[{"word":"CUCKOO","idx":25645,"count":1045203,"meanings":[{"definitions":[{"definition":"The two-note sound made by the cuckoo."},{"definition":"A Barbadian food made from mashed okra and cornmeal."},{"definition":"Any of various birds, of the family Cuculidae, famous for laying its eggs in the nests of other species; but especially the common cuckoo, Cuculus canorus, that has a characteristic two-note call."},{"definition":"The sound of that particular bird."},{"definition":"The bird-shaped figure found in cuckoo clocks."},{"definition":"The cuckoo clock itself."},{"definition":"A person who inveigles themselves into a place where they should not be (used especially in the phrase a cuckoo in the nest)."},{"definition":"Someone who is crazy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make the call of a cuckoo."},{"definition":"To repeat something incessantly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Crazy; not sane."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cuckoo-us","text":"/ˈkuː.kuː/"}]},{"word":"INSPIRES","idx":25648,"count":1044925,"meanings":[{"definitions":[{"definition":"To infuse into the mind; to communicate to the spirit; to convey, as by a divine or supernatural influence; to disclose preternaturally; to produce in, as by inspiration."},{"definition":"To infuse into; to affect, as with a superior or supernatural influence; to fill with what animates, enlivens or exalts; to communicate inspiration to.","example":"Elders should inspire children with sentiments of virtue."},{"definition":"To draw in by the operation of breathing; to inhale."},{"definition":"To infuse by breathing, or as if by breathing."},{"definition":"To breathe into; to fill with the breath; to animate."},{"definition":"To spread rumour indirectly."}],"partOfSpeech":"ve"}]},{"word":"INITIATES","idx":25649,"count":1044901,"meanings":[{"definitions":[{"definition":"A new member of an organization."},{"definition":"One who has been through a ceremony of initiation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To begin; to start."},{"definition":"To instruct in the rudiments or principles; to introduce."},{"definition":"To confer membership on; especially, to admit to a secret order with mysterious rites or ceremonies."},{"definition":"To do the first act; to perform the first rite; to take the initiative."}],"partOfSpeech":"ve"}]},{"word":"ACACIA","idx":25650,"count":1044793,"meanings":[{"definitions":[{"definition":"A shrub or tree of the tribe Acacieae."},{"definition":"The thickened or dried juice of several species in Acacieae, in particular Vachellia nilotica (syn. Acacia nilotica), the Egyptian acacia."},{"definition":"A false acacia; robinia tree, Robinia pseudoacacia."},{"definition":"Gum arabic; gum acacia."},{"definition":"Any of several related trees, such as the locust tree."},{"definition":"A light to moderate greenish yellow with a hint of red."},{"definition":"(history) A roll or bag, filled with dust, borne by Byzantine emperors, as a memento of mortality. It is represented on medals."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"acacia-us","text":"/əˈkeɪ.ʃə/"}]},{"word":"WHITING","idx":25654,"count":1044301,"meanings":[{"definitions":[{"definition":"To make white; to whiten; to bleach."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A fine white chalk used in paints, putty, whitewash etc."},{"definition":"A fish, Merlangius merlangus, similar to cod, found in the North Atlantic; English whiting (US)."},{"definition":"Any fish of many species that resemble Merlangius merlangus:"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"whiting-au"}]},{"word":"FANG","idx":25655,"count":1044228,"meanings":[{"definitions":[{"definition":"A long, pointed canine tooth used for biting and tearing flesh"},{"definition":"(in snakes) a long pointed tooth for injecting venom"},{"definition":"A grasping; capture; the act or power of seizing; hold."},{"definition":"That which is seized or carried off; booty; spoils; stolen goods."},{"definition":"Any projection, catch, shoot, or other thing by which hold is taken; a prehensile part or organ."},{"definition":"A channel cut in the rock, or a pipe of wood, used for conveying air."},{"definition":"(in the plural) Cage-shuts."},{"definition":"The coil or bend of a rope; (by extension) a noose; a trap."},{"definition":"The valve of a pump box."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike or attack with the fangs."},{"definition":"To enable to catch or tear; to furnish with fangs."},{"definition":"To catch, capture; seize; grip; clutch; lay hold of."},{"definition":"To take; receive with assent; accept."},{"definition":"(as a guest) To receive with hospitality; welcome."},{"definition":"(a thing given or imposed) To receive."},{"definition":"To receive or adopt into spiritual relation, as in baptism; be godfather or godmother to."},{"definition":"To supply (a pump) with the water necessary for it to operate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fang-uk","text":"/fæŋ/"}]},{"word":"NETTING","idx":25656,"count":1044090,"meanings":[{"definitions":[{"definition":"Something that acts as, or looks like, a net."},{"definition":"Urine"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To catch by means of a net."},{"definition":"To catch in a trap, or by stratagem."},{"definition":"To enclose or cover with a net.","example":"to net a tree"},{"definition":"To score (a goal).","example":"Evans netted the winner in the 80th minute."},{"definition":"To hit the ball into the net."},{"definition":"To form network or netting; to knit."},{"definition":"To receive as profit.","example":"The company nets $30 on every sale."},{"definition":"To yield as profit for.","example":"The scam netted the criminals $30,000."},{"definition":"To fully hedge a position.","example":"Every party is netting their position with a counter-party"}],"partOfSpeech":"ve"}]},{"word":"GRIZZLIES","idx":25657,"count":1044053,"meanings":[{"definitions":[{"definition":"A grizzly bear.","example":"Shotgun blast kills charging grizzly!"},{"definition":"In hydraulic mining, a grating used to catch and throw out large stones from the sluices."}],"partOfSpeech":"n"}]},{"word":"METHADONE","idx":25659,"count":1043973,"meanings":[{"definitions":[{"definition":"A synthetic opioid analgesic, used to wean addicts off heroin or other opiate based narcotics, and in chronic pain management."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɛθədoʊn/"}]},{"word":"CONTEMPLATING","idx":25660,"count":1043947,"meanings":[{"definitions":[{"definition":"To look at on all sides or in all its aspects; to view or consider with continued attention; to regard with deliberate care; to meditate on; to study, ponder, or consider."},{"definition":"To consider as a possibility.","example":"I contemplated doing the project myself, but it would have taken too long."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"contemplating-us"}]},{"word":"OFFSETS","idx":25661,"count":1043930,"meanings":[{"definitions":[{"definition":"Anything that acts as counterbalance; a compensating equivalent.","example":"Today's victory was an offset to yesterday's defeat."},{"definition":"A form of countertrade arrangement, in which the seller agrees to purchase within a set time frame products of a certain value from the buying country. This kind of agreement may be used in large international public sector contracts such as arms sales."},{"definition":"(c. 1555) A time at which something begins; outset."},{"definition":"The offset printing process, in which ink is carried from a metal plate to a rubber blanket and from there to the printing surface.","example":"offset lithographs"},{"definition":"The difference between a target memory address and a base address.","example":"An array of bytes uses its index as the offset, of words a multiple thereof."},{"definition":"(signal analysis) The displacement between the base level of a measurement and the signal's real base level.","example":"The raw signal data was subjected to a baseline correction process to subtract the sensor's offset and drift variations."},{"definition":"The distance by which one thing is out of alignment with another.","example":"There is a small offset between the switch and the indicator which some users found confusing."},{"definition":"A short distance measured at right angles from a line actually run to some point in an irregular boundary, or to some object."},{"definition":"An abrupt bend in an object, such as a rod, by which one part is turned aside out of line, but nearly parallel, with the rest; the part thus bent aside."},{"definition":"A short prostrate shoot that takes root and produces a tuft of leaves, etc."},{"definition":"A spur from a range of hills or mountains."},{"definition":"A horizontal ledge on the face of a wall, formed by a diminution of its thickness, or by the weathering or upper surface of a part built out from it; a set-off."},{"definition":"A terrace on a hillside."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To compensate for, by applying a change in the opposite direction.","example":"I'll offset the time difference locally."},{"definition":"To form an offset in (a wall, rod, pipe, etc.)."}],"partOfSpeech":"ve"}]},{"word":"SOP","idx":25666,"count":1043628,"meanings":[{"definitions":[{"definition":"Something entirely soaked."},{"definition":"A piece of solid food to be soaked in liquid food."},{"definition":"Something given or done to pacify or bribe."},{"definition":"A weak, easily frightened or ineffectual person; a milksop"},{"definition":"Gravy."},{"definition":"A thing of little or no value."},{"definition":"A piece of turf placed in the road as a target for a throw in road bowling."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To steep or dip in any liquid."},{"definition":"To soak in, or be soaked; to percolate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sop-uk","text":"/sɒp/"}]},{"word":"RECALLING","idx":25667,"count":1043497,"meanings":[{"definitions":[{"definition":"To withdraw, retract (one's words etc.); to revoke (an order)."},{"definition":"To call back, bring back or summon (someone) to a specific place, station etc.","example":"He was recalled to service after his retirement."},{"definition":"To bring back (someone) to or from a particular mental or physical state, activity etc."},{"definition":"To call back (a situation, event etc.) to one's mind; to remember, recollect."},{"definition":"To call again, to call another time."},{"definition":"To request or order the return of (a faulty product)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is recalled."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪˈkɔːlɪŋ/"}]},{"word":"PRACTISING","idx":25670,"count":1043343,"meanings":[{"definitions":[{"definition":"To repeat (an activity) as a way of improving one's skill in that activity.","example":"You should practise playing piano every day."},{"definition":"To repeat an activity in this way.","example":"If you want to speak French well, you need to practise."},{"definition":"To perform or observe in a habitual fashion.","example":"They gather to practise religion every Saturday."},{"definition":"To pursue (a career, especially law, fine art or medicine).","example":"She practised law for forty years before retiring."},{"definition":"To conspire."},{"definition":"To put into practice; to carry out; to act upon; to commit; to execute; to do."},{"definition":"To make use of; to employ."},{"definition":"To teach or accustom by practice; to train."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who practises."}],"partOfSpeech":"n"}]},{"word":"HERMITAGE","idx":25672,"count":1043143,"meanings":[{"definitions":[{"definition":"A house or dwelling where a hermit lives."},{"definition":"A place of seclusion."},{"definition":"A period of seclusion."}],"partOfSpeech":"n"}]},{"word":"STARLIGHT","idx":25673,"count":1043046,"meanings":[{"definitions":[{"definition":"Light emitted from stars other than the Sun."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"starlight-uk","text":"/ˈstɑː(ɹ)laɪt/"}]},{"word":"LOTTERIES","idx":25675,"count":1042832,"meanings":[{"definitions":[{"definition":"A scheme for the distribution of prizes by lot or chance, especially a gaming scheme in which one or more tickets bearing particular numbers draw prizes, the other tickets are blanks."},{"definition":"An affair of chance."},{"definition":"(Shakespeare) Allotment; a thing allotted."}],"partOfSpeech":"n"}]},{"word":"COAUTHOR","idx":25677,"count":1042575,"meanings":[{"definitions":[{"definition":"An author who collaborates with another to write something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write something in collaboration with another author."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"coauthor-us"}]},{"word":"FOYER","idx":25678,"count":1042532,"meanings":[{"definitions":[{"definition":"A lobby, corridor, or waiting room, used in a hotel, theater, etc.","example":"We had a drink in the foyer waiting for the play to start."},{"definition":"The crucible or basin in a furnace which receives the molten metal."},{"definition":"A hostel offering accommodation and work opportunities to homeless young people."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"foyer-ca","text":"/ˈfɔɪ.eɪ/"}]},{"word":"PALACES","idx":25679,"count":1042444,"meanings":[{"definitions":[{"definition":"Official residence of a head of state or other dignitary, especially in a monarchical or imperial governmental system."},{"definition":"A large and lavishly ornate residence."},{"definition":"A large, ornate public building used for entertainment or exhibitions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate or ornate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"palaces-us","text":"/ˈpælɪsɪz/"}]},{"word":"BROOD","idx":25680,"count":1042305,"meanings":[{"definitions":[{"definition":"The young of certain animals, especially a group of young birds or fowl hatched at one time by the same mother."},{"definition":"The young of any egg-laying creature, especially if produced at the same time."},{"definition":"The eggs and larvae of social insects such as bees, ants and some wasps, especially when gathered together in special brood chambers or combs within the colony."},{"definition":"The children in one family; offspring."},{"definition":"That which is bred or produced; breed; species."},{"definition":"Parentage."},{"definition":"Heavy waste in tin and copper ores."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To keep an egg warm to make it hatch.","example":"In some species of birds, both the mother and father brood the eggs."},{"definition":"To protect (something that is gradually maturing); to foster.","example":"Under the rock was a midshipman fish, brooding a mass of eggs."},{"definition":"(typically with about or over) To dwell upon moodily and at length, mainly alone.","example":"He sat brooding about the upcoming battle, fearing the outcome."},{"definition":"To be bred."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Kept or reared for breeding, said of animals.","example":"a brood mare"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"brood-us","text":"/bɹuːd/"}]},{"word":"AZURE","idx":25681,"count":1042257,"meanings":[{"definitions":[{"definition":"A blue colour on a coat of arms, represented in engraving by horizontal parallel lines."},{"definition":"The clear blue colour of the sky; also, a pigment or dye of this colour."},{"definition":"The unclouded sky; the blue vault above."},{"definition":"Any of various widely distributed lycaenid butterflies of the genus Celastrina."},{"definition":"Any of various Australasian lycaenid butterflies of the genus Ogyris."},{"definition":"Lapis lazuli."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To colour blue."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sky blue; resembling the clear blue colour of the unclouded sky"},{"definition":"Cloudless"},{"definition":"In blazon, of the colour blue."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"azure-us","text":"/əˈʒʊɹ/"}]},{"word":"COMPEL","idx":25683,"count":1042085,"meanings":[{"definitions":[{"definition":"To drive together, round up"},{"definition":"To overpower; to subdue."},{"definition":"To force, constrain or coerce.","example":"Logic compels the wise, while fools feel compelled by emotions."},{"definition":"To exact, extort, (make) produce by force."},{"definition":"To force to yield; to overpower; to subjugate."},{"definition":"To gather or unite in a crowd or company."},{"definition":"To call forth; to summon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"compel-us","text":"/kəmˈpɛl/"}]},{"word":"AIRFLOW","idx":25684,"count":1042045,"meanings":[{"definitions":[{"definition":"Any flow of air, especially the motion of air around a moving aircraft or aerofoil."}],"partOfSpeech":"n"}]},{"word":"CONTRADICTIONS","idx":25685,"count":1041974,"meanings":[{"definitions":[{"definition":"The act of contradicting.","example":"His contradiction of the proposal was very interesting."},{"definition":"A statement that contradicts itself, i.e., a statement that makes a claim that the same thing is true and that it is false at the same time and in the same senses of the terms.","example":"There is a contradiction in Clarence Page's statement that a woman should have the right to choose and decide for herself whether to have an abortion, and at the same time she should not have that right."},{"definition":"A logical inconsistency among two or more elements or propositions.","example":"Marx believed that the contradictions of capitalism would lead to socialism."},{"definition":"A proposition that is false for all values of its variables."}],"partOfSpeech":"n"}]},{"word":"THUR","idx":25686,"count":1041823,"meanings":[{"definitions":[{"definition":"(location) In a place or location (stated, implied or otherwise indicated) at some distance from the speaker (compare here)."},{"definition":"In that matter, relation, etc.; at that point, stage, etc., regarded as a distinct place.","example":"He did not stop there, but continued his speech."},{"definition":"(location) To or into that place; thither."},{"definition":"Where, there where, in which place."},{"definition":"In existence or in this world; see pronoun section below."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Used as an expletive subject of be in its sense of “exist”, with the semantic, usually indefinite subject being postponed or (occasionally) implied.","example":"Is there an answer? [=Does an answer exist?]"},{"definition":"Used with other intransitive verbs of existence, in the same sense, or with other intransitive verbs, adding a sense of existence.","example":"If x is a positive number, then there exists [=there is] a positive number y less than x."},{"definition":"Used with other verbs, when raised.","example":"I expected there to be a simpler solution. [=I expected that there would be a simpler solution.]"},{"definition":"(in combination with certain prepositions, no longer productive) That.","example":"therefor, thereat, thereunder"},{"definition":"Used to replace an unknown name, principally in greetings and farewells","example":"Hi there, young fellow."}],"partOfSpeech":"p"}]},{"word":"FESTIVITIES","idx":25687,"count":1041711,"meanings":[{"definitions":[{"definition":"(often pluralized) A festival or similar celebration."},{"definition":"An experience or expression of celebratory feeling, merriment, gaiety."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"festivities"}]},{"word":"TRENCHES","idx":25688,"count":1041638,"meanings":[{"definitions":[{"definition":"A long, narrow ditch or hole dug in the ground."},{"definition":"A narrow excavation as used in warfare, as a cover for besieging or emplaced forces."},{"definition":"A pit, usually rectangular with smooth walls and floor, excavated during an archaeological investigation."},{"definition":"A trench coat."},{"definition":"The front line of any field of endeavor, as the line of scrimmage in American football, patrol duty for a policeman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually followed by upon) To invade, especially with regard to the rights or the exclusive authority of another; to encroach."},{"definition":"(infantry) To excavate an elongated pit for protection of soldiers and or equipment, usually perpendicular to the line of sight toward the enemy."},{"definition":"To excavate an elongated and often narrow pit."},{"definition":"To have direction; to aim or tend."},{"definition":"To cut; to form or shape by cutting; to make by incision, hewing, etc."},{"definition":"To cut furrows or ditches in.","example":"to trench land for the purpose of draining it"},{"definition":"To dig or cultivate very deeply, usually by digging parallel contiguous trenches in succession, filling each from the next.","example":"to trench a garden for certain crops"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"trenches-us","text":"/ˈtɹɛnt͡ʃɪz/"}]},{"word":"SABINE","idx":25689,"count":1041514,"meanings":[{"definitions":[{"definition":"The evergreen shrub Juniperus sabina, endemic to Europe, which yields a medicinal oil."},{"definition":"The poisonous dried tips of this plant, with anthelmintic properties, used as a drug."},{"definition":"The eastern red cedar, Juniperus virginiana, of eastern North America."}],"partOfSpeech":"n"}]},{"word":"DOORSTEP","idx":25691,"count":1041402,"meanings":[{"definitions":[{"definition":"An outside step leading up to the door of a building, usually a home.","example":"On one's doorstep."},{"definition":"One's immediate neighbourhood or locality.","example":"They want to build the prison right on our doorstep; it will only be half a mile away and being that close scares me."},{"definition":"A big slice, especially of bread."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To visit one household after another to solicit sales, charitable donations, political support, etc."},{"definition":"To corner somebody for an unexpected interview."}],"partOfSpeech":"ve"}]},{"word":"SNIFF","idx":25692,"count":1041321,"meanings":[{"definitions":[{"definition":"An instance of sniffing.","example":"She gave the flowers a quick sniff to check they were real."},{"definition":"A quantity of something that is inhaled through the nose"},{"definition":"A brief perception, or tiny amount."},{"definition":"Cocaine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a short, audible inhalation, through the nose, as when smelling something.","example":"I sniffed the meat to see whether it had gone off."},{"definition":"To say something while sniffing, for example in case of illness or unhappiness, or in contempt.","example":"\"He's never coming back, is he?\" she sniffed while looking at a picture of him."},{"definition":"To perceive vaguely","example":"I can sniff trouble coming from the basement."},{"definition":"To be dismissive or contemptuous of something.","example":"This opportunity is not to be sniffed at."},{"definition":"To intercept and analyse packets of data being transmitted over a network."},{"definition":"To inhale drugs in powder form (usually cocaine) through the nose."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A short inhalation sound, sometimes associated with crying."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"sniff-au","text":"/snɪf/"}]},{"word":"DANGLING","idx":25693,"count":1041274,"meanings":[{"definitions":[{"definition":"To hang loosely with the ability to swing.","example":"His feet would dangle in the water."},{"definition":"The action of performing a move or deke with the puck in order to get past a defender or goalie; perhaps because of the resemblance to dangling the puck on a string.","example":"He dangled around three players and the goalie to score."},{"definition":"To hang or trail something loosely.","example":"I like to sit on the edge and dangle my feet in the water."},{"definition":"To trail or follow around."},{"definition":"Of a patient: to be positioned with the legs hanging over the edge of the bed."},{"definition":"To position (a patient) in this way."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of hanging something so that it can move freely; suspension."},{"definition":"The act of following or trailing around."},{"definition":"All out, open throttle, with all you have."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Suspended from above."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdæŋɡəlɪŋ(ɡ)/"}]},{"word":"UNATTACHED","idx":25695,"count":1041180,"meanings":[{"definitions":[{"definition":"Not attached or joined; disconnected.","example":"Take the unattached end of the rope..."},{"definition":"Not married or involved in a romantic relationship."},{"definition":"Not connected with or belonging to a particular group or organization."},{"definition":"Not seized for debt."}],"partOfSpeech":"j"}]},{"word":"NEGLIGENT","idx":25697,"count":1040936,"meanings":[{"definitions":[{"definition":"Careless, without appropriate or sufficient attention."},{"definition":"Culpable due to negligence."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"negligent-us","text":"/ˈnɛɡ.lɪ.dʒənt/"}]},{"word":"GLIDING","idx":25699,"count":1040577,"meanings":[{"definitions":[{"definition":"To move softly, smoothly, or effortlessly."},{"definition":"To fly unpowered, as of an aircraft. Also relates to gliding birds and flying fish."},{"definition":"To cause to glide."},{"definition":"To pass with a glide, as the voice."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action or motion of something that glides."},{"definition":"The hobby, sport or act of flying a glider."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That moves or changes with a glide."},{"definition":"(employment) Employing flexitime.","example":"gliding shifts; gliding hours; gliding time"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡlɑɪdɪŋ/"}]},{"word":"WOE","idx":25703,"count":1040184,"meanings":[{"definitions":[{"definition":"Great sadness or distress; a misfortune causing such sadness."},{"definition":"Calamity, trouble."},{"definition":"A curse; a malediction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Woeful; sorrowful"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"woe-us","text":"/woʊ/"}]},{"word":"MEDITATIONS","idx":25705,"count":1040007,"meanings":[{"definitions":[{"definition":"A devotional exercise of, or leading to contemplation."},{"definition":"A contemplative discourse, often on a religious or philosophical subject."},{"definition":"A musical theme treated in a meditative manner."}],"partOfSpeech":"n"}]},{"word":"CENTERPIECE","idx":25708,"count":1039839,"meanings":[{"definitions":[{"definition":"An ornament to be placed in the centre, as of a table, ceiling, etc."},{"definition":"A central article or figure."}],"partOfSpeech":"n"}]},{"word":"TRANQUILITY","idx":25710,"count":1039691,"meanings":[{"definitions":[{"definition":"The state of being tranquil"},{"definition":"The absence of disturbance; peacefulness"},{"definition":"The absence of stress; serenity"},{"definition":"The quality of calm such as that experienced in places with mainly natural features and activities, free from disturbance from manmade ones."}],"partOfSpeech":"n"}]},{"word":"UNWIND","idx":25711,"count":1039665,"meanings":[{"definitions":[{"definition":"Any mechanism or operation that unwinds something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To separate (something that is wound up)","example":"Could you unwind about a foot of ribbon so I can finish the package?"},{"definition":"To disentangle"},{"definition":"To relax; to chill out; to rest and relieve of stress","example":"After work, I like to unwind by smoking a pipe while reading the paper."},{"definition":"To be or become unwound; to be capable of being unwound or untwisted."},{"definition":"To undo something."},{"definition":"To analyse (a call stack) so as to generate a stack trace etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"unwind-au","text":"/ʌnˈwaɪnd/"}]},{"word":"HALTED","idx":25712,"count":1039584,"meanings":[{"definitions":[{"definition":"To limp; move with a limping gait."},{"definition":"To stand in doubt whether to proceed, or what to do; hesitate; be uncertain; linger; delay; mammer."},{"definition":"To be lame, faulty, or defective, as in connection with ideas, or in measure, or in versification."},{"definition":"To waver."},{"definition":"To falter."},{"definition":"To stop marching."},{"definition":"To stop either temporarily or permanently."},{"definition":"To bring to a stop."},{"definition":"To cause to discontinue.","example":"The contract negotiations halted operations for at least a week."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"halted-us","text":"/ˈhɔːltɪd/"}]},{"word":"OUTINGS","idx":25714,"count":1039301,"meanings":[{"definitions":[{"definition":"A pleasure trip or excursion."},{"definition":"An appearance to perform in public, for example in a drama, film, on a musical album, as a sports contestant etc."},{"definition":"The practice of publicly revealing that a person is homosexual or transgender without that person's consent."}],"partOfSpeech":"n"}]},{"word":"CROTCH","idx":25715,"count":1039119,"meanings":[{"definitions":[{"definition":"The area where something forks or branches, a ramification takes place.","example":"There is a child sitting in a crotch of that tree."},{"definition":"The ventral area (very bottom) of the human body between where the legs fork from the torso, in the area of the genitals and anus.","example":"Every mile they rode their crotches felt worse saddlepain."},{"definition":"Either the male or female genitalia.","example":"He cringed at being kicked in the crotch."},{"definition":"In the three-ball carom game, a small space at each corner of the table."},{"definition":"The open counter (negative space) formed by two downward strokes that meet at an internal acute angle, potentially above a vertex, as in the letters \"V\" and \"Y\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide with a crotch; to give the form of a crotch to.","example":"to crotch the ends of ropes in splicing or tying knots"},{"definition":"(logging, western US) To notch (a log) on opposite sides to provide a grip for the dogs that will haul it."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crotch-us","text":"/kɹɑtʃ/"}]},{"word":"WAVELET","idx":25716,"count":1039052,"meanings":[{"definitions":[{"definition":"A small wave; a ripple."},{"definition":"A fast-decaying oscillation."}],"partOfSpeech":"n"}]},{"word":"DRAWBACK","idx":25717,"count":1039041,"meanings":[{"definitions":[{"definition":"A disadvantage; something that detracts or takes away.","example":"Poor fuel economy is a common drawback among larger vehicles."},{"definition":"A partial refund of an import fee, as when goods are re-exported from the country that collected the fee."},{"definition":"The inhalation of a lungful of smoke from a cigarette."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɹɔːˌbæk/"}]},{"word":"PATHOGENESIS","idx":25720,"count":1038707,"meanings":[{"definitions":[{"definition":"The origin and development of a disease."},{"definition":"The mechanism whereby something causes a disease."}],"partOfSpeech":"n"}]},{"word":"DIODES","idx":25721,"count":1038697,"meanings":[{"definitions":[{"definition":"An electronic device that allows current to flow in one direction only; used chiefly as a rectifier."}],"partOfSpeech":"n"}]},{"word":"REINSTATEMENT","idx":25723,"count":1038681,"meanings":[{"definitions":[{"definition":"The act of restoring something to its previous state.","example":"Many people are unhappy with the sacking of the chief constable and demand his immediate reinstatement."}],"partOfSpeech":"n"}]},{"word":"BOTOX","idx":25724,"count":1038675,"meanings":[{"definitions":[{"definition":"To inject Botox."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Alternative letter-case form of Botox"}],"partOfSpeech":"n"}]},{"word":"HOSTESS","idx":25725,"count":1038635,"meanings":[{"definitions":[{"definition":"A female host.","example":"The host and hostess greeted their guests at the door."},{"definition":"A female innkeeper."},{"definition":"Stewardess: a woman steward on an airplane."},{"definition":"A bar hostess or bargirl; a paid female companion offering conversation and in some cases sex."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To host, as a woman."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hostess-us","text":"/ˈhoʊstəs/"}]},{"word":"WEEP","idx":25727,"count":1038608,"meanings":[{"definitions":[{"definition":"A session of crying.","example":"Sometimes you just have to have a good weep."},{"definition":"A lapwing; wipe, especially, a northern lapwing (Vanellus vanellus)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cry; shed tears."},{"definition":"To lament; to complain."},{"definition":"(of a wound or sore) To produce secretions."},{"definition":"To flow in drops; to run in drops.","example":"a weeping spring, which discharges water slowly"},{"definition":"To hang the branches, as if in sorrow; to be pendent; to droop; said of a plant or its branches."},{"definition":"To weep over; to bewail."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"weep-us","text":"/wiːp/"}]},{"word":"DIPOLE","idx":25728,"count":1038540,"meanings":[{"definitions":[{"definition":"Any object (such as a magnet, polar molecule or antenna) that is oppositely charged at two points (or poles)"},{"definition":"Any molecule or radical that has delocalised positive and negative charges"},{"definition":"A dipole antenna"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdaɪˌpoʊl/"},{"text":"/ˈdʌɪpəʊl/"}]},{"word":"POSSE","idx":25730,"count":1038358,"meanings":[{"definitions":[{"definition":"A group or company of people, originally especially one having hostile intent; a throng, a crowd."},{"definition":"A group of people summoned to help law enforcement."},{"definition":"A search party."},{"definition":"A criminal gang."},{"definition":"A group of (especially young) people seen as constituting a peer group or band of associates; a gang, a group of friends."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɑ.si/"},{"text":"/ˈpɒ.si/"}]},{"word":"MOSQUITOES","idx":25731,"count":1038355,"meanings":[{"definitions":[{"definition":"A small flying insect of the family Culicidae, the females of which bite humans and animals and suck blood, leaving an itching bump on the skin, and sometimes carrying diseases like malaria and yellow fever."}],"partOfSpeech":"n"}]},{"word":"KATA","idx":25733,"count":1038311,"meanings":[{"definitions":[{"definition":"Any of a sequence of positions and movements used in many martial arts.","example":"2010, Kenji Tokitsu, The Katas: The Meaning Behind the Movements."},{"definition":"(in combination) A drop (in temperature)."},{"definition":"(measuring instrument) A device consisting principally of an alcohol thermometer, used to measure air cooling power and, indirectly, small wind speeds in circulating air, by measuring the time taken for the temperature of the bulb of alcohol to make a specified drop (100° to 95°F)."},{"definition":"A kind of pastry in Armenia and some neighboring countries."}],"partOfSpeech":"n"},{"definitions":[{"definition":"In a direction analogous to down, but along the additional axis added by the fourth dimension."}],"partOfSpeech":"v"}]},{"word":"TANGLED","idx":25734,"count":1038220,"meanings":[{"definitions":[{"definition":"To become mixed together or intertwined","example":"Her hair was tangled from a day in the wind."},{"definition":"To enter into an argument, conflict, dispute, or fight","example":"Don't tangle with someone three times your size."},{"definition":"To mix together or intertwine"},{"definition":"To catch and hold; to ensnare."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtæŋ.ɡəld/"}]},{"word":"LILO","idx":25739,"count":1038025,"meanings":[{"definitions":[{"definition":"An inflatable air mattress."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/laɪləʊ/"}]},{"word":"AGRIBUSINESS","idx":25743,"count":1037906,"meanings":[{"definitions":[{"definition":"Business (especially big business) connected to agriculture, either owning or operating large-scale farms, or catering to those who do."},{"definition":"A business or group of businesses engaged in agriculture, particularly if using modern farming techniques in the process."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"agribusiness-uk","text":"/-nɪs/"}]},{"word":"FRYING","idx":25745,"count":1037756,"meanings":[{"definitions":[{"definition":"A method of cooking food."},{"definition":"To be affected by extreme heat or current."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb fry."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɹaɪ.ɪŋ/"}]},{"word":"HESITATION","idx":25747,"count":1037676,"meanings":[{"definitions":[{"definition":"An act of hesitating"},{"definition":"Doubt; vacillation.","example":"She carried out the order without hesitation."},{"definition":"A faltering in speech; stammering."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hesitation-us","text":"/hɛzɪˈteɪʃən/"}]},{"word":"IMPRINTED","idx":25748,"count":1037643,"meanings":[{"definitions":[{"definition":"To leave a print, impression, image, etc.","example":"For a fee, they can imprint the envelopes with a monogram."},{"definition":"To learn something indelibly at a particular stage of life, such as who one's parents are."},{"definition":"To mark a gene as being from a particular parent so that only one of the two copies of the gene is expressed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Stamped or impressed."},{"definition":"Produced by or exhibiting imprinting; showing distinction by its origin from the paternal or maternal genome."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪmˈpɹɪntɪd/"}]},{"word":"PIXIE","idx":25749,"count":1037554,"meanings":[{"definitions":[{"definition":"(fantasy literature, fairy tales) A playful sprite or elflike or fairy-like creature."},{"definition":"A cute, petite woman with short hair."},{"definition":"An upper-atmospheric optical phenomenon associated with thunderstorms, a short-lasting pinpoint of light on the surface of convective domes that produces a gnome."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɪksi/"},{"audio":"pixie-au"}]},{"word":"PROOFING","idx":25750,"count":1037507,"meanings":[{"definitions":[{"definition":"To proofread."},{"definition":"To make resistant, especially to water."},{"definition":"To allow yeast-containing dough to rise."},{"definition":"To test the activeness of yeast."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A step in creating yeast breads and baked goods, during which the yeast is allowed to leaven the dough."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɹuːfɪŋ/"}]},{"word":"CLITS","idx":25751,"count":1037485,"meanings":[{"definitions":[{"definition":"The clitoris."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(often with \"off\") To stimulate the clitoris."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/klɪts/"}]},{"word":"KEYRING","idx":25752,"count":1037390,"meanings":[{"definitions":[{"definition":"A ring, normally of metal or plastic, for holding keys together."},{"definition":"A set of data holding linked encryption keys."}],"partOfSpeech":"n"}]},{"word":"BEREAVEMENT","idx":25753,"count":1037389,"meanings":[{"definitions":[{"definition":"The state of being bereaved; deprivation; especially the loss of a relative by death"}],"partOfSpeech":"n"}]},{"word":"SURRENDERED","idx":25754,"count":1037373,"meanings":[{"definitions":[{"definition":"To give up into the power, control, or possession of another."},{"definition":"(by extension) To yield (a town, a fortification, etc.) to an enemy."},{"definition":"To give oneself up into the power of another, especially as a prisoner; to submit or give in.","example":"I surrender!"},{"definition":"To give up possession of; to yield; to resign.","example":"to surrender a right, privilege, or advantage"},{"definition":"To yield (oneself) to an influence, emotion, passion, etc.","example":"to surrender oneself to grief, to despair, to indolence, or to sleep"},{"definition":"To abandon (one's hand of cards) and recover half of the initial bet."},{"definition":"For a policyholder, to voluntarily terminate an insurance contract before the end of its term, usually with the expectation of receiving a surrender value."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"surrendered-us"}]},{"word":"VEHICULAR","idx":25756,"count":1037138,"meanings":[{"definitions":[{"definition":"Of or pertaining to a vehicle or vehicles, usually specifically cars and trucks.","example":"Ernest had a fear of vehicular travel, and ended up walking everywhere."},{"definition":"Of or pertaining to a language that is used as a contact language between two groups who do not share a common native tongue nor a common culture.","example":"English is used as a vehicular language in many business settings."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/viˈhɪk.jə.lə(ɹ)/"}]},{"word":"WORKBENCH","idx":25758,"count":1037033,"meanings":[{"definitions":[{"definition":"A sturdy bench or table at which manual work is done by a carpenter, machinist, etc."}],"partOfSpeech":"n"}]},{"word":"LANDSCAPED","idx":25760,"count":1036864,"meanings":[{"definitions":[{"definition":"To create or maintain a landscape."}],"partOfSpeech":"ve"}]},{"word":"WESTWARD","idx":25763,"count":1036734,"meanings":[{"definitions":[{"definition":"The western region or countries; the west."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Lying toward the west."},{"definition":"Moving or oriented toward the west."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Toward the west.","example":"ride westward."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈwɛstwɚd/"},{"text":"/ˈwɛstwəd/"}]},{"word":"IMPALA","idx":25766,"count":1036625,"meanings":[{"definitions":[{"definition":"An African antelope, Aepyceros melampus, noted for its leaping ability; the male has ridged, curved horns."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪmˈpɑːlə/"}]},{"word":"COMMENTER","idx":25767,"count":1036613,"meanings":[{"definitions":[{"definition":"One who comments."}],"partOfSpeech":"n"}]},{"word":"CONVERGED","idx":25768,"count":1036526,"meanings":[{"definitions":[{"definition":"Of two or more entities, to approach each other; to get closer and closer."},{"definition":"Of a sequence, to have a limit."},{"definition":"Of an iterative process, to reach a stable end point."}],"partOfSpeech":"ve"}]},{"word":"CELSIUS","idx":25769,"count":1036264,"meanings":[{"definitions":[{"definition":"Related to a metric temperature scale, originally defined as having the freezing point of water as 0 degrees and its boiling point as 100 degrees, at standard atmospheric pressure. The standardized definition has 0.01 °C as the triple point of water, and a difference in temperature of 1 °C corresponds to 1/273.16 of the difference in temperature between the triple point and the absolute zero."}],"partOfSpeech":"j"}]},{"word":"FLICKS","idx":25770,"count":1036253,"meanings":[{"definitions":[{"definition":"A short, quick movement, especially a brush, sweep, or flip.","example":"He removed the speck of dust with a flick of his finger."},{"definition":"A motion picture; (in plural, usually preceded by \"the\") movie theater, cinema.","example":"My all-time favorite flick is \"Gone with the Wind.\""},{"definition":"A cut that lands with the point, often involving a whip of the foible of the blade to strike at a concealed target."},{"definition":"A powerful underarm volley shot."},{"definition":"The act of pressing a place on a touch screen device."},{"definition":"A flitch.","example":"a flick of bacon"},{"definition":"A unit of time, equal to 1/705,600,000 of a second"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move or hit (something) with a short, quick motion.","example":"flick one's hair"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/flɪks/"}]},{"word":"RECOGNIZABLE","idx":25772,"count":1036118,"meanings":[{"definitions":[{"definition":"Able to be recognized"}],"partOfSpeech":"j"}]},{"word":"PREFIXES","idx":25776,"count":1035803,"meanings":[{"definitions":[{"definition":"Something placed before another"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To determine beforehand; to set in advance."},{"definition":"To put or fix before, or at the beginning of something; to place at the start."}],"partOfSpeech":"ve"}]},{"word":"RACQUETBALL","idx":25778,"count":1035723,"meanings":[{"definitions":[{"definition":"A certain sport, similar to squash, but played with a bigger ball."},{"definition":"A ball used for this sport."}],"partOfSpeech":"n"}]},{"word":"EMBRACES","idx":25780,"count":1035616,"meanings":[{"definitions":[{"definition":"An act of putting arms around someone and bringing the person close to the chest; a hug."},{"definition":"An enclosure partially or fully surrounding someone or something."},{"definition":"Full acceptance (of something)."},{"definition":"An act of enfolding or including."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clasp (someone or each other) in the arms with affection; to take in the arms; to hug."},{"definition":"To seize (something) eagerly or with alacrity; to accept or take up with cordiality; to welcome.","example":"I wholeheartedly embrace the new legislation."},{"definition":"To submit to; to undergo."},{"definition":"To encircle; to enclose, to encompass."},{"definition":"To enfold, to include (ideas, principles, etc.); to encompass.","example":"Natural philosophy embraces many sciences."},{"definition":"To fasten on, as armour."},{"definition":"To accept (someone) as a friend; to accept (someone's) help gladly."},{"definition":"To attempt to influence (a court, jury, etc.) corruptly; to practise embracery."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"embraces-us","text":"/ɛmˈbɹeɪsɪz/"}]},{"word":"FLAVOURS","idx":25781,"count":1035572,"meanings":[{"definitions":[{"definition":"The quality produced by the sensation of taste or, especially, of taste and smell in combined effect.","example":"The flavor of this apple pie is delicious."},{"definition":"A substance used to produce a taste. Flavoring.","example":"Flavor was added to the pudding."},{"definition":"A variety (of taste) attributed to an object.","example":"What flavor of bubble gum do you enjoy?"},{"definition":"The characteristic quality of something.","example":"the flavor of an experience"},{"definition":"A kind or type.","example":"Debian is one flavor of the Linux operating system."},{"definition":"One of the six types of quarks (top, bottom, strange, charmed, up, and down) or three types of leptons (electron, muon, and tauon)."},{"definition":"The quality produced by the sensation of smell; odour; fragrance.","example":"the flavor of a rose"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add flavoring to something."}],"partOfSpeech":"ve"}]},{"word":"PUNDITS","idx":25783,"count":1035470,"meanings":[{"definitions":[{"definition":"An expert in a particular field, especially as called upon to provide comment or opinion in the media; a commentator, a critic."},{"definition":"A learned person in India; someone with knowledge of Sanskrit, philosophy, religion and law; a Hindu scholar."},{"definition":"A native surveyor in British India, trained to carry out clandestine surveillance beyond British borders."}],"partOfSpeech":"n"}]},{"word":"UNSET","idx":25784,"count":1035406,"meanings":[{"definitions":[{"definition":"To make not set.","example":"to unset a single bit in a binary pattern"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not set; not fixed or appointed."},{"definition":"Not mounted or placed in a setting."},{"definition":"Not set, as a broken limb."},{"definition":"Not planted."}],"partOfSpeech":"j"}]},{"word":"OPTIMISED","idx":25786,"count":1035299,"meanings":[{"definitions":[{"definition":"(originally intransitive) To act optimistically or as an optimist."},{"definition":"To make (something) optimal."},{"definition":"To make (something) more efficient, such as a computer program."},{"definition":"To become optimal."}],"partOfSpeech":"ve"}]},{"word":"WAXING","idx":25787,"count":1035247,"meanings":[{"definitions":[{"definition":"To apply wax to (something, such as a shoe, a floor, a car, or an apple), usually to make it shiny."},{"definition":"To remove hair at the roots from (a part of the body) by coating the skin with a film of wax that is then pulled away sharply."},{"definition":"To defeat utterly."},{"definition":"To kill, especially to murder a person."},{"definition":"(usually of a musical or oral performance) To record."},{"definition":"To increasingly assume the specified characteristic."},{"definition":"To grow."},{"definition":"(of the moon) To appear larger each night as a progression from a new moon to a full moon."},{"definition":"(of the tide) To move from low tide to high tide."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to wax."},{"definition":"A cosmetic procedure in which hair is removed from the body by the application and removal of wax."},{"definition":"A recording intended for a phonograph."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwæksɪŋ/"}]},{"word":"SINNER","idx":25791,"count":1035124,"meanings":[{"definitions":[{"definition":"A person who sins or has sinned."},{"definition":"A person who sins or has sinned by the action or identity indicated or previously mentioned"},{"definition":"An unregenerate person."},{"definition":"(figuratively, by extension) A person with negative qualities; one who does bad things.","example":"Are you a sinner or a saint?"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sinner-us","text":"/ˈsɪnɚ/"}]},{"word":"ISOTOPES","idx":25792,"count":1035059,"meanings":[{"definitions":[{"definition":"Any of two or more forms of an element where the atoms have the same number of protons, but a different number of neutrons within their nuclei. As a consequence, atoms of isotopes will have the same atomic number but a different mass number."}],"partOfSpeech":"n"}]},{"word":"AUSPICES","idx":25795,"count":1034946,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) Patronage or protection.","example":"This building was built under the auspices of the Friends of the Poor."},{"definition":"An omen or a sign.","example":"The circle of vultures was not a good auspice."},{"definition":"Divination from the actions of birds."}],"partOfSpeech":"n"}]},{"word":"COLES","idx":25796,"count":1034873,"meanings":[{"definitions":[{"definition":"Cabbage."},{"definition":"Brassica; a plant of the Brassica genus, especially those of Brassica oleracea (rape and coleseed)."},{"definition":"A stack or stook of hay."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/koʊlz/"},{"text":"/kɔʊlz/"}]},{"word":"ERGO","idx":25797,"count":1034681,"meanings":[{"definitions":[{"definition":"Consequently, therefore, thus."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Therefore (especially in syllogisms)."}],"partOfSpeech":"c"},{"definitions":[{"definition":"An ergometer (rowing machine)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ergo-1-au"}]},{"word":"DISSENTING","idx":25798,"count":1034592,"meanings":[{"definitions":[{"definition":"To disagree; to withhold assent. Construed with from (or, formerly, to)."},{"definition":"To differ from, especially in opinion, beliefs, etc."},{"definition":"To be different; to have contrary characteristics."}],"partOfSpeech":"ve"}]},{"word":"MELEE","idx":25799,"count":1034523,"meanings":[{"definitions":[{"definition":"A battle fought at close range; hand-to-hand combat; brawling."},{"definition":"A noisy, confused or tumultuous fight, argument or scrap."},{"definition":"Any any confused, disorganised, disordered or chaotic situation."},{"definition":"Lively contention or debate, skirmish."},{"definition":"A cavalry exercise in which two groups of riders try to cut paper plumes off the helmets of their opponents, the contest continuing until no member of one group retains his plume."},{"definition":"Small cut and polished gemstones sold in lots."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To physically hit in close quarters, as opposed to shooting, blowing up, or other ranged means of damage. Often refers to the usage of a hand-to-hand weapon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"melee-us","text":"/meɪˈleɪ/"}]},{"word":"CONDUCTION","idx":25800,"count":1034425,"meanings":[{"definitions":[{"definition":"The conveying of heat or electricity through material."},{"definition":"The act of leading or guiding."},{"definition":"The act of training up."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kənˈdʌkʃən/"}]},{"word":"COUNTESS","idx":25802,"count":1034368,"meanings":[{"definitions":[{"definition":"The wife of a count or earl."},{"definition":"A woman holding the rank of count or earl in her own right; a female holder of an earldom.","example":"Elizabeth Millicent Leveson-Gower is 24th Countess of Sutherland; her son will be the 25th Earl."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"countess-us","text":"/ˈkaʊntɨs/"}]},{"word":"PLEADING","idx":25803,"count":1034105,"meanings":[{"definitions":[{"definition":"To present (an argument or a plea), especially in a legal case.","example":"The defendant has decided to plead not guilty."},{"definition":"To beg, beseech, or implore.","example":"He pleaded with me not to leave the house."},{"definition":"To offer by way of excuse.","example":"Not wishing to attend the banquet, I pleaded illness."},{"definition":"To discuss by arguments."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of making a plea."},{"definition":"A document filed in a lawsuit, particularly a document initiating litigation or responding to the initiation of litigation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That pleads."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpliːdɪŋ/"}]},{"word":"CRAFTY","idx":25805,"count":1034039,"meanings":[{"definitions":[{"definition":"Relating to, or characterized by, craft or skill; dexterous."},{"definition":"Possessing dexterity; skilled; skillful."},{"definition":"Skillful at deceiving others; characterized by craft"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"crafty-us","text":"/ˈkɹæfti/"}]},{"word":"LLAMA","idx":25807,"count":1033922,"meanings":[{"definitions":[{"definition":"A South American mammal of the camel family, Lama glama, used as a domestic beast of burden and a source of wool and meat."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"llama-uk","text":"/ˈlɑː.mə/"}]},{"word":"PERIDOT","idx":25808,"count":1033816,"meanings":[{"definitions":[{"definition":"A transparent olive-green form of olivine, used as a gem."},{"definition":"A yellow-green colour, like that of the peridot."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɛɹɪdoʊ/"},{"text":"/ˈpɛɹɪdɒt/"}]},{"word":"PACERS","idx":25812,"count":1033651,"meanings":[{"definitions":[{"definition":"One who paces."},{"definition":"In harness racing, a horse with a gait in which the front and back legs on one side take a step together alternating with the legs on the other side; as opposed to a trotter."},{"definition":"A pacemaker."},{"definition":"A mechanical pencil."}],"partOfSpeech":"n"}]},{"word":"TROUBLING","idx":25813,"count":1033591,"meanings":[{"definitions":[{"definition":"To disturb, stir up, agitate (a medium, especially water)."},{"definition":"To mentally distress; to cause (someone) to be anxious or perplexed.","example":"What she said about narcissism is troubling me."},{"definition":"In weaker sense: to bother or inconvenience.","example":"I will not trouble you to deliver the letter."},{"definition":"To take pains to do something.","example":"I won't trouble to post the letter today; I can do it tomorrow."},{"definition":"To worry; to be anxious."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The infliction of trouble or distress."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Distressing, worrying"}],"partOfSpeech":"j"}]},{"word":"VOWEL","idx":25815,"count":1033509,"meanings":[{"definitions":[{"definition":"A sound produced by the vocal cords with relatively little restriction of the oral cavity, forming the prominent sound of a syllable."},{"definition":"A letter representing the sound of vowel; in English, the vowels are a, e, i, o, u, and sometimes y."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add vowel points to a consonantal script (e.g. niqqud in Hebrew or harakat in Arabic)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vowel-us","text":"/vaʊl/"}]},{"word":"COB","idx":25820,"count":1033106,"meanings":[{"definitions":[{"definition":"A male swan."},{"definition":"A corncob."},{"definition":"A round, often crusty roll or loaf of bread."},{"definition":"A building material consisting of clay, sand, straw, water, and earth, similar to adobe; also called cobb, rammed earth or pisé."},{"definition":"A horse having a stout body and short legs."},{"definition":"A gull, especially the black-backed gull (Larus marinus); also spelled cobb."},{"definition":"Any of the gold and silver coins that were minted in the Spanish Empire and valued in reales or escudos, such as the piece of eight—especially those which were crudely struck and irregularly shaped."},{"definition":"A Spanish coin formerly current in Ireland, worth about four shillings and sixpence."},{"definition":"One who is eminent, great, large, or rich."},{"definition":"A spider."},{"definition":"A small fish, the miller's thumb."},{"definition":"A large fish, especially the kabeljou (variant spelling of kob)."},{"definition":"The head of a herring."},{"definition":"The top or head of anything."},{"definition":"A lump or piece of anything, usually of a somewhat large size, as of coal, or stone."},{"definition":"A punishment consisting of blows inflicted on the buttocks with a strap or a flat piece of wood."},{"definition":"A cylinder with pins in it, encoding music to be played back mechanically by a barrel organ."},{"definition":"A person of mixed black and white ancestry, especially a griffe; a mulatto."},{"definition":"The nut of the common hazel (Corylus avellana); hazelnut."},{"definition":"A specific cultivated variety of hazelnut, also known as the Kentish cobnut."},{"definition":"A game played by children with nuts."},{"definition":"Initialism of contingency operating base."},{"definition":"Acronym of chief of boat."},{"definition":"Close of Business, usually referring to a deadline for an office in another time zone.","example":"NY office told the LA office to have report e-mailed by COB."},{"definition":"Coordination of Benefits"},{"definition":"Chairman of the Board"},{"definition":"Chip on Board"},{"definition":"A cobblestone."},{"definition":"A particle from 64 to 256 mm in diameter, following the Wentworth scale."},{"definition":"Small flat-bottomed fishing boat suitable for launching from a beach, found on the north-east coast of England and in Scotland."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To construct using mud blocks or to seal a wall using mud or an artificial equivalent."},{"definition":"Of growing corn, to have the heads mature into corncobs."},{"definition":"To beat with a flat instrument; to paddle."},{"definition":"(Northern UK, possibly colloquial) To throw, chuck, lob."},{"definition":"To chip off unwanted pieces of stone, so as to form a desired shape or improve the quality of mineral ore."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cob-us","text":"/kɑb/"}]},{"word":"FEARING","idx":25821,"count":1033027,"meanings":[{"definitions":[{"definition":"To feel fear about (something or someone); to be afraid of; to consider or expect with alarm.","example":"I fear the worst will happen."},{"definition":"To feel fear (about something).","example":"Never fear; help is always near."},{"definition":"(used with for) To worry about, to feel concern for, to be afraid for.","example":"She fears for her son’s safety."},{"definition":"To venerate; to feel awe towards.","example":"People who fear God can be found in Christian churches."},{"definition":"To regret.","example":"I fear I have bad news for you: your husband has died."},{"definition":"To cause fear to; to frighten."},{"definition":"To be anxious or solicitous for."},{"definition":"To suspect; to doubt."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Exhibiting fear."},{"definition":"Showing profound respect or deference."}],"partOfSpeech":"j"}]},{"word":"CORONATION","idx":25822,"count":1033026,"meanings":[{"definitions":[{"definition":"The act or solemnity of crowning a sovereign; the act of investing a prince with the insignia of royalty, on his succeeding to the sovereignty."},{"definition":"A success in the face of little or no opposition."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌkɔɹəˈneɪʃən/"},{"text":"/ˌkɒɹəˈneɪʃən/"}]},{"word":"DERMATITIS","idx":25829,"count":1032522,"meanings":[{"definitions":[{"definition":"Inflammation of the skin."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdɜː(ɹ)m.əˈtaɪ.tɪs/"}]},{"word":"RELUCTANCE","idx":25833,"count":1032216,"meanings":[{"definitions":[{"definition":"Unwillingness to do something."},{"definition":"Hesitancy in taking some action."},{"definition":"That property of a magnetic circuit analogous to resistance in an electric circuit."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"reluctance-us","text":"/ɹɪˈlʌktəns/"}]},{"word":"SNOWFALL","idx":25834,"count":1032198,"meanings":[{"definitions":[{"definition":"An instance of falling of snow.","example":"There has been snowfall every day this week."},{"definition":"The amount of snow that falls on one occasion.","example":"London recorded a snowfall of 10 centimetres last night."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsnoʊfɔːl/"}]},{"word":"FUNDRAISERS","idx":25836,"count":1032138,"meanings":[{"definitions":[{"definition":"An event undertaken to get money by voluntary contributions for a particular activity, such as equipment for extracurricular sports programs, or to defray laboratory costs (salaries) for research of a cure for a particular disease.","example":"This year's fundraiser will be a walkathon."},{"definition":"An individual who collects money from the public for some charitable cause."}],"partOfSpeech":"n"}]},{"word":"INCONSISTENCY","idx":25837,"count":1032085,"meanings":[{"definitions":[{"definition":"The state of being inconsistent."},{"definition":"An incompatibility between two propositions that cannot both be true."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɪnkənˈsɪstənsi/"},{"text":"/ˌɪnkənˈsɪst(ə)nsi/"}]},{"word":"FECAL","idx":25838,"count":1032064,"meanings":[{"definitions":[{"definition":"Of or relating to feces."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfiːkəl/"}]},{"word":"APOSTOLIC","idx":25843,"count":1031812,"meanings":[{"definitions":[{"definition":"Pertaining to apostles or their practice of teaching; pertaining to the apostles (of early Christianity) or their teachings.","example":"an apostolic mission"},{"definition":"According to the doctrines of the apostles; delivered or taught by the apostles.","example":"apostolic faith or practice"},{"definition":"Of or pertaining to the pope or the papacy; papal."},{"definition":"Of or pertaining to the Catholic missions."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"apostolic-us","text":"/ˌæpəˈstɑːlɪk/"}]},{"word":"VALIDATING","idx":25844,"count":1031766,"meanings":[{"definitions":[{"definition":"To render valid."},{"definition":"To check or prove the validity of; verify."},{"definition":"To have its validity successfully proven.","example":"The data file cannot be imported because it doesn't validate."}],"partOfSpeech":"ve"}]},{"word":"NEWSSTAND","idx":25846,"count":1031670,"meanings":[{"definitions":[{"definition":"An open stall, often on a street, where newspapers and magazines are on sale to the public"}],"partOfSpeech":"n"}]},{"word":"SUMMONED","idx":25847,"count":1031641,"meanings":[{"definitions":[{"definition":"To call people together; to convene."},{"definition":"To ask someone to come; to send for."},{"definition":"To order (goods) and have delivered"},{"definition":"To rouse oneself to exert a skill."},{"definition":"To call a resource by magic."},{"definition":"To summons; convene."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"summoned-us","text":"/ˈsʌmənd/"}]},{"word":"DOSSIER","idx":25848,"count":1031628,"meanings":[{"definitions":[{"definition":"A collection of papers and/or other sources, containing detailed information about a particular person or subject, together with a synopsis of their content."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɑ.si.eɪ/"},{"text":"/ˈdɒs.i.eɪ/"}]},{"word":"TREBLE","idx":25849,"count":1031575,"meanings":[{"definitions":[{"definition":"The highest singing voice (especially as for a boy) or part in musical composition."},{"definition":"A person or instrument having a treble voice or pitch; a boy soprano."},{"definition":"The highest tuned in a ring of bells."},{"definition":"Any high-pitched or shrill voice or sound."},{"definition":"A threefold quantity or number; something having three parts or having been tripled."},{"definition":"A drink with three portions of alcohol."},{"definition":"Any of the narrow areas enclosed by the two central circles on a dartboard, worth three times the usual value of the segment."},{"definition":"Three goals, victories, awards etc. in a given match or season."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To multiply by three; to make into three parts, layers, or thrice the amount."},{"definition":"To become multiplied by three or increased threefold."},{"definition":"To make a shrill or high-pitched noise."},{"definition":"To utter in a treble key; to whine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pertaining to the highest singing voice or part in harmonized music; soprano."},{"definition":"High in pitch; shrill."},{"definition":"Threefold, triple."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Trebly; triply."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"treble-uk","text":"/ˈtɹɛbəl/"}]},{"word":"GALLEY","idx":25850,"count":1031511,"meanings":[{"definitions":[{"definition":"A long, slender ship propelled primarily by oars, whether having masts and sails or not; usually referring to rowed warships used in the Mediterranean from the 16th century until the modern era."},{"definition":"A light, open boat used on the Thames by customhouse officers, press gangs, and also for pleasure."},{"definition":"One of the small boats carried by a man-of-war."},{"definition":"The cookroom or kitchen and cooking apparatus of a vessel or aircraft; sometimes on merchant vessels called the caboose."},{"definition":"An oblong oven or muffle with a battery of retorts; a gallery furnace."},{"definition":"An oblong tray of wood or brass, with upright sides, for holding type which has been set, or is to be made up, etc."},{"definition":"A proof sheet taken from type while on a galley; a galley proof."},{"definition":"A representation of a single masted ship propelled by oars, with three flags and a basket."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"galley-us","text":"/ˈɡæli/"},{"audio":"galley-uk","text":"/ˈɡæli/"}]},{"word":"SHOVEL","idx":25852,"count":1031406,"meanings":[{"definitions":[{"definition":"A hand tool with a handle, used for moving portions of material such as earth, snow, and grain from one place to another, with some forms also used for digging. Not to be confused with a spade, which is designed solely for small-scale digging and incidental tasks such as chopping of small roots."},{"definition":"A spade."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move materials with a shovel.","example":"After the blizzard, we shoveled the driveway for the next two days."},{"definition":"To move with a shoveling motion.","example":"Already late for work, I shovelled breakfast into my mouth as fast as possible."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shovel-us","text":"/ˈʃʌvəl/"}]},{"word":"ENTAIL","idx":25855,"count":1031285,"meanings":[{"definitions":[{"definition":"To imply or require.","example":"This activity will entail careful attention to detail."},{"definition":"To settle or fix inalienably on a person or thing, or on a person and his descendants or a certain line of descendants; -- said especially of an estate; to bestow as a heritage."},{"definition":"To appoint hereditary possessor."},{"definition":"To cut or carve in an ornamental way."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That which is entailed. Hence:"},{"definition":"Delicately carved ornamental work; intaglio."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"entail-us","text":"/ənˈteɪl/"}]},{"word":"MASHED","idx":25857,"count":1031175,"meanings":[{"definitions":[{"definition":"To convert into a mash; to reduce to a soft pulpy state by beating or pressure","example":"The potatoes need to be mashed."},{"definition":"In brewing, to convert (for example malt, or malt and meal) into the mash which makes wort."},{"definition":"To press down hard (on).","example":"to mash on a bicycle pedal"},{"definition":"To press."},{"definition":"To prepare a cup of tea in a teapot; to brew (tea)."},{"definition":"To act violently."},{"definition":"To flirt, to make eyes, to make romantic advances"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Broken up into a pulpy state.","example":"mashed potatoes"},{"definition":"Intoxicated"}],"partOfSpeech":"j"}]},{"word":"SONGWRITING","idx":25858,"count":1031090,"meanings":[{"definitions":[{"definition":"(authorship) The work of a songwriter."}],"partOfSpeech":"n"}]},{"word":"PACING","idx":25861,"count":1030988,"meanings":[{"definitions":[{"definition":"To walk back and forth in a small distance."},{"definition":"To set the speed in a race."},{"definition":"To measure by walking."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of moving in paces, or their arrangement or timing."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpeɪsɪŋ/"}]},{"word":"NIGHTTIME","idx":25863,"count":1030862,"meanings":[{"definitions":[{"definition":"The hours of darkness between sunset and sunrise; the night."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to nighttime; appropriate to the night."},{"definition":"Happening during the night."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈnaɪtˌtaɪm/"}]},{"word":"FLUXES","idx":25864,"count":1030772,"meanings":[{"definitions":[{"definition":"The act of flowing; a continuous moving on or passing by, as of a flowing stream."},{"definition":"A state of ongoing change.","example":"Languages, like our bodies, are in a continual flux."},{"definition":"A chemical agent for cleaning metal prior to soldering or welding.","example":"It is important to use flux when soldering or oxides on the metal will prevent a good bond."},{"definition":"The rate of transfer of energy (or another physical quantity) through a given surface, specifically electric flux, magnetic flux.","example":"That high a neutron flux would be lethal in seconds."},{"definition":"A disease which causes diarrhea, especially dysentery."},{"definition":"Diarrhea or other fluid discharge from the body."},{"definition":"The state of being liquid through heat; fusion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use flux on.","example":"You have to flux the joint before soldering."},{"definition":"To melt."},{"definition":"To flow as a liquid."}],"partOfSpeech":"ve"}]},{"word":"MOAN","idx":25865,"count":1030590,"meanings":[{"definitions":[{"definition":"A low, mournful cry of pain, sorrow or pleasure"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To complain about; to bemoan, to bewail; to mourn."},{"definition":"To grieve."},{"definition":"To distress (someone); to sadden."},{"definition":"To make a moan or similar sound."},{"definition":"To say in a moan, or with a moaning voice.","example":"‘Please don't leave me,’ he moaned."},{"definition":"To complain; to grumble."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"moan-us","text":"/moʊn/"}]},{"word":"FINDERS","idx":25867,"count":1030500,"meanings":[{"definitions":[{"definition":"One who finds or discovers something."},{"definition":"An optical device, such as a viewfinder, used to locate a target or other object of interest"}],"partOfSpeech":"n"}]},{"word":"DICTATED","idx":25868,"count":1030464,"meanings":[{"definitions":[{"definition":"To order, command, control."},{"definition":"To speak in order for someone to write down the words.","example":"She is dictating a letter to a stenographer."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdɪkˌteɪtɪd/"},{"text":"/ˌdɪkˈteɪtɪd/"}]},{"word":"PROXIMAL","idx":25876,"count":1030071,"meanings":[{"definitions":[{"definition":"Closer to the point of attachment or observation."},{"definition":"Facing toward another tooth. The proximal surfaces of a tooth are those that touch or are close to neighboring teeth."},{"definition":"Closer to the speaker."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpɹɒksɪməl/"}]},{"word":"UNFOLDING","idx":25879,"count":1030013,"meanings":[{"definitions":[{"definition":"To undo a folding.","example":"to unfold a map; to unfold a tablecloth; she unpacks the new dress and unfolds it carefully"},{"definition":"To turn out; to happen; to develop."},{"definition":"To reveal."},{"definition":"To open (anything covered or closed); to lay open to view or contemplation; to bring out in all the details, or by successive development.","example":"to unfold one's designs;  to unfold the principles of a science"},{"definition":"To release from a fold or pen.","example":"to unfold sheep"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something unfolds or becomes revealed."}],"partOfSpeech":"n"}]},{"word":"DESERTS","idx":25881,"count":1029901,"meanings":[{"definitions":[{"definition":"(usually in the plural) That which is deserved or merited; a just punishment or reward"},{"definition":"A barren area of land or desolate terrain, especially one with little water or vegetation; a wasteland."},{"definition":"Any barren place or situation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To leave (anything that depends on one's presence to survive, exist, or succeed), especially when contrary to a promise or obligation; to abandon; to forsake.","example":"You can't just drive off and desert me here, in the middle of nowhere."},{"definition":"To leave one's duty or post, especially to leave a military or naval unit without permission.","example":"Anyone found deserting will be punished."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dəˈzɝts/"},{"text":"/ˈdɛzɚts/"},{"text":"/dɪˈzɜːts/"},{"text":"/ˈdɛzəts/"}]},{"word":"MILKING","idx":25882,"count":1029628,"meanings":[{"definitions":[{"definition":"To express milk from (a mammal, especially a cow).","example":"The farmer milked his cows."},{"definition":"To draw (milk) from the breasts or udder.","example":"to milk wholesome milk from healthy cows"},{"definition":"To express any liquid (from any creature)."},{"definition":"To make excessive use of (a particular point in speech or writing, a source of funds, etc.); to exploit; to take advantage of (something).","example":"When the audience began laughing, the comedian milked the joke for more laughs."},{"definition":"(of an electrical storage battery) To give off small gas bubbles during the final part of the charging operation."},{"definition":"To single-mindedly masturbate a male to ejaculation, especially for the amusement and/or satisfaction of the masturbator/trix rather than the person masturbated.","example":"Controlled milking can actually establish and consolidate a mistress’ dominance over her sub rather than diminish it."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which a cow, etc. is milked"},{"definition":"Male masturbation (or fellatio) that leads to the release of semen, especially when performed on a milking table"}],"partOfSpeech":"n"}]},{"word":"SUITABLY","idx":25884,"count":1029188,"meanings":[{"definitions":[{"definition":"In a suitable manner; with propriety."}],"partOfSpeech":"v"}]},{"word":"ENORMOUSLY","idx":25887,"count":1028873,"meanings":[{"definitions":[{"definition":"Extremely, greatly: to an enormous degree.","example":"Gloria is enormously pleased with our progress."},{"definition":"Shockingly."}],"partOfSpeech":"v"}]},{"word":"PEROXIDE","idx":25890,"count":1028613,"meanings":[{"definitions":[{"definition":"A divalent radical or anion containing two oxygen atoms linked by a covalent bond; any substance containing this group which yields hydrogen peroxide when treated with an acid"},{"definition":"Hydrogen peroxide, especially an aqueous solution used as a bleach"},{"definition":"Any unstable compound or general formula R-O-O-R'"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat (something) with hydrogen peroxide, especially hair in order to bleach it"}],"partOfSpeech":"ve"}]},{"word":"SCRIBE","idx":25892,"count":1028438,"meanings":[{"definitions":[{"definition":"Someone who writes; a draughtsperson; a writer for another; especially, an official or public writer; an amanuensis, secretary, notary or copyist."},{"definition":"A writer and doctor of the law; one skilled in the law and traditions; one who read and explained the law to the people."},{"definition":"A very sharp, steel drawing implement used in engraving and etching, a scriber."},{"definition":"(in particular) A journalist."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write."},{"definition":"To write, engrave, or mark upon; to inscribe."},{"definition":"To record."},{"definition":"To write or draw with a scribe."},{"definition":"To cut (anything) in such a way as to fit closely to a somewhat irregular surface, as a baseboard to a floor which is out of level, a board to the curves of a moulding, etc.; so called because the workman marks, or scribes, with the compasses the line that he afterwards cuts."},{"definition":"To score or mark with compasses or a scribing iron."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scribe-uk","text":"/skɹaɪb/"}]},{"word":"ERM","idx":25894,"count":1028321,"meanings":[{"definitions":[{"definition":"Used in hesitant speech, or to express uncertainty; um, umm.","example":"She was going to, erm... the salon, I think."},{"definition":"Used to express embarrassment or subtle disagreement.","example":"Erm, I don't think that was supposed to happen."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"erm-us","text":"/ɝm/"}]},{"word":"OUTAGES","idx":25897,"count":1028188,"meanings":[{"definitions":[{"definition":"A temporary suspension of operation, especially of electrical power supply."},{"definition":"The amount of something lost in storage or transportation."}],"partOfSpeech":"n"}]},{"word":"SLEIGH","idx":25898,"count":1028137,"meanings":[{"definitions":[{"definition":"A vehicle, generally pulled by an animal, which moves over snow or ice on runners, used for transporting persons or goods. (contrast \"sled\", which is smaller)","example":"Santa travels in a sleigh."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride or drive a sleigh."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sly."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sleigh-us","text":"/sleɪ/"}]},{"word":"COMPLEMENTED","idx":25899,"count":1028127,"meanings":[{"definitions":[{"definition":"To complete, to bring to perfection, to make whole.","example":"We believe your addition will complement the team."},{"definition":"To provide what the partner lacks and lack what the partner provides, thus forming part of a whole.","example":"I believe our talents really complement each other."},{"definition":"To change a voltage, number, color, etc. to its complement."},{"definition":"Old form of compliment"}],"partOfSpeech":"ve"}]},{"word":"FORMULAE","idx":25900,"count":1028052,"meanings":[{"definitions":[{"definition":"Any mathematical rule expressed symbolically."},{"definition":"A symbolic expression of the structure of a compound.","example":"H2O is the formula for water."},{"definition":"A plan or method for dealing with a problem or for achieving a result.","example":"The company's winning formula includes excellent service and quality products."},{"definition":"A formulation; a prescription; a mixture or solution made in a prescribed manner; the identity and quantities of ingredients of such a mixture.","example":"The formula of the rocket fuel has not been revealed."},{"definition":"A formal statement of doctrine, as in religion."},{"definition":"A syntactic expression of a proposition, built up from quantifiers, logical connectives, variables, relation and operation symbols, and, depending on the type of logic, possibly other operators such as modal, temporal, deontic or epistemic ones."},{"definition":"A manufactured food simulating human breast milk, designed to be fed to babies and infants under 12 months of age."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɔː(ɹ)mjəˌlaɪ/"}]},{"word":"FEN","idx":25901,"count":1028033,"meanings":[{"definitions":[{"definition":"A type of wetland fed by ground water and runoff, containing peat below the waterline, characteristically alkaline."},{"definition":"Unit of currency in China, one-hundredth of a yuan"},{"definition":"Fans; a plural form used by enthusiasts of science fiction, fantasy, and anime, partly from whimsy and partly to distinguish themselves from fans of sport, etc."},{"definition":"A kind of mildew that grows on hops."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fɛn/"}]},{"word":"BACKLASH","idx":25904,"count":1027493,"meanings":[{"definitions":[{"definition":"A sudden backward motion."},{"definition":"A negative reaction, objection or outcry, especially of a violent or abrupt nature.","example":"The public backlash to the proposal was quick and insistent."},{"definition":"The distance through which one part of connected machinery, as a wheel, piston, or screw, can be moved without moving the connected parts, resulting from looseness in fitting or from wear."},{"definition":"The jarring or reflex motion caused in badly fitting machinery by irregularities in velocity or a reverse of motion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause or set off a backlash."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"backlash-us","text":"/ˈbækˌlæʃ/"}]},{"word":"SANK","idx":25907,"count":1027160,"meanings":[{"definitions":[{"definition":"(heading, physical) To move or be moved into something."},{"definition":"(heading, social) To diminish or be diminished."},{"definition":"To conceal and appropriate."},{"definition":"To keep out of sight; to suppress; to ignore."},{"definition":"To pay absolutely.","example":"I have sunk thousands of pounds into this project."},{"definition":"To reduce or extinguish by payment.","example":"to sink the national debt"},{"definition":"To be overwhelmed or depressed; to fail in strength."},{"definition":"To decrease in volume, as a river; to subside; to become diminished in volume or in apparent height."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sank-us","text":"/sæŋk/"}]},{"word":"FRONTAGE","idx":25908,"count":1027134,"meanings":[{"definitions":[{"definition":"The front part of a property or building that faces the street."},{"definition":"The land between a property and the street."},{"definition":"The length of a property along a street."},{"definition":"Property or territory adjacent to a body of water."},{"definition":"The front part generally."}],"partOfSpeech":"n"}]},{"word":"BLISTER","idx":25909,"count":1027084,"meanings":[{"definitions":[{"definition":"A small bubble between the layers of the skin that contains watery or bloody fluid and is caused by friction and pressure, burning, freezing, chemical irritation, disease or infection."},{"definition":"A swelling on a plant."},{"definition":"Something applied to the skin to raise a blister; a vesicatory or other applied medicine."},{"definition":"A bubble, as on a painted surface."},{"definition":"(roofing) An enclosed pocket of air, which may be mixed with water or solvent vapor, trapped between impermeable layers of felt or between the membrane and substrate."},{"definition":"A type of pre-formed packaging made from plastic that contains cavities.","example":"blister card"},{"definition":"A cause of annoyance"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To raise blisters on.","example":"a chemical agent that blisters the skin"},{"definition":"To have a blister form."},{"definition":"To criticise severely."},{"definition":"To break out in blisters."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈblɪstɚ/"}]},{"word":"ZS","idx":25910,"count":1026992,"meanings":[{"definitions":[{"definition":"Sleep.","example":"It's getting late: it's time to catch some z's."}],"partOfSpeech":"n"}]},{"word":"OPACITY","idx":25915,"count":1026698,"meanings":[{"definitions":[{"definition":"The state or quality of being opaque, not allowing light to pass through","example":"We could not see the sandbar due to the opacity of the muddy water."},{"definition":"The state or quality of being inaccessible to understanding.","example":"The opacity of these decisions is troubling."},{"definition":"A measure of relative impenetrability to electromagnetic radiation such as light.","example":"The opacity of a clean glass window is near zero."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/oʊˈpæsɪtiː/"}]},{"word":"RATION","idx":25916,"count":1026649,"meanings":[{"definitions":[{"definition":"A portion of some limited resource allocated to a person or group."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply with a ration; to limit (someone) to a specific allowance of something.","example":"We rationed ourselves to three sips of water a day until we were rescued."},{"definition":"To portion out (especially during a shortage of supply); to limit access to.","example":"By the third day on the raft, we had to ration our water."},{"definition":"To restrict (an activity etc.)","example":"Our present health care system is rationed only to those who can afford it because of unnecessary high cost, lack of insurance coverage by 47 million people, and exorbitant prescription prices."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ration-us"},{"text":"/ˈɹæʃən/"}]},{"word":"HUMID","idx":25919,"count":1026485,"meanings":[{"definitions":[{"definition":"Containing perceptible moisture (usually describing air or atmosphere); damp; moist; somewhat wet or watery.","example":"humid earth"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"humid-us","text":"/ˈhjuːmɪd/"}]},{"word":"PORTRAYAL","idx":25921,"count":1026432,"meanings":[{"definitions":[{"definition":"The act of portraying."},{"definition":"The result of portraying; a representation, description, or portrait."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌpɔɹˈtɹeɪ.əl/"}]},{"word":"VEGGIES","idx":25922,"count":1026387,"meanings":[{"definitions":[{"definition":"A vegetable."},{"definition":"A vegetarian."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"veggies-us"}]},{"word":"CENTENARY","idx":25923,"count":1026348,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or completing a period of 100 years."},{"definition":"Relating to a hundred of anything."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The hundredth anniversary of an event or happening."}],"partOfSpeech":"n"}]},{"word":"GUILE","idx":25924,"count":1026260,"meanings":[{"definitions":[{"definition":"Astuteness often marked by a certain sense of cunning or artful deception."},{"definition":"Deceptiveness, deceit, fraud, duplicity, dishonesty."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deceive, beguile, bewile."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"guile-uk","text":"/ɡaɪl/"}]},{"word":"LACQUER","idx":25925,"count":1026221,"meanings":[{"definitions":[{"definition":"A glossy, resinous material used as a surface coating; either a natural exudation of certain trees, or a solution of nitrocellulose in alcohol, etc."},{"definition":"A similar finish, baked onto the inside of cans."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply a lacquer to something or to give something a smooth, glossy finish."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lacquer-us","text":"/ˈlæk.ɚ/"}]},{"word":"UNFOLD","idx":25926,"count":1026128,"meanings":[{"definitions":[{"definition":"In functional programming, a kind of higher-order function that is the opposite of a fold."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To undo a folding.","example":"to unfold a map; to unfold a tablecloth; she unpacks the new dress and unfolds it carefully"},{"definition":"To turn out; to happen; to develop."},{"definition":"To reveal."},{"definition":"To open (anything covered or closed); to lay open to view or contemplation; to bring out in all the details, or by successive development.","example":"to unfold one's designs;  to unfold the principles of a science"},{"definition":"To release from a fold or pen.","example":"to unfold sheep"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"unfold-uk","text":"/ʌnˈfəʊld/"}]},{"word":"HAMMERED","idx":25928,"count":1026068,"meanings":[{"definitions":[{"definition":"To strike repeatedly with a hammer, some other implement, the fist, etc.","example":"Tony hammered on the door to try to get him to open."},{"definition":"To form or forge with a hammer; to shape by beating."},{"definition":"To emphasize a point repeatedly."},{"definition":"To hit particularly hard."},{"definition":"To ride very fast."},{"definition":"To strike internally, as if hit by a hammer.","example":"I could hear the engine’s valves hammering once the timing rod was thrown."},{"definition":"To defeat (a person, a team) resoundingly","example":"We hammered them 5-0!"},{"definition":"To make high demands on (a system or service)."},{"definition":"To declare (a person) a defaulter on the stock exchange."},{"definition":"To beat down the price of (a stock), or depress (a market)."},{"definition":"To have hard sex with","example":"Daniel hammered Mary til he came."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been hit with a hammer or hammer-like object."},{"definition":"Very drunk; inebriated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hammered-us"}]},{"word":"EID","idx":25929,"count":1025911,"meanings":[{"definitions":[{"definition":"Alternative letter-case form of Eid"},{"definition":"An isthmus or narrow neck of land jutting out into the sea; a sandbank cast up by the sea across the head of an open bight or inlet and having a lagoon inside it."}],"partOfSpeech":"n"}]},{"word":"PEDAGOGICAL","idx":25931,"count":1025853,"meanings":[{"definitions":[{"definition":"Of, or relating to pedagogy; teaching."},{"definition":"Haughty and formal."}],"partOfSpeech":"j"}]},{"word":"TUTTI","idx":25933,"count":1025839,"meanings":[{"definitions":[{"definition":"A passage in which all members of an orchestra are playing"}],"partOfSpeech":"n"},{"definitions":[{"definition":"All together; with all playing at once.","example":"a tutti passage"}],"partOfSpeech":"j"},{"definitions":[{"definition":"All together. Indicates that the remainder of a group should join in playing after a solo or other passage with a reduced number of voices."}],"partOfSpeech":"v"}]},{"word":"MINED","idx":25934,"count":1025833,"meanings":[{"definitions":[{"definition":"To remove (ore) from the ground."},{"definition":"To dig into, for ore or metal."},{"definition":"To sow mines (the explosive devices) in (an area)."},{"definition":"To damage (a vehicle or ship) with a mine (an explosive device)."},{"definition":"To dig a tunnel or hole; to burrow in the earth."},{"definition":"To dig away, or otherwise remove, the substratum or foundation of; to lay a mine under; to sap; to undermine."},{"definition":"(by extension) To ruin or destroy by slow degrees or secret means."},{"definition":"To pick one's nose."},{"definition":"To earn new units of cryptocurrency by doing certain calculations."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/maɪnd/"}]},{"word":"INTERVENING","idx":25936,"count":1025536,"meanings":[{"definitions":[{"definition":"To become involved in a situation, so as to alter or prevent an action.","example":"The police had to be called to intervene in the fight."},{"definition":"To occur, fall, or come between, points of time, or events.","example":"An instant intervened between the flash and the report."},{"definition":"To occur or act as an obstacle or delay.","example":"Nothing intervened to prevent the undertaking."},{"definition":"To say (something) in the middle of a conversation or discussion between other people, or to respond to a situation involving other people."},{"definition":"To come between, or to be between, persons or things.","example":"The Mediterranean intervenes between Europe and Africa."},{"definition":"In a suit to which one has not been made a party, to put forward a defense of one's interest in the subject matter.","example":"an application for leave (i.e. permission) to intervene"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Intervention; mediation"}],"partOfSpeech":"n"},{"definitions":[{"definition":"That intervenes or mediates."},{"definition":"Falling between two periods or events."}],"partOfSpeech":"j"}]},{"word":"BALE","idx":25937,"count":1025459,"meanings":[{"definitions":[{"definition":"Evil, especially considered as an active force for destruction or death."},{"definition":"Suffering, woe, torment."},{"definition":"A large fire, a conflagration or bonfire."},{"definition":"A funeral pyre."},{"definition":"A beacon-fire."},{"definition":"A rounded bundle or package of goods in a cloth cover, and corded for storage or transportation."},{"definition":"A bundle of compressed wool or hay, compacted for shipping and handling."},{"definition":"A measurement of hay equal to 10 flakes. Approximately 70-90 lbs (32-41 kg)."},{"definition":"A measurement of paper equal to 10 reams."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove water from a boat with buckets etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bale-us","text":"/beɪ̯l/"}]},{"word":"ASTRONOMERS","idx":25938,"count":1025450,"meanings":[{"definitions":[{"definition":"One who studies astronomy, the stars or the physical universe; a scientist whose area of research is astronomy or astrophysics"}],"partOfSpeech":"n"}]},{"word":"FISHNET","idx":25939,"count":1025386,"meanings":[{"definitions":[{"definition":"A net used to catch fish.","example":"The fishnets were hung over bushes to dry."},{"definition":"A fabric with an open diamond-shaped structure; normally used for stockings etc"},{"definition":"(usually in plural) Stockings made of fishnet fabric.","example":"Fishnets are for catching men."}],"partOfSpeech":"n"}]},{"word":"COMBINATORIAL","idx":25940,"count":1025254,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or involving combinations"},{"definition":"Of or pertaining to the combination and arrangement of elements in sets"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"combinatorial-us","text":"/ˌkɑm.bɪ.nəˈtɔɹ.i.əɫ/"}]},{"word":"THRILLS","idx":25941,"count":1025183,"meanings":[{"definitions":[{"definition":"A trembling or quivering, especially one caused by emotion."},{"definition":"A cause of sudden excitement; a kick."},{"definition":"A slight quivering of the heart that accompanies a cardiac murmur."},{"definition":"A breathing place or hole; a nostril, as of a bird."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To suddenly excite someone, or to give someone great pleasure; to (figuratively) electrify; to experience such a sensation."},{"definition":"To (cause something to) tremble or quiver."},{"definition":"To perforate by a pointed instrument; to bore; to transfix; to drill."},{"definition":"To hurl; to throw; to cast."},{"definition":"To drill and thread in one operation, using a tool bit that cuts the hole and the threads in one series of computer-controlled movements."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/θɹɪlz/"}]},{"word":"THEREFOR","idx":25942,"count":1025143,"meanings":[{"definitions":[{"definition":"Therefore, for that or this reason or cause."},{"definition":"For or in return for that."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ðɛəɹˈfɔɹ/"},{"text":"/ðɛəˈfɔː/"}]},{"word":"UNINTENDED","idx":25943,"count":1025052,"meanings":[{"definitions":[{"definition":"Not intended; unplanned"}],"partOfSpeech":"j"}]},{"word":"SORES","idx":25944,"count":1024935,"meanings":[{"definitions":[{"definition":"An injured, infected, inflamed or diseased patch of skin.","example":"They put ointment and a bandage on the sore."},{"definition":"Grief; affliction; trouble; difficulty."},{"definition":"A group of ducks on land."},{"definition":"A young hawk or falcon in its first year."},{"definition":"A young buck in its fourth year."}],"partOfSpeech":"n"}]},{"word":"PASTURES","idx":25950,"count":1024520,"meanings":[{"definitions":[{"definition":"Land, specifically, an open field, on which livestock is kept for feeding."},{"definition":"Ground covered with grass or herbage, used or suitable for the grazing of livestock."},{"definition":"Food, nourishment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move animals into a pasture."},{"definition":"To graze."},{"definition":"To feed, especially on growing grass; to supply grass as food for.","example":"The farmer pastures fifty oxen; the land will pasture forty cows."}],"partOfSpeech":"ve"}]},{"word":"SMOG","idx":25951,"count":1024498,"meanings":[{"definitions":[{"definition":"A noxious mixture of particulates and gases that is the result of urban air pollution."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To get a smog check; to check a vehicle or have it checked for emissions.","example":"If the car is more than five years old, you'll have to have it smogged before you can register it."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"smog-uk","text":"/smɒɡ/"}]},{"word":"UNATTENDED","idx":25952,"count":1024424,"meanings":[{"definitions":[{"definition":"Not attended; without persons present.","example":"System administrators may schedule an unattended installation of the software."},{"definition":"Not attended to; not receiving attention.","example":"The fire was caused by an unattended electric blanket."}],"partOfSpeech":"j"}]},{"word":"POA","idx":25954,"count":1024369,"meanings":[{"definitions":[{"definition":"Any grass of the genus Poa, especiallu Poa annua."}],"partOfSpeech":"n"}]},{"word":"PLAYWRIGHT","idx":25955,"count":1024239,"meanings":[{"definitions":[{"definition":"A writer and creator of theatrical plays."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"playwright-us","text":"/ˈpleɪˌɹaɪt/"}]},{"word":"MICS","idx":25956,"count":1024213,"meanings":[{"definitions":[{"definition":"Alternative form of mike"}],"partOfSpeech":"n"}]},{"word":"PREM","idx":25958,"count":1024164,"meanings":[{"definitions":[{"definition":"A prematurely born infant."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɹɛm/"}]},{"word":"SELVES","idx":25966,"count":1023898,"meanings":[{"definitions":[{"definition":"One individual's personality, character, demeanor, or disposition.","example":"one's true self; one's better self; one's former self"},{"definition":"The subject of one's own experience of phenomena: perception, emotions, thoughts."},{"definition":"An individual person as the object of his own reflective consciousness (plural selves)."},{"definition":"Self-interest or personal advantage."},{"definition":"Identity or personality."},{"definition":"A seedling produced by self-pollination (plural selfs)."},{"definition":"A flower having its colour uniform as opposed to variegated."},{"definition":"Any molecule, cell, or tissue of an organism's own (belonging to the self), as opposed to a foreign (nonself) molecule, cell, or tissue (for example, infective, allogenic, or xenogenic)."}],"partOfSpeech":"n"}]},{"word":"TITTY","idx":25967,"count":1023702,"meanings":[{"definitions":[{"definition":"A breast"},{"definition":"A nipple"},{"definition":"A kitten"},{"definition":"A sister or girl"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"titty-au","text":"/ˈtɪti/"}]},{"word":"NATURALIZATION","idx":25968,"count":1023665,"meanings":[{"definitions":[{"definition":"The action of naturalizing somebody; act of granting citizenship."},{"definition":"The admission or adoption of foreign words or customs into general use."},{"definition":"The introduction and establishment of an animal or plant into a place where it is not indigenous."}],"partOfSpeech":"n"}]},{"word":"WHISPERING","idx":25970,"count":1023584,"meanings":[{"definitions":[{"definition":"To speak softly, or under the breath, so as to be heard only by one near at hand; to utter words without sonant breath; to talk without that vibration in the larynx which gives sonorous, or vocal, sound."},{"definition":"To mention privately and confidentially, or in a whisper."},{"definition":"To make a low, sibilant sound."},{"definition":"To speak with suspicion or timorous caution; to converse in whispers, as in secret plotting."},{"definition":"To address in a whisper, or low voice."},{"definition":"To prompt secretly or cautiously; to inform privately."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something that is whispered; gossip; a rumor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That whispers"},{"definition":"Associated with whispers"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"whispering-us","text":"/ˈ(h)wɪspəɹɪŋ/"}]},{"word":"DISSIPATION","idx":25971,"count":1023511,"meanings":[{"definitions":[{"definition":"The act of dissipating or dispersing; a state of dispersion or separation; dispersion; waste."},{"definition":"A dissolute course of life, in which health, money, etc., are squandered in pursuit of pleasure; profuseness in immoral indulgence, as late hours, riotous living, etc.; dissoluteness."},{"definition":"A trifle which wastes time or distracts attention."},{"definition":"A loss of energy, usually as heat, from a dynamic system."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdɪsɪˈpeɪʃən/"}]},{"word":"SPRITE","idx":25972,"count":1023444,"meanings":[{"definitions":[{"definition":"Spirit; mind; soul; state of mind; mood."},{"definition":"A supernatural being; a spirit; a shade; an apparition; a ghost."},{"definition":"A kind of short arrow."},{"definition":"A spirit; a soul; a shade"},{"definition":"An apparition; ghost"},{"definition":"An elf; a fairy; a goblin."},{"definition":"The green woodpecker, or yaffle."},{"definition":"A two-dimensional image or animation that is integrated into a larger scene."},{"definition":"An electrical discharge that occurs high above the cumulonimbus cloud of an active thunderstorm."},{"definition":"A spayed female ferret."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sprite-uk","text":"/spɹaɪt/"}]},{"word":"KEEL","idx":25973,"count":1023303,"meanings":[{"definitions":[{"definition":"Red chalk; ruddle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark with ruddle."},{"definition":"To put to death; to extinguish the life of.","example":"Smoking kills more people each year than alcohol and drugs combined."},{"definition":"To render inoperative.","example":"He killed the engine and turned off the headlights, but remained in the car, waiting."},{"definition":"To stop, cease or render void; to terminate.","example":"My computer wouldn't respond until I killed some of the running processes."},{"definition":"To amaze, exceed, stun or otherwise incapacitate.","example":"That joke always kills me."},{"definition":"To cause great pain, discomfort or distress to.","example":"These tight shoes are killing my feet."},{"definition":"To produce feelings of dissatisfaction or revulsion in.","example":"It kills me to learn how many poor people are practically starving in this country while rich moguls spend such outrageous amounts on useless luxuries."},{"definition":"To use up or to waste.","example":"He told the bartender, pointing at the bottle of scotch he planned to consume, \"Leave it, I'm going to kill the bottle.\""},{"definition":"To exert an overwhelming effect on.","example":"Between the two of us, we killed the rest of the case of beer."},{"definition":"To overpower, overwhelm or defeat.","example":"The team had absolutely killed their traditional rivals, and the local sports bars were raucous with celebrations."},{"definition":"To force a company out of business."},{"definition":"To produce intense pain.","example":"You don't ever want to get rabies. The doctor will have to give you multiple shots and they really kill."},{"definition":"To punish severely.","example":"My parents are going to kill me!"},{"definition":"To strike (a ball, etc.) with such force and placement as to make a shot that is impossible to defend against, usually winning a point."},{"definition":"To cause (a ball, etc.) to be out of play, resulting in a stoppage of gameplay."},{"definition":"To succeed with an audience, especially in comedy."},{"definition":"To cause to assume the value zero."},{"definition":"(IRC) To disconnect (a user) involuntarily from the network."},{"definition":"To deadmelt."}],"partOfSpeech":"ve"}]},{"word":"FART","idx":25974,"count":1023292,"meanings":[{"definitions":[{"definition":"An emission of digestive gases from the anus; a flatus."},{"definition":"(impolite) An irritating person; a fool."},{"definition":"(impolite, potentially offensive) (usually as \"old fart\") An elderly person; especially one perceived to hold old-fashioned views."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(impolite) To emit digestive gases from the anus; to flatulate."},{"definition":"(usually as \"fart around\") To waste time with idle and inconsequential tasks; to go about one's activities in a lackadaisical manner; to be lazy or over-relaxed in one's manner or bearing."},{"definition":"To emit (fumes, gases, etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fart-uk","text":"/fɑːt/"}]},{"word":"OXIDASE","idx":25975,"count":1023113,"meanings":[{"definitions":[{"definition":"Any of many enzymes which catalyze oxidation reactions, especially ones using molecular oxygen."}],"partOfSpeech":"n"}]},{"word":"ATHEISM","idx":25978,"count":1022796,"meanings":[{"definitions":[{"definition":"(narrowly) Belief that no deities exist (sometimes including rejection of other religious beliefs)."},{"definition":"(broadly) Rejection of belief that any deities exist (with or without a belief that no deities exist)."},{"definition":"(very broadly) Absence of belief that any deities exist (including absence of the concept of deities)."},{"definition":"Absence of belief in a particular deity, pantheon, or religious doctrine (notwithstanding belief in other deities)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"atheism-us","text":"/ˈeɪθiɪzəm/"}]},{"word":"GRIPPING","idx":25979,"count":1022602,"meanings":[{"definitions":[{"definition":"To take hold of, particularly with the hand.","example":"After a few slips, the tires gripped the pavement."},{"definition":"To help or assist, particularly in an emotional sense.","example":"He grips me."},{"definition":"To do something with another that makes you happy/gives you relief.","example":"Let’s grip (get a coffee, hang, take a break, see a movie, etc.)"},{"definition":"To trench; to drain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pinching and spasmodic pain in the intestines; gripe."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Which catches someone's attention; exciting","example":"a gripping action film"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɹɪpɪŋ/"}]},{"word":"CELLARS","idx":25980,"count":1022403,"meanings":[{"definitions":[{"definition":"An enclosed underground space, often under a building, used for storage or shelter."},{"definition":"A wine collection, especially when stored in a cellar."},{"definition":"Last place in a league or competition."},{"definition":"Salt cellar"},{"definition":"A small dish for holding salt."}],"partOfSpeech":"n"}]},{"word":"CATERER","idx":25981,"count":1022391,"meanings":[{"definitions":[{"definition":"A person employed to obtain and maintain the storage of provisions, especially food."},{"definition":"A person or company hired to provide and serve food, usually for a large group and at a location separate from where the food is prepared."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkeɪtəɹəɹ/"}]},{"word":"PREGNANCIES","idx":25982,"count":1022382,"meanings":[{"definitions":[{"definition":"The condition of being pregnant."},{"definition":"The period of time this condition prevails."},{"definition":"The progression of stages from conception to birth."}],"partOfSpeech":"n"}]},{"word":"TAINTED","idx":25984,"count":1022281,"meanings":[{"definitions":[{"definition":"To contaminate or corrupt (something) with an external agent, either physically or morally."},{"definition":"To spoil (food) by contamination."},{"definition":"To be infected or corrupted; to be touched by something corrupting."},{"definition":"To be affected with incipient putrefaction.","example":"Meat soon taints in warm weather."},{"definition":"To mark (a variable) as unsafe, so that operations involving it are subject to additional security checks."},{"definition":"To invalidate (a share capital account) by transferring profits into it."},{"definition":"To damage, as a lance, without breaking it; also, to break, as a lance, but usually in an unknightly or unscientific manner."},{"definition":"To hit or touch lightly, in tilting."},{"definition":"To thrust ineffectually with a lance."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Corrupted or filled with imperfections.","example":"Hey, get that away from me! It was bought with tainted money."},{"definition":"(of data) Originating from an untrusted source.","example":"Do not use tainted values in SQL queries."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈteɪntɪd/"}]},{"word":"DATELINE","idx":25985,"count":1022263,"meanings":[{"definitions":[{"definition":"A line at the beginning of a document (such as a newspaper article) stating the place of origin and typically the date, and often written in capital letters."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attach a dateline to a particular document"}],"partOfSpeech":"ve"}]},{"word":"REMISSION","idx":25986,"count":1022240,"meanings":[{"definitions":[{"definition":"A pardon of a sin; the forgiveness of an offence, or relinquishment of a (legal) claim or a debt."},{"definition":"A lessening of amount due, as in either money or work, or intensity of a thing."},{"definition":"An act of remitting, returning, or sending back."},{"definition":"(spectroscopy) Reflection or scattering of light by a material; reemission."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"remission-uk","text":"/ɹɪˈmɪʃ(ə)n/"}]},{"word":"PRAXIS","idx":25987,"count":1022194,"meanings":[{"definitions":[{"definition":"The practical application of any branch of learning."},{"definition":"The deliberate action of a rational being."},{"definition":"The synthesis of theory and practice, without presuming the primacy of either."},{"definition":"Custom or established practice."},{"definition":"An example or form of exercise, or a collection of such examples, for practice."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"praxis-uk","text":"/ˈpɹæk.sɪs/"}]},{"word":"AFFIRMATION","idx":25988,"count":1022188,"meanings":[{"definitions":[{"definition":"That which is affirmed; a declaration that something is true."},{"definition":"The solemn declaration made by Quakers and others incapable of taking an oath."},{"definition":"A form of self-forced meditation or repetition; autosuggestion."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"affirmation-us","text":"/æfɝˈmeɪʃn/"}]},{"word":"PERTURBATION","idx":25990,"count":1022159,"meanings":[{"definitions":[{"definition":"Agitation; the state of being perturbed"},{"definition":"A small change in a physical system, or more broadly any definable system (such as a biological or economic system)"},{"definition":"Variation in an orbit due to the influence of external bodies"}],"partOfSpeech":"n"}]},{"word":"WANDERED","idx":25991,"count":1022080,"meanings":[{"definitions":[{"definition":"To move without purpose or specified destination; often in search of livelihood.","example":"to wander over the fields"},{"definition":"To stray; stray from one's course; err.","example":"A writer wanders from his subject."},{"definition":"To commit adultery."},{"definition":"To go somewhere indirectly or at varying speeds; to move in a curved path."},{"definition":"Of the mind, to lose focus or clarity of argument or attention."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wandered-us","text":"/ˈwɑndɚd/"},{"audio":"wandered-uk","text":"/ˈwɒndəd/"}]},{"word":"UNASSIGNED","idx":25992,"count":1021964,"meanings":[{"definitions":[{"definition":"Not assigned.","example":"the unassigned crew members"},{"definition":"Without a value assigned to it.","example":"an unassigned variable"}],"partOfSpeech":"j"}]},{"word":"REEDS","idx":25994,"count":1021880,"meanings":[{"definitions":[{"definition":"Any of various types of tall stiff perennial grass-like plants growing together in groups near water."},{"definition":"The hollow stem of these plants."},{"definition":"Part of the mouthpiece of certain woodwind instruments, comprising a thin piece of wood or metal which shakes very quickly to produce sound when a musician blows over it."},{"definition":"A musical instrument such as the clarinet or oboe, which produces sound when a musician blows on the reed."},{"definition":"A comb-like part of a beater for beating the weft when weaving."},{"definition":"A piece of whalebone or similar for stiffening the skirt or waist of a woman's dress."},{"definition":"Reeding."},{"definition":"A tube containing the train of powder for igniting the charge in blasting."},{"definition":"Straw prepared for thatching a roof."},{"definition":"A missile weapon."},{"definition":"A measuring rod."},{"definition":"The fourth stomach of a ruminant; rennet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To thatch."},{"definition":"To mill or mint with reeding."}],"partOfSpeech":"ve"}]},{"word":"GROUPINGS","idx":25996,"count":1021741,"meanings":[{"definitions":[{"definition":"A collection of things or people united as a group."},{"definition":"The action of the verb to group."},{"definition":"Shot grouping."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹuːpɪŋz/"}]},{"word":"MEMS","idx":25997,"count":1021728,"meanings":[{"definitions":[{"definition":"The thirteenth letter of many Semitic alphabets/abjads (Phoenician, Aramaic, Hebrew, Syriac, Arabic and others)."},{"definition":"A memory access as part of processing."}],"partOfSpeech":"n"}]},{"word":"ANGLER","idx":25998,"count":1021700,"meanings":[{"definitions":[{"definition":"A person who fishes with a hook and line.","example":"A throng of anglers lined the trout stream on opening day of trout season."},{"definition":"An angler fish, Lophius piscatorius.","example":"The angler lured a smaller fish into reach with the appendage on its head."},{"definition":"Someone who tries to work an angle; a person who schemes or has an ulterior motive.","example":"Jonas was a consummate angler when it came the company's leave policy; he had it figured so he only needed to work six months out of the year."},{"definition":"(thieves' cant) A thief who uses a hooked stick to steal goods out of shop-windows, grates, etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæŋ.ɡlɚ/"},{"text":"/ˈæŋ.ɡlə(ɹ)/"}]},{"word":"MIDTERM","idx":25999,"count":1021694,"meanings":[{"definitions":[{"definition":"A midterm school exam (i.e., halfway through the term)."},{"definition":"A midterm election"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Halfway through a term, or roughly so.","example":"The administration is suffering from the usual midterm drop in approval ratings."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmɪdˌtəɹm/"}]},{"word":"ASTOUNDING","idx":26000,"count":1021601,"meanings":[{"definitions":[{"definition":"To astonish, bewilder or dazzle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That astounds or astound.","example":"astounding success; an astounding spectacle"}],"partOfSpeech":"j"}]},{"word":"COSY","idx":26001,"count":1021452,"meanings":[{"definitions":[{"definition":"A padded or knit covering put on an item to keep it warm, especially a teapot or egg."},{"definition":"A padded or knit covering for any item (often an electronic device such as a laptop computer)."},{"definition":"A work of crime fiction in which sex and violence are downplayed or treated humorously, and the crime and detection take place in a small, socially intimate community."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become snug and comfortable."},{"definition":"To become friendly with.","example":"He spent all day cosying up to the new boss, hoping for a plum assignment."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Affording comfort and warmth; snug; social"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cosy-us","text":"/ˈkoʊzi/"}]},{"word":"CAMPSITE","idx":26002,"count":1021313,"meanings":[{"definitions":[{"definition":"A place where a tent may be or is pitched."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"campsite-us"}]},{"word":"DROPDOWN","idx":26003,"count":1021287,"meanings":[{"definitions":[{"definition":"An instance of a selection object that hides the contents (especially the other choices) until activated.","example":"That screen is good, but add a couple of dropdowns and it will be perfect."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a widget) Dropping down from above; being a specific type of selection control that hides its contents until activated.","example":"Click the Colours button on the toolbar to show a dropdown menu of available colours."}],"partOfSpeech":"j"}]},{"word":"MARKETER","idx":26004,"count":1021263,"meanings":[{"definitions":[{"definition":"One who designs and executes marketing campaigns."},{"definition":"One who sells goods at a market."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"marketer"}]},{"word":"RESEND","idx":26005,"count":1021151,"meanings":[{"definitions":[{"definition":"The act of sending again."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send again.","example":"I didn't get your email. You'll have to resend it."},{"definition":"To send back."},{"definition":"To forward (something received), especially a message."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːˈsɛnd/"},{"text":"/ˈɹiːsɛnd/"}]},{"word":"AUGMENT","idx":26006,"count":1020894,"meanings":[{"definitions":[{"definition":"(grammar) In some Indo-European languages, a prefix e- (a- in Sanskrit) indicating a past tense of a verb."},{"definition":"(grammar) In some Bantu languages, an additional vowel prepended to the noun prefix."},{"definition":"An increase."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To increase; to make larger or supplement.","example":"The money from renting out a spare room can augment a salary."},{"definition":"To grow; to increase; to become greater."},{"definition":"To slow the tempo or meter, e.g. for a dramatic or stately passage."},{"definition":"To increase an interval, especially the largest interval in a triad, by a half step (chromatic semitone)."},{"definition":"(grammar) To add an augment to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"augment-us","text":"/ɑɡˈmɛnt/"}]},{"word":"FLARES","idx":26007,"count":1020861,"meanings":[{"definitions":[{"definition":"A sudden bright light."},{"definition":"A source of brightly burning light or intense heat.","example":"solar flare"},{"definition":"A sudden eruption or outbreak; a flare-up."},{"definition":"A widening of an object with an otherwise roughly constant width.","example":"During assembly of a flare tube fitting, a flare nut is used to secure the flared tubing’s tapered end to the also tapered fitting, producing a pressure-resistant, leak-tight seal."},{"definition":"(in plural) Bell-bottom trousers."},{"definition":"The transition from downward flight to level flight just before landing.","example":"The captain executed the flare perfectly, and we lightly touched down."},{"definition":"A low fly ball that is hit in the region between the infielders and the outfielders.","example":"Jones hits a little flare to left that falls for a single."},{"definition":"A route run by the running back, releasing toward the sideline and then slightly arcing upfield looking for a short pass."},{"definition":"Short for lens flare."},{"definition":"Bell-bottoms, pants with flared legs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to burn."},{"definition":"To cause inflammation; to inflame."},{"definition":"To open outward in shape.","example":"The building flared from the third through the seventh floors to occupy the airspace over the entrance plaza. (intransitive)"},{"definition":"To (operate an aircraft to) transition from downward flight to level flight just before landing."},{"definition":"To blaze brightly.","example":"The blast furnace flared in the night."},{"definition":"To shine out with a sudden and unsteady light; to emit a dazzling or painfully bright light.","example":"The candle flared in a sudden draught."},{"definition":"To shine out with gaudy colours; to be offensively bright or showy."},{"definition":"To suddenly happen or intensify."},{"definition":"To suddenly erupt in anger."},{"definition":"To be exposed to too much light."}],"partOfSpeech":"ve"}]},{"word":"GELATIN","idx":26010,"count":1020629,"meanings":[{"definitions":[{"definition":"A protein derived through partial hydrolysis of the collagen extracted from animal skin, bones, cartilage, ligaments, etc."},{"definition":"An edible jelly made from this material."},{"definition":"A thin, translucent membrane used as a filter for photography or for theatrical lighting effects."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gelatin-us","text":"/ˈdʒɛlətɪn/"}]},{"word":"SHEDDING","idx":26012,"count":1020506,"meanings":[{"definitions":[{"definition":"To part, separate or divide.","example":"A metal comb shed her golden hair."},{"definition":"To part with, separate from, leave off; cast off, let fall, be divested of.","example":"When we found the snake, it was in the process of shedding its skin."},{"definition":"To pour; to make flow."},{"definition":"To allow to flow or fall.","example":"A tarpaulin sheds water."},{"definition":"To radiate, cast, give off (light); see also shed light on.","example":"Can you shed any light on this problem?"},{"definition":"To pour forth, give off, impart."},{"definition":"To fall in drops; to pour."},{"definition":"To sprinkle; to intersperse; to cover."},{"definition":"To divide, as the warp threads, so as to form a shed, or passageway, for the shuttle."},{"definition":"To place or allocate a vehicle, such as a locomotive, in or to a depot or shed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of shedding, separating, or casting off.","example":"the sheddings of blood under the Old Testament"},{"definition":"That which is shed, or cast off."}],"partOfSpeech":"n"}]},{"word":"ADENOSINE","idx":26013,"count":1020486,"meanings":[{"definitions":[{"definition":"A nucleoside derived from adenine and ribose, found in striated muscle tissue."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈdɛnəsən/"},{"text":"/əˈdɛnə(ʊ)siːn/"}]},{"word":"FUNERALS","idx":26015,"count":1020335,"meanings":[{"definitions":[{"definition":"A ceremony to honour and remember a deceased person. Often distinguished from a memorial service by the presence of the body of the deceased.","example":"Many mourners turned up at the local artist's funeral to pay homage."},{"definition":"(chiefly in the plural) A funeral sermon."}],"partOfSpeech":"n"}]},{"word":"MILLISECONDS","idx":26016,"count":1020126,"meanings":[{"definitions":[{"definition":"One one-thousandth of a second. Symbol: ms."}],"partOfSpeech":"n"}]},{"word":"SWATCH","idx":26017,"count":1020069,"meanings":[{"definitions":[{"definition":"A piece, pattern, or sample, generally of cloth or a similar material.","example":"He held a swatch of the wallpaper up to see if the colors would match the room."},{"definition":"A selection of such samples bound together."},{"definition":"A clump or portion of something."},{"definition":"A demonstration, an example, a proof."},{"definition":"A tag or other small object attached to another item as a means of identifying its owner; a tally; specifically the counterfoil of a tally."},{"definition":"A channel or passage of water between sandbanks, or between a sandbank and a seashore."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create a swatch, especially a sample of knitted fabric.","example":"Swatching is important in knitting to obtain the correct gauge."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"swatch-us","text":"/swɑtʃ/"}]},{"word":"EUCALYPTUS","idx":26018,"count":1020001,"meanings":[{"definitions":[{"definition":"Any of many trees, of genus Eucalyptus, native mainly to Australia."},{"definition":"A greenish colour, like that of a eucalyptus leaves."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌjuːkəˈlɪptəs/"}]},{"word":"REDEFINE","idx":26019,"count":1020000,"meanings":[{"definitions":[{"definition":"To define again or differently."}],"partOfSpeech":"ve"}]},{"word":"CONSERVATISM","idx":26020,"count":1019836,"meanings":[{"definitions":[{"definition":"A political philosophy that advocates traditional values."},{"definition":"A risk-averse attitude or approach."}],"partOfSpeech":"n"}]},{"word":"BACKDOOR","idx":26022,"count":1019708,"meanings":[{"definitions":[{"definition":"A subsidiary entrance to a building or house at its rear, normally away from the street."},{"definition":"A means of access, often secret and unprotected, to something."},{"definition":"A secret means of access to a program or system."},{"definition":"A rear side door of a car, or at the back of a van."},{"definition":"The anus, generally used in reference to anal sex."},{"definition":"The rear side of the hole, furthest from the golfer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attempt to accomplish by indirect means, especially when direct means are proscribed."},{"definition":"To enter a tube by accelerating from behind; to surf into an already formed hollow wave, in contrast to the normal method of slowing to allow a surfable wave to form."}],"partOfSpeech":"ve"}]},{"word":"ENVISIONED","idx":26024,"count":1019572,"meanings":[{"definitions":[{"definition":"To conceive or see something within one's mind. To imagine."}],"partOfSpeech":"ve"}]},{"word":"BUMPED","idx":26027,"count":1019181,"meanings":[{"definitions":[{"definition":"To knock against or run into with a jolt."},{"definition":"To move up or down by a step; displace.","example":"I bumped the font size up to make my document easier to read."},{"definition":"To post in an Internet forum thread in order to raise the thread's profile by returning it to the top of the list of active threads."},{"definition":"(of a superheated liquid) To suddenly boil, causing movement of the vessel and loss of liquid."},{"definition":"To move (a booked passenger) to a later flight because of earlier delays or cancellations."},{"definition":"To move the time of (a scheduled event)."},{"definition":"To pick (a lock) with a repeated striking motion that dislodges the pins."},{"definition":"To make a loud, heavy, or hollow noise; to boom."},{"definition":"To spread out material so as to fill any desired number of pages."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bʌmpt/"}]},{"word":"AUTOMATING","idx":26028,"count":1019109,"meanings":[{"definitions":[{"definition":"To replace or enhance human labor with machines.","example":"Many offices still need to automate."}],"partOfSpeech":"ve"}]},{"word":"CURSORS","idx":26030,"count":1019027,"meanings":[{"definitions":[{"definition":"A part of any of several scientific instruments that moves back and forth to indicate a position"},{"definition":"A moving icon or other representation of the position of the pointing device"},{"definition":"An indicator, often a blinking line or bar, indicating where the next insertion or other edit will take place"},{"definition":"A reference to a row of data in a table, which moves from row to row as data is retrieved by way of it"},{"definition":"A design pattern in object oriented methodology in which a collection is iterated uniformly"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To navigate by means of the cursor keys."}],"partOfSpeech":"ve"}]},{"word":"CRIPPLE","idx":26032,"count":1018899,"meanings":[{"definitions":[{"definition":"(sometimes offensive) a person who has severely impaired physical abilities because of deformation, injury, or amputation of parts of the body.","example":"He returned from war a cripple."},{"definition":"A shortened wooden stud or brace used to construct the portion of a wall above a door or above and below a window."},{"definition":"Scrapple."},{"definition":"(among lumbermen) A rocky shallow in a stream."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make someone a cripple; to cause someone to become physically impaired","example":"The car bomb crippled five passers-by."},{"definition":"To damage seriously; to destroy","example":"My ambitions were crippled by a lack of money."},{"definition":"To release a product (especially a computer program) with reduced functionality, in some cases, making the item essentially worthless.","example":"The word processor was released in a crippled demonstration version that did not allow you to save."},{"definition":"To nerf something which is overpowered"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Crippled."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cripple-uk","text":"/ˈkɹɪpl/"}]},{"word":"DIVERT","idx":26033,"count":1018673,"meanings":[{"definitions":[{"definition":"To turn aside from a course.","example":"The workers diverted the stream away from the road."},{"definition":"To distract.","example":"Don't let him divert your attention; keep your eye on the ball."},{"definition":"To entertain or amuse (by diverting the attention)"},{"definition":"To turn aside; to digress."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"divert-us","text":"/daɪˈvɝt/"}]},{"word":"LOFTY","idx":26034,"count":1018661,"meanings":[{"definitions":[{"definition":"High, tall, having great height or stature"},{"definition":"Idealistic, implying over-optimism","example":"a lofty goal"},{"definition":"Extremely proud; arrogant; haughty"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lofty-us","text":"/ˈlɔːfti/"}]},{"word":"PROCLAIM","idx":26037,"count":1018465,"meanings":[{"definitions":[{"definition":"To announce or declare."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɹoʊˈkleɪm/"}]},{"word":"KANJI","idx":26038,"count":1018304,"meanings":[{"definitions":[{"definition":"The system of writing Japanese using Chinese characters."},{"definition":"Any individual Chinese character as used in the Japanese language.","example":"I know about a thousand kanji."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkaːndʒi/"}]},{"word":"RECREATE","idx":26040,"count":1018160,"meanings":[{"definitions":[{"definition":"To give new life, energy or encouragement (to); to refresh, enliven."},{"definition":"To enjoy or entertain oneself."},{"definition":"To take recreation."},{"definition":"To create anew."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"recreate-1-uk","text":"/ˈɹɛkɹɪeɪt/"}]},{"word":"SMACKDOWN","idx":26041,"count":1018009,"meanings":[{"definitions":[{"definition":"A fight; a beating, a physical or emotional confrontation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"smackdown-uk"}]},{"word":"DROPOUT","idx":26042,"count":1018001,"meanings":[{"definitions":[{"definition":"Someone who has left an educational institution without completing the course","example":"The politicians of the world are mere political university dropouts."},{"definition":"Someone who has opted out of conventional society."},{"definition":"One who suddenly leaves anything, or the act of doing so."},{"definition":"The slot in the frame that accepts the axles of the wheels."},{"definition":"A damaged portion of a tape or disk, causing a brief omission of audio, video, or data."},{"definition":"Momentary loss of an electronic signal."},{"definition":"A technique for regularizing a neural network by discarding a random subset of its units."}],"partOfSpeech":"n"}]},{"word":"CROPPED","idx":26043,"count":1017807,"meanings":[{"definitions":[{"definition":"To remove the top end of something, especially a plant."},{"definition":"To mow, reap or gather."},{"definition":"To cut (especially hair or an animal's tail or ears) short."},{"definition":"To remove the outer parts of a photograph or other image, typically in order to frame the subject better."},{"definition":"To yield harvest."},{"definition":"To cause to bear a crop.","example":"to crop a field"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Cut very short."}],"partOfSpeech":"j"}]},{"word":"LOCKOUT","idx":26046,"count":1017679,"meanings":[{"definitions":[{"definition":"The opposite of a strike; a labor disruption where management refuses to allow workers into a plant to work even if they are willing."},{"definition":"The action of installing a lock to keep someone out of an area, such as eviction of a tenant by changing the lock."},{"definition":"(by extension) The exclusion of others from a certain place or situation.","example":"It's another front-row lockout for Mercedes on the starting grid of the Japanese Grand Prix."},{"definition":"A situation where the system is not responding to input."},{"definition":"A safety device designed to prevent touching a moving part when it is under operation."},{"definition":"The final portion of a weightlifting motion where all applicable limbs or joints are fully extended or \"locked out\"."},{"definition":"An exercise meant to increase strength in the lockout portion of a lifting motion.","example":"2016, Christian Thibaudeau, “Tip: For Bigger Triceps, Do Heavy Lockouts”, T-Nation."}],"partOfSpeech":"n"}]},{"word":"MORON","idx":26047,"count":1017416,"meanings":[{"definitions":[{"definition":"A stupid person; an idiot; a fool."},{"definition":"A person of mild mental subnormality in the former classification of mental retardation, having an intelligence quotient of 50–70."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"moron-uk","text":"/ˈmɔːɹɒn/"}]},{"word":"TOWNHOUSES","idx":26049,"count":1017273,"meanings":[{"definitions":[{"definition":"A row house."},{"definition":"A house in an urban setting."},{"definition":"Town hall."}],"partOfSpeech":"n"}]},{"word":"HORRIFIC","idx":26051,"count":1017211,"meanings":[{"definitions":[{"definition":"Horrifying, causing horror; horrible."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/hɑˈɹɪfɪk/"},{"text":"/hɒˈɹɪfɪk/"},{"text":"/hɔˈɹɘfɘk/"}]},{"word":"ERE","idx":26052,"count":1017200,"meanings":[{"definitions":[{"definition":"At an earlier time."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Before; sooner than."}],"partOfSpeech":"pr"},{"definitions":[{"definition":"Before"}],"partOfSpeech":"c"},{"definitions":[{"definition":"The organ of hearing, consisting of the pinna, auditory canal, eardrum, malleus, incus, stapes and cochlea."},{"definition":"The external part of the organ of hearing, the auricle."},{"definition":"A police informant."},{"definition":"The sense of hearing; the perception of sounds; skill or good taste in listening to music.","example":"a good ear for music"},{"definition":"The privilege of being kindly heard; favour; attention."},{"definition":"That which resembles in shape or position the ear of an animal; a prominence or projection on an object, usually for support or attachment; a lug; a handle.","example":"the ears of a tub, skillet, or dish;   The ears of a boat are outside kneepieces near the bow."},{"definition":"An acroterium."},{"definition":"A crossette."},{"definition":"The fruiting body of a grain plant.","example":"He is in the fields, harvesting ears of corn."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ere-1-uk","text":"/ɛə/"}]},{"word":"ABACUS","idx":26053,"count":1017068,"meanings":[{"definitions":[{"definition":"A table or tray scattered with sand which was used for calculating or drawing."},{"definition":"A device used for performing arithmetical calculations; a table on which loose counters are placed, or (more commonly) an instrument with beads sliding on rods, or counters in grooves, with one row of beads or counters representing units, the next tens, etc.","example":"I’ve heard merchants still use an abacus for adding things up in China."},{"definition":"The uppermost portion of the capital of a column immediately under the architrave, in some cases a flat oblong or square slab, in others more decorated."},{"definition":"A board, tray, or table, divided into perforated compartments for holding bottles, cups, or the like; a kind of buffet, cupboard, or sideboard."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"abacus-us","text":"/-ˌsaɪ/"}]},{"word":"LIFELINE","idx":26054,"count":1016950,"meanings":[{"definitions":[{"definition":"A line to which a drowning or falling victim may cling."},{"definition":"(by extension) A source of salvation in a crisis."},{"definition":"A means or route for transporting indispensable supplies."},{"definition":"System or structure of vital importance to a community."},{"definition":"On the deck of a boat, a line to which one can attach oneself to stay aboard on rough seas."},{"definition":"A line from the diver to a tender at the surface control point."},{"definition":"A particular crease in the palm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlaɪfˌlaɪn/"}]},{"word":"RICHLY","idx":26056,"count":1016923,"meanings":[{"definitions":[{"definition":"In a rich manner; full of flavor or expression."},{"definition":"Thoroughly","example":"a richly deserved comeuppance"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"richly-us","text":"/ˈɹɪt͡ʃli/"}]},{"word":"DAO","idx":26058,"count":1016773,"meanings":[{"definitions":[{"definition":"In Taoism, The Way, specifically the transcendental basis of nature and, and/or the ideal way to live one's life."}],"partOfSpeech":"pn"},{"definitions":[{"definition":"The act of moving or revolving around, or as in a circle or orbit; a revolution"},{"definition":"The circumference of, or distance around, any space; the measure of a line around an area."},{"definition":"That which encircles anything, as a ring or crown."},{"definition":"The space enclosed within a circle, or within limits."},{"definition":"Enclosed path of an electric current, usually designed for a certain function."},{"definition":"A regular or appointed trip from place to place as part of one's job"},{"definition":"The jurisdiction of certain judges within a state or country, whether itinerant or not."},{"definition":"Various administrative divisions of imperial and early Republican China, including:"},{"definition":"Methodism: The basic grouping of local Methodist churches."},{"definition":"By analogy to the proceeding three, a set of theaters among which the same acts circulate; especially common in the heyday of vaudeville."},{"definition":"A track on which a race in held; a racetrack"},{"definition":"Circumlocution"},{"definition":"A thought that unconsciously goes round and round in a person's mind and controls that person."},{"definition":"A closed path, without repeated vertices allowed"},{"definition":"A court that sits at more than one location in the district that it serves."},{"definition":"A Chinese sword with a curved, single-edged blade, primarily used for slashing and chopping"},{"definition":"Dracontomelon dao; a large tree of the family Anacardiaceae; the argus pheasant tree."},{"definition":"The hard strong wood of the dao used for veneers and cabinetwork."}],"partOfSpeech":"n"}]},{"word":"CONJUGATE","idx":26059,"count":1016714,"meanings":[{"definitions":[{"definition":"Any entity formed by joining two or more smaller entities together."},{"definition":"(of a complex number) A complex conjugate."},{"definition":"More generally, any of a set of irrational or complex numbers that are zeros of the same polynomial with integral coefficients."},{"definition":"(of an element of an extension field) Given a field extension L / K and an element α ∈ L, any other element β ∈ L that is another root of the minimal polynomial of α over K."},{"definition":"An explementary angle."},{"definition":"(grammar) A word agreeing in derivation with another word, and therefore generally resembling it in meaning."},{"definition":"A weak and a strong antigen covalently linked together"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(grammar) To inflect (a verb) for each person, in order, for one or more tenses.","example":"In English, the verb 'to be' is conjugated as follows: 'I am', 'you are', 'he/she/it is', 'we are', 'you are', 'they are'."},{"definition":"To multiply on the left by one element and on the right by its inverse."},{"definition":"To join together, unite; to juxtapose."},{"definition":"(of bacteria and algae) To temporarily fuse, exchanging or transferring DNA."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"United in pairs; yoked together; coupled."},{"definition":"In single pairs; coupled."},{"definition":"Containing two or more radicals supposed to act the part of a single one."},{"definition":"(grammar) Agreeing in derivation and radical signification; said of words."},{"definition":"Presenting themselves simultaneously and having reciprocal properties; said of quantities, points, lines, axes, curves, etc."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɒndʒəɡeɪt/"}]},{"word":"DOGMA","idx":26061,"count":1016614,"meanings":[{"definitions":[{"definition":"An authoritative principle, belief or statement of opinion, especially one considered to be absolutely true and indisputable, regardless of evidence or without evidence to support it."},{"definition":"A doctrine (or set of doctrines) relating to matters such as morality and faith, set forth authoritatively by a religious organization or leader.","example":"In the Catholic Church, new dogmas can only be declared by the pope after the extremely rare procedure ex cathedra to make them part of the official faith."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dogma-us","text":"/ˈdɑɡ.mə/"}]},{"word":"VAGUELY","idx":26063,"count":1016488,"meanings":[{"definitions":[{"definition":"In a vague manner.","example":"He looked vaguely around the room, as if lost."},{"definition":"Loosely; more or less; somewhat."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈveɪɡli/"}]},{"word":"WINCH","idx":26064,"count":1016374,"meanings":[{"definitions":[{"definition":"A machine consisting of a drum on an axle, a friction brake or ratchet and pawl, and a crank handle or prime mover (often an electric or hydraulic motor), with or without gearing, to give increased mechanical advantage when hauling on a rope or cable."},{"definition":"A hoisting machine used for loading or discharging cargo, or for hauling in lines. (FM 55-501)."},{"definition":"A wince (machine used in dyeing or steeping cloth)."},{"definition":"A kick, as of an animal, from impatience or uneasiness."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a winch","example":"Winch in those sails, lad!"},{"definition":"To wince; to shrink"},{"definition":"To kick with impatience or uneasiness."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"winch-us","text":"/wɪntʃ/"}]},{"word":"YAM","idx":26065,"count":1016356,"meanings":[{"definitions":[{"definition":"Any climbing vine of the genus Dioscorea in the Eastern and Western hemispheres, usually cultivated."},{"definition":"The edible, starchy, tuberous root of that plant, a tropical staple food."},{"definition":"A sweet potato; a tuber from the species Ipomoea batatas."},{"definition":"Potato."},{"definition":"A oca; a tuber from the species Oxalis tuberosa."},{"definition":"Taro."},{"definition":"An orange-brown colour, like the flesh of the yam."},{"definition":"(Cumberland) home"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"yam-us","text":"/jæm/"}]},{"word":"MELONS","idx":26070,"count":1015937,"meanings":[{"definitions":[{"definition":"Any of various plants of the family Cucurbitaceae grown for food, generally not including the cucumber."},{"definition":"The fruit of such plants."},{"definition":"A light pinkish orange colour, like that of some melon flesh."},{"definition":"(usually in the plural) Breasts."},{"definition":"The head."},{"definition":"A member of the Green Party, or similar environmental group."},{"definition":"A mass of adipose tissue found in the forehead of all toothed whales, used to focus and modulate vocalizations."},{"definition":"(in the plural) Breasts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"melons-au","text":"/ˈmɛlənz/"}]},{"word":"SHES","idx":26071,"count":1015890,"meanings":[{"definitions":[{"definition":"A female.","example":"Pat is definitely a she."}],"partOfSpeech":"n"}]},{"word":"SEER","idx":26073,"count":1015838,"meanings":[{"definitions":[{"definition":"One who sees something; an eyewitness."},{"definition":"One who foretells the future; a clairvoyant, prophet, soothsayer or diviner."},{"definition":"Unit of mass or volume in the Middle East and Indian subcontinent."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"seer-uk","text":"/siː.əɹ/"}]},{"word":"EVILS","idx":26074,"count":1015737,"meanings":[{"definitions":[{"definition":"Moral badness; wickedness; malevolence; the forces or behaviors that are the opposite or enemy of good.","example":"Evil lacks spirituality, hence its need for mind control."},{"definition":"Something which impairs the happiness of a being or deprives a being of any good; something which causes suffering of any kind to sentient beings; harm; injury; mischief."},{"definition":"A malady or disease; especially in the phrase king's evil (scrofula)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"evils-au","text":"/ˈiːvəlz/"}]},{"word":"SPONTANEOUSLY","idx":26075,"count":1015714,"meanings":[{"definitions":[{"definition":"In a spontaneous manner; naturally; voluntarily."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/spɑnˈteɪ.ni.əs.li/"},{"text":"/spɒnˈteɪ.ni.əs.li/"}]},{"word":"SABOTAGE","idx":26076,"count":1015607,"meanings":[{"definitions":[{"definition":"A deliberate action aimed at weakening an enemy through subversion, obstruction, disruption, and/or destruction."},{"definition":"An act or acts with intent to injure, interfere with, or obstruct the national defense of a country by willfully injuring or destroying, or attempting to injure or destroy, any national defense or war materiel, premises, or utilities, to include human and natural resources."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deliberately destroy or damage something in order to prevent it from being successful.","example":"The railway line had been sabotaged by enemy commandos."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsæbətɑʒ/"}]},{"word":"BLUEPRINTS","idx":26077,"count":1015443,"meanings":[{"definitions":[{"definition":"A type of paper-based reproduction process producing white-on-blue images, used primarily for technical and architecture's drawings, now largely replaced by other technologies."},{"definition":"A print produced with this process."},{"definition":"(by extension) A detailed technical drawing (now often in some electronically storable and transmissible form)."},{"definition":"(by extension) Any detailed plan, whether literal or figurative."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a blueprint for.","example":"The architect blueprinted the renovation plan once the client had signed off."},{"definition":"To make a detailed operational plan for.","example":"They blueprinted every aspect of the first phase of the operation."}],"partOfSpeech":"ve"}]},{"word":"LIMOS","idx":26078,"count":1015393,"meanings":[{"definitions":[{"definition":"An automobile body with seats and permanent top like a coupe, and with the top projecting over the driver and a projecting front."},{"definition":"An automobile with such a body."},{"definition":"A luxury sedan or saloon car, especially one with a lengthened wheelbase or driven by a chauffeur."},{"definition":"An automobile for transportation to or from an airport, including sedans, vans, and buses."}],"partOfSpeech":"n"}]},{"word":"UNAVOIDABLE","idx":26079,"count":1015064,"meanings":[{"definitions":[{"definition":"Something that cannot be avoided."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Impossible to avoid; bound to happen.","example":"an unavoidable urge"},{"definition":"Not voidable; incapable of being made null or void."}],"partOfSpeech":"j"}]},{"word":"SUPPRESSOR","idx":26082,"count":1014850,"meanings":[{"definitions":[{"definition":"A device which suppresses something, especially an electronic or mechanical device."},{"definition":"A person who suppresses others, a tyrant."},{"definition":"A gene that suppresses the effect of another through epistasis."}],"partOfSpeech":"n"}]},{"word":"DOGPILE","idx":26083,"count":1014839,"meanings":[{"definitions":[{"definition":"A disorderly pile of people formed by jumping upon a victim."},{"definition":"Any similarly disorderly pile of people or things."},{"definition":"A pile of dogshit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(often with 'on') To jump into a dogpile."},{"definition":"To pile on, to overwhelm in other senses."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdɑɡ ˌpaɪl/"},{"text":"/ˈdɒɡ pʌɪl/"}]},{"word":"RUTHLESS","idx":26084,"count":1014804,"meanings":[{"definitions":[{"definition":"Without pity or compassion; cruel, pitiless."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹuːθləs/"}]},{"word":"ALMONDS","idx":26085,"count":1014790,"meanings":[{"definitions":[{"definition":"A type of tree nut."},{"definition":"A small deciduous tree in family Rosaceae, Prunus dulcis, that produces predominantly sweet almonds."},{"definition":"Other plants that produce almond-like nuts:"},{"definition":"The colour of the kernel of an almond without its shell and thin seed coat, a creamy off-white colour."},{"definition":"The color of an almond still covered by its skin, a shade of brown."},{"definition":"Anything shaped like an almond; specifically, a tonsil."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæ.məndz/"},{"text":"/ˈɑː.məndz/"}]},{"word":"APTITUDE","idx":26087,"count":1014706,"meanings":[{"definitions":[{"definition":"Natural ability to acquire knowledge or skill."},{"definition":"The condition of being suitable."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæptɪˌtjuːd/"}]},{"word":"VIAL","idx":26089,"count":1014511,"meanings":[{"definitions":[{"definition":"A glass vessel or bottle, especially a small tube-shaped bottle used to store medicine, perfume or other chemical."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put or keep in, or as in, a vial."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vial-us","text":"/ˈvaɪəl/"}]},{"word":"SHARPENING","idx":26092,"count":1014460,"meanings":[{"definitions":[{"definition":"(sometimes figurative) To make sharp.","example":"to sharpen a pencil or a knife or a musical note"},{"definition":"To become sharp."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is sharpened."},{"definition":"(in the plural) The debris produced when a pencil is sharpened."}],"partOfSpeech":"n"}]},{"word":"SENIORITY","idx":26093,"count":1014348,"meanings":[{"definitions":[{"definition":"A measure of the amount of time a person has been a member of an organization, as compared to other members, and with an eye towards awarding privileges to those who have been members longer.","example":"It's an old-fashioned company, with parking spaces and other perks doled out on the basis of seniority."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sinˈjɔɹɪti/"},{"text":"/siːnɪˈɒɹɪti/"}]},{"word":"JOCKS","idx":26094,"count":1014285,"meanings":[{"definitions":[{"definition":"A common man."},{"definition":"A Scotsman."},{"definition":"The penis."},{"definition":"An athletic supporter worn by men to support the genitals especially during sports, a jockstrap."},{"definition":"A young male athlete (through college age)."},{"definition":"An enthusiastic athlete or sports fan, especially one with few other interests. A slow-witted person of large size and great physical strength. A pretty boy that shows off in sport."},{"definition":"A disc jockey."},{"definition":"(in combination) A specialist computer programmer.","example":"a compiler jock; a systems jock"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"jocks-au"}]}]