[{"word":"SAG","idx":23395,"count":1223285,"meanings":[{"definitions":[{"definition":"The state of sinking or bending; a droop."},{"definition":"The difference in elevation of a wire, cable, chain or rope suspended between two consecutive points."},{"definition":"The difference in height or depth between the vertex and the rim of a curved surface, specifically used for optical elements such as a mirror or lens."},{"definition":"An Indian dish made from greens (usually spinach) cooked down to a thick paste."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sink, in the middle, by its weight or under applied pressure, below a horizontal line or plane.","example":"A line or cable supported by its ends sags, even if it is tightly drawn."},{"definition":"(by extension) To lean, give way, or settle from a vertical position.","example":"A building may sag one way or another."},{"definition":"To lose firmness, elasticity, vigor, or a thriving state; to sink; to droop; to flag; to bend; to yield, as the mind or spirits, under the pressure of care, trouble, doubt, or the like; to be unsettled or unbalanced."},{"definition":"To loiter in walking; to idle along; to drag or droop heavily."},{"definition":"To cause to bend or give way; to load."},{"definition":"To wear one's trousers so that their top is well below the waist."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sag-1-uk","text":"/sæɡ/"}]},{"word":"BARNS","idx":23396,"count":1223270,"meanings":[{"definitions":[{"definition":"A building, often found on a farm, used for storage or keeping animals such as cattle."},{"definition":"A unit of surface area equal to 10−28 square metres."},{"definition":"An arena.","example":"Maple Leaf Gardens was a grand old barn."},{"definition":"A child."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lay up in a barn."}],"partOfSpeech":"ve"}]},{"word":"COVENANTS","idx":23397,"count":1223140,"meanings":[{"definitions":[{"definition":"An agreement to do or not do a particular thing."},{"definition":"A promise, incidental to a deed or contract, either express or implied."},{"definition":"A pact or binding agreement between two or more parties."},{"definition":"An incidental clause in an agreement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enter into, or promise something by, a covenant."},{"definition":"To enter a formal agreement."},{"definition":"To bind oneself in contract."},{"definition":"To make a stipulation."}],"partOfSpeech":"ve"}]},{"word":"PEAT","idx":23398,"count":1223084,"meanings":[{"definitions":[{"definition":"Soil formed of dead but not fully decayed plants found in bog areas, often burned as fuel."},{"definition":"A pet, a darling; a woman."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"peat-1-us","text":"/piːt/"}]},{"word":"PRIVATISATION","idx":23400,"count":1223030,"meanings":[{"definitions":[{"definition":"The transfer of a company or organization from government to private ownership and control."}],"partOfSpeech":"n"}]},{"word":"PROPRIETOR","idx":23401,"count":1222912,"meanings":[{"definitions":[{"definition":"An owner."},{"definition":"A sole owner of an unincorporated business, also called a sole proprietor."},{"definition":"One of the owners of an unincorporated business, a partner."},{"definition":"(history) One or more persons to whom a colonial territory is assigned, like a fief, including its administration.","example":"From 10 September 1621 till 12 June 1632, Sir William Alexander, styled Earl of Stirling and Viscount of Canada, was proprietor of the Scottish colony Nova Scotia."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"proprietor-us","text":"/pɹəˈpɹaɪətɚ/"}]},{"word":"TOFU","idx":23402,"count":1222741,"meanings":[{"definitions":[{"definition":"A protein-rich food made from curdled soy milk."},{"definition":"A box or rectangle, empty or with a question mark or hexadecimal code inside, displayed by some systems in place of a character not supported by available fonts. (such as □ or ժ)"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtoʊfu/"},{"text":"/ˈtəʊfuː/"}]},{"word":"RAIDS","idx":23407,"count":1222441,"meanings":[{"definitions":[{"definition":"A quick hostile or predatory incursion or invasion in a battle."},{"definition":"An attack or invasion for the purpose of making arrests, seizing property, or plundering","example":"a police raid of a narcotics factory"},{"definition":"An attacking movement."},{"definition":"An activity initiated at or towards the end of a live broadcast by the broadcaster that sends its viewers to a different broadcast, primarily intended to boost the viewership of the receiving broadcaster. This is frequently accompanied by a message in the form of a hashtag that is posted in the broadcast's chat by the viewers."},{"definition":"A large group in a massively multiplayer online game, consisting of multiple parties who team up to defeat a powerful enemy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To engage in a raid against.","example":"The police raided the gambling den."},{"definition":"To lure from another; to entice away from."},{"definition":"To indulge oneself by taking from.","example":"I raided the fridge for snacks."}],"partOfSpeech":"ve"}]},{"word":"INTUIT","idx":23408,"count":1222292,"meanings":[{"definitions":[{"definition":"To know intuitively or by immediate perception."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"intuit-us","text":"/ɪnˈtuɪt/"}]},{"word":"ADOPTIVE","idx":23409,"count":1222288,"meanings":[{"definitions":[{"definition":"Related through adoption; more generally, relating to adoption.","example":"My adoptive parents recently got to know my biological parents."}],"partOfSpeech":"j"}]},{"word":"SOLOS","idx":23411,"count":1222232,"meanings":[{"definitions":[{"definition":"A piece of music for one performer."},{"definition":"A job or performance done by one person alone."},{"definition":"(games) A card game similar to whist in which each player plays against the others in turn without a partner"},{"definition":"A single shot of espresso."},{"definition":"An instance of soloing the football."}],"partOfSpeech":"n"}]},{"word":"COMPARTMENTS","idx":23412,"count":1222206,"meanings":[{"definitions":[{"definition":"A room, or section, or chamber","example":"Two men were seated in a well-lighted compartment of a third-class railway carriage."},{"definition":"One of the parts into which an area is subdivided."},{"definition":"Part of a protein that serves a specific function."},{"definition":"A mound (often of grass) beneath the shield in a coat of arms on which the supporters stand."},{"definition":"A region in the body, delimited by a biological membrane."}],"partOfSpeech":"n"}]},{"word":"MINIMIZED","idx":23413,"count":1222201,"meanings":[{"definitions":[{"definition":"To make (something) as small or as insignificant as possible."},{"definition":"To remove (a window) from the main display area, collapsing it to an icon or caption.","example":"I didn't close anything, but I minimized all the windows so I could see the desktop."},{"definition":"To treat (someone) slightingly."}],"partOfSpeech":"ve"}]},{"word":"PARTNERED","idx":23414,"count":1221939,"meanings":[{"definitions":[{"definition":"To join as a partner."},{"definition":"(often with with) To work or perform as a partner."}],"partOfSpeech":"ve"}]},{"word":"TWAT","idx":23415,"count":1221912,"meanings":[{"definitions":[{"definition":"The vagina or vulva."},{"definition":"A contemptible and stupid person, idiot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit, slap."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"twat-uk","text":"/twæt/"}]},{"word":"FILIBUSTER","idx":23417,"count":1221836,"meanings":[{"definitions":[{"definition":"A mercenary soldier; a freebooter; specifically, a mercenary who travelled illegally in an organized group from the United States to a country in Central America or the Spanish West Indies in the mid-19th century seeking economic and political benefits through armed force."},{"definition":"(US politics) A tactic (such as giving long, often irrelevant speeches) employed to delay the proceedings of, or the making of a decision by, a legislative body, particularly the United States Senate."},{"definition":"(US politics) A member of a legislative body causing such an obstruction; a filibusterer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a private military action in a foreign country."},{"definition":"To use obstructionist tactics in a legislative body."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"filibuster-us","text":"/ˈfɪləbʌstɚ/"}]},{"word":"FACET","idx":23422,"count":1221287,"meanings":[{"definitions":[{"definition":"Any one of the flat surfaces cut into a gem.","example":"This facet of the diamond was masterfully cut to enhance its value."},{"definition":"One among many similar or related, yet still distinct things.","example":"The child's learning disability was only one facet of the problems contributing to his delinquency."},{"definition":"One of a series of things, such as steps in a project.","example":"We had just about completed the research facet of the project when the order came to cancel it."},{"definition":"One member of a compound eye, as found in insects and crustaceans."},{"definition":"A smooth circumscribed surface.","example":"the articular facet of a bone"},{"definition":"Any of the small joints at each segment of the spine that provide stability and help guide motion"},{"definition":"The narrow plane surface between flutings of a column."},{"definition":"A face of codimension 1 of a polytope."},{"definition":"A criterion that can be used to sort and filter, such as the colour or size of products in an online store."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut a facet into a gemstone."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"facet-us","text":"/ˈfæsɪt/"}]},{"word":"BEHAVIOURS","idx":23424,"count":1221081,"meanings":[{"definitions":[{"definition":"The way a living creature behaves or acts.","example":"She can't stop the strange behaviour because she has OCD (obsessive-compulsive disorder)."},{"definition":"The way a device or system operates."}],"partOfSpeech":"n"}]},{"word":"IMPORTATION","idx":23425,"count":1221062,"meanings":[{"definitions":[{"definition":"The act or an instance of importing."},{"definition":"The act or an instance of carrying or conveying, especially into some system, place, area or country."},{"definition":"That which is imported; commodities or wares introduced into a country from abroad."}],"partOfSpeech":"n"}]},{"word":"REDNECK","idx":23426,"count":1221019,"meanings":[{"definitions":[{"definition":"A poor, rural, usually white and male, person from the Southern United States or parts of the Midwest and northeast, especially one who is unsophisticated and backward; sometimes with additional connotations of being bigoted."},{"definition":"Any of the miners who wore red bandanas for identification during the West Virginia mine war of 1921."},{"definition":"A member of a certain Baltimore street gang, active in 1859."},{"definition":"(19th and 20th centuries) A Roman Catholic."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"redneck-au","text":"/ˈɹɛdnɛk/"}]},{"word":"SYNTHESIZED","idx":23429,"count":1220873,"meanings":[{"definitions":[{"definition":"To combine two or more things to produce a new product."},{"definition":"(of two or more things) To be combined producing a new, more complex product."},{"definition":"To produce a substance by chemical synthesis."},{"definition":"(of a substance) To be produced by chemical synthesis."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a substance) produced by synthesis"},{"definition":"(of music) produced by a synthesizer"}],"partOfSpeech":"j"}]},{"word":"ENCAPSULATION","idx":23430,"count":1220769,"meanings":[{"definitions":[{"definition":"The act of enclosing in a capsule; the growth of a membrane around (any part) so as to enclose it in a capsule."},{"definition":"Grouping together an object’s ‘state’ (its data) and the operations that may alter or interrogate it (its methods)."},{"definition":"The process of arranging data into packets that can be transmitted using a given protocol."}],"partOfSpeech":"n"}]},{"word":"ACCORDION","idx":23432,"count":1220579,"meanings":[{"definitions":[{"definition":"A small, portable, keyed wind instrument, whose tones are generated by play of the wind from a squeezed bellows upon free metallic reeds."},{"definition":"A vertical list of items that can be individually expanded and collapsed to reveal their contents."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fold up, in the manner of an accordion"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"accordion-us","text":"/ə.ˈkɔɹ.di.ən/"}]},{"word":"MSS","idx":23433,"count":1220495,"meanings":[{"definitions":[{"definition":"A book, composition or any other document, written by hand (or manually typewritten), not mechanically reproduced."},{"definition":"A single, original copy of a book, article, composition etc, written by hand or even printed, submitted as original for (copy-editing and) reproductive publication."}],"partOfSpeech":"n"}]},{"word":"PLANTER","idx":23434,"count":1220396,"meanings":[{"definitions":[{"definition":"One who plants something."},{"definition":"A box or pot for plants, usually large and standing on the floor."},{"definition":"Any of the early English settlers, given the lands of the dispossessed Irish populace during the reign of Elizabeth I."},{"definition":"A machine used for planting seeds."},{"definition":"The owner of a plantation."}],"partOfSpeech":"n"}]},{"word":"MINIMALLY","idx":23436,"count":1220266,"meanings":[{"definitions":[{"definition":"In a minimal way; to the least extent.","example":"minimally invasive surgery"}],"partOfSpeech":"v"}]},{"word":"MATCHUPS","idx":23441,"count":1219795,"meanings":[{"definitions":[{"definition":"A pairing of two things, people or teams, especially for a competition"}],"partOfSpeech":"n"}]},{"word":"IMMACULATE","idx":23442,"count":1219765,"meanings":[{"definitions":[{"definition":"Having no stain or blemish; spotless, undefiled, clear, clean, pure.","example":"Thou sheer, immaculate and silver fountain. — Shakespeare, Richard II, V-iii."},{"definition":"Lacking spots, blotches, or other markings; spotless; unspotted."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪˈmækjəlɪt/"}]},{"word":"PUR","idx":23444,"count":1219454,"meanings":[{"definitions":[{"definition":"The vibrating sound made by a cat in its throat when contented."},{"definition":"A throaty, seductive sound of pleasure made by a person."},{"definition":"The low consistent rumble made by an engine at slow speed"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a cat, to make a vibrating sound in its throat when contented."},{"definition":"To say (something) in a throaty, seductive manner."},{"definition":"To make a vibrating throaty sound, as from pleasure.","example":"He purred like a kitten when she massaged his neck."},{"definition":"(of an engine) To make a low and consistent rumbling sound."}],"partOfSpeech":"ve"}]},{"word":"MAILINGS","idx":23445,"count":1219364,"meanings":[{"definitions":[{"definition":"An act of sending mail."},{"definition":"A farm."}],"partOfSpeech":"n"}]},{"word":"REINDEER","idx":23446,"count":1219300,"meanings":[{"definitions":[{"definition":"(plural: reindeer) Any Arctic and subarctic-dwelling deer of the species Rangifer tarandus, with a number of subspecies."},{"definition":"(plural: reindeers) Any species, subspecies, ecotype, or other scientific grouping of such animals."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"reindeer-us","text":"/ˈɹeɪndɪɹ/"}]},{"word":"ONO","idx":23447,"count":1219081,"meanings":[{"definitions":[{"definition":"Good-tasting, delicious."}],"partOfSpeech":"j"}]},{"word":"BEACHFRONT","idx":23448,"count":1219052,"meanings":[{"definitions":[{"definition":"The portion of land or property that runs alongside and facing a beach."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of property (real estate): located on a beach."}],"partOfSpeech":"j"}]},{"word":"TELEGRAM","idx":23449,"count":1219049,"meanings":[{"definitions":[{"definition":"A message transmitted by telegraph."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send a telegram."},{"definition":"To send a telegram to (a person)."},{"definition":"To send (a message) in a telegram."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"telegram-us"},{"text":"/ˈtɛləˌɡɹæm/"}]},{"word":"SHAKEN","idx":23452,"count":1218549,"meanings":[{"definitions":[{"definition":"To cause (something) to move rapidly in opposite directions alternatingly.","example":"He shook the can of soda for thirty seconds before delivering it to me, so that, when I popped it open, soda went everywhere."},{"definition":"To move (one's head) from side to side, especially to indicate refusal, reluctance or disapproval.","example":"Shaking his head, he kept repeating \"No, no, no\"."},{"definition":"To move or remove by agitating; to throw off by a jolting or vibrating motion.","example":"to shake fruit down from a tree"},{"definition":"To disturb emotionally; to shock.","example":"He was shaken by what had happened."},{"definition":"To lose, evade, or get rid of (something).","example":"I can't shake the feeling that I forgot something."},{"definition":"To move from side to side.","example":"She shook with grief."},{"definition":"(usually as \"shake on\") To shake hands.","example":"OK, let's shake on it."},{"definition":"To dance.","example":"She was shaking it on the dance floor."},{"definition":"To give a tremulous tone to; to trill.","example":"to shake a note in music"},{"definition":"To threaten to overthrow.","example":"The experience shook my religious belief."},{"definition":"To be agitated; to lose firmness."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In a state of shock or trauma.","example":"We were left shaken by the revelations of abuse."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shaken-us","text":"/ˈʃeɪkən/"}]},{"word":"CROSSWORDS","idx":23453,"count":1218510,"meanings":[{"definitions":[{"definition":"(games, puzzles) A word puzzle in which interlocking words are entered usually horizontally and vertically into a grid based on clues given for each word."}],"partOfSpeech":"n"}]},{"word":"WARES","idx":23454,"count":1218442,"meanings":[{"definitions":[{"definition":"(usually in combination) Goods or a type of goods offered for sale or use."},{"definition":"(in the plural) See wares."},{"definition":"Pottery or metal goods.","example":"damascene ware, tole ware"},{"definition":"A style or genre of artifact."},{"definition":"Crockery."},{"definition":"Goods or services that are for sale.","example":"The square was filled with booths, with vendors offering their wares."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wares-us","text":"/wɛɹz/"}]},{"word":"INTEGRATIVE","idx":23456,"count":1218387,"meanings":[{"definitions":[{"definition":"Tending toward or promoting integration","example":"an integrative approach"}],"partOfSpeech":"j"}]},{"word":"RIVALRY","idx":23457,"count":1218286,"meanings":[{"definitions":[{"definition":"An ongoing relationship between (usually two) rivals who compete for superiority.","example":"James and Polly have a bitter rivalry due to the latter's inclusion in the Tea Time Teaser."},{"definition":"The characteristic of being a rivalrous good, such that it can be consumed or used by only one person at a time.","example":"Common goods are those which are rivalrous in consumption but non-excludable"},{"definition":"Any competition between two or more things or factors.","example":"Binocular rivalry is a visual phenomenon in which perception alternates between different images presented to each eye."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rivalry-us","text":"/ˈɹaɪ.vəl.ɹi/"}]},{"word":"VERVE","idx":23459,"count":1218256,"meanings":[{"definitions":[{"definition":"Excitement of imagination such as that which animates a poet, artist, or musician, in composing or performing"},{"definition":"Artistic energy and enthusiasm"},{"definition":"Vigour, vitality and liveliness"},{"definition":"Rapture, enthusiasm"},{"definition":"Spirit, energy"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"verve-us","text":"/vɜː(r)v/"}]},{"word":"CARPENTERS","idx":23461,"count":1218145,"meanings":[{"definitions":[{"definition":"A person skilled at carpentry, the trade of cutting and joining timber in order to construct buildings or other structures."},{"definition":"A senior rating in ships responsible for all the woodwork onboard; in the days of sail, a warrant officer responsible for the hull, masts, spars and boats of a ship, and whose responsibility was to sound the well to see if the ship was making water."},{"definition":"A two-wheeled carriage."},{"definition":"A carpenter bee."},{"definition":"A woodlouse."}],"partOfSpeech":"n"}]},{"word":"SPREE","idx":23462,"count":1218040,"meanings":[{"definitions":[{"definition":"A merry frolic; especially, a drinking frolic."},{"definition":"Uninhibited activity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To engage in a spree."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/spɹiː/"}]},{"word":"EMBED","idx":23463,"count":1217930,"meanings":[{"definitions":[{"definition":"An embedded reporter or journalist, such as a war reporter assigned to and travelling with a military unit, or a political reporter assigned to follow and report on the campaign of a candidate."},{"definition":"An element of an advertisement, etc. serving as a subliminal message."},{"definition":"An item embedded in another document."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lay as in a bed; to lay in surrounding matter; to bed.","example":"to embed something in clay, mortar, or sand"},{"definition":"(by extension) To include in surrounding matter.","example":"We wanted to embed our reporter with the Fifth Infantry Division, but the Army would have none of it."},{"definition":"To encapsulate within another document or data file.","example":"The instructions showed how to embed a chart from the spreadsheet within the wordprocessor document."},{"definition":"To define a one-to-one function from (one set) to another so that certain properties of the domain are preserved when considering the image as a subset of the codomain."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"embed-us","text":"/əmˈbɛd/"}]},{"word":"GURUS","idx":23464,"count":1217822,"meanings":[{"definitions":[{"definition":"A Hindu or Sikh spiritual teacher."},{"definition":"(sometimes humorous) An influential advisor or mentor."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡuːˈɹuːz/"},{"text":"/ˈɡuː.ɹuːz/"}]},{"word":"SUNK","idx":23465,"count":1217793,"meanings":[{"definitions":[{"definition":"(heading, physical) To move or be moved into something."},{"definition":"(heading, social) To diminish or be diminished."},{"definition":"To conceal and appropriate."},{"definition":"To keep out of sight; to suppress; to ignore."},{"definition":"To pay absolutely.","example":"I have sunk thousands of pounds into this project."},{"definition":"To reduce or extinguish by payment.","example":"to sink the national debt"},{"definition":"To be overwhelmed or depressed; to fail in strength."},{"definition":"To decrease in volume, as a river; to subside; to become diminished in volume or in apparent height."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sunk-us","text":"/sʌŋk/"}]},{"word":"BESPOKE","idx":23467,"count":1217478,"meanings":[{"definitions":[{"definition":"To speak about; tell of; relate; discuss."},{"definition":"To speak for beforehand; engage in advance; make arrangements for; order or reserve in advance."},{"definition":"To stipulate, solicit, ask for, or request, as in a favour.","example":"to bespeak a calm hearing;  I bespeak your patience in advance."},{"definition":"To forbode; foretell."},{"definition":"To speak to; address."},{"definition":"To betoken; show; indicate; foretell; suggest; allude to.","example":"This act bespeaks his kindness."},{"definition":"To speak up or out; exclaim; speak."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Individually or custom made."},{"definition":"Relating to someone who makes custom-made products, especially clothing items.","example":"a bespoke tailor"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/bəˈspoʊk/"},{"text":"/bɪˈspəʊk/"}]},{"word":"INFLICTED","idx":23468,"count":1217476,"meanings":[{"definitions":[{"definition":"To thrust upon; to impose.","example":"They inflicted terrible pains on her to obtain a confession."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"inflicted-us","text":"/ɪnˈflɪktɪd/"}]},{"word":"ABBREVIATED","idx":23469,"count":1217434,"meanings":[{"definitions":[{"definition":"To shorten by omitting parts or details."},{"definition":"To speak or write in a brief manner."},{"definition":"To make shorter; to shorten (in time); to abridge; to shorten by ending sooner than planned."},{"definition":"To reduce a word or phrase by means of contraction or omission to a shorter recognizable form."},{"definition":"To reduce to lower terms, as a fraction."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Shortened; made briefer.","example":"The abbreviated lesson only took fifteen minutes as opposed to an hour and a half."},{"definition":"Relatively short; shorter than normal, or compared to others."},{"definition":"Scanty, as in clothing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈbɹi.viˌeɪ.tɪd/"},{"text":"/əˈbɹiːvieɪtɪd/"}]},{"word":"ALLOTTED","idx":23470,"count":1217411,"meanings":[{"definitions":[{"definition":"To distribute or apportion by (or as if by) lot."},{"definition":"To assign or designate as a task or for a purpose."}],"partOfSpeech":"ve"}]},{"word":"DROWNED","idx":23472,"count":1217295,"meanings":[{"definitions":[{"definition":"To die from suffocation while immersed in water or other fluid."},{"definition":"To kill by suffocating in water or another liquid."},{"definition":"To be flooded: to be inundated with or submerged in (literally) water or (figuratively) other things; to be overwhelmed."},{"definition":"To inundate, submerge, overwhelm."},{"definition":"(usually passive) To obscure, particularly amid an overwhelming volume of other items.","example":"The answers intelligence services seek are often drowned in the flood of information they can now gather."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has died by drowning.","example":"a drowned rat"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɹaʊnd/"}]},{"word":"ESCORTED","idx":23474,"count":1217210,"meanings":[{"definitions":[{"definition":"To attend to in order to guard and protect; to accompany as a safeguard (for the person escorted or for others); to give honorable or ceremonious attendance to"},{"definition":"To accompany (a person) in order to compel them to go somewhere (e.g. to leave a building).","example":"2018, TST-00493-18 (Re), Ontario Landlord and Tenant Board (Anna Solomon, member)"},{"definition":"To go with someone as a partner, for example on a formal date."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"With or having an escort."}],"partOfSpeech":"j"}]},{"word":"WATERSHEDS","idx":23475,"count":1217085,"meanings":[{"definitions":[{"definition":"The topographical boundary dividing two adjacent catchment basins, such as a ridge or a crest."},{"definition":"A region of land within which water flows down into a specified body, such as a river, lake, sea, or ocean; a drainage basin."},{"definition":"A critical point marking a change in course or development."},{"definition":"The time after which material of more adult nature (violence, swear words, sex) may be broadcast on television or radio, either one laid down or one contrived (e.g. when children are not watching)"}],"partOfSpeech":"n"}]},{"word":"BRUTE","idx":23476,"count":1216912,"meanings":[{"definitions":[{"definition":"An animal seen as being without human reason; a senseless beast."},{"definition":"A person with the characteristics of an unthinking animal; a coarse or brutal person.","example":"One of them was a hulking brute of a man, heavily tattooed and with a hardened face that practically screamed \"I just got out of jail.\""},{"definition":"(Cambridge University slang) One who has not yet matriculated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shape (diamonds) by grinding them against each other."},{"definition":"To disseminate, promulgate, or spread news, a rumour, etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Without reason or intelligence (of animals).","example":"a brute beast"},{"definition":"Characteristic of unthinking animals; senseless, unreasoning (of humans)."},{"definition":"Being unconnected with intelligence or thought; purely material, senseless.","example":"the brute earth; the brute powers of nature"},{"definition":"Crude, unpolished."},{"definition":"Strong, blunt, and spontaneous.","example":"I punched him with brute force."},{"definition":"Brutal; cruel; fierce; ferocious; savage; pitiless.","example":"brute violence"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"brute-us","text":"/bɹut/"},{"audio":"brute-uk","text":"/bɹuːt/"}]},{"word":"TRIMESTER","idx":23477,"count":1216502,"meanings":[{"definitions":[{"definition":"A period of three months or about three months; quarter.","example":"She is in the second trimester of her first pregnancy."},{"definition":"One of the terms of an academic year in those learning institutions that divide their teaching in three roughly equal terms, each about three months long. Compare semester.","example":"The school operates on a trimester schedule."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"trimester-us","text":"/tɹaɪˈmɛs.təɹ/"}]},{"word":"BARRACKS","idx":23478,"count":1216474,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) A building for soldiers, especially within a garrison; originally referred to temporary huts, now usually to a permanent structure or set of buildings."},{"definition":"(chiefly in the plural) primitive structure resembling a long shed or barn for (usually temporary) housing or other purposes"},{"definition":"(chiefly in the plural) any very plain, monotonous, or ugly large building"},{"definition":"A movable roof sliding on four posts, to cover hay, straw, etc."},{"definition":"(usually in the plural) A police station."},{"definition":"A group of buildings used by military personnel as housing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To house military personnel; to quarter."},{"definition":"To live in barracks."},{"definition":"To jeer and heckle; to attempt to disconcert by verbal means."},{"definition":"To cheer for or support a team."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"barracks-us","text":"/ˈbæɹəks/"}]},{"word":"CLICKABLE","idx":23479,"count":1216458,"meanings":[{"definitions":[{"definition":"Any element that can be clicked by the user."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(entertainment) That establishes rapport with an audience."},{"definition":"(of a rigid plastic foam) That retains its shape after being cut by a blade or punched by a die."},{"definition":"Causing some action to occur when clicked with a mouse or other pointing device.","example":"Putting a clickable link in your post is easy."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"clickable-uk"}]},{"word":"KIDNEYS","idx":23480,"count":1216443,"meanings":[{"definitions":[{"definition":"An organ in the body that filters the blood, producing urine."},{"definition":"This organ (of an animal) cooked as food."},{"definition":"Constitution, temperament, nature, type, character, disposition. (usually used of people)"},{"definition":"A waiter."}],"partOfSpeech":"n"}]},{"word":"ELECTRICIANS","idx":23482,"count":1216354,"meanings":[{"definitions":[{"definition":"A tradesman who installs, repairs and maintains electrical wiring and equipment."},{"definition":"A scientist who studies electricity."}],"partOfSpeech":"n"}]},{"word":"WARBLER","idx":23483,"count":1216351,"meanings":[{"definitions":[{"definition":"Any of various small passerine songbirds, especially of the family Sylviidae (Old World warblers) and Parulidae (New World warblers)."},{"definition":"One who warbles."},{"definition":"A hissy fit."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"warbler-au","text":"/ˈwɔː(ɹ)blə(ɹ)/"}]},{"word":"ONWARD","idx":23485,"count":1216039,"meanings":[{"definitions":[{"definition":"To keep going; to progress or persevere."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Moving forward.","example":"There was an onward rush as the gates opened."},{"definition":"Advanced in a forward direction or toward an end."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a forward direction."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈɔnwɚd/"},{"text":"/ˈɒnwəd/"}]},{"word":"KIDNAPPING","idx":23487,"count":1216019,"meanings":[{"definitions":[{"definition":"To seize and detain a person unlawfully; sometimes for ransom."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The crime of taking a person against their will, sometimes for ransom."}],"partOfSpeech":"n"}]},{"word":"INDUCING","idx":23488,"count":1215951,"meanings":[{"definitions":[{"definition":"To lead by persuasion or influence; incite or prevail upon."},{"definition":"To cause, bring about, lead to.","example":"His meditation induced a compromise.   Opium induces sleep."},{"definition":"To cause or produce (electric current or a magnetic state) by a physical process of induction."},{"definition":"To infer by induction."},{"definition":"To lead in, bring in, introduce."},{"definition":"To draw on, place upon."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That induces; inductive"}],"partOfSpeech":"j"}]},{"word":"DIPPED","idx":23489,"count":1215912,"meanings":[{"definitions":[{"definition":"To lower into a liquid.","example":"Dip your biscuit into your tea."},{"definition":"To immerse oneself; to become plunged in a liquid; to sink."},{"definition":"(of a value or rate) To decrease slightly."},{"definition":"To lower a light's beam.","example":"Dip your lights as you meet an oncoming car."},{"definition":"To lower (a flag), particularly a national ensign, to a partially hoisted position in order to render or to return a salute. While lowered, the flag is said to be “at the dip.” A flag being carried on a staff may be dipped by leaning it forward at an approximate angle of 45 degrees.","example":"“The sailor rushed to the flag hoist to dip the flag in return.”"},{"definition":"To treat cattle or sheep by immersion in chemical solution.","example":"The farmer is going to dip the cattle today."},{"definition":"To use a dip stick to check oil level in an engine."},{"definition":"To consume snuff by placing a pinch behind the lip or under the tongue so that the active chemical constituents of the snuff may be absorbed into the system for their narcotic effect."},{"definition":"To immerse for baptism."},{"definition":"To wet, as if by immersing; to moisten."},{"definition":"To plunge or engage thoroughly in any affair."},{"definition":"To take out, by dipping a dipper, ladle, or other receptacle, into a fluid and removing a part; often with out.","example":"to dip water from a boiler; to dip out water"},{"definition":"To perform the action of plunging a dipper, ladle. etc. into a liquid or soft substance and removing a part."},{"definition":"To engage as a pledge; to mortgage."},{"definition":"To perform (a bow or curtsey) by inclining the body."},{"definition":"To incline downward from the plane of the horizon.","example":"Strata of rock dip."},{"definition":"To perform a dip dance move (often phrased with the leader as the subject noun and the follower as the subject noun being dipped)"},{"definition":"To lower the body by bending the knees while keeping the body in an upright position, as in movement to the rhythm of music."},{"definition":"To leave.","example":"He dipped out of the room so fast."},{"definition":"To miss out on seeing a sought after bird."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been briefly immersed in a liquid."},{"definition":"Of headlights: lowered."},{"definition":"Caught up in debt; mortgaged."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪpt/"}]},{"word":"LANCET","idx":23490,"count":1215888,"meanings":[{"definitions":[{"definition":"A sharp, pointed, two-edged surgical instrument used in venesection and for opening abscesses etc."},{"definition":"A small, sterile single-use needle used to draw a drop of blood for testing, as with a glucometer."},{"definition":"An iron bar used for tapping a melting furnace."},{"definition":"A high narrow window, terminating in an arch acutely pointed, often double or triple, common in the first half of the 13th century."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pierce with a lancet."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/lɑːn.sɪt/"},{"text":"/læn.sɪt/"}]},{"word":"ANTELOPE","idx":23491,"count":1215883,"meanings":[{"definitions":[{"definition":"Any of several African mammals of the family Bovidae distinguished by hollow horns, which, unlike deer, they do not shed."},{"definition":"The pronghorn, Antilocapra americana."},{"definition":"A fierce legendary creature said to live on the banks of the Euphrates, having long serrated horns and being hard to catch."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæn.tə.loʊp/"},{"text":"/ˈæn.tɪ.ləʊp/"}]},{"word":"TERMINUS","idx":23492,"count":1215859,"meanings":[{"definitions":[{"definition":"The end or final point of something."},{"definition":"The end point of a transportation system, or the town or city in which it is located."},{"definition":"A boundary or border, or a post or stone marking such a boundary."}],"partOfSpeech":"n"}]},{"word":"CASTINGS","idx":23493,"count":1215845,"meanings":[{"definitions":[{"definition":"The act or process of selecting actors, singers, dancers, models, etc."},{"definition":"A manufacturing process using a mold."},{"definition":"An object made in a mold."},{"definition":"The regurgitation of fur, feathers, and other undigestible material by hawks, to clean and empty their crops."},{"definition":"The excreta of an earthworm or similar creature."},{"definition":"The act of converting between data types."}],"partOfSpeech":"n"}]},{"word":"PERM","idx":23495,"count":1215568,"meanings":[{"definitions":[{"definition":"A permanent."},{"definition":"A permanent wave."},{"definition":"A permutation."},{"definition":"A combination of outcomes (not a permutation) that a gambler bets on in the football pools."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give hair a perm, using heat, chemicals etc."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɝm/"},{"text":"/pɜːm/"}]},{"word":"SNIPPET","idx":23498,"count":1215241,"meanings":[{"definitions":[{"definition":"A small part of something, such as a song or fabric; sample.","example":"From the snippet I heard of their rehearsal, they sound pretty good."},{"definition":"A text file containing a relatively small amount of code, useless by itself, along with instructions for inserting that code into a larger codebase."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce a snippet (small part) of; to excerpt.","example":"We snippeted the blog posts for display on the home page."},{"definition":"To make small cuts, to snip, particularly with scissors."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"snippet-us","text":"/ˈsnɪpɪt/"}]},{"word":"PELLETS","idx":23499,"count":1215032,"meanings":[{"definitions":[{"definition":"A small, compressed, hard chunk of matter.","example":"a pellet of wood, paper, or ore"},{"definition":"A lead projectile used as ammunition in rifled air guns."},{"definition":"Compressed byproduct of digestion regurgitated by owls. Serves as a waste disposal mechanism for indigestible parts of food, such as fur and bones."},{"definition":"A roundel sable (black circular spot; also called ogress)."},{"definition":"One of the short conductive tubes in a Pelletron particle accelerator."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into pellets."},{"definition":"To strike with pellets."}],"partOfSpeech":"ve"}]},{"word":"PERMEABILITY","idx":23501,"count":1214520,"meanings":[{"definitions":[{"definition":"The property of being permeable"},{"definition":"The rate of flow of a fluid through a porous material"},{"definition":"A measure of the ability of a rock to transmit fluids (such as oil or water)"},{"definition":"A quantitative measure of the degree of magnetization of a material in the presence of an applied magnetic field (measured in newtons per ampere squared in SI units)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌpɝmi.əˈbɪlɪti/"},{"text":"/ˌpɜːmi.əˈbɪlɪti/"}]},{"word":"ENCLOSING","idx":23502,"count":1214363,"meanings":[{"definitions":[{"definition":"To surround with a wall, fence, etc.","example":"to enclose lands"},{"definition":"To insert into a container, usually an envelope or package","example":"Please enclose a stamped self-addressed envelope if you require a reply."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That which encloses."},{"definition":"The act or situation by which something is enclosed."}],"partOfSpeech":"n"}]},{"word":"STARRED","idx":23503,"count":1214232,"meanings":[{"definitions":[{"definition":"To appear as a featured performer or headliner, especially in an entertainment program."},{"definition":"To feature (a performer or a headliner), especially in a movie or an entertainment program."},{"definition":"To mark with a star or asterisk."},{"definition":"To set or adorn with stars, or bright, radiating bodies; to bespangle."},{"definition":"To shine like a star."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a star or stars.","example":"a Michelin-starred restaurant"}],"partOfSpeech":"j"}]},{"word":"DEACON","idx":23505,"count":1214127,"meanings":[{"definitions":[{"definition":"(Church history) A designated minister of charity in the early Church (see Acts 6:1-6)."},{"definition":"(Orthodoxy and Roman Catholicism) A clergyman ranked directly below a priest, with duties of helping the priests and carrying out parish work."},{"definition":"Free Churches: A lay leader of a congregation who assists the pastor."},{"definition":"Anglicanism: An ordained clergyman usually serving a year prior to being ordained presbyter, though in some cases they remain a permanent deacon."},{"definition":"Methodism: A separate office from that of minister, neither leading to the other; instead there is a permanent deaconate."},{"definition":"A junior lodge officer."},{"definition":"The lowest office in the Aaronic priesthood, generally held by 12 or 13 year old boys or recent converts."},{"definition":"(animal husbandry) A male calf of a dairy breed, so called because they are usually deaconed (see below)."},{"definition":"The chairman of an incorporated company."}],"partOfSpeech":"n"},{"definitions":[{"definition":"For a choir leader to lead a hymn by speaking one or two lines at a time, which are then sung by the choir."},{"definition":"(animal husbandry) To kill a calf shortly after birth."},{"definition":"To place fresh fruit at the top of a barrel or other container, with spoiled or imperfect fruit hidden beneath."},{"definition":"To make sly alterations to the boundaries of (land); to adulterate or doctor (an article to be sold), etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"deacon-au","text":"/ˈdiːkən/"}]},{"word":"SWEEPS","idx":23507,"count":1213879,"meanings":[{"definitions":[{"definition":"A single action of sweeping.","example":"Give the front steps a quick sweep to get rid of those fallen leaves."},{"definition":"The person who steers a dragon boat."},{"definition":"A person who stands at the stern of a surf boat, steering with a steering oar and commanding the crew."},{"definition":"A chimney sweep."},{"definition":"A methodical search, typically for bugs (electronic listening devices)."},{"definition":"A batsman's shot, played from a kneeling position with a swinging horizontal bat.","example":"Bradman attempted a sweep, but in fact top edged the ball to the wicket keeper"},{"definition":"A lottery, usually on the results of a sporting event, where players win if their randomly chosen team wins.","example":"Jim will win fifty dollars in the office sweep if Japan wins the World Cup."},{"definition":"A flow of water parallel to shore caused by wave action at an ocean beach or at a point or headland."},{"definition":"A throw or takedown that primarily uses the legs to attack an opponent's legs."},{"definition":"Violent and general destruction.","example":"the sweep of an epidemic disease"},{"definition":"A movable templet for making moulds, in loam moulding."},{"definition":"In the game casino, the act of capturing all face-up cards from the table."},{"definition":"The compass of any turning body or of any motion.","example":"the sweep of a door; the sweep of the eye"},{"definition":"Direction or departure of a curve, a road, an arch, etc. away from a rectilinear line."},{"definition":"A large oar used in small vessels, partly to propel them and partly to steer them."},{"definition":"A rowing style in which each rower rows with oar on either the port or starboard side.","example":"I am primarily a sweep rower."},{"definition":"(refining) The almond furnace."},{"definition":"A long pole, or piece of timber, moved on a horizontal fulcrum fixed to a tall post and used to raise and lower a bucket in a well for drawing water."},{"definition":"Any of the blades of a windmill."},{"definition":"(in the plural) The sweepings of workshops where precious metals are worked, containing filings, etc."},{"definition":"Any of several sea chub in the kyphosid subfamily Scorpidinae."},{"definition":"An expanse or a swath, a strip of land."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clean (a surface) by means of a stroking motion of a broom or brush.","example":"to sweep a floor, the street, or a chimney"},{"definition":"To move through a (horizontal) arc or similar long stroke.","example":"The offended countess swept out of the ballroom."},{"definition":"To search (a place) methodically."},{"definition":"To travel quickly."},{"definition":"To play a sweep shot."},{"definition":"To brush the ice in front of a moving stone, causing it to travel farther and to curl less."},{"definition":"To move something in a long sweeping motion, as a broom."},{"definition":"To win (a series) without drawing or losing any of the games in that series."},{"definition":"To defeat (a team) in a series without drawing or losing any of the games in that series."},{"definition":"To remove something abruptly and thoroughly.","example":"She swept the peelings off the table onto the floor."},{"definition":"To brush against or over; to rub lightly along.","example":"Their long descending train, / With rubies edg'd and sapphires, swept the plain."},{"definition":"To carry with a long, swinging, or dragging motion; hence, to carry in a stately or proud fashion."},{"definition":"To strike with a long stroke."},{"definition":"To row with one oar to either the port or starboard side."},{"definition":"To draw or drag something over.","example":"to sweep the bottom of a river with a net"},{"definition":"To pass over, or traverse, with the eye or with an instrument of observation.","example":"to sweep the heavens with a telescope"},{"definition":"(including) to vacuum a carpet or rug"}],"partOfSpeech":"ve"}]},{"word":"BUTCH","idx":23508,"count":1213820,"meanings":[{"definitions":[{"definition":"A lesbian who appears masculine or acts in a masculine manner."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(originally Polari) Very masculine, with a masculine appearance or attitude."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"butch-au","text":"/bʊtʃ/"}]},{"word":"SCART","idx":23510,"count":1213599,"meanings":[{"definitions":[{"definition":"A slight wound."},{"definition":"A dash or stroke."},{"definition":"A niggard."},{"definition":"A poor-looking creature; a wretch."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To scratch or scrape."}],"partOfSpeech":"ve"}]},{"word":"NORMALIZATION","idx":23513,"count":1213382,"meanings":[{"definitions":[{"definition":"Any process that makes something more normal or regular, which typically means conforming to some regularity or rule, or returning from some state of abnormality."},{"definition":"Standardization, act of imposing standards or norms or rules or regulations."},{"definition":"In relational database design, a process that breaks down data into record groups for efficient processing, by eliminating redundancy."},{"definition":"Process of establishing normal diplomatic relations between two countries"},{"definition":"Globalization, the process of making a worldwide normal and dominant model of production and consumption"},{"definition":"(operations) Making a normalized production."},{"definition":"Sharing or enforcement of standard policies"},{"definition":"A process whereby artificial and unwanted norms of behaviour and models of behaviour are made to seem natural and wanted, through propaganda, influence, imitation and conformity."},{"definition":"The process of removing statistical error in repeated measured data."}],"partOfSpeech":"n"}]},{"word":"SKILLET","idx":23514,"count":1212990,"meanings":[{"definitions":[{"definition":"A pan for frying, generally large and heavy.","example":"Heat some oil in a cast-iron skillet and add the onions."},{"definition":"(sometimes attributive) A dish or meal cooked in such a pan.","example":"Can you make up a quick skillet hash?"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook in a skillet."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈskɪlɪt/"}]},{"word":"BOOKCASE","idx":23515,"count":1212892,"meanings":[{"definitions":[{"definition":"A piece of furniture for the storage and display of books."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[ˈbʊkːeɪs]"}]},{"word":"NEOPRENE","idx":23516,"count":1212726,"meanings":[{"definitions":[{"definition":"A synthetic rubber, a polymer of chloroprene, commonly used in wetsuits, laptop sleeves, orthopedic braces, electrical insulation, liquid and sheet-applied elastomeric membranes and flashings, car fan belts, etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈniɵpɹin/"}]},{"word":"ASSEMBLING","idx":23519,"count":1212486,"meanings":[{"definitions":[{"definition":"To put together.","example":"He assembled the model ship."},{"definition":"To gather as a group.","example":"The parents assembled in the school hall."},{"definition":"To translate from assembly language to machine code"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A gathering or assembly."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"assembling-us"}]},{"word":"DIAPHRAGM","idx":23521,"count":1212110,"meanings":[{"definitions":[{"definition":"In mammals, a sheet of muscle separating the thorax from the abdomen, contracted and relaxed in respiration to draw air into and expel air from the lungs; also called thoracic diaphragm."},{"definition":"Any of various membranes or sheets of muscle or ligament which separate one cavity from another."},{"definition":"A contraceptive device consisting of a flexible cup, used to cover the cervix during intercourse."},{"definition":"A flexible membrane separating two chambers and fixed around its periphery that distends into one or other chamber as the difference in the pressure in the chambers varies."},{"definition":"(acoustics) In a speaker, the thin, semi-rigid membrane which vibrates to produce sound."},{"definition":"A thin opaque structure with a central aperture, used to limit the passage of light into a camera or similar device."},{"definition":"A permeable or semipermeable membrane."},{"definition":"A floor slab, metal wall panel, roof panel or the like, having a sufficiently large in-plane shear stiffness and sufficient strength to transmit horizontal forces to resisting systems."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reduce lens aperture using an optical diaphragm."},{"definition":"To act as a diaphragm, for example by vibrating."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdaɪəˌfɹæm/"}]},{"word":"CHORES","idx":23524,"count":1211813,"meanings":[{"definitions":[{"definition":"A task, especially a difficult, unpleasant, or routine one.","example":"Washing dishes is a chore, but we cannot just stop eating."},{"definition":"A choir or chorus."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To do chores."},{"definition":"To steal."}],"partOfSpeech":"ve"}]},{"word":"CONSIGNMENT","idx":23526,"count":1211676,"meanings":[{"definitions":[{"definition":"A collection of goods to be sent, in transit or having been sent"},{"definition":"The act of consigning"}],"partOfSpeech":"n"}]},{"word":"YARNS","idx":23527,"count":1211638,"meanings":[{"definitions":[{"definition":"A twisted strand of fiber used for knitting or weaving."},{"definition":"Bundles of fibers twisted together, and which in turn are twisted in bundles to form strands, which in their turn are twisted or plaited to form rope."},{"definition":"A story, a tale, especially one that is incredible."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tell a story or stories."}],"partOfSpeech":"ve"}]},{"word":"MAINTAINERS","idx":23529,"count":1211328,"meanings":[{"definitions":[{"definition":"Someone who keeps or upholds something; a steward.","example":"He become the maintainer of the software project."},{"definition":"A person who does maintenance work."},{"definition":"A device used to keep teeth in a given position."}],"partOfSpeech":"n"}]},{"word":"GINSENG","idx":23532,"count":1211113,"meanings":[{"definitions":[{"definition":"Any plant of two species of the genus Panax (Panax ginseng and Panax quinquefolius), having forked roots supposed to have medicinal properties."},{"definition":"The root of such a plant, or an extract of these roots."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʒɪnsɛŋ/"}]},{"word":"BLACKOUT","idx":23533,"count":1211055,"meanings":[{"definitions":[{"definition":"A temporary loss of consciousness."},{"definition":"A temporary loss of memory."},{"definition":"An instance of censorship, especially a temporary one.","example":"media blackout"},{"definition":"A large-scale power failure, and resulting loss of electricity to consumers.","example":"\"The repairs at the Koeberg Power Station in the Western Cape were on schedule for completion in the third week of May. This follows huge blackouts related to the problems at the power supplier since November. Weekend Argus May 13/14 2006 p.5."},{"definition":"The mandatory blocking of all light emanating from buildings as imposed during World War II."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈblækaʊt/"}]},{"word":"DETERGENT","idx":23534,"count":1211009,"meanings":[{"definitions":[{"definition":"That cleanses.","example":"Apply the cleansing cream to your skin."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Any non-soap cleaning agent, especially a synthetic surfactant."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈtɜːdʒənt/"}]},{"word":"SEEDLINGS","idx":23535,"count":1210993,"meanings":[{"definitions":[{"definition":"A young plant grown from seed."},{"definition":"Any young plant, especially:"}],"partOfSpeech":"n"}]},{"word":"FORTIFIED","idx":23537,"count":1210684,"meanings":[{"definitions":[{"definition":"A fortified wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To increase the defenses of; to strengthen and secure by military works; to render defensible against an attack by hostile forces."},{"definition":"To impart strength or vigor to."},{"definition":"To add spirits to wine to increase the alcohol content.","example":"Sherry is made by fortifying wine."},{"definition":"To increase the nutritional value of food by adding ingredients.","example":"Soy milk is often fortified with calcium."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fortified-us","text":"/ˈfɔɹtɪfaɪd/"}]},{"word":"RECONSIDERATION","idx":23538,"count":1210658,"meanings":[{"definitions":[{"definition":"The act of reconsidering or something reconsidered"}],"partOfSpeech":"n"}]},{"word":"GRENADE","idx":23540,"count":1210206,"meanings":[{"definitions":[{"definition":"A small explosive device, designed to be thrown by hand or launched from a grenade launcher."},{"definition":"A pomegranate."},{"definition":"A charge similar to a fireball, and made of a disc-shaped bomb shell, but with only one set of flames at the top."},{"definition":"An unattractive girl."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use grenade(s) upon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"grenade-us","text":"/ɡɹəˈneɪd/"}]},{"word":"PROFOUNDLY","idx":23542,"count":1209930,"meanings":[{"definitions":[{"definition":"(manner) With depth, meaningfully.","example":"He thought and wrote profoundly."},{"definition":"(evaluative) Very importantly.","example":"More profoundly, it has shaken our most fundamental assumptions."},{"definition":"(degree) Deeply; very; strongly or forcefully.","example":"From his childhood, she was profoundly troubled."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"profoundly-us","text":"/pɹəˈfaʊndli/"}]},{"word":"BARTENDER","idx":23546,"count":1209797,"meanings":[{"definitions":[{"definition":"One who tends a bar or pub; a person preparing and serving drinks at a bar."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɑɹˌtɛndɚ/"},{"text":"/ˈbɑːˌtɛndə(ɹ)/"}]},{"word":"JAG","idx":23548,"count":1209711,"meanings":[{"definitions":[{"definition":"A sharp projection."},{"definition":"A part broken off; a fragment."},{"definition":"A cleft or division."},{"definition":"A medical injection, a jab."},{"definition":"Enough liquor to make a person noticeably drunk; a skinful."},{"definition":"A binge or period of overindulgence; a spree."},{"definition":"A fit, spell, outburst."},{"definition":"A one-horse cart load, or, in modern times, a truck load, of hay or wood."},{"definition":"A leather bag or wallet; (in the plural) saddlebags."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut unevenly."},{"definition":"To tease."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jag-uk","text":"/d͡ʒæɡ/"}]},{"word":"MANEUVER","idx":23549,"count":1209634,"meanings":[{"definitions":[{"definition":"The planned movement of troops, vehicles etc.; a strategic repositioning; (later also) a large training field-exercise of fighting units.","example":"Joint NATO maneuvers are as much an exercise in diplomacy as in tactics and logistics."},{"definition":"Any strategic or cunning action; a stratagem."},{"definition":"A movement of the body, or with an implement, instrument etc., especially one performed with skill or dexterity."},{"definition":"A specific medical or surgical movement, often eponymous, done with the doctor's hands or surgical instruments."},{"definition":"A controlled (especially skilful) movement taken while steering a vehicle.","example":"Parallel parking can be a difficult maneuver."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move (something, or oneself) carefully, and often with difficulty, into a certain position."},{"definition":"To guide, steer, manage purposefully"},{"definition":"To intrigue, manipulate, plot, scheme","example":"The patriarch maneuvered till his offspring occupied countless key posts"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"maneuver-us","text":"/məˈnuːvɚ/"},{"audio":"maneuver-uk","text":"/məˈnuːvə/"}]},{"word":"VANISHED","idx":23552,"count":1209355,"meanings":[{"definitions":[{"definition":"To become invisible or to move out of view unnoticed."},{"definition":"To become equal to zero.","example":"The function f(x)=x^2 vanishes at x=0."},{"definition":"To disappear; to kidnap"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vanished-us","text":"/ˈvænɪʃt/"}]},{"word":"CRAFTING","idx":23553,"count":1209082,"meanings":[{"definitions":[{"definition":"To make by hand and with much skill."},{"definition":"To construct, develop something (like a skilled craftsman).","example":"state crafting; the process of crafting global policing"},{"definition":"To combine multiple items to form a new item, such as armour or medicine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is crafted."}],"partOfSpeech":"n"}]},{"word":"LAIR","idx":23554,"count":1209040,"meanings":[{"definitions":[{"definition":"A place inhabited by a wild animal, often a cave or a hole in the ground."},{"definition":"A shed or shelter for domestic animals."},{"definition":"A place inhabited by a criminal or criminals, a superhero or a supervillain; a refuge, retreat, haven or hideaway."},{"definition":"A bed or resting place."},{"definition":"A grave; a cemetery plot."},{"definition":"A bog; a mire."},{"definition":"A person who dresses in a showy but tasteless manner and behaves in a vulgar and conceited way; a show-off."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rest; to dwell."},{"definition":"To lay down."},{"definition":"To bury."},{"definition":"To mire."},{"definition":"To become mired."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lair-uk","text":"/lɛə/"}]},{"word":"ENCLOSE","idx":23555,"count":1209007,"meanings":[{"definitions":[{"definition":"To surround with a wall, fence, etc.","example":"to enclose lands"},{"definition":"To insert into a container, usually an envelope or package","example":"Please enclose a stamped self-addressed envelope if you require a reply."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪnˈkloʊz/"},{"text":"/ɪnˈkləʊz/"},{"text":"/ənˈkloʊz/"}]},{"word":"MOWERS","idx":23557,"count":1208690,"meanings":[{"definitions":[{"definition":"A lawnmower, a machine used to cut grass."},{"definition":"A person who cuts grass."}],"partOfSpeech":"n"}]},{"word":"SINNERS","idx":23559,"count":1208415,"meanings":[{"definitions":[{"definition":"A person who sins or has sinned."},{"definition":"A person who sins or has sinned by the action or identity indicated or previously mentioned"},{"definition":"An unregenerate person."},{"definition":"(figuratively, by extension) A person with negative qualities; one who does bad things.","example":"Are you a sinner or a saint?"}],"partOfSpeech":"n"}]},{"word":"POLICYMAKERS","idx":23560,"count":1208400,"meanings":[{"definitions":[{"definition":"One involved in the formulation of policies, especially politicians, lobbyists, and activists."}],"partOfSpeech":"n"}]},{"word":"SIENNA","idx":23562,"count":1208342,"meanings":[{"definitions":[{"definition":"A form of clay containing iron and manganese."},{"definition":"A pigment with a reddish-brown colour."},{"definition":"A light reddish-brown colour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a reddish-brown colour."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/siˈɛnə/"}]},{"word":"CALVES","idx":23564,"count":1208012,"meanings":[{"definitions":[{"definition":"A young cow or bull."},{"definition":"Leather made of the skin of the calf; especially, a fine, light-coloured leather used in bookbinding."},{"definition":"A young deer, elephant, seal, whale or giraffe (also used of some other animals)."},{"definition":"A chunk of ice broken from a larger glacier, ice shelf, or iceberg."},{"definition":"A small island, near a larger island.","example":"the Calf of Man"},{"definition":"A cabless railroad engine."},{"definition":"An awkward or silly boy or young man; any silly person; a dolt."},{"definition":"The back of the leg below the knee."},{"definition":"The muscle in the back of the leg below the knee."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give birth to a calf"},{"definition":"To assist in a cow's giving birth to a calf"},{"definition":"To give birth to (a calf)"},{"definition":"(especially of an ice shelf, a glacier, an ice sheet, or even an iceberg) to shed a large piece, e.g. an iceberg or a smaller block of ice (coming off an iceberg)","example":"The glacier was starting to calve even as we watched."},{"definition":"(especially of an iceberg) to break off","example":"The sea was dangerous because of icebergs calving off the nearby glacier."},{"definition":"(especially of an ice shelf, a glacier, an ice sheet, or even an iceberg) to shed (a large piece, e.g. an iceberg); to set loose (a mass of ice), e.g. a block of ice (coming off an iceberg)","example":"The glacier was starting to calve an iceberg even as we watched."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kævz/"},{"text":"/kɑːvz/"}]},{"word":"DEFER","idx":23566,"count":1207925,"meanings":[{"definitions":[{"definition":"To delay or postpone","example":"We're going to defer the decision until we have all the facts."},{"definition":"After winning the opening coin toss, to postpone until the start of the second half a team's choice of whether to kick off or receive (and to allow the opposing team to make this choice at the start of the first half)."},{"definition":"To delay, to wait."},{"definition":"To submit to the opinion or desire of another in respect to their judgment or authority."},{"definition":"To render, to offer."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"defer-uk","text":"/dɪˈfɜː(ɹ)/"}]},{"word":"LIARS","idx":23569,"count":1207786,"meanings":[{"definitions":[{"definition":"One who tells lies."},{"definition":"A swabber responsible for cleaning the outside parts of the ship rather than the cabins, a role traditionally assigned to a person caught telling a lie the previous week."}],"partOfSpeech":"n"}]},{"word":"ELS","idx":23570,"count":1207650,"meanings":[{"definitions":[{"definition":"The name of the Latin-script letter L."},{"definition":"An elevated railway, especially for specific systems such as the metro in Chicago."},{"definition":"The"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(used only with indefinite or interrogative pronouns) Other; in addition to previously mentioned items.","example":"The instructor is busy. Can anyone else help me?"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"els-1-uk","text":"/ˈɛlz/"}]},{"word":"SOD","idx":23571,"count":1207500,"meanings":[{"definitions":[{"definition":"That stratum of the surface of the soil which is filled with the roots of grass, or any portion of that surface; turf; sward."},{"definition":"Turf grown and cut specifically for the establishment of lawns.","example":"The landscapers rolled sod onto the bare earth and made a presentable lawn by nightfall."},{"definition":"Sodomite; bugger."},{"definition":"(mildly pejorative, formerly considered vulgar) A person, usually male; often qualified with an adjective.","example":"You mean old sod!"},{"definition":"Any trifling amount, a bugger, a damn, a jot.","example":"I don’t care a sod."},{"definition":"A damper (bread) which has failed to rise, remaining a flat lump."},{"definition":"The rock dove."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover with sod.","example":"He sodded the worn areas twice a year."},{"definition":"Bugger; sodomize."},{"definition":"Damn, curse, confound.","example":"Sod him!, Sod it!, Sod that bastard!"},{"definition":"To boil."},{"definition":"(of a liquid) To boil vigorously."},{"definition":"(of a liquid) To foam in an agitated manner, as if boiling."},{"definition":"(of a person) To be in an agitated or angry mental state, as if boiling."},{"definition":"(of a place) To buzz with activity."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Expression of surprise, contempt, outrage, disgust, boredom, frustration."}],"partOfSpeech":"i"},{"definitions":[{"definition":"Boiled."},{"definition":"(of bread) Sodden; incompletely risen.","example":"sod damper"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sod-us","text":"/sɒd/"},{"audio":"sod-au","text":"/sɒd/"}]},{"word":"LACY","idx":23572,"count":1207457,"meanings":[{"definitions":[{"definition":"Made of lace or decorated with it.","example":"lacy lingerie"},{"definition":"Looking like lace."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lacy-us"},{"text":"/ˈleɪ.si/"}]},{"word":"PHARAOH","idx":23573,"count":1207358,"meanings":[{"definitions":[{"definition":"The supreme ruler of Ancient Egypt; a formal address for the sovereign seat of power as personified by the 'king' in an institutional role of Horus son of Osiris; often used by metonymy for Ancient Egyptian sovereignty"},{"definition":"The card game faro."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfæɹoʊ/"},{"text":"/ˈfɛəɹəʊ/"}]},{"word":"ADVOCATED","idx":23574,"count":1207217,"meanings":[{"definitions":[{"definition":"To plead in favour of; to defend by argument, before a tribunal or the public; to support, vindicate, or recommend publicly."},{"definition":"To encourage support for something.","example":"I like trees, but I do not advocate living in them."},{"definition":"(with for) To engage in advocacy.","example":"We have been advocating for changes in immigration law."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been argued in favor of."}],"partOfSpeech":"j"}]},{"word":"ITCHING","idx":23575,"count":1206981,"meanings":[{"definitions":[{"definition":"To feel itchy; to feel a need to be scratched."},{"definition":"To have a constant, teasing urge; to feel strongly motivated; to want or desire something.","example":"He started learning to drive and he has been itching for opportunities to practice ever since."},{"definition":"To cause to feel an itch."},{"definition":"To scratch or rub so as to relieve an itch."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A sensation that itches."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪtʃɪŋ/"}]},{"word":"REIMBURSE","idx":23577,"count":1206798,"meanings":[{"definitions":[{"definition":"To compensate with payment; especially, to repay money spent on one's behalf.","example":"The company will reimburse you for your expenses for the business trip."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"reimburse-us"}]},{"word":"DEVOTIONAL","idx":23578,"count":1206612,"meanings":[{"definitions":[{"definition":"A brief religious service.","example":"To prepare for leading a devotional, select a theme appropriate to the occasion."},{"definition":"A textor piece of music or writing to be used for devotion.","example":"Each page of the book offers a short devotional that inspires thought and self-reflection."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually religious) Of or pertaining to devotion or worship.","example":"She spent much time playing devotional music."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈvoʊʃənəl/"},{"text":"/dɪˈvəʊʃənəl/"}]},{"word":"MODALITIES","idx":23581,"count":1206215,"meanings":[{"definitions":[{"definition":"The fact of being modal."},{"definition":"The classification of propositions on the basis on whether they claim possibility, impossibility, contingency or necessity; mode."},{"definition":"The inflection of a verb that shows how its action is conceived by the speaker; mood"},{"definition":"A method of diagnosis or therapy."},{"definition":"Any of the senses (such as sight or taste)"},{"definition":"A particular way in which the information is to be encoded for presentation to humans, i.e. to the type of sign and to the status of reality ascribed to or claimed by a sign, text or genre."},{"definition":"The organization and structure of the church, as distinct from sodality or parachurch organizations."},{"definition":"The subject concerning certain diatonic scales known as musical modes."},{"definition":"The way in which infrastructure and knowledge of how to use it give rise to a meaningful pattern of interaction (a concept in Anthony Giddens' structuration theory)."},{"definition":"The quality of being limited by a condition."}],"partOfSpeech":"n"}]},{"word":"LIGHTERS","idx":23583,"count":1206079,"meanings":[{"definitions":[{"definition":"One who, or that which, lights.","example":"a lighter of lamps"},{"definition":"A small, reusable handheld device for creating fire, especially for lighting cigarettes.","example":"Cigarette in mouth, he clutched his pockets in search of a lighter."},{"definition":"A flat-bottomed boat for carrying heavy loads across short distances (especially for canals or for loading or unloading larger boats)."}],"partOfSpeech":"n"}]},{"word":"COMPARATIVELY","idx":23584,"count":1205974,"meanings":[{"definitions":[{"definition":"In a comparative manner."},{"definition":"When compared to other entities"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"comparatively-us","text":"/kəmˈpæɹ.ə.tɪvli/"}]},{"word":"SHUTTING","idx":23585,"count":1205847,"meanings":[{"definitions":[{"definition":"To close, to stop from being open.","example":"Please shut the door."},{"definition":"To close, to stop being open.","example":"If you wait too long, the automatic door will shut."},{"definition":"To close a business temporarily, or (of a business) to be closed.","example":"The pharmacy is shut on Sunday."},{"definition":"To confine in an enclosed area.","example":"I shut the cat in the kitchen before going out."},{"definition":"To catch or snag in the act of shutting something.","example":"He's just shut his finger in the door."},{"definition":"To preclude; to exclude; to bar out."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is shut.","example":"openings and shuttings of doors"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʃʌtɪŋ/"}]},{"word":"ENDEMIC","idx":23587,"count":1205766,"meanings":[{"definitions":[{"definition":"An individual or species that is endemic to a region."},{"definition":"A disease affecting a number of people simultaneously, so as to show a distinct connection with certain localities."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Native to a particular area or culture; originating where it occurs.","example":"The endemic religion of Easter Island arrived with the Polynesian settlers."},{"definition":"(especially of plants and animals) Peculiar to a particular area or region; not found in other places.","example":"Kangaroos are endemic to Australia."},{"definition":"(especially of diseases) Prevalent in a particular area or region.","example":"Malaria is endemic to the tropics."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"endemic-us","text":"/ɛnˈdɛm.ɪk/"}]},{"word":"TOURNEY","idx":23588,"count":1205705,"meanings":[{"definitions":[{"definition":"Tournament."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a tournament."}],"partOfSpeech":"ve"}]},{"word":"REASONED","idx":23589,"count":1205666,"meanings":[{"definitions":[{"definition":"To deduce or come to a conclusion by being rational"},{"definition":"To perform a process of deduction or of induction, in order to convince or to confute; to argue."},{"definition":"To converse; to compare opinions."},{"definition":"To arrange and present the reasons for or against; to examine or discuss by arguments; to debate or discuss.","example":"I reasoned the matter with my friend."},{"definition":"To support with reasons, as a request."},{"definition":"To persuade by reasoning or argument.","example":"to reason one into a belief; to reason one out of his plan"},{"definition":"(with down) To overcome or conquer by adducing reasons.","example":"to reason down a passion"},{"definition":"(usually with out) To find by logical process; to explain or justify by reason or argument.","example":"to reason out the causes of the librations of the moon"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Based on reasoning; being the result of logical thought"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"reasoned-us"}]},{"word":"SAITH","idx":23596,"count":1205270,"meanings":[{"definitions":[{"definition":"To pronounce.","example":"Please say your name slowly and clearly."},{"definition":"To recite.","example":"Martha, will you say the Pledge of Allegiance?"},{"definition":"To tell, either verbally or in writing.","example":"He said he would be here tomorrow."},{"definition":"To indicate in a written form.","example":"The sign says it’s 50 kilometres to Paris."},{"definition":"To have a common expression; used in singular passive voice or plural active voice to indicate a rumor or well-known fact.","example":"They say \"when in Rome, do as the Romans do\", which means \"behave as those around you do.\""},{"definition":"Suppose, assume; used to mark an example, supposition or hypothesis.","example":"A holiday somewhere warm – Florida, say – would be nice."},{"definition":"To speak; to express an opinion; to make answer; to reply."},{"definition":"(of a possession, especially money) To bet as a wager on an outcome; by extension, used to express belief in an outcome by the speaker."},{"definition":"To try; to assay."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The pollock or coalfish or coley (Pollachius virens)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈseɪ.əθ/"}]},{"word":"ASTRAL","idx":23597,"count":1205159,"meanings":[{"definitions":[{"definition":"Relating to or resembling the stars; starry."},{"definition":"Relating to an aster.","example":"astral rays"},{"definition":"(theosophy) Relating to a supposed supersensible substance taking the form of an aura discernible by certain gifted individuals."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"astral-us","text":"/ˈæstɹəl/"}]},{"word":"ACH","idx":23599,"count":1205052,"meanings":[{"definitions":[{"definition":"Any of several species of plants, such as smallage, wild celery, parsley."}],"partOfSpeech":"n"}]},{"word":"PARALLELS","idx":23601,"count":1204896,"meanings":[{"definitions":[{"definition":"One of a set of parallel lines."},{"definition":"Direction conformable to that of another line."},{"definition":"A line of latitude.","example":"The 31st parallel passes through the center of my town."},{"definition":"An arrangement of electrical components such that a current flows along two or more paths; see in parallel."},{"definition":"Something identical or similar in essential respects."},{"definition":"A comparison made; elaborate tracing of similarity.","example":"Johnson's parallel between Dryden and Pope"},{"definition":"One of a series of long trenches constructed before a besieged fortress, by the besieging force, as a cover for troops supporting the attacking batteries. They are roughly parallel to the line of outer defenses of the fortress."},{"definition":"A character consisting of two parallel vertical lines, used in the text to direct attention to a similarly marked note in the margin or at the foot of a page."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To construct or place something parallel to something else."},{"definition":"Of a path etc: To be parallel to something else."},{"definition":"Of a process etc: To be analogous to something else."},{"definition":"To compare or liken something to something else."},{"definition":"To make to conform to something else in character, motive, aim, etc."},{"definition":"To equal; to match; to correspond to."},{"definition":"To produce or adduce as a parallel."}],"partOfSpeech":"ve"}]},{"word":"YELLED","idx":23603,"count":1204763,"meanings":[{"definitions":[{"definition":"Shout; holler; make a loud sound with the voice."},{"definition":"To convey by shouting","example":"He yelled directions to the party from the car."},{"definition":"To tell someone off (in a loud and angry manner)","example":"If I come home late again, my dad is gonna yell at me."}],"partOfSpeech":"ve"}]},{"word":"WREN","idx":23605,"count":1204605,"meanings":[{"definitions":[{"definition":"Any member of a mainly New World passerine bird family Troglodytidae; true wren."},{"definition":"Small bird of similar appearance to a true wren."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wren-us","text":"/ɹɛn/"}]},{"word":"AIT","idx":23608,"count":1204086,"meanings":[{"definitions":[{"definition":"An island in a river, especially the River Thames in England."},{"definition":"An oat."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/eɪt/"}]},{"word":"HAMPER","idx":23610,"count":1203919,"meanings":[{"definitions":[{"definition":"A large basket, usually with a cover, used for the packing and carrying of articles or small animals","example":"a clothes hamper"},{"definition":"(uncommon except in) A wicker or plastic basket specifically for holding laundry (from clothes hamper), as opposed to a covered wicker basket which is a true hamper"},{"definition":"A shackle; a fetter; anything which impedes."},{"definition":"Articles ordinarily indispensable, but in the way at certain times."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put into a hamper.","example":"Competition pigeons are hampered for the truck trip to the point of release where the race back starts."},{"definition":"To put a hamper or fetter on; to shackle"},{"definition":"To impede in motion or progress."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhæmpɚ/"},{"audio":"hamper-uk"}]},{"word":"BLURRED","idx":23614,"count":1203526,"meanings":[{"definitions":[{"definition":"To make indistinct or hazy, to obscure or dim.","example":"to blur a photograph by moving the camera while taking it"},{"definition":"To smear, stain or smudge.","example":"to blur a manuscript by handling it while damp"},{"definition":"To become indistinct."},{"definition":"To cause imperfection of vision in; to dim; to darken."},{"definition":"To sully; to stain; to blemish, as reputation."},{"definition":"To transfer the input focus away from."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Out of focus; partially obscured; smudged."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/blɝd/"},{"text":"/blɜːd/"}]},{"word":"CLARIFYING","idx":23615,"count":1203505,"meanings":[{"definitions":[{"definition":"(of liquids, such as wine or syrup) To make clear or bright by freeing from feculent matter"},{"definition":"To make clear or easily understood; to explain in order to remove doubt or obscurity"},{"definition":"To grow or become clear or transparent; to become free from feculent impurities, as wine or other liquid under clarification.","example":"Leave the wine for 24 hours and it will clarify."},{"definition":"To grow clear or bright; to clear up."},{"definition":"To glorify."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A clarification."}],"partOfSpeech":"n"}]},{"word":"AORTIC","idx":23616,"count":1203393,"meanings":[{"definitions":[{"definition":"Of or pertaining to the aorta or the aortic valve."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/eˈoɹ.tɪk/"}]},{"word":"SMUGGLING","idx":23618,"count":1203317,"meanings":[{"definitions":[{"definition":"To import or export, illicitly or by stealth, without paying lawful customs charges or duties"},{"definition":"To bring in surreptitiously"},{"definition":"To fondle or cuddle."},{"definition":"To thrash or be thrashed by a bear's claws, or to swipe at or be swiped at by a person's arms in a bearlike manner."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of something being smuggled."}],"partOfSpeech":"n"}]},{"word":"MARTENS","idx":23621,"count":1202872,"meanings":[{"definitions":[{"definition":"Any carnivorous mammal of the genus Martes in the family Mustelidae."},{"definition":"Any of various passerine birds of the family Hirundinidae, which also includes swallows, that catch insects whilst flying."},{"definition":"A perforated stone-faced runner for grinding."}],"partOfSpeech":"n"}]},{"word":"INSTINCTS","idx":23622,"count":1202792,"meanings":[{"definitions":[{"definition":"A natural or inherent impulse or behaviour.","example":"Many animals fear fire by instinct."},{"definition":"An intuitive reaction not based on rational conscious thought.","example":"Debbie's instinct was to distrust John."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"instincts-us","text":"/ˈɪn.stɪŋkts/"}]},{"word":"MASQUERADE","idx":23625,"count":1202457,"meanings":[{"definitions":[{"definition":"An assembly or party of people wearing (usually elaborate or fanciful) masks and costumes, and amusing themselves with dancing, conversation, or other diversions.","example":"I was invited to the masquerade party at their home."},{"definition":"The act of wearing a mask or dressing up in a costume for, or as if for, a masquerade ball."},{"definition":"An act of living under false pretenses; a concealment of something by a false or unreal show; a disguise, a pretence; also, a pretentious display."},{"definition":"An assembly of varied, often fanciful, things."},{"definition":"A cosplay event at which costumed attendees perform skits."},{"definition":"A dramatic performance by actors in masks; a mask or masque."},{"definition":"A Spanish entertainment or military exercise in which squadrons of horses charge at each other, the riders fighting with bucklers and canes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a masquerade; to assemble in masks and costumes; to wear a disguise.","example":"I’m going to masquerade as the wikipede. What are you going to dress up as?"},{"definition":"To pass off as a different person or a person with qualities that one does not possess; also, to make a pretentious show of being what one is not.","example":"He masqueraded as my friend until the truth finally came out."},{"definition":"To conceal (someone) with, or as if with, a mask; to disguise."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"masquerade-us","text":"/ˈmæskəˌɹeɪd/"},{"audio":"masquerade-uk","text":"/ˈmæskəˌɹeɪd/"}]},{"word":"DEANS","idx":23626,"count":1202452,"meanings":[{"definitions":[{"definition":"A senior official in a college or university, who may be in charge of a division or faculty (for example, the dean of science) or have some other advisory or disciplinary function (for example, the dean of students)."},{"definition":"A dignitary or presiding officer in certain church bodies, especially an ecclesiastical dignitary, subordinate to a bishop, in charge of a chapter of canons."},{"definition":"The senior member of some group of people."},{"definition":"(chiefly in place names) A hill."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To serve as a dean."},{"definition":"To send (a student) to see the dean of a university."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/diːnz/"}]},{"word":"STRUCTURING","idx":23627,"count":1202302,"meanings":[{"definitions":[{"definition":"To give structure to; to arrange.","example":"I'm trying to structure my time better so I'm not always late."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Structure; organization"}],"partOfSpeech":"n"}]},{"word":"DUALITY","idx":23629,"count":1202153,"meanings":[{"definitions":[{"definition":"A classification into two subclasses or opposed parts."},{"definition":"(projective geometry) The interchangeability of points and planes."},{"definition":"The mathematical equivalence of two seemingly different theoretical descriptions of a physical system."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/d(j)uːˈælɪti/"}]},{"word":"SENSATIONAL","idx":23630,"count":1202129,"meanings":[{"definitions":[{"definition":"Of or pertaining to sensation.","example":"sensational nerves"},{"definition":"Piquing or arousing the senses."},{"definition":"Provocative."},{"definition":"Exceptionally great."}],"partOfSpeech":"j"}]},{"word":"LIPIDS","idx":23632,"count":1202098,"meanings":[{"definitions":[{"definition":"Any of a group of organic compounds including the fats, oils, waxes, sterols, and triglycerides. Lipids are characterized by being insoluble in water, and account for most of the fat present in the human body."}],"partOfSpeech":"n"}]},{"word":"JURISDICTIONAL","idx":23633,"count":1201956,"meanings":[{"definitions":[{"definition":"Of or pertaining to jurisdiction."}],"partOfSpeech":"j"}]},{"word":"SMOOTHER","idx":23634,"count":1201781,"meanings":[{"definitions":[{"definition":"Having a texture that lacks friction. Not rough."},{"definition":"Without difficulty, problems, or unexpected consequences or incidents.","example":"We hope for a smooth transition to the new system."},{"definition":"Bland; glib."},{"definition":"Flowing or uttered without check, obstruction, or hesitation; not harsh; fluent."},{"definition":"(of a person) Suave; sophisticated."},{"definition":"(of an action) Natural; unconstrained."},{"definition":"(of a motion) Unbroken."},{"definition":"(chiefly of water) Placid, calm."},{"definition":"(of an edge) Lacking projections or indentations; not serrated."},{"definition":"(of food or drink) Not grainy; having an even texture."},{"definition":"(of a beverage) Having a pleasantly rounded flavor; neither rough nor astringent."},{"definition":"(of a function) Having derivatives of all finite orders at all points within the function’s domain."},{"definition":"(of a number) That factors completely into small prime numbers."},{"definition":"(of a vowel) Lacking marked aspiration."},{"definition":"(of muscles) Involuntary and non-striated."}],"partOfSpeech":"j"},{"definitions":[{"definition":"One who, or that which, smooths."},{"definition":"In glass-cutting, an abrading-wheel for polishing the aces of the grooves cut by another wheel."},{"definition":"A flatterer."}],"partOfSpeech":"n"}]},{"word":"DESI","idx":23635,"count":1201653,"meanings":[{"definitions":[{"definition":"A member of the South Asian diaspora."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the culture, people, or products of India; Indian."}],"partOfSpeech":"j"}]},{"word":"CELLPHONES","idx":23636,"count":1201610,"meanings":[{"definitions":[{"definition":"A portable, wireless telephone, which changes antenna connections seamlessly during travel from one radio reception cell to another without losing the party-to-party call connection."}],"partOfSpeech":"n"}]},{"word":"EXPULSION","idx":23637,"count":1201583,"meanings":[{"definitions":[{"definition":"The act of expelling or the state of being expelled.","example":"The scandal involved every member of the high school's football team, resulting in a flurry of expulsions, starting with the quarterback."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪkˈspʌlʃən/"}]},{"word":"CORDOBA","idx":23638,"count":1201447,"meanings":[{"definitions":[{"definition":"The currency of Nicaragua, divided into 100 centavos."}],"partOfSpeech":"n"}]},{"word":"WITHHOLD","idx":23640,"count":1201289,"meanings":[{"definitions":[{"definition":"To keep (a physical object that one has obtained) to oneself rather than giving it back to its owner."},{"definition":"To keep (information, assent etc) to oneself rather than revealing it."},{"definition":"To stay back."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"withhold-us","text":"/wɪðˈhoʊld/"}]},{"word":"ROMANO","idx":23641,"count":1201287,"meanings":[{"definitions":[{"definition":"A hard, sharp cheese served grated as a garnish"}],"partOfSpeech":"n"}]},{"word":"GRIEVANCES","idx":23643,"count":1200994,"meanings":[{"definitions":[{"definition":"Something which causes grief."},{"definition":"A wrong or hardship suffered, which is the grounds of a complaint."},{"definition":"Feelings of being wronged; outrage."},{"definition":"A complaint or annoyance."},{"definition":"A formal complaint, especially in the context of a unionized workplace.","example":"If you want the problem fixed, you'll have to file a grievance with the city."},{"definition":"Violation of regulations or objectionable behavior."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"grievances-us","text":"/ˈɡɹiː.vən.sɪz/"}]},{"word":"BETRAYED","idx":23644,"count":1200949,"meanings":[{"definitions":[{"definition":"To deliver into the hands of an enemy by treachery or fraud, in violation of trust; to give up treacherously or faithlessly.","example":"an officer betrayed the city"},{"definition":"To prove faithless or treacherous to, as to a trust or one who trusts; to be false to; to deceive.","example":"My eyes have been betraying me since I turned sixty."},{"definition":"To violate the confidence of, by disclosing a secret, or that which one is bound in honor not to make known."},{"definition":"To disclose or indicate, for example something which prudence would conceal; to reveal unintentionally.","example":"Though he had lived in England for many years, a faint accent betrayed his Swedish origin."},{"definition":"To mislead; to expose to inconvenience not foreseen; to lead into error or sin."},{"definition":"To lead astray; to seduce (as under promise of marriage) and then abandon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"betrayed-us","text":"/bɪˈtɹeɪd/"}]},{"word":"TRIGGERING","idx":23647,"count":1200514,"meanings":[{"definitions":[{"definition":"To fire a weapon."},{"definition":"To initiate something.","example":"The controversial article triggered a deluge of angry letters from readers."},{"definition":"To spark a response, especially a negative emotional response, in (someone).","example":"This story contains a rape scene and may be triggering for rape victims."},{"definition":"To activate; to become active."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The initiation of an event or process."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That triggers or initiates."}],"partOfSpeech":"j"}]},{"word":"DUMPS","idx":23648,"count":1200377,"meanings":[{"definitions":[{"definition":"A place where waste or garbage is left; a ground or place for dumping ashes, refuse, etc.; a disposal site.","example":"A toxic waste dump."},{"definition":"A car or boat for dumping refuse, etc."},{"definition":"That which is dumped, especially in a chaotic way; a mess."},{"definition":"An act of dumping, or its result.","example":"The new XML dump is coming soon."},{"definition":"A formatted listing of the contents of program storage, especially when produced automatically by a failing program"},{"definition":"A storage place for supplies, especially military."},{"definition":"An unpleasant, dirty, disreputable, unfashionable, boring or depressing looking place.","example":"Don't feel bad about moving away from this dump."},{"definition":"(often with the verb \"take\") An act of defecation; a defecating.","example":"I have to take a dump."},{"definition":"(usually in the plural) A sad, gloomy state of the mind; sadness; melancholy; despondency"},{"definition":"Absence of mind; revery."},{"definition":"A pile of ore or rock."},{"definition":"A melancholy strain or tune in music; any tune."},{"definition":"An old kind of dance."},{"definition":"A small coin made by punching a hole in a larger coin (called a holey dollar)."},{"definition":"A temporary display case that holds many copies of an item being sold."},{"definition":"A thick, ill-shapen piece."},{"definition":"A lead counter used in the game of chuck-farthing."},{"definition":"A deep hole in a river bed; a pool."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To release, especially in large quantities and chaotic manner."},{"definition":"To discard; to get rid of something one does not want anymore."},{"definition":"To sell below cost or very cheaply; to engage in dumping."},{"definition":"To copy data from a system to another place or system, usually in order to archive it."},{"definition":"To output the contents of storage or a data structure, often in order to diagnose a bug."},{"definition":"To end a relationship with."},{"definition":"To knock heavily; to stump."},{"definition":"To put or throw down with more or less of violence; hence, to unload from a cart by tilting it","example":"We dumped the coal onto the fireplace."},{"definition":"To precipitate (especially snow) heavily."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dʌmps/"}]},{"word":"RACKMOUNT","idx":23651,"count":1200262,"meanings":[{"definitions":[{"definition":"Any equipment designed to be rack-mounted."}],"partOfSpeech":"n"}]},{"word":"BINOCULAR","idx":23652,"count":1200231,"meanings":[{"definitions":[{"definition":"A pair of binoculars."},{"definition":"Any binocular glass, such as an opera glass, telescope, or microscope."},{"definition":"A hand-held device consisting of a series of lenses and prisms, used to magnify objects so that they can be better seen from a distance, and looked at through both eyes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Using two eyes or viewpoints; especially, using two eyes or viewpoints to ascertain distance.","example":"a binocular microscope or telescope"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/bɪˈnɒkjʊlə(ɹ)/"}]},{"word":"BUCKLES","idx":23653,"count":1200203,"meanings":[{"definitions":[{"definition":"To distort or collapse under physical pressure; especially, of a slender structure in compression."},{"definition":"To make bend; to cause to become distorted."},{"definition":"To give in; to react suddenly or adversely to stress or pressure (of a person).","example":"It is amazing that he has never buckled after so many years of doing such urgent work."},{"definition":"To yield; to give way; to cease opposing."},{"definition":"To enter upon some labour or contest; to join in close fight; to contend."},{"definition":"To buckle down; to apply oneself."},{"definition":"To fasten using a buckle."},{"definition":"To unite in marriage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A clasp used for fastening two things together, such as the ends of a belt, or for retaining the end of a strap."},{"definition":"The brisure of an eighth daughter."},{"definition":"(roofing) An upward, elongated displacement of a roof membrane frequently occurring over insulation or deck joints. A buckle may be an indication of movement with the roof assembly."},{"definition":"A distortion, bulge, bend, or kink, as in a saw blade or a plate of sheet metal."},{"definition":"A curl of hair, especially a kind of crisp curl formerly worn; also, the state of being curled."},{"definition":"A contorted expression, as of the face."}],"partOfSpeech":"n"}]},{"word":"JOYFUL","idx":23654,"count":1200200,"meanings":[{"definitions":[{"definition":"Feeling or causing joy."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"joyful-us","text":"/ˈdʒɔɪfəl/"}]},{"word":"GENERALIZATION","idx":23655,"count":1200162,"meanings":[{"definitions":[{"definition":"The formulation of general concepts from specific instances by abstracting common properties."},{"definition":"Inductive reasoning from detailed facts to general principles."},{"definition":"An oversimplified or exaggerated conception, opinion, or image of the members of a group."},{"definition":"A proof, axiom, problem, or definition which includes another's cases, and also some additional cases.","example":"A hypersphere is a generalization of a sphere across more than three dimensions."}],"partOfSpeech":"n"}]},{"word":"SPECIALISE","idx":23657,"count":1200116,"meanings":[{"definitions":[{"definition":"To make distinct or separate, particularly:"},{"definition":"To become distinct or separate, particularly:"}],"partOfSpeech":"ve"}]},{"word":"HIN","idx":23659,"count":1199932,"meanings":[{"definitions":[{"definition":"A former Hebrew liquid measure of volume (about 3.8 L)."},{"definition":"An Ancient Egyptian liquid measure of volume (about 0.48 L)."}],"partOfSpeech":"n"}]},{"word":"REMORTGAGES","idx":23660,"count":1199867,"meanings":[{"definitions":[{"definition":"A subsequent or additional mortgage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mortgage again."}],"partOfSpeech":"ve"}]},{"word":"HANKS","idx":23662,"count":1199778,"meanings":[{"definitions":[{"definition":"A coil or loop of something, especially twine, yarn, or rope."},{"definition":"A ring or shackle that secures a staysail to its stay and allows the sail to glide smoothly up and down."},{"definition":"Doubt, difficulty."},{"definition":"Mess, tangle."},{"definition":"A rope or withe for fastening a gate."},{"definition":"Hold; influence."},{"definition":"A throw in which a wrestler turns his left side to his opponent, twines his left leg about his opponent's right leg from the inside, and throws him backward."}],"partOfSpeech":"n"}]},{"word":"PANCAKES","idx":23663,"count":1199765,"meanings":[{"definitions":[{"definition":"A thin batter cake fried in a pan or on a griddle in oil or butter."},{"definition":"A kind of makeup, consisting of a thick layer of a compressed powder."},{"definition":"A type of throw, usually with a ring where the prop is thrown in such a way that it rotates round an axis of the diameter of the prop."},{"definition":"Anything very thin and flat."},{"definition":"A box on which an actor stands to make them appear taller."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpænkeɪks/"}]},{"word":"DOSING","idx":23664,"count":1199682,"meanings":[{"definitions":[{"definition":"The administration of a dose"}],"partOfSpeech":"n"}]},{"word":"CRAVE","idx":23665,"count":1199466,"meanings":[{"definitions":[{"definition":"A formal application to a court to make a particular order."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To desire strongly, so as to satisfy an appetite; to long or yearn for.","example":"to crave after wealth"},{"definition":"To ask for earnestly; to beg; to claim.","example":"I humbly crave your indulgence to read this letter until the end."},{"definition":"To call for; to require as a course of action."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crave-us","text":"/kɹeɪv/"}]},{"word":"STROBE","idx":23667,"count":1199249,"meanings":[{"definitions":[{"definition":"A stroboscopic lamp: a device used to produce regular flashes of light."},{"definition":"An electronic signal in hardware indicating that a value is ready to be read.","example":"a memory strobe; a data strobe"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flash like a stroboscopic lamp."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/stɹoʊb/"},{"text":"/stɹəʊb/"}]},{"word":"FOCUSSED","idx":23668,"count":1199162,"meanings":[{"definitions":[{"definition":"(followed by on or upon) To concentrate one's attention.","example":"I have to focus on my work."},{"definition":"To cause (rays of light, etc) to converge at a single point."},{"definition":"To adjust (a lens, an optical instrument) in order to position an image with respect to the focal plane.","example":"You'll need to focus the microscope carefully in order to capture the full detail of this surface."},{"definition":"To concentrate one’s attention.","example":"If you're going to beat your competitors, you need to focus."},{"definition":"To transfer the input focus to (a visual element), so that it receives subsequent input.","example":"The text box won't receive the user's keystrokes unless you explicitly focus it."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Directing all one's efforts towards achieving a particular goal."},{"definition":"Dealing with some narrowly defined aspects of a broader phenomenon."}],"partOfSpeech":"j"}]},{"word":"WAFFLE","idx":23669,"count":1199095,"meanings":[{"definitions":[{"definition":"A flat pastry pressed with a grid pattern.","example":"The brunch was waffles with strawberries and whipped cream."},{"definition":"A potato waffle, a savoury flat potato cake with the same kind of grid pattern."},{"definition":"Speech or writing that is vague, pretentious or evasive.","example":"This interesting point seems to get lost a little within a lot of self-important waffle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To smash."},{"definition":"(of birds) To move in a side-to-side motion and descend (lose altitude) before landing. Cf wiffle, whiffle.","example":"The geese waffled as they approached the water."},{"definition":"To speak or write vaguely and evasively."},{"definition":"To speak or write at length without any clear point or aim."},{"definition":"To vacillate."},{"definition":"To rotate (one's hand) back and forth in a gesture of vacillation or ambivalence."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"waffle-us","text":"/ˈwɑ.fl/"}]},{"word":"DETECTABLE","idx":23670,"count":1199069,"meanings":[{"definitions":[{"definition":"That which can be detected, noticeable.","example":"There was a detectable pause before he continued. We all noticed it but no one commented."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈtɛktəbəɫ/"}]},{"word":"ARROWHEAD","idx":23672,"count":1198937,"meanings":[{"definitions":[{"definition":"The pointed part of an arrow."},{"definition":"(symbol) The pointed part of an arrow."},{"definition":"Any plant in the genus Sagittaria."}],"partOfSpeech":"n"}]},{"word":"RIPPLE","idx":23675,"count":1198877,"meanings":[{"definitions":[{"definition":"A moving disturbance, or undulation, in the surface of a fluid.","example":"I dropped a small stone into the pond and watched the ripples spread."},{"definition":"A sound similar to that of undulating water."},{"definition":"A style of ice cream in which flavors have been coarsely blended together.","example":"I enjoy fudge ripple ice cream, but I especially like to dig through the carton to get at the ripple part and eat only that."},{"definition":"A small oscillation of an otherwise steady signal."},{"definition":"An implement, with teeth like those of a comb, for removing the seeds and seed vessels from flax, broom corn, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move like the undulating surface of a body of water; to undulate."},{"definition":"To propagate like a moving wave."},{"definition":"To make a sound as of water running gently over a rough bottom, or the breaking of ripples on the shore."},{"definition":"To shape into a series of ripples."},{"definition":"To launch or unleash in rapid succession."},{"definition":"To scratch, tear, or break slightly; graze"},{"definition":"To remove the seeds from (the stalks of flax, etc.), by means of a ripple."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ripple-us","text":"/ˈɹɪp(ə)l/"}]},{"word":"PAYCHECK","idx":23676,"count":1198864,"meanings":[{"definitions":[{"definition":"Money received on payday as payment for work performed.","example":"He was delighted after getting his first paycheck, but subsequently blew it all on the horses"}],"partOfSpeech":"n"}]},{"word":"SWEEPER","idx":23677,"count":1198591,"meanings":[{"definitions":[{"definition":"One who sweeps floors or chimneys."},{"definition":"A detector (for mines)."},{"definition":"Any of the small, tropical marine perciform fishes of the family Pempheridae, typically with deeply keeled, compressed bodies and large eyes."},{"definition":"A defender who is the last line of defence before the goalkeeper."},{"definition":"A person who sweeps the ice ahead of the rock in play."},{"definition":"A batsman who plays sweep shots."},{"definition":"A fielding position along the boundary; a fielder in this position."},{"definition":"A tree that has fallen over a river with branches extending into the water.","example":"..tree will be hanging over the water about canoe level (a sweeper).. Basic Essentials Canoe Paddling, 3rd - Page 62"},{"definition":"A carpet sweeper."},{"definition":"(including) A vacuum cleaner."},{"definition":"(including, Cebu) A group of students tasked at cleaning the homeroom after class dismissal."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈswipɚ/"},{"audio":"sweeper-au"}]},{"word":"CLAIMANTS","idx":23678,"count":1198404,"meanings":[{"definitions":[{"definition":"One who claims; one who makes a claim."},{"definition":"A person receiving money from the government, in a form of unemployment benefits, disability benefits or similar."},{"definition":"The party who initiates a lawsuit before a court."}],"partOfSpeech":"n"}]},{"word":"FREELANCERS","idx":23679,"count":1198389,"meanings":[{"definitions":[{"definition":"One who freelances"}],"partOfSpeech":"n"}]},{"word":"CONSOLIDATING","idx":23680,"count":1198303,"meanings":[{"definitions":[{"definition":"To combine into a single unit; to group together or join.","example":"He consolidated his luggage into a single large bag."},{"definition":"To make stronger or more solid."},{"definition":"To pay off several debts with a single loan."}],"partOfSpeech":"ve"}]},{"word":"GOLDSMITH","idx":23684,"count":1197840,"meanings":[{"definitions":[{"definition":"A person who makes, repairs or sells things out of gold, especially jewelry."},{"definition":"A banker (because the goldsmiths of London used to receive money on deposit, being equipped to keep it safely)."}],"partOfSpeech":"n"}]},{"word":"RESPONDERS","idx":23685,"count":1197839,"meanings":[{"definitions":[{"definition":"One who responds."},{"definition":"A person who responds to an emergency situation or other summons.","example":"911 responders arrived at the scene within five minutes after the call."}],"partOfSpeech":"n"}]},{"word":"INCLINATION","idx":23686,"count":1197709,"meanings":[{"definitions":[{"definition":"A physical tilt or bend.","example":"The inclination of his head increased and he awoke with a start."},{"definition":"A slant or slope.","example":"The road up to the house had a steep inclination."},{"definition":"A mental tendency.","example":"His inclination to drink escalated to alcoholism."},{"definition":"The angle of intersection of a reference plane","example":"Artillery must take account of a weapon's precise inclination."},{"definition":"A person or thing loved or admired."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"inclination-us","text":"/ɪn.klɪˈneɪ.ʃən/"}]},{"word":"KEEPSAKE","idx":23687,"count":1197679,"meanings":[{"definitions":[{"definition":"Some object given by a person and retained in memory of something or someone; something kept for sentimental or nostalgic reasons.","example":"She gave him a lock of hair as a keepsake of their time together."},{"definition":"Specifically, a type of literary album popular in the nineteenth-century, containing scraps of poetry and prose, and engravings."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"keepsake-us","text":"/ˈkiːp.seɪk/"},{"audio":"keepsake-au","text":"/ˈkiːp.seɪk/"}]},{"word":"BIRTHDATE","idx":23688,"count":1197392,"meanings":[{"definitions":[{"definition":"The year, month, and day of someone's birth; date of birth"}],"partOfSpeech":"n"}]},{"word":"MEASLES","idx":23690,"count":1197305,"meanings":[{"definitions":[{"definition":"Rubeola, an acute highly contagious disease, often of childhood, caused by Measles virus, of genus Morbillivirus, featuring a spreading red skin rash, fever, runny nose, cough and red eyes"},{"definition":"Any of several other similar diseases, such as German measles."},{"definition":"A disease of pigs and cattle, caused by larval tapeworms."},{"definition":"A disease of trees, in which the leaves are covered in spots."},{"definition":"A leper."},{"definition":"A tapeworm larva."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"measles-us","text":"/ˈmiːzəlz/"}]},{"word":"ARCS","idx":23691,"count":1197124,"meanings":[{"definitions":[{"definition":"That part of a circle which a heavenly body appears to pass through as it moves above and below the horizon."},{"definition":"A continuous part of the circumference of a circle (circular arc) or of another curve."},{"definition":"A curve, in general."},{"definition":"A band contained within parallel curves, or something of that shape."},{"definition":"(electrics) A flow of current across an insulating medium; especially a hot, luminous discharge between either two electrodes or as lightning."},{"definition":"A story arc."},{"definition":"A continuous mapping from a real interval (typically [0, 1]) into a space."},{"definition":"A directed edge."},{"definition":"The three-point line."},{"definition":"An arclight."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move following a curved path."},{"definition":"To shape into an arc; to hold in the form of an arc."},{"definition":"To form an electrical arc."}],"partOfSpeech":"ve"}]},{"word":"UPBEAT","idx":23692,"count":1196797,"meanings":[{"definitions":[{"definition":"An unaccented beat at the start of a musical phrase.","example":"The conductor said: I give you three beats for nothing and then you come in on the upbeat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a fast pace, tempo, or beat.","example":"The notes are easy, but it's an upbeat tune and should be played fairly quickly."},{"definition":"Having a positive, lively, or perky tone, attitude, etc.","example":"He sounded upbeat when I talked to him."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"upbeat-us"}]},{"word":"AYES","idx":23694,"count":1196545,"meanings":[{"definitions":[{"definition":"An affirmative vote; one who votes in the affirmative.","example":"\"To call for the ayes and nays;\" \"The ayes have it.\""}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ayes-uk","text":"/aɪz/"}]},{"word":"AMENITY","idx":23695,"count":1196507,"meanings":[{"definitions":[{"definition":"Pleasantness.","example":"We especially enjoyed the amenity of the climate on our last holiday."},{"definition":"A thing or circumstance that is welcome and makes life a little easier or more pleasant.","example":"All the little amenities the hotel provided made our stay very enjoyable."},{"definition":"Convenience."},{"definition":"A unit pertaining to the infrastructure of a community, such as a public toilet, a postbox, a library etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"amenity-au","text":"/əˈmiːnəti/"}]},{"word":"DONUTS","idx":23696,"count":1196447,"meanings":[{"definitions":[{"definition":"A deep-fried piece of dough or batter, commonly made in a toroidal or ellipsoidal shape, and mixed with various sweeteners and flavors, sometimes filled with jelly, custard or cream."},{"definition":"Anything in the shape of a torus."},{"definition":"(automobile) A peel-out or skid-mark in the shape of donut; a 360-degree skid."},{"definition":"A spare tire, smaller and less durable than a full-sized tire, only intended for temporary use."},{"definition":"A toroidal cushion typically used by hemorrhoid patients."},{"definition":"An idiot."}],"partOfSpeech":"n"}]},{"word":"SALTY","idx":23697,"count":1196416,"meanings":[{"definitions":[{"definition":"Tasting of salt."},{"definition":"Containing salt."},{"definition":"Coarse, provocative, earthy; said of language."},{"definition":"Experienced, especially used to indicate a veteran of the naval services; salty dog (from salt of the sea)."},{"definition":"Irritated, annoyed (from the sharp, spicy flavor of salt)."},{"definition":"Indignant or offended due to over-sensitivity, humourlessness, disappointment, or defeat (implying the person is a crybaby, shedding salty tears); said of interlocutors expressing indignation, or merely disagreement."},{"definition":"Pertaining to the Sardinian language and those dialects of Catalan, spoken in the Balearic Islands and along the coast of Catalonia, that use definitive articles descended from the Latin ipse instead of the Latin ille."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɒl.ti/"},{"audio":"salty-au"}]},{"word":"BAPTIZED","idx":23700,"count":1196165,"meanings":[{"definitions":[{"definition":"To perform the sacrament of baptism by sprinkling or pouring water over someone or immersing them in water."},{"definition":"To dedicate or christen."},{"definition":"Of rum, brandy, or any other spirits, to dilute with water."},{"definition":"To ensure proper burning of a joint by moistening the exterior with saliva."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a person) who has been baptized"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈbæptaɪzd/"}]},{"word":"EXPELLED","idx":23701,"count":1196114,"meanings":[{"definitions":[{"definition":"To eject or erupt."},{"definition":"To fire (a bullet, arrow etc.)."},{"definition":"To remove from membership.","example":"He was expelled from school multiple times."},{"definition":"To deport."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"expelled-us"}]},{"word":"ESTRADIOL","idx":23703,"count":1195949,"meanings":[{"definitions":[{"definition":"A potent estrogenic hormone ((17)-estra-1,3,5-triene-3,17-diol) produced in the ovaries of all vertebrates; the synthetic compound is used medicinally to treat estrogen deficiency and breast cancer."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɛstɹəˈdaɪɔl/"},{"text":"/ˌiːstɹəˈdaɪɒl/"}]},{"word":"RUPEES","idx":23704,"count":1195946,"meanings":[{"definitions":[{"definition":"The common name for the monetary currencies used in modern India, Mauritius, Nepal, Pakistan, the Seychelles, or Sri Lanka, often abbreviated ₨."},{"definition":"A silver coin circulating in India between the 16th and 20th centuries, weighing one tola (formerly 170–180 troy grains; from 1833, 180 troy grains)."}],"partOfSpeech":"n"}]},{"word":"BETRAYAL","idx":23707,"count":1195306,"meanings":[{"definitions":[{"definition":"The act of betraying"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bɪˈtɹeɪəl/"}]},{"word":"PROTOTYPING","idx":23710,"count":1195134,"meanings":[{"definitions":[{"definition":"The rapid creation of prototypes of a new product for demonstration and research purposes"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-ɾə-/"},{"text":"/ˈpɹəʊtətaɪpɪŋ/"}]},{"word":"MTH","idx":23711,"count":1195054,"meanings":[{"definitions":[{"definition":"A period into which a year is divided, historically based on the phases of the moon.","example":"July is my favourite month."},{"definition":"A period of 30 days, 31 days, or some alternation thereof.","example":"We went on holiday for two months."},{"definition":"(in the plural) A woman's period; menstrual discharge."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Occurring at position m in a sequence."}],"partOfSpeech":"j"}]},{"word":"FLOURISH","idx":23712,"count":1194963,"meanings":[{"definitions":[{"definition":"A dramatic gesture such as the waving of a flag.","example":"With many flourishes of the captured banner, they marched down the avenue."},{"definition":"An ornamentation.","example":"His signature ended with a flourish."},{"definition":"A ceremonious passage such as a fanfare.","example":"The trumpets blew a flourish as they entered the church."},{"definition":"A decorative embellishment on a building."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To thrive or grow well.","example":"The barley flourished in the warm weather."},{"definition":"To prosper or fare well.","example":"The cooperation flourished as the customers rushed in the business."},{"definition":"To be in a period of greatest influence.","example":"His writing flourished before the war."},{"definition":"To develop; to make thrive; to expand."},{"definition":"To make bold, sweeping movements with.","example":"They flourished the banner as they stormed the palace."},{"definition":"To make bold and sweeping, fanciful, or wanton movements, by way of ornament, parade, bravado, etc.; to play with fantastic and irregular motion."},{"definition":"To use florid language; to indulge in rhetorical figures and lofty expressions."},{"definition":"To make ornamental strokes with the pen; to write graceful, decorative figures."},{"definition":"To adorn with beautiful figures or rhetoric; to ornament with anything showy; to embellish."},{"definition":"To execute an irregular or fanciful strain of music, by way of ornament or prelude."},{"definition":"To boast; to vaunt; to brag."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈflʌ.ɹɪʃ/"}]},{"word":"ZEROS","idx":23713,"count":1194886,"meanings":[{"definitions":[{"definition":"The numeric symbol that represents the cardinal number zero.","example":"In unary and k-adic notation in general, zero is the empty string."},{"definition":"The digit 0 in the decimal, binary, and all other base numbering systems.","example":"One million has six zeroes."},{"definition":"Nothing, or none.","example":"He knows zero about humour."},{"definition":"The value of a magnitude corresponding to the cardinal number zero.","example":"The electromagnetic field does not drop all of the way to zero before a reversal."},{"definition":"The point on a scale at which numbering or measurement originates.","example":"The temperature outside is ten degrees below zero."},{"definition":"A value of the independent variables of a function, for which the function is equal to zero.","example":"The derivative of a continuous, differentiable function that twice crosses the axis must have a zero."},{"definition":"The additive identity element of a monoid or greater algebraic structure, particularly a group or ring.","example":"Since a commutative zero is the inverse of any additive identity, it must be unique when it exists."},{"definition":"A person of little or no importance.","example":"They rudely treated him like a zero."},{"definition":"A Mitsubishi A6M Zero, a long range fighter aircraft operated by the Japanese Navy Air Service from 1940 to 1945."},{"definition":"A setting of calibrated instruments such as a firearm."},{"definition":"A security which has a zero coupon (paying no periodic interest).","example":"The takeovers were financed by issuing zeroes."}],"partOfSpeech":"n"}]},{"word":"HEED","idx":23714,"count":1194819,"meanings":[{"definitions":[{"definition":"Careful attention."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To guard, protect."},{"definition":"To mind; to regard with care; to take notice of; to attend to; to observe."},{"definition":"To pay attention, care."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"heed-us","text":"/hiːd/"}]},{"word":"SPORTY","idx":23716,"count":1194690,"meanings":[{"definitions":[{"definition":"Favourable to sports","example":"She's perfect for me, as she's both studious and sporty."},{"definition":"Flashy in appearance.","example":"My new car looks sporty but is actually very practical."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈspɔɹti/"},{"text":"/ˈspɔːti/"}]},{"word":"HAWKING","idx":23718,"count":1194571,"meanings":[{"definitions":[{"definition":"To hunt with a hawk."},{"definition":"To make an attack while on the wing; to soar and strike like a hawk.","example":"to hawk at flies"},{"definition":"To sell; to offer for sale by outcry in the street; to carry (merchandise) about from place to place for sale; to peddle.","example":"The vendors were hawking their wares from little tables lining either side of the market square."},{"definition":"To cough up something from one's throat."},{"definition":"To try to cough up something from one's throat; to clear the throat loudly.","example":"Grandpa sat on the front porch, hawking and wheezing, as he packed his pipe with cheap tobacco."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Action of the verb to hawk."}],"partOfSpeech":"n"}]},{"word":"TUMOUR","idx":23719,"count":1194461,"meanings":[{"definitions":[{"definition":"An abnormal growth; differential diagnosis includes abscess, metaplasia, and neoplasia."}],"partOfSpeech":"n"}]},{"word":"POOLED","idx":23723,"count":1194178,"meanings":[{"definitions":[{"definition":"(of a liquid) To form a pool."},{"definition":"To put together; contribute to a common fund, on the basis of a mutual division of profits or losses; to make a common interest of.","example":"We must pool our resources."},{"definition":"To combine or contribute with others, as for a commercial, speculative, or gambling transaction."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/puːld/"}]},{"word":"BORA","idx":23724,"count":1194117,"meanings":[{"definitions":[{"definition":"A initiation ceremony for males among the Aborigines of New South Wales."},{"definition":"A cold, often dry, northeasterly wind which blows, sometimes in violent gusts, down from mountains on the eastern shore of the Adriatic Sea. It also applies to cold, squally, downslope winds in other parts of the world."}],"partOfSpeech":"n"}]},{"word":"DIVIDES","idx":23726,"count":1194034,"meanings":[{"definitions":[{"definition":"A thing that divides.","example":"Stay on your side of the divide, please."},{"definition":"An act of dividing.","example":"The divide left most of the good land on my share of the property."},{"definition":"A distancing between two people or things.","example":"There is a great divide between us."},{"definition":"A large chasm, gorge, or ravine between two areas of land.","example":"If you're heading to the coast, you'll have to cross the divide first."},{"definition":"The topographical boundary dividing two adjacent catchment basins, such as a ridge or a crest."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To split or separate (something) into two or more parts.","example":"a wall divides two houses; a stream divides the towns"},{"definition":"To share (something) by dividing it.","example":"How shall we divide this pie?"},{"definition":"(with by) To calculate the number (the quotient) by which you must multiply one given number (the divisor) to produce a second given number (the dividend).","example":"If you divide 6 by 3, you get 2."},{"definition":"To be a divisor of.","example":"3 divides 6."},{"definition":"To separate into two or more parts."},{"definition":"Of a cell, to reproduce by dividing."},{"definition":"To disunite in opinion or interest; to make discordant or hostile; to set at variance."},{"definition":"To break friendship; to fall out."},{"definition":"To have a share; to partake."},{"definition":"To vote, as in the British parliament and other legislatures, by the members separating themselves into two parties (as on opposite sides of the hall or in opposite lobbies), that is, the ayes dividing from the noes."},{"definition":"To mark divisions on; to graduate.","example":"to divide a sextant"},{"definition":"To play or sing in a florid style, or with variations."}],"partOfSpeech":"ve"}]},{"word":"STABILIZE","idx":23727,"count":1193707,"meanings":[{"definitions":[{"definition":"To make stable.","example":"Jody stabilized the table by putting a book under the short leg."},{"definition":"To become stable.","example":"The country will stabilize after the next election ends."}],"partOfSpeech":"ve"}]},{"word":"SUBWOOFERS","idx":23728,"count":1193643,"meanings":[{"definitions":[{"definition":"An electronic speaker designed to produce low-frequency sound, especially bass."}],"partOfSpeech":"n"}]},{"word":"COMPOSING","idx":23730,"count":1193544,"meanings":[{"definitions":[{"definition":"To make something by merging parts.","example":"The editor composed a historical journal from many individual letters."},{"definition":"To make up the whole; to constitute.","example":"A church is composed of its members."},{"definition":"To comprise."},{"definition":"To construct by mental labor; to think up; particularly, to produce or create a literary or musical work.","example":"It's difficult to compose without absolute silence."},{"definition":"(sometimes reflexive) To calm; to free from agitation.","example":"The defendant couldn't compose herself and was found in contempt."},{"definition":"To arrange the elements of a photograph or other picture."},{"definition":"To settle (an argument, dispute etc.); to come to a settlement."},{"definition":"To arrange in proper form; to reduce to order; to put in proper state or condition."},{"definition":"To arrange (types) in a composing stick for printing; to typeset."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"composing-us","text":"/kəmˈpoʊzɪŋ/"}]},{"word":"HANDICRAFTS","idx":23731,"count":1193497,"meanings":[{"definitions":[{"definition":"A trade requiring skill of hand; manual occupation; handcraft."},{"definition":"An artifact produced by handicraft."},{"definition":"A man who earns his living by handicraft; a handicraftsman."}],"partOfSpeech":"n"}]},{"word":"HEALED","idx":23732,"count":1193454,"meanings":[{"definitions":[{"definition":"To make better from a disease, wound, etc.; to revive or cure.","example":"This bandage will heal your cut."},{"definition":"To become better or healthy again.","example":"Bandages allow cuts to heal."},{"definition":"To reconcile, as a breach or difference; to make whole; to free from guilt.","example":"to heal dissensions"},{"definition":"To hide, conceal, and keep secret, especially for a secret society (such as the masons)."},{"definition":"(now especially in the phrase \"hele in\") To cover or conceal (a seedling, plant, roots, etc)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hiːld/"}]},{"word":"CLUELESS","idx":23734,"count":1193405,"meanings":[{"definitions":[{"definition":"Lacking knowledge or understanding; uninformed."},{"definition":"Without any clues or hints."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkluː.ləs/"}]},{"word":"BOON","idx":23735,"count":1193354,"meanings":[{"definitions":[{"definition":"A prayer; petition."},{"definition":"That which is asked or granted as a benefit or favor; a gift or benefaction."},{"definition":"A good thing; a blessing or benefit; a thing to be thankful for.","example":"Anaesthetics are a great boon to modern surgery."},{"definition":"An unpaid service due by a tenant to his lord."},{"definition":"The woody portion of flax, separated from the fiber as refuse matter by retting, braking, and scutching."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Good; prosperous.","example":"boon voyage"},{"definition":"Kind; bountiful; benign."},{"definition":"(Now only in boon companion) gay; merry; jovial; convivial."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/buːn/"}]},{"word":"VALOR","idx":23737,"count":1193133,"meanings":[{"definitions":[{"definition":"Value; worth."},{"definition":"Strength of mind in regard to danger; that quality which enables a person to encounter danger with firmness"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"valor-us","text":"/ˈvælɚ/"}]},{"word":"PEDESTRIANS","idx":23738,"count":1193075,"meanings":[{"definitions":[{"definition":"A walker; one who walks or goes on foot, especially as opposed to one who uses a vehicle."},{"definition":"Specifically, an expert or professional walker or runner; one who performs feats of walking or running."}],"partOfSpeech":"n"}]},{"word":"WOODRUFF","idx":23739,"count":1193004,"meanings":[{"definitions":[{"definition":"Galium odoratum, an aromatic herb."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwʊdɹʌf/"}]},{"word":"RADIOTHERAPY","idx":23742,"count":1192760,"meanings":[{"definitions":[{"definition":"The therapeutic use of ionizing radiation, almost exclusively used for the treatment of malignant disease."}],"partOfSpeech":"n"}]},{"word":"GATHERS","idx":23743,"count":1192558,"meanings":[{"definitions":[{"definition":"A plait or fold in cloth, made by drawing a thread through it; a pucker."},{"definition":"The inclination forward of the axle journals to keep the wheels from working outward."},{"definition":"The soffit or under surface of the masonry required in gathering. See gather (transitive verb)."},{"definition":"A blob of molten glass collected on the end of a blowpipe."},{"definition":"A gathering."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To collect; normally separate things.","example":"I've been gathering ideas from the people I work with."},{"definition":"To bring parts of a whole closer.","example":"She gathered the shawl about her as she stepped into the cold."},{"definition":"To infer or conclude; to know from a different source.","example":"From his silence, I gathered that things had not gone well."},{"definition":"(of a boil or sore) To be filled with pus","example":"Salt water can help boils to gather and then burst."},{"definition":"To collect molten glass on the end of a tool."},{"definition":"To gain; to win."}],"partOfSpeech":"ve"}]},{"word":"PAWN","idx":23744,"count":1192557,"meanings":[{"definitions":[{"definition":"The most common chess piece, or a similar piece in a similar game. In chess each side has eight; moves are only forward, and attacks are only forward diagonally or en passant."},{"definition":"Someone who is being manipulated or used to some end.","example":"Though a pawn of the gods, her departure is the precipitating cause of the Trojan War."},{"definition":"The state of being held as security for a loan, or as a pledge.","example":"All our jewellery was in pawn by this stage."},{"definition":"An instance of pawning something."},{"definition":"An item given as security on a loan, or as a pledge."},{"definition":"A pawnshop; pawnbroker."},{"definition":"A psychoactive preparation of betel leaf combined with areca nut and/or cured tobacco, chewed recreationally in Asia; such a preparation served wrapped in the leaf."},{"definition":"A gallery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pledge; to stake or wager."},{"definition":"To give as security on a loan of money; especially, to deposit (something) at a pawn shop."},{"definition":"(originally leet) To own, to defeat or dominate (someone or something, especially a game or someone playing a game)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pawn-uk","text":"/pɔːn/"}]},{"word":"STITCHED","idx":23745,"count":1192536,"meanings":[{"definitions":[{"definition":"To form stitches in; especially, to sew in such a manner as to show on the surface a continuous line of stitches.","example":"to stitch a shirt bosom."},{"definition":"To sew, or unite or attach by stitches.","example":"to stitch printed sheets in making a book or a pamphlet."},{"definition":"To practice/practise stitching or needlework."},{"definition":"To form land into ridges."},{"definition":"To weld together through a series of connecting or overlapping spot welds."},{"definition":"(graphics) To combine two or more photographs of the same scene into a single image.","example":"I can use this software to stitch together a panorama."},{"definition":"(more generally) To include, combine, or unite into a single whole."}],"partOfSpeech":"ve"}]},{"word":"CEASES","idx":23748,"count":1191983,"meanings":[{"definitions":[{"definition":"To stop.","example":"And with that, his twitching ceased."},{"definition":"To stop doing (something).","example":"And with that, he ceased twitching."},{"definition":"To be wanting; to fail; to pass away."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ceases-us","text":"/ˈsiːsɪz/"}]},{"word":"DORSAL","idx":23749,"count":1191905,"meanings":[{"definitions":[{"definition":"A hanging, usually of rich stuff, at the back of a throne, altar, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"With respect to, or concerning the side in which the backbone is located, or the analogous side of an invertebrate."},{"definition":"(of a knife) Having only one sharp side."},{"definition":"Relating to the top surface of the foot or hand."},{"definition":"(of a sound) Produced using the dorsum of the tongue."},{"definition":"Relating to the surface naturally inferior, as of a leaf."},{"definition":"Relating to the surface naturally superior, as of a creeping hepatic moss."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɔɹsəl/"}]},{"word":"TRANSFUSION","idx":23750,"count":1191882,"meanings":[{"definitions":[{"definition":"The transfer of blood or blood products from one individual to another."},{"definition":"The act of pouring liquid from one vessel to another."}],"partOfSpeech":"n"}]},{"word":"SAMS","idx":23751,"count":1191871,"meanings":[{"definitions":[{"definition":"Federal narcotics agent."}],"partOfSpeech":"n"}]},{"word":"COLLIE","idx":23752,"count":1191722,"meanings":[{"definitions":[{"definition":"Any of various breeds of dog originating in Scotland and England as sheepdogs"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɒli/"}]},{"word":"HEREDITARY","idx":23756,"count":1191152,"meanings":[{"definitions":[{"definition":"A hereditary ruler; a hereditary peer in the House of Lords."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Passed on as an inheritance, by last will or intestate."},{"definition":"Of a title, honor or right: legally granted to somebody's descendant after that person's death.","example":"Duke is a hereditary title which was created in Norman times."},{"definition":"Of a person: holding a legally hereditary title or rank.","example":"hereditary rulers"},{"definition":"Of a disease or trait: passed from a parent to offspring in the genes","example":"Haemophilia is hereditary in his family."},{"definition":"Of a ring: such that all submodules of projective modules over the ring are also projective."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hereditary-us","text":"/həˈɹɛdɪˌtɛɹi/"}]},{"word":"EXAGGERATED","idx":23757,"count":1191139,"meanings":[{"definitions":[{"definition":"To overstate, to describe more than is fact.","example":"He said he'd slept with hundreds of girls, but I know he's exaggerating. The real number is about ten."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been described as greater than it actually is; abnormally increased or enlarged."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"exaggerated-us","text":"/ɛɡ-/"}]},{"word":"BUCCANEERS","idx":23761,"count":1190784,"meanings":[{"definitions":[{"definition":"Any of a group of seamen who cruised on their own account on the Spanish Main and in the Pacific in the 17th century, who were similar to pirates but did not prey on ships of their own nation."},{"definition":"A pirate."}],"partOfSpeech":"n"}]},{"word":"NEWSFLASH","idx":23764,"count":1190486,"meanings":[{"definitions":[{"definition":"A brief media report of something that has recently taken place.","example":"Television programmes were interrupted by a newsflash announcing that the Prime Minister had resigned."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Introduces an obvious fact of which the person addressed is ostensibly not aware."}],"partOfSpeech":"i"}]},{"word":"SPLEEN","idx":23765,"count":1190381,"meanings":[{"definitions":[{"definition":"In vertebrates, including humans, a ductless vascular gland, located in the left upper abdomen near the stomach, which destroys old red blood cells, removes debris from the bloodstream, acts as a reservoir of blood, and produces lymphocytes."},{"definition":"(except in the set phrase \"to vent one's spleen\") A bad mood; spitefulness."},{"definition":"A sudden motion or action; a fit; a freak; a whim."},{"definition":"Melancholy; hypochondriacal affections."},{"definition":"A fit of immoderate laughter or merriment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dislike."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spleen-uk","text":"/spliːn/"}]},{"word":"ALLOTMENT","idx":23766,"count":1190325,"meanings":[{"definitions":[{"definition":"The act of allotting."},{"definition":"Something allotted; a share, part, or portion granted or distributed"},{"definition":"The allowance of a specific amount of money or other credit of a particular thing to a particular person."},{"definition":"A plot of land rented from the council for growing fruit and vegetables."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈlɔt.mɛnt/"},{"audio":"allotment-uk"}]},{"word":"RECOMBINATION","idx":23767,"count":1190311,"meanings":[{"definitions":[{"definition":"Combination a second or subsequent time."},{"definition":"The formation of genetic combinations in offspring that are not present in the parents"},{"definition":"The reverse of dissociation"},{"definition":"The process by which the plasma of electrons and protons produced after the Big Bang condensed into hydrogen, or the epoch in which this process occurred."}],"partOfSpeech":"n"}]},{"word":"MESSING","idx":23768,"count":1190210,"meanings":[{"definitions":[{"definition":"(transitive, often used with \"up\") To make untidy or dirty."},{"definition":"(transitive, often used with \"up\") To throw into disorder or to ruin."},{"definition":"To interfere.","example":"This doesn't concern you. Don't mess."},{"definition":"(used with \"with\") To screw around with, to bother, to be annoying to.","example":"Stop messing with me!"},{"definition":"To take meals with a mess."},{"definition":"To belong to a mess."},{"definition":"To eat (with others).","example":"I mess with the wardroom officers."},{"definition":"To supply with a mess."}],"partOfSpeech":"ve"}]},{"word":"MULTIPLYING","idx":23770,"count":1190135,"meanings":[{"definitions":[{"definition":"To increase the amount, degree or number of (something)."},{"definition":"(with by) To perform multiplication on (a number).","example":"when you multiply 3 by 7, you get 21;  he multiplied several numbers"},{"definition":"To grow in number."},{"definition":"To breed or propagate."},{"definition":"To perform multiplication.","example":"He had been multiplying, but it occurred to him he needed to resolve the exponents, first."},{"definition":"To be a factor in a multiplication with (another factor)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of multiplication."}],"partOfSpeech":"n"}]},{"word":"EMPRESS","idx":23771,"count":1190035,"meanings":[{"definitions":[{"definition":"The female monarch (ruler) of an empire."},{"definition":"The wife or widow of an emperor or equated ruler."},{"definition":"The third trump or major arcana card of most tarot decks."},{"definition":"A female chimpanzee."},{"definition":"A deciduous tree, Paulownia tomentosa"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To affect (someone) strongly and often favourably.","example":"You impressed me with your command of Urdu."},{"definition":"To make an impression, to be impressive.","example":"Henderson impressed in his first game as captain."},{"definition":"To produce a vivid impression of (something).","example":"That first view of the Eiger impressed itself on my mind."},{"definition":"To mark or stamp (something) using pressure.","example":"We impressed our footprints in the wet cement."},{"definition":"To produce (a mark, stamp, image, etc.); to imprint (a mark or figure upon something)."},{"definition":"To fix deeply in the mind; to present forcibly to the attention, etc.; to imprint; to inculcate."},{"definition":"To compel (someone) to serve in a military force.","example":"The press gang used to impress people into the Navy."},{"definition":"To seize or confiscate (property) by force.","example":"The liner was impressed as a troop carrier."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"empress-1-us","text":"/ˈɛmpɹəs/"}]},{"word":"ORBITS","idx":23772,"count":1189963,"meanings":[{"definitions":[{"definition":"A circular or elliptical path of one object around another object, particularly in astronomy and space travel.","example":"The Moon's orbit around the Earth takes nearly one month to complete."},{"definition":"A sphere of influence; an area of control.","example":"In the post WWII era, several eastern European countries came into the orbit of the Soviet Union."},{"definition":"The course of one's usual progression, or the extent of one's typical range.","example":"The convenience store was a heavily travelled point in her daily orbit, as she purchased both cigarettes and lottery tickets there."},{"definition":"The bony cavity containing the eyeball; the eye socket."},{"definition":"A mathematical function that describes the wave-like behavior of an electron in an atom; area of the highest probability of electron´s occurrence around the atom's nucleus."},{"definition":"A collection of points related by the evolution function of a dynamical system."},{"definition":"The subset of elements of a set X to which a given element can be moved by members of a specified group of transformations that act on X."},{"definition":"A state of increased excitement, activity, or anger.","example":"Dad went into orbit when I told him that I'd crashed the car."},{"definition":"A path for the ball on the outer edge of the playfield, usually connected so that the ball entering in one end will come out of the other."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To circle or revolve around another object.","example":"The Earth orbits the Sun."},{"definition":"To move around the general vicinity of something.","example":"The harried mother had a cloud of children orbiting her, begging for sweets."},{"definition":"To place an object into an orbit around a planet.","example":"A rocket was used to orbit the satellite."}],"partOfSpeech":"ve"}]},{"word":"BUDGETED","idx":23773,"count":1189863,"meanings":[{"definitions":[{"definition":"To construct or draw up a budget.","example":"Budgeting is even harder in times of recession"},{"definition":"To provide funds, allow for in a budget.","example":"The PM’s pet projects are budgeted rather generously"},{"definition":"To plan for the use of in a budget.","example":"The prestigious building project is budgeted in great detail, from warf facilities to the protocollary opening."}],"partOfSpeech":"ve"}]},{"word":"WHENCE","idx":23774,"count":1189837,"meanings":[{"definitions":[{"definition":"From where; from which place or source.","example":"\"Pork\" comes from French, whence we get most of our modern cooking terms."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Used for introducing the result of a fact that has just been stated.","example":"I scored more than you in the exam, whence we can conclude that I am better at the subject than you are."}],"partOfSpeech":"c"}],"phonetics":[{"audio":"whence-us","text":"/wɛns/"},{"audio":"whence-au","text":"/wɛns/"}]},{"word":"SLOGANS","idx":23776,"count":1189647,"meanings":[{"definitions":[{"definition":"A catch phrase associated with the product or service being advertised."},{"definition":"A distinctive phrase of a person or group of people."},{"definition":"A battle cry among the ancient highlanders of Scotland."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsloʊɡəns/"},{"text":"/ˈsləʊɡ(ə)ns/"}]},{"word":"FLASHBACK","idx":23777,"count":1189561,"meanings":[{"definitions":[{"definition":"(authorship) A dramatic device in which an earlier event is inserted into the normal chronological flow of a narrative."},{"definition":"A vivid mental image of a past trauma, especially one that recurs."},{"definition":"A similar recurrence of the effects of a hallucinogenic drug."},{"definition":"The condition of the flame propagating down the hose of an oxy-fuel welding system."},{"definition":"A query that operates against data from an earlier time, before it was changed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To undergo a flashback; to experience a vivid mental image from the past."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈflæʃbæk/"}]},{"word":"TRUSTING","idx":23778,"count":1189507,"meanings":[{"definitions":[{"definition":"To place confidence in; to rely on, to confide, or have faith, in.","example":"We cannot trust anyone who deceives us."},{"definition":"To give credence to; to believe; to credit."},{"definition":"To hope confidently; to believe (usually with a phrase or infinitive clause as the object)","example":"I trust you have cleaned your room?"},{"definition":"To show confidence in a person by entrusting them with something."},{"definition":"To commit, as to one's care; to entrust."},{"definition":"To give credit to; to sell to upon credit, or in confidence of future payment.","example":"Merchants and manufacturers trust their customers annually with goods."},{"definition":"(followed by to) To rely on (something), as though having trust (on it).","example":"Having lost the book, he had to trust to his memory for further details."},{"definition":"To risk; to venture confidently."},{"definition":"To have trust; to be credulous; to be won to confidence; to confide."},{"definition":"To sell or deliver anything in reliance upon a promise of payment; to give credit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Inclined to believe what others say; trustful"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"trusting-us","text":"/ˈtɹʌstɪŋ/"}]},{"word":"SABRE","idx":23780,"count":1189329,"meanings":[{"definitions":[{"definition":"A light sword, sharp along the front edge, part of the back edge, and at the point."},{"definition":"A modern fencing sword modeled after the sabre."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike or kill with a sabre."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈseɪ.bə(ɹ)/"},{"text":"/ˈseɪ.bɚ/"}]},{"word":"STIGMA","idx":23781,"count":1189307,"meanings":[{"definitions":[{"definition":"A mark of infamy or disgrace."},{"definition":"A scar or birthmark."},{"definition":"(chiefly in the plural stigmata) A mark on the body corresponding to one of the wounds of the Crucifixion on Jesus' body, and sometimes reported to bleed periodically."},{"definition":"The sticky part of a flower that receives pollen during pollination."},{"definition":"A visible sign or characteristic of a disease."},{"definition":"A ligature of the Greek letters sigma and tau, (Ϛ/ϛ)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈstɪɡmə/"}]},{"word":"KNICKS","idx":23784,"count":1188900,"meanings":[{"definitions":[{"definition":"Knickers."},{"definition":"Lycra pants (usually short) used by cyclists."}],"partOfSpeech":"n"}]},{"word":"ABDUCTION","idx":23785,"count":1188510,"meanings":[{"definitions":[{"definition":"Leading away; a carrying away."},{"definition":"The act of abducing or abducting; a drawing apart; the movement which separates a limb or other part from the axis, or middle line, of the body."},{"definition":"A syllogism or form of argument in which the major premise is evident, but the minor is only probable."},{"definition":"The wrongful, and usually forcible, carrying off of a human being.","example":"the abduction of a child"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æbˈdək.ʃn̩/"},{"text":"/əbˈdʌk.ʃn̩/"}]},{"word":"INGESTION","idx":23786,"count":1188366,"meanings":[{"definitions":[{"definition":"The action of ingesting, or consuming something orally, whether it be food, drink, medicine, or other substance. It is usually referred to as the first step of digestion."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈdʒɛstʃən/"}]},{"word":"MINDSET","idx":23787,"count":1188254,"meanings":[{"definitions":[{"definition":"A way of thinking; an attitude or opinion, especially a habitual one.","example":"Earth Day is a way of propagating and celebrating the environmentalist mindset."}],"partOfSpeech":"n"}]},{"word":"ATTACHES","idx":23789,"count":1187711,"meanings":[{"definitions":[{"definition":"To fasten, to join to (literally and figuratively).","example":"An officer is attached to a certain regiment, company, or ship."},{"definition":"To adhere; to be attached."},{"definition":"To come into legal operation in connection with anything; to vest.","example":"Dower will attach."},{"definition":"To win the heart of; to connect by ties of love or self-interest; to attract; to fasten or bind by moral influence; with to.","example":"attached to a friend; attaching others to us by wealth or flattery"},{"definition":"To connect, in a figurative sense; to ascribe or attribute; to affix; with to.","example":"to attach great importance to a particular circumstance"},{"definition":"To take, seize, or lay hold of."},{"definition":"To arrest, seize."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈtætʃɪz/"}]},{"word":"ADULTHOOD","idx":23790,"count":1187666,"meanings":[{"definitions":[{"definition":"The state or condition of a human being once it has reached physical maturity, and is presumed to have reached a state of psychological maturity, to wit: once it has become an adult."},{"definition":"The time period of a human being's majority; the time during which a human being has reached physical maturity, and ending with its death."}],"partOfSpeech":"n"}]},{"word":"INJECT","idx":23791,"count":1187647,"meanings":[{"definitions":[{"definition":"To push or pump (something, especially fluids) into a cavity or passage.","example":"The nurse injected a painkilling drug into the veins of my forearm."},{"definition":"To introduce (something) suddenly or violently.","example":"Punk injected a much-needed sense of urgency into the British music scene."},{"definition":"To administer an injection to (someone or something), especially of medicine or drugs.","example":"Now lie back while we inject you with the anesthetic."},{"definition":"To take or be administered something by means of injection, especially medicine or drugs.","example":"It's been a week since I stopped injecting, and I'm still in withdrawal."},{"definition":"To introduce (code) into an existing program or its memory space, often without tight integration and sometimes through a security vulnerability."},{"definition":"To cast or throw; used with on."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"inject-uk","text":"/ɪnˈdʒɛkt/"}]},{"word":"TARTAN","idx":23792,"count":1187619,"meanings":[{"definitions":[{"definition":"A kind of woven woollen cloth with a distinctive pattern of coloured stripes intersecting at right angles, associated with Scottish Highlanders, different clans having their own distinctive patterns."},{"definition":"The pattern associated with such material."},{"definition":"An individual or a group wearing tartan; a Highlander or Scotsman in general."},{"definition":"Trade name of a synthetic resin, used for surfacing tracks etc."},{"definition":"A type of one-masted vessel used in the Mediterranean."},{"definition":"A kind of long covered carriage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clothe in tartan."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a pattern like a tartan."},{"definition":"Scottish."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/tɑɹtən/"},{"text":"/tɑːtən/"}]},{"word":"PROLOG","idx":23793,"count":1187552,"meanings":[{"definitions":[{"definition":"A speech or section used as an introduction, especially to a play or novel."},{"definition":"A component of a computer program that prepares the computer to execute a routine."}],"partOfSpeech":"n"}]},{"word":"TWISTING","idx":23794,"count":1187497,"meanings":[{"definitions":[{"definition":"A twisting force."},{"definition":"Anything twisted, or the act of twisting."},{"definition":"The form given in twisting."},{"definition":"The degree of stress or strain when twisted."},{"definition":"A type of thread made from two filaments twisted together."},{"definition":"A sliver of lemon peel added to a cocktail, etc."},{"definition":"A sudden bend (or short series of bends) in a road, path, etc."},{"definition":"A distortion to the meaning of a word or passage."},{"definition":"An unexpected turn in a story, tale, etc."},{"definition":"(preceded by definite article) A type of dance characterised by rotating one’s hips. See Twist (dance) on Wikipedia for more details."},{"definition":"A rotation of the body when diving."},{"definition":"A sprain, especially to the ankle."},{"definition":"A twig."},{"definition":"A girl, a woman."},{"definition":"A roll of twisted dough, baked."},{"definition":"A small roll of tobacco."},{"definition":"A material for gun barrels, consisting of iron and steel twisted and welded together.","example":"Damascus twist"},{"definition":"The spiral course of the rifling of a gun barrel or a cannon."},{"definition":"A beverage made of brandy and gin."},{"definition":"A strong individual tendency or bent; inclination.","example":"a twist toward fanaticism"},{"definition":"An appetite for food."},{"definition":"The disreputable practice of selling unnecessary insurance to a customer in order to earn commission."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To turn the ends of something, usually thread, rope etc., in opposite directions, often using force."},{"definition":"To join together by twining one part around another."},{"definition":"To contort; to writhe; to complicate; to crook spirally; to convolve."},{"definition":"To wreathe; to wind; to encircle; to unite by intertexture of parts."},{"definition":"To wind into; to insinuate.","example":"Avarice twists itself into all human concerns."},{"definition":"To turn a knob etc."},{"definition":"To distort or change the truth or meaning of words when repeating."},{"definition":"To form a twist (in any of the above noun meanings)."},{"definition":"To injure (a body part) by bending it in the wrong direction."},{"definition":"(of a path) To wind; to follow a bendy or wavy course; to have many bends."},{"definition":"To cause to rotate."},{"definition":"To dance the twist (a type of dance characterised by twisting one's hips)."},{"definition":"To coax."},{"definition":"In the game of blackjack (pontoon or twenty-one), to be dealt another card."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having many twists","example":"The mountain road is even more twisting than the valley road."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"twisting-us","text":"/ˈtwɪstɪŋ/"}]},{"word":"TORE","idx":23795,"count":1187333,"meanings":[{"definitions":[{"definition":"Hard, difficult; wearisome, tedious."},{"definition":"Strong, sturdy; great, massive."},{"definition":"Full; rich."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To rend (a solid material) by holding or restraining in two places and pulling apart, whether intentionally or not; to destroy or separate.","example":"He tore his coat on the nail."},{"definition":"To injure as if by pulling apart.","example":"He has a torn ligament."},{"definition":"To destroy or reduce abstract unity or coherence, such as social, political or emotional.","example":"He was torn by conflicting emotions."},{"definition":"To make (an opening) with force or energy.","example":"A piece of debris tore a tiny straight channel through the satellite."},{"definition":"(often with off or out) To remove by tearing.","example":"Tear the coupon out of the newspaper."},{"definition":"(of structures, with down) To demolish","example":"The slums were torn down to make way for the new development."},{"definition":"To become torn, especially accidentally.","example":"My dress has torn."},{"definition":"To move or act with great speed, energy, or violence.","example":"He tore into the backlog of complaints."},{"definition":"To smash or enter something with great force.","example":"The chain shot tore into the approaching line of infantry."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The surface described by the circumference of a circle revolving about a straight line in its own plane."},{"definition":"The solid enclosed by such a surface; an anchor ring."},{"definition":"A topological space which is a product of two circles.","example":"A 4-variable Karnaugh map can be thought of, topologically, as being a torus."},{"definition":"The standard representation of such a space in 3-dimensional Euclidean space: a shape consisting of a ring with a circular cross-section: the shape of an inner tube or hollow doughnut."},{"definition":"(in combination, n-torus, 4-torus, etc.) The product of the specified number of circles."},{"definition":"A molding which projects at the base of a column and above the plinth."},{"definition":"The end of the peduncle or flower stalk to which the floral parts (or in the Asteraceae, the florets of a flower head) are attached; receptacle, thalamus."},{"definition":"A rounded ridge, especially one on the occipital bone."},{"definition":"The dead grass that remains on mowing land in winter and spring."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tore-uk","text":"/tɔː/"}]},{"word":"GOOFY","idx":23797,"count":1187234,"meanings":[{"definitions":[{"definition":"Silly, quirky"},{"definition":"Riding with the right foot forward."}],"partOfSpeech":"j"},{"definitions":[{"definition":"One who rides with the right foot forward."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡuːfi/"}]},{"word":"ETH","idx":23798,"count":1187222,"meanings":[{"definitions":[{"definition":"A letter (capital Ð, small ð) introduced into Old English to represent its dental fricative, then not distinguished from the letter thorn, no longer used in English but still in modern use in Icelandic, the IPA and other phonetic alphabets to represent the voiced dental fricative \"th\" sound as in the English word then. The letter is also used in Faroese, but is generally silent in that language."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"eth-uk","text":"/ɛð/"}]},{"word":"MIMIC","idx":23799,"count":1187154,"meanings":[{"definitions":[{"definition":"A person who practices mimicry, or mime."},{"definition":"An imitation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To imitate, especially in order to ridicule."},{"definition":"To take on the appearance of another, for protection or camouflage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pertaining to mimicry; imitative."},{"definition":"Mock, pretended."},{"definition":"Imitative; characterized by resemblance to other forms; applied to crystals which by twinning resemble simple forms of a higher grade of symmetry."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mimic-us","text":"/ˈmɪm.ɪk/"}]},{"word":"AGA","idx":23801,"count":1186967,"meanings":[{"definitions":[{"definition":"An honorific for high officials used in Turkey and certain Muslim countries."}],"partOfSpeech":"n"}]},{"word":"SHIELDING","idx":23803,"count":1186790,"meanings":[{"definitions":[{"definition":"To protect, to defend."},{"definition":"To protect from the influence of"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The situation, in NMR spectroscopy, in which a local magnetic field is weakened by the presence of neighbouring nuclei"},{"definition":"Action done by the person with the ball to protect the ball from the defender; the person concerned keeps his body between the ball and the defender."}],"partOfSpeech":"n"}]},{"word":"STORMY","idx":23804,"count":1186775,"meanings":[{"definitions":[{"definition":"Of or pertaining to storms."},{"definition":"Characterized by, or proceeding from, a storm; subject to storms; agitated with strong winds and heavy rain.","example":"a stormy season or a stormy day"},{"definition":"Proceeding from violent agitation or fury.","example":"a stormy sound or stormy shocks"},{"definition":"Violent; passionate; rough.","example":"stormy passions"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stormy-us","text":"/ˈstɔɹmi/"}]},{"word":"RAGLAN","idx":23805,"count":1186757,"meanings":[{"definitions":[{"definition":"An overcoat with sleeves of this type."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a sleeve) Being or having a kind of sleeve that continues in one piece up to the neck of a garment, without a shoulder seam."}],"partOfSpeech":"j"}]},{"word":"PHOTONICS","idx":23806,"count":1186739,"meanings":[{"definitions":[{"definition":"The science and technology of generating and controlling photons, particularly in the visible and near infrared light spectrum"}],"partOfSpeech":"n"}]},{"word":"HETEROSEXUAL","idx":23809,"count":1186643,"meanings":[{"definitions":[{"definition":"A heterosexual person, or other heterosexual organism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Sexually attracted to members of the opposite sex."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌhɛtəɹoʊˈsɛkʃuəl/"},{"text":"/ˌhɛtəɹəˈsɛkʃuəl/"}]},{"word":"VULGAR","idx":23810,"count":1186559,"meanings":[{"definitions":[{"definition":"(classicism) A common, ordinary person."},{"definition":"(collective) The common people."},{"definition":"The vernacular tongue or common language of a country."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Debased, uncouth, distasteful, obscene.","example":"The construction worker made a vulgar suggestion to the girls walking down the street."},{"definition":"(classical sense) Having to do with ordinary, common people."},{"definition":"Common, usual; of the typical kind."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"vulgar-us","text":"/ˈvʌl.ɡɚ/"}]},{"word":"PATHOLOGICAL","idx":23811,"count":1186406,"meanings":[{"definitions":[{"definition":"Pertaining to pathology."},{"definition":"Relating to, amounting to, causing, or caused by a physical or mental disorder."},{"definition":"Having properties which are counterintuitive or difficult to handle."},{"definition":"Having properties that cause unusually bad behaviour, especially regarding correctness or performance."}],"partOfSpeech":"j"}]},{"word":"MAPPINGS","idx":23812,"count":1186365,"meanings":[{"definitions":[{"definition":"The process of making maps."},{"definition":"The process of locating genes on a chromosome."},{"definition":"Assigning a PC to a shared drive or printer port on a network."},{"definition":"A function that maps every element of a given set to a unique element of another set; a correspondence."},{"definition":"Conversion of data types between incompatible type systems."}],"partOfSpeech":"n"}]},{"word":"JEL","idx":23813,"count":1186313,"meanings":[{"definitions":[{"definition":"Jealous","example":"2012 May 12, Kate Middleton looked amaze at London Olympic Gala concert, totally jel of the dress!, OK! Magazine"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"jel-au","text":"/dʒɛl/"}]},{"word":"HODGE","idx":23814,"count":1186264,"meanings":[{"definitions":[{"definition":"A rustic; a country person."}],"partOfSpeech":"n"}]},{"word":"SNIP","idx":23815,"count":1186200,"meanings":[{"definitions":[{"definition":"The act of snipping; cutting a small amount off of something."},{"definition":"A single cut with scissors, clippers, or similar tool."},{"definition":"Something acquired for a low price; a bargain.","example":"That wholesale lot on eBay was a snip at $10"},{"definition":"A small amount of something; a pinch."},{"definition":"(definite, the snip) A vasectomy."},{"definition":"A small or weak person, especially a young one."},{"definition":"An impertinent or mischievous person."},{"definition":"A share or portion; a snack."},{"definition":"A tailor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut with short sharp actions, as with scissors.","example":"I don't want you to take much hair off; just snip my mullet off."},{"definition":"To reduce the price of a product, to create a snip."},{"definition":"To break off; to snatch away."},{"definition":"To circumcise."},{"definition":"To remove the irrelevant parts of quotations in the reply message."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"snip-au","text":"/snɪp/"}]},{"word":"TRIMMING","idx":23818,"count":1185796,"meanings":[{"definitions":[{"definition":"To reduce slightly; to cut; especially, to remove excess.","example":"A ranch steak is usually trimmed of all excess fat."},{"definition":"To decorate or adorn; especially of a Christmas tree.","example":"They traditionally trim the tree on Christmas Eve."},{"definition":"(of an aircraft) To adjust pitch using trim tabs."},{"definition":"(of a vessel) To modify the angle relative to the water by shifting cargo or ballast; to adjust for sailing; to assume, or cause to assume a certain position, or trim, in the water."},{"definition":"(of a vessel's sails) To modify the angle (of the sails) relative to the wind, especially to set them at the most advantageous angle."},{"definition":"To balance; to fluctuate between parties, so as to appear to favour each."},{"definition":"To make trim; to put in due order for any purpose; to make right, neat, or pleasing; to adjust."},{"definition":"(of timber) To dress; to make smooth."},{"definition":"To rebuke; to reprove."},{"definition":"To beat or thrash."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of someone who trims.","example":"I gave a good trimming to my elderly neighbour's hedges."},{"definition":"Material that is removed by someone trimming something, as a piece of steak.","example":"He gave the trimmings to the dog under the kitchen table."},{"definition":"An ornamental accessory to a dress or other piece of clothing."},{"definition":"An accessory or accompaniment.","example":"Christmas dinner with all the trimmings"},{"definition":"A reprimand or chastising.","example":"to give a boy a trimming"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɹɪmɪŋ/"}]},{"word":"AUDIOVISUAL","idx":23819,"count":1185766,"meanings":[{"definitions":[{"definition":"Containing both aural and visual elements.","example":"They put together a stunning audiovisual presentation, with movies and music as well as plenty of information."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɔ.di.oʊˈvɪ.ʒu.əl/"},{"text":"/-ʒʊ.əl/"}]},{"word":"DIAGNOSING","idx":23820,"count":1185641,"meanings":[{"definitions":[{"definition":"To determine which disease is causing a sick person's signs and symptoms; to find the diagnosis."},{"definition":"(by extension) To determine the cause of a problem."}],"partOfSpeech":"ve"}]},{"word":"SERENE","idx":23822,"count":1185408,"meanings":[{"definitions":[{"definition":"Serenity; clearness; calmness."},{"definition":"Evening air; night chill."},{"definition":"A fine rain from a cloudless sky after sunset."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make serene."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Peaceful, calm, unruffled.","example":"She looked at her students with joviality and a serene mentality."},{"definition":"Without worry or anxiety; unaffected by disturbance."},{"definition":"Fair and unclouded (as of the sky); clear; unobscured."},{"definition":"Used as part of certain titles, originally to indicate sovereignty or independence.","example":"Her Serene Highness"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"serene-us","text":"/səˈɹin/"}]},{"word":"NEUTRINO","idx":23823,"count":1185359,"meanings":[{"definitions":[{"definition":"An elementary particle that is classified as a lepton, and has an extremely small but nonzero mass and no electric charge. It interacts with the surroundings only via the weak force or gravitation, making it very difficult to detect."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/njuːˈtɹiːnoʊ/"},{"text":"/njuːˈtɹiːnəʊ/"}]},{"word":"OBLIGATORY","idx":23824,"count":1185319,"meanings":[{"definitions":[{"definition":"Imposing obligation, legally, morally, or otherwise; binding; mandatory.","example":"an obligatory promise"},{"definition":"Requiring a matter or obligation."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"obligatory-uk","text":"/əˈblɪɡət(ə)ɹi/"}]},{"word":"CODECS","idx":23827,"count":1185012,"meanings":[{"definitions":[{"definition":"A device or program capable of performing transformations on a data stream or signal.","example":"Audio and video codecs are important in making multimedia files small enough to distribute and simple to play back."}],"partOfSpeech":"n"}]},{"word":"CORRUGATED","idx":23828,"count":1184999,"meanings":[{"definitions":[{"definition":"(of the skin) To wrinkle."},{"definition":"To fold into parallel folds, grooves or ridges."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Marked with parallel folds, ridges or furrows."},{"definition":"Bent into regular curved folds or grooves."}],"partOfSpeech":"j"}]},{"word":"CERTIFYING","idx":23830,"count":1184880,"meanings":[{"definitions":[{"definition":"To attest to (a fact) as the truth."},{"definition":"To authenticate or verify in writing."},{"definition":"To attest that a product, service, organization, or person has met an official standard.","example":"These blankets have been certified as fireproof."},{"definition":"To inform; to tell (a person) that something is true."},{"definition":"To assure (oneself) of something; to ascertain."}],"partOfSpeech":"ve"}]},{"word":"FORBID","idx":23832,"count":1184790,"meanings":[{"definitions":[{"definition":"To disallow; to proscribe.","example":"Smoking in the restaurant is forbidden."},{"definition":"(ditransitive) To deny, exclude from, or warn off, by express command."},{"definition":"To oppose, hinder, or prevent, as if by an effectual command.","example":"An impassable river forbids the approach of the army."},{"definition":"To accurse; to blast."},{"definition":"To defy; to challenge.","example":"What part of \"no\" do you forbid to understand?"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"forbid-us","text":"/fɚˈbɪd/"}]},{"word":"UNHEALTHY","idx":23833,"count":1184748,"meanings":[{"definitions":[{"definition":"Characterized by, or conducive to poor health","example":"The villagers lived in unhealthy surroundings."},{"definition":"Sick or ill","example":"He was an unhealthy child."},{"definition":"Tending to corrupt","example":"He liked unhealthy reading material."},{"definition":"Characterized by disturbed mental health","example":"He had an unhealthy interest in fire."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈhɛl.θi/"}]},{"word":"FELICITY","idx":23834,"count":1184673,"meanings":[{"definitions":[{"definition":"Happiness."},{"definition":"An apt and pleasing style in speech, writing, etc."},{"definition":"(semiology) Reproduction of a sign with fidelity.","example":"The quotation was rendered with felicity."},{"definition":"Something that is either a source of happiness or particularly apt."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"felicity-us","text":"/fəˈlɪsɪti/"}]},{"word":"TICKS","idx":23839,"count":1184410,"meanings":[{"definitions":[{"definition":"A tiny woodland arachnid of the suborder Ixodida."},{"definition":"A relatively quiet but sharp sound generally made repeatedly by moving machinery.","example":"The steady tick of the clock provided a comforting background for the conversation."},{"definition":"A mark on any scale of measurement; a unit of measurement.","example":"At midday, the long bond is up a tick."},{"definition":"A jiffy (unit of time defined by basic timer frequency)."},{"definition":"A short period of time, particularly a second.","example":"I'll be back in a tick."},{"definition":"A periodic increment of damage or healing caused by an ongoing status effect."},{"definition":"A mark (✓) made to indicate agreement, correctness or acknowledgement.","example":"Indicate that you are willing to receive marketing material by putting a tick in the box"},{"definition":"A bird seen (or heard) by a birdwatcher, for the first time that day, year, trip, etc., and thus added to a list of observed birds."},{"definition":"The whinchat."},{"definition":"Ticking."},{"definition":"A sheet that wraps around a mattress; the cover of a mattress, containing the filling."},{"definition":"Credit, trust."},{"definition":"(place names) A goat.","example":"Tickenhall Drive"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a clicking noise similar to the movement of the hands in an analog clock."},{"definition":"To make a tick or checkmark."},{"definition":"To work or operate, especially mechanically.","example":"He took the computer apart to see how it ticked."},{"definition":"To strike gently; to pat."},{"definition":"To add a bird to a list of birds that have been seen (or heard)."},{"definition":"To go on trust, or credit."},{"definition":"To give tick; to trust."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɪks/"}]},{"word":"FASCINATION","idx":23840,"count":1184058,"meanings":[{"definitions":[{"definition":"The act of bewitching, or enchanting"},{"definition":"The state or condition of being fascinated.","example":"To my fascination, the skies turned all kinds of colours."},{"definition":"Something which fascinates.","example":"Life after death had always been a great fascination to him."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fæsɪˈneɪʃən/"}]},{"word":"ISOTOPE","idx":23841,"count":1183977,"meanings":[{"definitions":[{"definition":"Any of two or more forms of an element where the atoms have the same number of protons, but a different number of neutrons within their nuclei. As a consequence, atoms of isotopes will have the same atomic number but a different mass number."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To define or demonstrate an isotopy of (one map with another)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"isotope-1-us","text":"/ˈaɪ.sə.toʊp/"}]},{"word":"MOBLOG","idx":23843,"count":1183948,"meanings":[{"definitions":[{"definition":"A weblog posted from a mobile device, such as a cell phone or PDA."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To post to a weblog by this means."}],"partOfSpeech":"ve"}]},{"word":"LOCALES","idx":23844,"count":1183870,"meanings":[{"definitions":[{"definition":"The place where something happens.","example":"Being near running water and good shade, the explorers decided it was a good locale for setting up camp."},{"definition":"The set of settings related to the language and region in which a computer program executes. Examples are language, currency and time formats, character encoding etc."},{"definition":"A partially ordered set with the following additional axiomatic properties: any finite subset of it has a meet, any arbitrary subset of it has a join, and distributivity, which states that a binary meet distributes with respect to an arbitrary join. (Note: locales are just like frames except that the category of locales is opposite to the category of frames.)"}],"partOfSpeech":"n"}]}]