[{"word":"CORRECTIONAL","idx":15722,"count":2397855,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or intended for correction."},{"definition":"Of or pertaining to the imprisonment or rehabilitation of convicted criminals.","example":"correctional officer, correctional policy, correctional services."}],"partOfSpeech":"j"}]},{"word":"FACULTIES","idx":15723,"count":2397454,"meanings":[{"definitions":[{"definition":"The academic staff at schools, colleges, universities or not-for-profit research institutes, as opposed to the students or support staff."},{"definition":"A division of a university.","example":"She transferred from the Faculty of Science to the Faculty of Medicine."},{"definition":"An ability, skill, or power, often plural.","example":"He lived until he reached the age of 90 with most of his faculties intact."},{"definition":"A power, authority or privilege conferred by a higher authority."},{"definition":"(Church of England) A licence to make alterations to a church."},{"definition":"The members of a profession."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfæ.kəl.tiz/"}]},{"word":"DENIES","idx":15725,"count":2397434,"meanings":[{"definitions":[{"definition":"To disallow or reject.","example":"I wanted to go to the party, but I was denied."},{"definition":"To assert that something is not true.","example":"Everyone knows he committed the crime, but he still denies it."},{"definition":"(ditransitive) To refuse to give or grant something to someone.","example":"My father denied me a good education."},{"definition":"To take something away from someone; to deprive of."},{"definition":"To prevent from scoring."},{"definition":"To disclaim connection with, responsibility for, etc.; to refuse to acknowledge; to disown; to abjure; to disavow."},{"definition":"To refuse (to do or accept something)."}],"partOfSpeech":"ve"}]},{"word":"BUFFERS","idx":15727,"count":2396823,"meanings":[{"definitions":[{"definition":"Someone or something that buffs."},{"definition":"A solution used to stabilize the pH (acidity) of a liquid."},{"definition":"A portion of memory set aside to store data, often before it is sent to an external device or as it is received from an external device."},{"definition":"(mechanical) Anything used to maintain slack or isolate different objects."},{"definition":"A routine or storage medium used to compensate for a difference in rate of flow of data, or time of occurrence of events, when transferring data from one device to another."},{"definition":"A device on trains and carriages designed to cushion the impact between them."},{"definition":"The metal barrier to help prevent trains from running off the end of the track."},{"definition":"An isolating circuit, often an amplifier, used to minimize the influence of a driven circuit on the driving circuit."},{"definition":"(international relations) A buffer zone (such as a demilitarized zone) or a buffer state."},{"definition":"A good-humoured, slow-witted fellow, usually an elderly man."},{"definition":"A gap that isolates or separates two things."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a buffer or buffers; to isolate or minimize the effects of one thing on another."},{"definition":"To store data in memory temporarily."},{"definition":"To maintain the acidity of a solution near a chosen value by adding an acid or a base."}],"partOfSpeech":"ve"}]},{"word":"TALKBACK","idx":15728,"count":2396655,"meanings":[{"definitions":[{"definition":"A system in broadcasting and recording studios that enables the director to communicate with others during performance."},{"definition":"(by extension) Communication from members of the public to the makers of a broadcast transmission while it is happening."}],"partOfSpeech":"n"}]},{"word":"SERVINGS","idx":15729,"count":2396089,"meanings":[{"definitions":[{"definition":"The action of the verb to serve."},{"definition":"A portion (especially, of a meal) served to someone."},{"definition":"A layer added to the outside of an electrical cable to protect it."}],"partOfSpeech":"n"}]},{"word":"REINFORCE","idx":15730,"count":2394921,"meanings":[{"definitions":[{"definition":"To strengthen, especially by addition or augmentation.","example":"He reinforced the handle with a metal rod and a bit of tape."},{"definition":"To emphasize or review.","example":"The right homework will reinforce and complement the lesson!"},{"definition":"To encourage (a behavior or idea) through repeated stimulus.","example":"Advertising for fast food can reinforce unhealthy dietary tendencies."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"reinforce-us","text":"/ˌɹiːɪnˈfɔː(ɹ)s/"}]},{"word":"INCEPTION","idx":15732,"count":2394773,"meanings":[{"definitions":[{"definition":"The creation or beginning of something; the establishment.","example":"From its inception, the agency has been helping people obtain and properly install car seats for children."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"inception-us","text":"/ɪnˈsɛpʃn/"},{"audio":"inception-au","text":"/ɪnˈsɛpʃn/"}]},{"word":"DRAPER","idx":15733,"count":2394747,"meanings":[{"definitions":[{"definition":"One who sells cloths; a dealer in cloths."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɹeɪ.pə(ɹ)/"}]},{"word":"BOWMAN","idx":15736,"count":2394377,"meanings":[{"definitions":[{"definition":"A man who uses a bow; an archer."},{"definition":"The person, in a team or among oarsmen, positioned nearest the bow."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bowman-1-uk","text":"/ˈbəʊmən/"}]},{"word":"FRUSTRATING","idx":15737,"count":2394252,"meanings":[{"definitions":[{"definition":"To disappoint or defeat; to vex by depriving of something expected or desired.","example":"It frustrates me to do all this work and then lose it all."},{"definition":"To hinder or thwart.","example":"My clumsy fingers frustrate my typing efforts."},{"definition":"To cause stress or annoyance.","example":"This test frustrates me because if I fail, it'll destroy my grade."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Discouraging; causing annoyance or anger by excessive difficulty"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/fɹʌˈstɹeɪ̯tɪŋ/"}]},{"word":"SUBVERSION","idx":15738,"count":2394175,"meanings":[{"definitions":[{"definition":"The act of subverting or the condition of being subverted."},{"definition":"A systematic attempt to overthrow a government by working from within; undermining."},{"definition":"A revision considered more similar to preceding subversions than a revision deemed a new \"version\" is to preceding versions."}],"partOfSpeech":"n"}]},{"word":"ZETA","idx":15740,"count":2394047,"meanings":[{"definitions":[{"definition":"The sixth letter of the modern Greek alphabet (Ζ, ζ) preceded by epsilon (Ε, ε) and followed by eta, (Η, η); or the seventh letter in the ancient Greek alphabet, in which it is preceded by digamma (Ϝ, ϝ)"},{"definition":"A mathematical function formally known as the Riemann zeta function.","example":"Zeta of 3 is irrational"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"zeta-us","text":"/ˈzeɪtə/"}]},{"word":"BENNY","idx":15741,"count":2393928,"meanings":[{"definitions":[{"definition":"An amphetamine tablet."},{"definition":"A tantrum; a fit of furious or erratic behaviour."},{"definition":"A benefit."},{"definition":"An overcoat."},{"definition":"A straw hat."},{"definition":"(originally United States) A dish consisting of slices of English muffins with poached eggs, ham or bacon and hollandaise sauce."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually with \"up\") To take amphetamines."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"benny-au"}]},{"word":"SPIRES","idx":15742,"count":2393880,"meanings":[{"definitions":[{"definition":"The stalk or stem of a plant."},{"definition":"A young shoot of a plant; a spear."},{"definition":"Any of various tall grasses, rushes, or sedges, such as the marram, the reed canary-grass, etc."},{"definition":"A sharp or tapering point."},{"definition":"A tapering structure built on a roof or tower, especially as one of the central architectural features of a church or cathedral roof.","example":"The spire of the church rose high above the town."},{"definition":"The top, or uppermost point, of anything; the summit."},{"definition":"A tube or fuse for communicating fire to the charge in blasting."},{"definition":"One of the sinuous foldings of a serpent or other reptile; a coil."},{"definition":"A spiral."},{"definition":"The part of a spiral generated in one revolution of the straight line about the pole."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a seed, plant etc.) to sprout, to send forth the early shoots of growth; to germinate."},{"definition":"To grow upwards rather than develop horizontally."},{"definition":"To furnish with a spire."},{"definition":"To breathe."}],"partOfSpeech":"ve"}]},{"word":"BARNEY","idx":15743,"count":2393754,"meanings":[{"definitions":[{"definition":"A lark, a romp, some fun."},{"definition":"A hoax, a humbug, something that is not genuine, a rigged or unfair sporting contest."},{"definition":"(Harvard University slang) A poor recitation."},{"definition":"A noisy argument."},{"definition":"A minor physical fight."},{"definition":"(Boston) A student at Harvard University."},{"definition":"(pejorative slang) A police officer, usually one perceived as inferior or overzealous."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(Harvard University slang) To recite badly; to fail."},{"definition":"To argue, to quarrel."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Insane crazy, loony."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"barney-us","text":"/ˈbɑɹni/"}]},{"word":"DINNERWARE","idx":15744,"count":2393648,"meanings":[{"definitions":[{"definition":"The dishes used for serving dinner."}],"partOfSpeech":"n"}]},{"word":"SCLEROSIS","idx":15745,"count":2392826,"meanings":[{"definitions":[{"definition":"The abnormal hardening of body tissues, such as an artery."},{"definition":"Inability to create change."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sklɪˈɹəʊsɪs/"}]},{"word":"HOMOSEXUALITY","idx":15746,"count":2392550,"meanings":[{"definitions":[{"definition":"The state of being sexually attracted primarily or exclusively to persons of the same sex."},{"definition":"Sexual activity with a person of the same sex."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"homosexuality-us"}]},{"word":"DECLARES","idx":15747,"count":2392411,"meanings":[{"definitions":[{"definition":"To make clear, explain, interpret."},{"definition":"To make a declaration."},{"definition":"To show one's cards in order to score."},{"definition":"To announce one’s support, choice, opinion, etc.","example":"He declared him innocent."},{"definition":"For the captain of the batting side to announce the innings complete even though all batsmen have not been dismissed."},{"definition":"To announce something formally or officially.","example":"declare bankruptcy"},{"definition":"For a constituency in an election to officially announce the result","example":"Houghton and Sunderland South was the first constituency to declare in the 2015 general election."},{"definition":"To affirm or state something emphatically."},{"definition":"To inform government customs or taxation officials of goods one is importing or of income, expenses, or other circumstances affecting one's taxes."},{"definition":"To make outstanding debts, e.g. taxes, payable."},{"definition":"To explicitly establish the existence of (a variable, function, etc.) without necessarily describing its content.","example":"The counter \"i\" was declared as an integer."}],"partOfSpeech":"ve"}]},{"word":"EMOTIONALLY","idx":15748,"count":2391987,"meanings":[{"definitions":[{"definition":"In an emotional manner; displaying emotion."},{"definition":"Regarding emotions.","example":"Physically, it was easy, but emotionally it was the hardest thing I've ever done."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɪˈməʊʃənli/"},{"text":"/iˈmoʊʃənəli/"}]},{"word":"MASONRY","idx":15749,"count":2391921,"meanings":[{"definitions":[{"definition":"The art or occupation of a mason.","example":"He studied masonry for five years."},{"definition":"The work or performance of a mason","example":"The masonry was exquisite."},{"definition":"That which is built by a mason; anything constructed of the materials used by masons, such as stone, brick, tiles, or the like. Dry masonry is applied to structures made without mortar.","example":"The masonry was cracked."},{"definition":"The craft, institution, or mysteries of Freemasons; Freemasonry."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmeɪsənɹi/"}]},{"word":"CARBOHYDRATE","idx":15750,"count":2391830,"meanings":[{"definitions":[{"definition":"(nutrition) A sugar, starch, or cellulose that is a food source of energy for an animal or plant.","example":"These microbes are primarily responsible for breaking down cellulose and other carbohydrates into volatile fatty acids (VFAs)."},{"definition":"(by extension, metonym) Any food rich in starch or other carbohydrates.","example":"I'm cutting down on carbohydrates like bread and pasta."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"carbohydrate-us","text":"/kɑːɹboʊˈhaɪdɹeɪt/"}]},{"word":"MEDICINAL","idx":15751,"count":2391733,"meanings":[{"definitions":[{"definition":"Any plant that can be used for medicinal purposes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the properties of medicine, or pertaining to medicine; medical."},{"definition":"Tending or used to cure disease or relieve pain."},{"definition":"Tasting like medicine; particularly of unpleasant or artificial sweet or bitter flavours similar to cherry, almond or licorice."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/məˈdɪsnəl/"}]},{"word":"ESTROGEN","idx":15752,"count":2391686,"meanings":[{"definitions":[{"definition":"Any of a group of steroids that are secreted by the ovaries and function as female sex hormones."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛstɹədʒən/"},{"text":"/ˈiːstɹəd͡ʒən/"}]},{"word":"ACCRUED","idx":15755,"count":2391008,"meanings":[{"definitions":[{"definition":"To increase, to rise"},{"definition":"To reach or come to by way of increase; to arise or spring up because of growth or result, especially as the produce of money lent."},{"definition":"To be incurred as a result of the passage of time.","example":"The monthly financial statements show all the actual but only some of the accrued expenses."},{"definition":"To accumulate","example":"He has accrued nine sick days."},{"definition":"To become an enforceable and permanent right."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having increased through accrual; having risen over time or due to financial transactions."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈkɹuːd/"}]},{"word":"TEMPLES","idx":15756,"count":2390437,"meanings":[{"definitions":[{"definition":"A house of worship, especially:"},{"definition":"A meeting house of the Oddfellows fraternity; its members."},{"definition":"Any place regarded as holding a religious presence."},{"definition":"Any place seen as an important centre for some activity.","example":"a temple of commerce, a temple of drinking and dining"},{"definition":"Anything regarded as important or minutely cared for.","example":"My body is my temple."},{"definition":"A gesture wherein the forefingers are outstretched and touch pad to pad while the other fingers are clasped together."},{"definition":"The slightly flatter region, on either side of the human head, behind of the eye and forehead, above the zygomatic arch, and forward of the ear."},{"definition":"Either of the sidepieces on a set of spectacles, extending backwards from the hinge toward the ears and, usually, turning down around them."},{"definition":"A contrivance used in a loom for keeping the web stretched transversely."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To build a temple for; to appropriate a temple to; to temple a god"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"temples-us","text":"/ˈtɛmpl̩z/"}]},{"word":"REALIZING","idx":15757,"count":2390433,"meanings":[{"definitions":[{"definition":"To make real; to convert from the imaginary or fictitious into reality; to bring into real existence","example":"The objectives of the project were never fully realized."},{"definition":"To become aware of (a fact or situation, especially of something that has been true for a long time).","example":"He realized that he had left his umbrella on the train."},{"definition":"To cause to seem real; to sense vividly or strongly; to make one's own in thought or experience."},{"definition":"To acquire as an actual possession; to obtain as the result of plans and efforts; to gain; to get","example":"to realize large profits from a speculation"},{"definition":"To convert any kind of property into money, especially property representing investments, such as shares, bonds, etc.","example":"By realizing the company's assets, the liquidator was able to return most of the shareholders' investments."},{"definition":"To convert into real property; to make real estate of."},{"definition":"To turn an abstract linguistic object into actual language, especially said of a phoneme's conversion into speech sound.","example":"The southern /v/ is realized as the voiced approximant [ʋ]."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"realizing-us"}]},{"word":"CEMETERIES","idx":15760,"count":2389792,"meanings":[{"definitions":[{"definition":"A place where the dead are buried; a graveyard or memorial park."}],"partOfSpeech":"n"}]},{"word":"INDOORS","idx":15761,"count":2389570,"meanings":[{"definitions":[{"definition":"The interior of a building; the space inside buildings generally.","example":"I prefer the indoors to the outdoors."}],"partOfSpeech":"n"},{"definitions":[{"definition":"In or into a building.","example":"We stayed indoors to avoid the brutal heat."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɪnˈdɔɹz/"},{"text":"/ɪnˈdɔːz/"}]},{"word":"TELESCOPES","idx":15762,"count":2389085,"meanings":[{"definitions":[{"definition":"A monocular optical instrument that magnifies distant objects, especially in astronomy."},{"definition":"Any instrument used in astronomy for observing distant objects (such as a radio telescope)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extend or contract in the manner of a telescope."},{"definition":"To slide or pass one within another, after the manner of the sections of a small telescope or spyglass."},{"definition":"To come into collision, as railway cars, in such a manner that one runs into another."}],"partOfSpeech":"ve"}]},{"word":"CHAMPS","idx":15764,"count":2388179,"meanings":[{"definitions":[{"definition":"To bite or chew, especially noisily or impatiently."}],"partOfSpeech":"ve"}]},{"word":"FEDERATED","idx":15765,"count":2387686,"meanings":[{"definitions":[{"definition":"To unite in a federation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"United, as a federation, under a central government"}],"partOfSpeech":"j"}]},{"word":"AVERAGING","idx":15766,"count":2387410,"meanings":[{"definitions":[{"definition":"To compute the average of, especially the arithmetic mean.","example":"If you average 10, 20 and 24, you get 18."},{"definition":"Over a period of time or across members of a population, to have or generate a mean value of.","example":"I averaged 75% in my examinations this year."},{"definition":"To divide among a number, according to a given proportion.","example":"to average a loss"},{"definition":"To be, generally or on average."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of computing an average."}],"partOfSpeech":"n"}]},{"word":"SALADS","idx":15767,"count":2387032,"meanings":[{"definitions":[{"definition":"A food made primarily of a mixture of raw or cold ingredients, typically vegetables, usually served with a dressing such as vinegar or mayonnaise."},{"definition":"A raw vegetable of the kind used in salads."}],"partOfSpeech":"n"}]},{"word":"ADDICTED","idx":15768,"count":2386786,"meanings":[{"definitions":[{"definition":"To deliver (someone or something) following a judicial decision."},{"definition":"To devote (oneself) to a given activity, occupation, thing etc."},{"definition":"To bind (a person or thing) to the service of something."},{"definition":"To devote or pledge (oneself) to a given person, cause etc."},{"definition":"To devote (one's mind, talent etc.) to a given activity, occupation, thing etc."},{"definition":"To make (someone) become devoted to a given thing or activity; to cause to be addicted."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a biochemical addiction."},{"definition":"Devoted to or obsessed with something."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈdɪktɪd/"}]},{"word":"FLASHLIGHT","idx":15770,"count":2386453,"meanings":[{"definitions":[{"definition":"A battery-powered hand-held light source."},{"definition":"A flashgun (device used to create flashes of light for photography)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To illuminate with a flashlight."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈflæʃˌlaɪt/"}]},{"word":"DISAPPOINTING","idx":15771,"count":2386364,"meanings":[{"definitions":[{"definition":"To sadden or displease (someone) by underperforming, or by not delivering something promised or hoped for.","example":"His lack of respect disappointed her."},{"definition":"To deprive (someone of something expected or hoped for)."},{"definition":"To fail to meet (an expectation); to fail to fulfil (a hope)."},{"definition":"To show (an opinion, belief, etc.) to be mistaken."},{"definition":"To prevent (something planned or attempted)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Causing disappointment.","example":"disappointing results / news; a disappointing experience"}],"partOfSpeech":"j"}]},{"word":"EIGHTY","idx":15773,"count":2385976,"meanings":[{"definitions":[{"definition":"The cardinal number occurring after seventy-nine and before eighty-one, represented in Roman numerals as LXXX and in Arabic numerals as 80."}],"partOfSpeech":"nu"}],"phonetics":[{"audio":"eighty-us","text":"[ˈ(ʔ)eɪ̯ɾi]"}]},{"word":"STAGING","idx":15774,"count":2385972,"meanings":[{"definitions":[{"definition":"To produce on a stage, to perform a play.","example":"The local theater group will stage \"Pride and Prejudice\"."},{"definition":"To demonstrate in a deceptive manner.","example":"The salesman's demonstration of the new cleanser was staged to make it appear highly effective."},{"definition":"To orchestrate; to carry out.","example":"A protest will be staged in the public square on Monday."},{"definition":"To place in position to prepare for use.","example":"We staged the cars to be ready for the start, then waited for the starter to drop the flag."},{"definition":"To determine what stage (a disease, etc.) has progressed to"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A performance of a play"},{"definition":"The scenery and/or organization of actors' movements on stage."},{"definition":"(by extension) The arrangement or layout of something in order to create an impression."},{"definition":"The organization of something in order to prepare for or facilitate working with it."},{"definition":"A structure of posts and boards for supporting workmen, etc., as in building."},{"definition":"The act or process of putting on an event."},{"definition":"The business of running stagecoaches."},{"definition":"The act of journeying in stagecoaches."},{"definition":"The classification of a patient or tumor into its stage of cancer."}],"partOfSpeech":"n"}]},{"word":"UNLOCKED","idx":15775,"count":2385296,"meanings":[{"definitions":[{"definition":"To undo or open a lock or something locked by, for example, turning a key, or selecting a combination.","example":"I unlocked the door and walked in."},{"definition":"To obtain access to something.","example":"I unlocked the dictionary article so I could edit it."},{"definition":"To disclose or reveal previously unknown knowledge.","example":"The discovery of a clue unlocked the mystery."},{"definition":"To be or become unfastened or unrestrained."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not secured or protected by a lock.","example":"an unlocked computer file"},{"definition":"(of a phone) Not bound to any particular carrier.","example":"an unlocked iPhone"}],"partOfSpeech":"j"}]},{"word":"SCARCE","idx":15776,"count":2385219,"meanings":[{"definitions":[{"definition":"Uncommon, rare; difficult to find; insufficient to meet a demand."},{"definition":"Scantily supplied (with); deficient (in); used with of."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Scarcely, only just."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"scarce-us","text":"/ˈskɛɚs/"}]},{"word":"STATISTIC","idx":15777,"count":2384948,"meanings":[{"definitions":[{"definition":"A single item in a statistical study."},{"definition":"A quantity calculated from the data in a sample, which characterises an important aspect in the sample (such as mean or standard deviation)."},{"definition":"A person, or personal event, reduced to being an item of statistical information.","example":"By dying from an overdose, he became just another statistic."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to statistics."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"statistic-us"}]},{"word":"ROPES","idx":15779,"count":2384639,"meanings":[{"definitions":[{"definition":"Thick strings, yarn, monofilaments, metal wires, or strands of other cordage that are twisted together to form a stronger line.","example":"Nylon rope is usually stronger than similar rope made of plant fibers."},{"definition":"An individual length of such material.","example":"The swinging bridge is constructed of 40 logs and 30 ropes."},{"definition":"A cohesive strand of something.","example":"The duchess wore a rope of pearls to the soirée."},{"definition":"A continuous stream."},{"definition":"A hard line drive.","example":"He hit a rope past third and into the corner."},{"definition":"A long thin segment of soft clay, either extruded or formed by hand."},{"definition":"A data structure resembling a string, using a concatenation tree in which each leaf represents a character."},{"definition":"A unit of distance equivalent to the distance covered in six months by a god flying at ten million miles per second."},{"definition":"(jewelry) A necklace of at least 1 meter in length."},{"definition":"Cordage of at least 1 inch in diameter, or a length of such cordage."},{"definition":"A unit of length equal to 20 feet."},{"definition":"Flunitrazepam, also known as Rohypnol."},{"definition":"A shot of semen that a man releases during ejaculation."},{"definition":"(in the plural) The small intestines.","example":"the ropes of birds"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tie (something) with rope.","example":"The robber roped the victims."},{"definition":"To throw a rope (or something similar, e.g. a lasso, cable, wire, etc.) around (something).","example":"The cowboy roped the calf."},{"definition":"To be formed into rope; to draw out or extend into a filament or thread."},{"definition":"To commit suicide.","example":"My life is a mess; I might as well rope."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ropes-us","text":"/ɹoʊps/"}]},{"word":"SPIDERS","idx":15781,"count":2384288,"meanings":[{"definitions":[{"definition":"Any of various eight-legged, predatory arthropods, of the order Araneae, most of which spin webs to catch prey."},{"definition":"A program which follows links on the World Wide Web in order to gather information."},{"definition":"A float (drink) made by mixing ice-cream and a soda or fizzy drink (such as lemonade).","example":"2002, Katharine Gasparini, Cranberry and vanilla ice cream spider, recipe in Cool Food, page 339."},{"definition":"An alcoholic drink made with brandy and lemonade or ginger beer."},{"definition":"A spindly person."},{"definition":"A man who persistently approaches or accosts a woman in a public social setting, particularly in a bar."},{"definition":"A stick with a convex arch-shaped notched head used to support the cue when the cue ball is out of reach at normal extension; a bridge."},{"definition":"A cast-iron frying pan with three legs, once common in open-hearth cookery."},{"definition":"Implement for moving food in and out of hot oil for deep frying, with a circular metal mesh attached to a long handle; a spider skimmer"},{"definition":"A part of a crank, to which the chainrings are attached."},{"definition":"Heroin (street drug)."},{"definition":"Part of a resonator instrument that transmits string vibrations from the bridge to a resonator cone at multiple points."},{"definition":"A skeleton or frame with radiating arms or members, often connected by crosspieces, such as a casting forming the hub and spokes to which the rim of a fly wheel or large gear is bolted; the body of a piston head; or a frame for strengthening a core or mould for a casting."},{"definition":"(fly fishing) a soft-hackle fly"},{"definition":"The network of wires separating the areas of a dartboard"},{"definition":"A spider graph or spider tree"},{"definition":"A type of light phaeton."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move like a spider."},{"definition":"To cover a surface like a cobweb."},{"definition":"(of a computer program) To follow links on the World Wide Web in order to gather information.","example":"The online dictionary is regularly spidered by search engines."}],"partOfSpeech":"ve"}]},{"word":"OBEDIENCE","idx":15782,"count":2384233,"meanings":[{"definitions":[{"definition":"The quality of being obedient.","example":"Obedience is essential in any army."},{"definition":"The collective body of persons subject to any particular authority."},{"definition":"A written instruction from the superior of an order to those under him."},{"definition":"Any official position under an abbot's jurisdiction."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"obedience-us"},{"text":"/ə(ʊ)ˈbiːdɪəns/"}]},{"word":"PLAGUE","idx":15783,"count":2383845,"meanings":[{"definitions":[{"definition":"(often used with the, sometimes capitalized: the Plague) The bubonic plague, the pestilent disease caused by the virulent bacterium Yersinia pestis."},{"definition":"An epidemic or pandemic caused by any pestilence, but specifically by the above disease."},{"definition":"A widespread affliction, calamity or destructive influx, especially when seen as divine retribution.","example":"Ten Biblical plagues over Egypt, ranging from locusts to the death of the crown prince, finally forced Pharaoh to let Moses's people go."},{"definition":"A grave nuisance, whatever greatly irritates.","example":"Bart is an utter plague; his pranks never cease."},{"definition":"Collective noun for common grackles"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To harass, pester or annoy someone persistently or incessantly."},{"definition":"To afflict with a disease or other calamity.","example":"Natural catastrophes plagued the colonists till they abandoned the pestilent marshland."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plague-us","text":"/pleɪɡ/"}]},{"word":"DILUTED","idx":15784,"count":2383641,"meanings":[{"definitions":[{"definition":"To make thinner by adding solvent to a solution, especially by adding water."},{"definition":"To weaken, especially by adding a foreign substance."},{"definition":"To cause the value of individual shares or the stake of a shareholder to decrease by increasing the total number of shares."},{"definition":"To become attenuated, thin, or weak.","example":"It dilutes easily."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has had something added in order to dilute it.","example":"diluted orange juice"}],"partOfSpeech":"j"}]},{"word":"CANINE","idx":15785,"count":2383411,"meanings":[{"definitions":[{"definition":"Any member of Caninae, the only living subfamily of Canidae."},{"definition":"Any of certain extant canids regarded as similar to the dog or wolf (including coyotes, jackals, etc.) but distinguished from the vulpines, which are regarded as fox-like."},{"definition":"In heterodont mammals, the pointy tooth between the incisors and the premolars; a cuspid."},{"definition":"A king and a nine as a starting hand in Texas hold 'em due to phonetic similarity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or pertaining to, a dog or dogs."},{"definition":"Dog-like."},{"definition":"Of or pertaining to mammalian teeth which are cuspids or fangs."},{"definition":"Of an appetite: depraved or inordinate; used to describe eating disorders."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kəˈnaɪn/"},{"audio":"canine-au"}]},{"word":"GLADLY","idx":15786,"count":2383400,"meanings":[{"definitions":[{"definition":"In a glad manner; happily."},{"definition":"Willingly; certainly.","example":"Gladly, thank you."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"gladly-us","text":"/ˈɡlædli/"}]},{"word":"SCHIZOPHRENIA","idx":15787,"count":2383269,"meanings":[{"definitions":[{"definition":"A psychiatric diagnosis denoting a persistent, often chronic, mental illness characterised by abnormal perception, thinking, behavior and emotion, often marked by delusions."},{"definition":"Any condition in which disparate or mutually exclusive activities coexist; a lack of decision between options."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"schizophrenia-us","text":"/ˌskɪt.səˈfɹiː.ni.ə/"}]},{"word":"BREWERY","idx":15788,"count":2383143,"meanings":[{"definitions":[{"definition":"A building where beer is produced."},{"definition":"A company that brews beer."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɹuːəɹi/"}]},{"word":"LINEAGE","idx":15789,"count":2382912,"meanings":[{"definitions":[{"definition":"Descent in a line from a common progenitor; progeny; descending line of offspring or ascending line of parentage."},{"definition":"A number of lines of text in a column."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɪ.ni.ɪdʒ/"}]},{"word":"BREW","idx":15791,"count":2382584,"meanings":[{"definitions":[{"definition":"The mixture formed by brewing; that which is brewed; a brewage, such as a cup of tea or a brewed beer."},{"definition":"A beer."},{"definition":"A hill or overhanging cliff."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make tea or coffee by mixing tea leaves or coffee beans with hot water."},{"definition":"To heat wine, infusing it with spices; to mull."},{"definition":"To make a hot soup by combining ingredients and boiling them in water."},{"definition":"To make beer by steeping a starch source in water and fermenting the resulting sweet liquid with yeast."},{"definition":"To foment or prepare, as by brewing"},{"definition":"To attend to the business, or go through the processes, of brewing or making beer."},{"definition":"(of an unwelcome event) To be in a state of preparation; to be mixing, forming, or gathering."},{"definition":"To boil or seethe; to cook."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"brew-1-us","text":"/bɹuː/"}]},{"word":"KERN","idx":15793,"count":2382522,"meanings":[{"definitions":[{"definition":"A corn; grain; kernel."},{"definition":"The last handful or sheaf reaped at the harvest."},{"definition":"The harvest home."},{"definition":"Any part of a letter which extends into the space used by another letter."},{"definition":"A light-armed foot soldier of the ancient militia of Ireland and Scotland; in archaic contexts often used as a term of contempt."},{"definition":"A boor; a low person."},{"definition":"An idler; a vagabond."},{"definition":"A mill for grinding corn, especially a hand-mill made of two circular stones."},{"definition":"A churn."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(chiefly proportional font printing) To adjust the horizontal space between selected pairs of letters (characters or glyphs); to perform such adjustments to a portion of text, according to preset rules."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"kern-uk","text":"/kɜːn/"}]},{"word":"COUP","idx":15795,"count":2382274,"meanings":[{"definitions":[{"definition":"A quick, brilliant, and highly successful act."},{"definition":"(of Native Americans) A blow against an enemy delivered in a way that shows bravery."},{"definition":"A coup d'état."},{"definition":"(by extension) A takeover of one group by another."},{"definition":"A single roll of the wheel at roulette, or a deal in rouge et noir."},{"definition":"One of various named strategies employed by the declarer to win more tricks, such as the Bath coup."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a coup."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ku/"},{"text":"/kuː/"}]},{"word":"MORSE","idx":15797,"count":2382036,"meanings":[{"definitions":[{"definition":"A clasp or fastening used to fasten a cope in the front, usually decorative."},{"definition":"A walrus."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mɔːs/"}]},{"word":"DOMINANCE","idx":15798,"count":2381788,"meanings":[{"definitions":[{"definition":"The state of being dominant; of prime importance; supremacy."},{"definition":"Being in a position of power, authority or ascendancy over others."},{"definition":"The superior development of or preference for one side of the body or one of a pair of organs; such as being right-handed."},{"definition":"The property of a gene such that it suppresses the expression of its allele."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɑːmɪnəns/"},{"text":"/ˈdɒmɪnəns/"}]},{"word":"PREDATORS","idx":15799,"count":2381273,"meanings":[{"definitions":[{"definition":"Any animal or other organism that hunts and kills other organisms (their prey), primarily for food."},{"definition":"Someone who attacks and plunders for gain."},{"definition":"A sexual predator."}],"partOfSpeech":"n"}]},{"word":"PISTON","idx":15800,"count":2381202,"meanings":[{"definitions":[{"definition":"A solid disk or cylinder that fits inside a hollow cylinder, and moves under pressure (as in an engine) or displaces fluid (as in a pump)"},{"definition":"A valve device in some brass instruments for changing the pitch"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move up and down like a piston."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"piston-us","text":"/ˈpɪstən/"}]},{"word":"CORDS","idx":15802,"count":2380982,"meanings":[{"definitions":[{"definition":"A harmonic set of three or more notes that is heard as if sounding simultaneously."},{"definition":"A straight line between two points of a curve."},{"definition":"A horizontal member of a truss."},{"definition":"The distance between the leading and trailing edge of a wing, measured in the direction of the normal airflow."},{"definition":"An imaginary line from the luff of a sail to its leech."},{"definition":"A keyboard shortcut that involves two or more distinct keypresses, such as Ctrl+M followed by P."},{"definition":"The string of a musical instrument."},{"definition":"A cord."},{"definition":"An edge that is not part of a cycle but connects two vertices of the cycle."},{"definition":"A long, thin, flexible length of twisted yarns (strands) of fiber (rope, for example); (uncountable) such a length of twisted strands considered as a commodity.","example":"He looped some cord around his fingers."},{"definition":"A small flexible electrical conductor composed of wires insulated separately or in bundles and assembled together usually with an outer cover; the electrical cord of a lamp, sweeper ((US) vacuum cleaner), or other appliance."},{"definition":"A unit of measurement for firewood, equal to 128 cubic feet (4 × 4 × 8 feet), composed of logs and/or split logs four feet long and none over eight inches diameter. It is usually seen as a stack four feet high by eight feet long."},{"definition":"Any influence by which persons are caught, held, or drawn, as if by a cord."},{"definition":"Any structure having the appearance of a cord, especially a tendon or nerve.","example":"spermatic cord; spinal cord; umbilical cord; vocal cords"},{"definition":"Corduroys."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To furnish with cords"},{"definition":"To tie or fasten with cords"},{"definition":"To flatten a book during binding"},{"definition":"To arrange (wood, etc.) in a pile for measurement by the cord."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cords-us","text":"/kɔɹdz/"}]},{"word":"REVISITED","idx":15804,"count":2380826,"meanings":[{"definitions":[{"definition":"To visit again."},{"definition":"To reconsider or re-experience something."}],"partOfSpeech":"ve"}]},{"word":"SEALING","idx":15806,"count":2380108,"meanings":[{"definitions":[{"definition":"To hunt seals.","example":"They're organizing a protest against sealing."},{"definition":"To place a seal on (a document)."},{"definition":"To mark with a stamp, as an evidence of standard exactness, legal size, or merchantable quality.","example":"to seal silverware"},{"definition":"To fasten (something) so that it cannot be opened without visible damage.","example":"The cover is sealed. If anyone tries to open it, we'll know about it."},{"definition":"To prevent people or vehicles from crossing (something).","example":"The border has been sealed until the fugitives are found."},{"definition":"To close securely to prevent leakage.","example":"I've sealed the bottle to keep the contents fresh."},{"definition":"To place in a sealed container.","example":"I've sealed the documents in this envelope."},{"definition":"To place a notation of one's next move in a sealed envelope to be opened after an adjournment.","example":"After thinking for half an hour, the champion sealed his move."},{"definition":"To guarantee.","example":"The last-minute goal sealed United’s win."},{"definition":"To fix, as a piece of iron in a wall, with cement or plaster, etc."},{"definition":"To close by means of a seal.","example":"to seal a drainpipe with water"},{"definition":"To confirm or set apart as a second or additional wife."},{"definition":"To tie up animals (especially cattle) in their stalls."},{"definition":"To hunt seals.","example":"They're organizing a protest against sealing."},{"definition":"To place a seal on (a document)."},{"definition":"To mark with a stamp, as an evidence of standard exactness, legal size, or merchantable quality.","example":"to seal silverware"},{"definition":"To fasten (something) so that it cannot be opened without visible damage.","example":"The cover is sealed. If anyone tries to open it, we'll know about it."},{"definition":"To prevent people or vehicles from crossing (something).","example":"The border has been sealed until the fugitives are found."},{"definition":"To close securely to prevent leakage.","example":"I've sealed the bottle to keep the contents fresh."},{"definition":"To place in a sealed container.","example":"I've sealed the documents in this envelope."},{"definition":"To place a notation of one's next move in a sealed envelope to be opened after an adjournment.","example":"After thinking for half an hour, the champion sealed his move."},{"definition":"To guarantee.","example":"The last-minute goal sealed United’s win."},{"definition":"To fix, as a piece of iron in a wall, with cement or plaster, etc."},{"definition":"To close by means of a seal.","example":"to seal a drainpipe with water"},{"definition":"To confirm or set apart as a second or additional wife."},{"definition":"To tie up animals (especially cattle) in their stalls."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Action of the verb to seal in any sense."},{"definition":"Hunting of seals (the animals)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Used for closing securely."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsiːlɪŋ/"}]},{"word":"TOPPED","idx":15807,"count":2379955,"meanings":[{"definitions":[{"definition":"To cover on the top or with a top.","example":"I like my ice cream topped with chocolate sauce."},{"definition":"To cut or remove the top (as of a tree)","example":"I don't want to be bald, so just top my hair."},{"definition":"To excel, to surpass, to beat.","example":"Titanic was the most successful film ever until it was topped by another Cameron film, Avatar."},{"definition":"To be in the lead, to be at number one position (of).","example":"Celine Dion topped the UK music charts twice in the 1990s."},{"definition":"To commit suicide.","example":"Depression causes many people to top themselves."},{"definition":"To murder."},{"definition":"(BDSM) To be the dominant partner in a BDSM relationship or roleplay.","example":"Giving advice to the dominant partner on how to run the BDSM session is called \"topping from the bottom\"."},{"definition":"(gay sexuality) To be the partner who penetrates in anal sex."},{"definition":"(gay sexuality) To anally penetrate."},{"definition":"To rise aloft; to be eminent; to tower.","example":"lofty ridges and topping mountains"},{"definition":"To predominate.","example":"topping passions"},{"definition":"To excel; to rise above others."},{"definition":"To raise one end of (a yard, etc.), making it higher than the other."},{"definition":"(dyeing) To cover with another dye.","example":"to top aniline black with methyl violet to prevent greening"},{"definition":"To put a stiffening piece or back on (a saw blade)."},{"definition":"To arrange (fruit, etc.) with the best on top."},{"definition":"(of a horse) To strike the top of (an obstacle) with the hind feet while jumping, so as to gain new impetus."},{"definition":"To improve (domestic animals, especially sheep) by crossing certain individuals or breeds with other superior breeds."},{"definition":"To cut, break, or otherwise take off the top of (a steel ingot) to remove unsound metal."},{"definition":"To strike (the ball) above the centre; also, to make (a stroke, etc.) by hitting the ball in this way."}],"partOfSpeech":"ve"}]},{"word":"ADHESIVES","idx":15808,"count":2379922,"meanings":[{"definitions":[{"definition":"A substance, such as glue, that provides or promotes adhesion"}],"partOfSpeech":"n"}]},{"word":"RAG","idx":15809,"count":2379816,"meanings":[{"definitions":[{"definition":"(in the plural) Tattered clothes."},{"definition":"A piece of old cloth; a tattered piece of cloth; a shred, a tatter."},{"definition":"A shabby, beggarly fellow; a ragamuffin."},{"definition":"A ragged edge in metalworking."},{"definition":"A sail, or any piece of canvas."},{"definition":"A newspaper, magazine."},{"definition":"A poor, low-ranking kicker.","example":"I have ace-four on my hand. In other words, I have ace-rag."},{"definition":"A coarse kind of rock, somewhat cellular in texture; ragstone."},{"definition":"A prank or practical joke."},{"definition":"A society run by university students for the purpose of charitable fundraising."},{"definition":"An informal dance party featuring music played by African-American string bands."},{"definition":"A ragtime song, dance or piece of music."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate (a wall, etc.) by applying paint with a rag."},{"definition":"To become tattered."},{"definition":"To break (ore) into lumps for sorting."},{"definition":"To cut or dress roughly, as a grindstone."},{"definition":"To scold or tell off; to torment; to banter."},{"definition":"To drive a car or another vehicle in a hard, fast or unsympathetic manner."},{"definition":"To tease or torment, especially at a university; to bully, to haze."},{"definition":"To play or compose (a piece, melody, etc.) in syncopated time."},{"definition":"To dance to ragtime music."},{"definition":"To add syncopation (to a tune) and thereby make it appropriate for a ragtime song."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rag-us","text":"/ɹæɡ/"}]},{"word":"DESPAIR","idx":15810,"count":2379553,"meanings":[{"definitions":[{"definition":"Loss of hope; utter hopelessness; complete despondency.","example":"He turned around in despair, aware that he was not going to survive"},{"definition":"That which causes despair."},{"definition":"That which is despaired of."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give up as beyond hope or expectation; to despair of."},{"definition":"To cause to despair."},{"definition":"(often with “of”) To be hopeless; to have no hope; to give up all hope or expectation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"despair-us","text":"/dɪˈspɛəɹ/"}]},{"word":"INVENTORIES","idx":15811,"count":2379122,"meanings":[{"definitions":[{"definition":"(operations) The stock of an item on hand at a particular location or business.","example":"Due to an undersized inventory at the Boston outlet, customers had to travel to Providence to find the item."},{"definition":"(operations) A detailed list of all of the items on hand.","example":"The inventory included several items that one wouldn't normally think to find at a cheese shop."},{"definition":"(operations) The process of producing or updating such a list.","example":"This month's inventory took nearly three days."},{"definition":"A space containing the items available to a character for immediate use.","example":"You can't get through the underground tunnel if there are more than three items in your inventory."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(operations) To take stock of the resources or items on hand; to produce an inventory.","example":"The main job of the night shift was to inventory the store, and restock when necessary."}],"partOfSpeech":"ve"}]},{"word":"FORE","idx":15812,"count":2378954,"meanings":[{"definitions":[{"definition":"The front; the forward part of something; the foreground.","example":"The fore was painted white."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Former; occurring earlier (in some order); previous.","example":"the fore part of the day"},{"definition":"Forward; situated towards the front (of something).","example":"the fore end of a wagon"}],"partOfSpeech":"j"},{"definitions":[{"definition":"In the part that precedes or goes first; opposed to aft, after, back, behind, etc."},{"definition":"Formerly; previously; afore."},{"definition":"In or towards the bows of a ship."}],"partOfSpeech":"v"},{"definitions":[{"definition":"An exclamation yelled to inform players a ball is moving in their direction."}],"partOfSpeech":"i"},{"definitions":[{"definition":"To go, travel.","example":"Behold! A knight fares forth."},{"definition":"To get along, succeed (well or badly); to be in any state, or pass through any experience, good or bad; to be attended with any circumstances or train of events."},{"definition":"To eat, dine."},{"definition":"To happen well, or ill.","example":"We shall see how it will fare with him."},{"definition":"To move along; proceed; progress; advance","example":"We will continue to monitor how the hurricane fares against projected models."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fore-us","text":"/fɔɹ/"}]},{"word":"ABSORB","idx":15815,"count":2378096,"meanings":[{"definitions":[{"definition":"To include so that it no longer has separate existence; to overwhelm; to cause to disappear as if by swallowing up; to incorporate; to assimilate; to take in and use up."},{"definition":"To engulf, as in water; to swallow up."},{"definition":"To suck up; to drink in; to imbibe, like a sponge or as the lacteals of the body; to chemically take in."},{"definition":"To take in energy and convert it, as","example":"Heat, light, and electricity are absorbed in the substances into which they pass."},{"definition":"To engross or engage wholly; to occupy fully"},{"definition":"To occupy or consume time."},{"definition":"Assimilate mentally."},{"definition":"To assume or pay for as part of a commercial transaction."},{"definition":"To defray the costs."},{"definition":"To accept or purchase in quantity."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"absorb-us","text":"/æbˈsɔɹb/"}]},{"word":"INJECTED","idx":15816,"count":2378069,"meanings":[{"definitions":[{"definition":"To push or pump (something, especially fluids) into a cavity or passage.","example":"The nurse injected a painkilling drug into the veins of my forearm."},{"definition":"To introduce (something) suddenly or violently.","example":"Punk injected a much-needed sense of urgency into the British music scene."},{"definition":"To administer an injection to (someone or something), especially of medicine or drugs.","example":"Now lie back while we inject you with the anesthetic."},{"definition":"To take or be administered something by means of injection, especially medicine or drugs.","example":"It's been a week since I stopped injecting, and I'm still in withdrawal."},{"definition":"To introduce (code) into an existing program or its memory space, often without tight integration and sometimes through a security vulnerability."},{"definition":"To cast or throw; used with on."}],"partOfSpeech":"ve"}]},{"word":"ALPS","idx":15817,"count":2377380,"meanings":[{"definitions":[{"definition":"A very high mountain. Specifically, one of the Alps, the highest chain of mountains in Europe."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ælps/"}]},{"word":"COMMODORE","idx":15818,"count":2377211,"meanings":[{"definitions":[{"definition":"A naval officer holding a rank between captain and rear admiral."},{"definition":"A (temporary) commander over a collection of ships who is not an admiral."},{"definition":"The leading ship in a fleet of merchantmen."},{"definition":"The president of a yacht club."},{"definition":"A yacht-club president's vessel in a regatta."},{"definition":"A commodore admiral."},{"definition":"A rear admiral (lower half)."},{"definition":"Any of various nymphalid butterflies of the Asian genus Parasarpa."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"commodore-us","text":"/ˈkɑmədɔɹ/"}]},{"word":"DUMPING","idx":15819,"count":2377175,"meanings":[{"definitions":[{"definition":"To release, especially in large quantities and chaotic manner."},{"definition":"To discard; to get rid of something one does not want anymore."},{"definition":"To sell below cost or very cheaply; to engage in dumping."},{"definition":"To copy data from a system to another place or system, usually in order to archive it."},{"definition":"To output the contents of storage or a data structure, often in order to diagnose a bug."},{"definition":"To end a relationship with."},{"definition":"To knock heavily; to stump."},{"definition":"To put or throw down with more or less of violence; hence, to unload from a cart by tilting it","example":"We dumped the coal onto the fireplace."},{"definition":"To precipitate (especially snow) heavily."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The disposal of something no longer needed, or of no value."},{"definition":"Selling goods at less than their normal price, especially in the export market as a means of securing a monopoly."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʌmpɪŋ/"}]},{"word":"ENLISTED","idx":15820,"count":2376750,"meanings":[{"definitions":[{"definition":"To enter on a list; to enroll; to register."},{"definition":"To join a cause or organization, especially military service.","example":"The army wants potential soldiers to enlist."},{"definition":"To recruit the aid or membership of others.","example":"We enlisted fifty new members."},{"definition":"To secure; to obtain.","example":"They enlisted the government's support."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Those individuals who have enlisted in the military and who are not commissioned officers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Belonging to the military, but not as a commissioned officer."}],"partOfSpeech":"j"}]},{"word":"PROPHETS","idx":15821,"count":2376749,"meanings":[{"definitions":[{"definition":"Someone who speaks by divine inspiration.","example":"Muslims believe that Muhammad was the final prophet sent to mankind."},{"definition":"Someone who predicts the future; a soothsayer."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɹɑfɪts/"},{"text":"/ˈpɹɒfɪts/"}]},{"word":"OW","idx":15822,"count":2376433,"meanings":[{"definitions":[{"definition":"An expression of one's own physical pain.","example":"Ouch! You stepped on my toe! That hurt!"},{"definition":"An expression in sympathy at another's pain.","example":"Ouch! Her sunburn looks awful."},{"definition":"A reply to an insult seen as savage (frequently one that is tongue-in-cheek or joking).","example":"Ouch. How could you say that?"},{"definition":"An expression of disappointment.","example":"Ouch, I really wanted to do that."},{"definition":"Expressing surprise at the high price of something.","example":"Ouch, one hundred thousand dollars for a car! I could never afford that!"},{"definition":"Used for emotional emphasis."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"ow-us","text":"/ˈaʊ/"}]},{"word":"WAREZ","idx":15825,"count":2375829,"meanings":[{"definitions":[{"definition":"(leet) Software that is illegally obtained or distributed.","example":"Hey dude, I've got some cool new warez!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(leet) To obtain a copy of (software or other works of authorship) illegally."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"warez-us"}]},{"word":"SUPERNATURAL","idx":15826,"count":2374979,"meanings":[{"definitions":[{"definition":"A supernatural being"},{"definition":"Supernatural beings and events collectively (when used with definite article: \"the supernatural\")"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Above nature; beyond or added to nature, often so considered because it is given by a deity or some force beyond that which humans are born with.","example":"Stephen King's first novel is about a girl named Carrie dealing with supernatural powers."},{"definition":"Not of the usual; not natural; altered by forces that are not understood fully if at all.","example":"The house is haunted by supernatural forces."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"supernatural-us","text":"/ˌs(j)uːpɚˈnætʃɚəl/"}]},{"word":"OVERLOOKED","idx":15827,"count":2374946,"meanings":[{"definitions":[{"definition":"To offer a view (of something) from a higher position.","example":"Our hotel room overlooks the lake."},{"definition":"To fail to notice; to look over and beyond (anything) without seeing it.","example":"These errors were overlooked by the proofreaders."},{"definition":"To pretend not to have noticed (something, especially a mistake or flaw); to pass over (something) without censure or punishment.","example":"I’m not willing to overlook such bad behaviour."},{"definition":"To look down upon (something) from a place that is over or above.","example":"to overlook a valley from a hill"},{"definition":"To supervise, oversee; to watch over.","example":"to overlook a gang of laborers"},{"definition":"To observe or watch (someone or something) surreptitiously or secretly."},{"definition":"To inspect (something); to examine; to look over carefully or repeatedly."},{"definition":"To look upon with an evil eye; to bewitch by looking upon; to fascinate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Missed, unnoticed."}],"partOfSpeech":"j"}]},{"word":"MAGENTA","idx":15828,"count":2374461,"meanings":[{"definitions":[{"definition":"A vibrant light purple, purplish-red, reddish-purple, or pinkish purple colour obtained by mixing red and blue light (thus a secondary colour), but primary in the CMYK colour system used in printing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the colour of fuchsia, fuchsine, light purple."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/məˈdʒɛntə/"}]},{"word":"TAGGING","idx":15829,"count":2374392,"meanings":[{"definitions":[{"definition":"To label (something)."},{"definition":"(graffiti) To mark (something) with one’s tag."},{"definition":"To remove dung tags from a sheep.","example":"Regularly tag the rear ends of your sheep."},{"definition":"To hit the ball hard.","example":"He really tagged that ball."},{"definition":"To put a runner out by touching them with the ball or the ball in a gloved hand.","example":"He tagged the runner for the out."},{"definition":"To mark with a tag (metadata for classification).","example":"I am tagging my music files by artist and genre."},{"definition":"To follow closely, accompany, tag along."},{"definition":"To catch and touch (a player in the game of tag)."},{"definition":"To fit with, or as if with, a tag or tags."},{"definition":"To fasten; to attach."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is tagged."}],"partOfSpeech":"n"}]},{"word":"DITCH","idx":15830,"count":2373753,"meanings":[{"definitions":[{"definition":"A trench; a long, shallow indentation, as for irrigation or drainage.","example":"Digging ditches has long been considered one of the most demanding forms of manual labor."},{"definition":"Dirt ingrained on the hands, or in cracks, crevices, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To discard or abandon.","example":"Once the sun came out we ditched our rain-gear and started a campfire."},{"definition":"To deliberately crash-land an airplane on water.","example":"When the second engine failed, the pilot was forced to ditch; their last location was just south of the Azores."},{"definition":"To deliberately not attend classes; to play hookey.","example":"The truant officer caught Louise ditching with her friends, and her parents were forced to pay a fine."},{"definition":"To dig ditches.","example":"Enclosure led to fuller winter employment in hedging and ditching."},{"definition":"To dig ditches around.","example":"The soldiers ditched the tent to prevent flooding."},{"definition":"To throw into a ditch.","example":"The engine was ditched and turned on its side."},{"definition":"To smear, daub, plaster, or impregnate, especially with dirt which becomes hard and ingrained."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ditch-us","text":"/dɪtʃ/"}]},{"word":"FEARED","idx":15831,"count":2373625,"meanings":[{"definitions":[{"definition":"To feel fear about (something or someone); to be afraid of; to consider or expect with alarm.","example":"I fear the worst will happen."},{"definition":"To feel fear (about something).","example":"Never fear; help is always near."},{"definition":"(used with for) To worry about, to feel concern for, to be afraid for.","example":"She fears for her son’s safety."},{"definition":"To venerate; to feel awe towards.","example":"People who fear God can be found in Christian churches."},{"definition":"To regret.","example":"I fear I have bad news for you: your husband has died."},{"definition":"To cause fear to; to frighten."},{"definition":"To be anxious or solicitous for."},{"definition":"To suspect; to doubt."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pertaining to someone or thing that causes great fear in others."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"feared-us","text":"/fɪɹd/"}]},{"word":"PRELUDE","idx":15832,"count":2373600,"meanings":[{"definitions":[{"definition":"An introductory or preliminary performance or event."},{"definition":"A short, free-form piece of music, originally one serving as an introduction to a longer and more complex piece; later, starting with the Romantic period, generally a stand-alone piece."},{"definition":"A standard module or library of subroutines and functions to be imported, generally by default, into a program."},{"definition":"A forerunner to anything."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To introduce something, as a prelude."},{"definition":"To play an introduction or prelude; to give a prefatory performance."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prelude-us","text":"/ˈpɹeɪl(j)uːd/"}]},{"word":"SLICK","idx":15834,"count":2372634,"meanings":[{"definitions":[{"definition":"A covering of liquid, particularly oil.","example":"Careful in turn three — there's an oil slick on the road."},{"definition":"Someone who is clever and untrustworthy."},{"definition":"A tool used to make something smooth or even."},{"definition":"A tire with a smooth surface instead of a tread pattern, often used in auto racing.","example":"You'll go much faster if you put on slicks."},{"definition":"A helicopter."},{"definition":"A camera-ready image to be used by a printer. The \"slick\" is photographed to produce a negative image which is then used to burn a positive offset plate or other printing device.","example":"The project was delayed because the slick had not been delivered to the printer."},{"definition":"A wide paring chisel used in joinery."},{"definition":"The finer portion of crushed ore, as of gold, lead, or tin, separated by the water in certain wet processes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make slick.","example":"The surface had been slicked."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Slippery or smooth due to a covering of liquid; often used to describe appearances.","example":"His large round head was shaved slick."},{"definition":"Appearing expensive or sophisticated.","example":"They read all kinds of slick magazines."},{"definition":"Superficially convincing but actually untrustworthy.","example":"That new sales rep is slick. Be sure to read the fine print before you buy anything."},{"definition":"(often used sarcastically) Clever, making an apparently hard task easy.","example":"Our new process for extracting needles from haystacks is extremely slick."},{"definition":"Extraordinarily great or special.","example":"That is one slick bicycle: it has all sorts of features!"},{"definition":"Sleek; smooth"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"slick-au","text":"/slɪk/"}]},{"word":"OVERLY","idx":15835,"count":2372522,"meanings":[{"definitions":[{"definition":"Superficial; not thorough; careless, negligent, inattentive."},{"definition":"Having a sense of superiority, haughty."},{"definition":"Excessive; too great."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To an excessive degree.","example":"Parents can be overly protective of their children."},{"definition":"Superficially."},{"definition":"Carelessly, without due attention."},{"definition":"With a sense of superiority, haughtily."}],"partOfSpeech":"v"}]},{"word":"LIMESTONE","idx":15836,"count":2372437,"meanings":[{"definitions":[{"definition":"An abundant rock of marine and fresh-water sediments; primarily composed of calcite (CaCO3); it occurs in a variety of forms, both crystalline and amorphous."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Made of or with limestone."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈlaɪmstoʊn/"},{"text":"/ˈlaɪmstəʊn/"}]},{"word":"TRIGGERS","idx":15837,"count":2372243,"meanings":[{"definitions":[{"definition":"A finger-operated lever used to fire a gun.","example":"Just pull the trigger."},{"definition":"A similar device used to activate any mechanism."},{"definition":"An event that initiates others, or incites a response.","example":"Sleeping in an unfamiliar room can be a trigger for sleepwalking."},{"definition":"A concept or image that upsets somebody.","example":"I can't watch that violent film. Blood is one of my triggers."},{"definition":"An event, experience or other stimulus that initiates a traumatic memory or action in a person."},{"definition":"An electronic transducer allowing a drum, cymbal, etc. to control an electronic drum unit or similar device."},{"definition":"A device that manually lengthens (or sometimes shortens) the slide or tubing of a brass instrument, allowing the pitch range to be altered while playing."},{"definition":"A pulse in an electronic circuit that initiates some component."},{"definition":"An SQL procedure that may be initiated when a record is inserted, updated or deleted; typically used to maintain referential integrity."},{"definition":"A text string that, when received by a player, will cause the player to execute a certain command."},{"definition":"A catch to hold the wheel of a carriage on a declivity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fire a weapon."},{"definition":"To initiate something.","example":"The controversial article triggered a deluge of angry letters from readers."},{"definition":"To spark a response, especially a negative emotional response, in (someone).","example":"This story contains a rape scene and may be triggering for rape victims."},{"definition":"To activate; to become active."}],"partOfSpeech":"ve"}]},{"word":"COMMENTARIES","idx":15838,"count":2372211,"meanings":[{"definitions":[{"definition":"A series of comments or annotations; especially, a book of explanations or expositions on the whole or a part of some other work"},{"definition":"(usually in the plural) a brief account of transactions or events written hastily, as if for a memorandum","example":"Caesar's Commentaries on the Gallic War"},{"definition":"An oral relation of an event, especially broadcast by television or radio, as it occurs","example":"We listened to the football commentary while watching the match."}],"partOfSpeech":"n"}]},{"word":"CONSTRUCTS","idx":15839,"count":2372108,"meanings":[{"definitions":[{"definition":"Something constructed from parts.","example":"Loops and conditional statements are constructs in computer programming."},{"definition":"A concept or model.","example":"Bohr's theoretical construct of the atom was soon superseded by quantum mechanics."},{"definition":"(genetics) A segment of nucleic acid, created artificially, for transplantation into a target cell or tissue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To build or form (something) by assembling parts.","example":"We constructed the radio from spares."},{"definition":"To build (a sentence, an argument, etc.) by arranging words or ideas.","example":"A sentence may be constructed with a subject, verb and object."},{"definition":"To draw (a geometric figure) by following precise specifications and using geometric tools and techniques.","example":"Construct a circle that touches each vertex of the given triangle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"constructs"}]},{"word":"IMPEDANCE","idx":15840,"count":2372086,"meanings":[{"definitions":[{"definition":"The act of impeding; that which impedes; a hindrance."},{"definition":"A measure of the opposition to the flow of an alternating current in a circuit; the aggregation of its resistance, and inductive and capacitive reactances; the ratio of voltage to current treated as complex quantities."},{"definition":"A quantity analogous to electrical impedance in some other energy domain"},{"definition":"(by analogy, usually with “mismatch”) a measure of the opposition caused by differences between two paradigms, especially between object-oriented development and relational databases"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪmˈpiːdn̩s/"}]},{"word":"DRAGONFLY","idx":15841,"count":2371854,"meanings":[{"definitions":[{"definition":"An insect of the suborder Epiprocta or, more strictly, the infraorder Anisoptera, having four long transparent wings held perpendicular to a long body when perched."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dragonfly-us","text":"/ˈdɹæɡənˌflaɪ/"}]},{"word":"MANPOWER","idx":15842,"count":2371829,"meanings":[{"definitions":[{"definition":"The total number of all available workers; the workforce."},{"definition":"The power exerted by a single person (analogous to horsepower.)"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"manpower-us"}]},{"word":"CHUNK","idx":15845,"count":2371231,"meanings":[{"definitions":[{"definition":"A part of something that has been separated.","example":"The statue broke into chunks."},{"definition":"A representative portion of a substance, often large and irregular.","example":"a chunk of granite"},{"definition":"A sequence of two or more words that occur in language with high frequency but are not idiomatic; a bundle or cluster.","example":"examples of chunks would include \"in accordance with\", \"the results of\", and \"so far\""},{"definition":"A discrete segment of a file, stream, etc. (especially one that represents audiovisual media); a block."},{"definition":"A segment of a comedian's performance"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To break into large pieces or chunks."},{"definition":"To break down (language, etc.) into conceptual pieces of manageable size."},{"definition":"To throw."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chunk-us","text":"/t͡ʃʌŋk/"}]},{"word":"REELS","idx":15846,"count":2371017,"meanings":[{"definitions":[{"definition":"A shaky or unsteady gait."},{"definition":"A lively dance originating in Scotland; also, the music of this dance; often called a Scottish (or Scotch) reel."},{"definition":"A kind of spool, turning on an axis, on which yarn, threads, lines, or the like, are wound.","example":"a garden reel"},{"definition":"A machine on which yarn is wound and measured into lays and hanks, —-- for cotton or linen it is fifty-four inches in circuit; for worsted, thirty inches."},{"definition":"A device consisting of radial arms with horizontal stats, connected with a harvesting machine, for holding the stalks of grain in position to be cut by the knives."},{"definition":"A short compilation of sample film work used as a demonstrative resume in the entertainment industry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wind on a reel."},{"definition":"To spin or revolve repeatedly."},{"definition":"To unwind, to bring or acquire something by spinning or winding something else.","example":"He reeled off some tape from the roll and sealed the package."},{"definition":"To walk shakily or unsteadily; to stagger; move as if drunk or not in control of oneself."},{"definition":"(with back) To back off or step away unsteadily and quickly.","example":"He reeled back from the punch."},{"definition":"To make or cause to reel."},{"definition":"To have a whirling sensation; to be giddy."},{"definition":"To be in shock."},{"definition":"To roll."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːlz/"}]},{"word":"LOB","idx":15847,"count":2370806,"meanings":[{"definitions":[{"definition":"(ball sports) A pass or stroke which arches high into the air.","example":"The guard launched a desperate lob over the outstretched arms of the defender."},{"definition":"A lump."},{"definition":"A country bumpkin; a yokel."},{"definition":"A clumsy person."},{"definition":"The person who comes last in a race."},{"definition":"A lobworm."},{"definition":"A fish, the European pollock."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw or hit a ball into the air in a high arch.","example":"The guard lobbed a pass just over the defender."},{"definition":"To throw."},{"definition":"To put, place","example":"Lob it in the pot."},{"definition":"To hit, kick, or throw a ball over another player in a game."},{"definition":"To let fall heavily or lazily."},{"definition":"To cob (chip off unwanted pieces of stone)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lob-uk","text":"/lɒb/"}]},{"word":"SLEPT","idx":15848,"count":2370802,"meanings":[{"definitions":[{"definition":"To rest in a state of reduced consciousness.","example":"You should sleep 8 hours a day."},{"definition":"(of a spinning top or yo-yo) To spin on its axis with no other perceptible motion."},{"definition":"To cause (a spinning top or yo-yo) to spin on its axis with no other perceptible motion."},{"definition":"To accommodate in beds.","example":"This caravan can sleep four people comfortably."},{"definition":"To be slumbering in (a state).","example":"to sleep a dreamless sleep"},{"definition":"To be careless, inattentive, or unconcerned; not to be vigilant; to live thoughtlessly."},{"definition":"To be dead; to lie in the grave."},{"definition":"To be, or appear to be, in repose; to be quiet; to be unemployed, unused, or unagitated; to rest; to lie dormant.","example":"a question sleeps for the present; the law sleeps"},{"definition":"To wait for a period of time without performing any action.","example":"After a failed connection attempt, the program sleeps for 5 seconds before trying again."},{"definition":"To place into a state of hibernation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slept-us","text":"/slɛpt/"}]},{"word":"BILLBOARD","idx":15852,"count":2369545,"meanings":[{"definitions":[{"definition":"A very large outdoor sign, generally used for advertising."},{"definition":"A flat surface, such as a panel or fence, on which bills are posted; a bulletin board."},{"definition":"A piece of thick plank, armed with iron plates, and fixed on the bow or fore-channels of a vessel, for the bill or fluke of the anchor to rest on."},{"definition":"A sprite that always faces the screen, no matter which direction it is looked at from."}],"partOfSpeech":"n"}]},{"word":"DRAFTED","idx":15853,"count":2369018,"meanings":[{"definitions":[{"definition":"To write a first version, make a preliminary sketch."},{"definition":"To draw in outline; to make a draught, sketch, or plan of, as in architectural and mechanical drawing."},{"definition":"To write a law."},{"definition":"To conscript a person, force a person to serve in some capacity, especially in the military.","example":"He was drafted during the Vietnam War."},{"definition":"To select someone (or something) for a particular role or purpose.","example":"There was a campaign to draft Smith to run for President."},{"definition":"To select and separate an animal or animals from a group.","example":"The calves were drafted from the cows."},{"definition":"To select a rookie player onto a professional sports team.","example":"After his last year of college football, he was drafted by the Miami Dolphins."},{"definition":"To follow very closely (behind another vehicle), thereby providing an aerodynamic advantage to both lead and follower and conserving energy or increasing speed."},{"definition":"To draw out; to call forth."},{"definition":"To draw fibers out of a clump, for spinning in the production of yarn."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a certain depth required to float (said of a vessel); used comparatively with shallow, deep, etc.","example":"A johnboat is a shallow drafted boat favored by fishermen."},{"definition":"Conscripted"}],"partOfSpeech":"j"}]},{"word":"CHALET","idx":15854,"count":2368986,"meanings":[{"definitions":[{"definition":"An alpine style of wooden building with a sloping roof and overhanging eaves."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"chalet-us","text":"/ʃæleɪ/"}]},{"word":"SPORTSBOOK","idx":15856,"count":2368566,"meanings":[{"definitions":[{"definition":"A place where a gambler can bet on various sports competitions."}],"partOfSpeech":"n"}]},{"word":"LAYERED","idx":15857,"count":2368440,"meanings":[{"definitions":[{"definition":"To cut or divide (something) into layers"},{"definition":"To arrange (something) in layers.","example":"Layer the ribbons on top of one another to make an attractive pattern."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Formed of layers."}],"partOfSpeech":"j"}]},{"word":"HOPPER","idx":15858,"count":2367920,"meanings":[{"definitions":[{"definition":"One who or that which hops."},{"definition":"A temporary storage bin, filled from the top and emptied from the bottom, often funnel-shaped."},{"definition":"A funnel-shaped section at the top of a drainpipe used to collect water, from above, from one or more smaller drainpipes."},{"definition":"A device that feeds material into a machine."},{"definition":"Various insects"},{"definition":"An artificial fishing lure.","example":"To catch a big fish, use a hopper that jumps across the pond surface."},{"definition":"A toilet."},{"definition":"An escapement lever in a piano."},{"definition":"The game of hopscotch."},{"definition":"A window with hinges at the bottom, opened by tilting vertically."},{"definition":"A hopper car."},{"definition":"A fairy chess piece which moves only by jumping over another piece."},{"definition":"A person or machine that picks hops."},{"definition":"A Sri Lankan food made from a fermented batter of rice flour, coconut milk, and palm toddy or yeast."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hopper-1-au","text":"/ˈhɔp.ə/"}]},{"word":"SUS","idx":15859,"count":2367695,"meanings":[{"definitions":[{"definition":"Suspicion (in terms of a sus law)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Suspicious; having suspicions or questions."},{"definition":"Suspicious; raising suspicions, causing people to have suspicions."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/sʌs/"}]},{"word":"NEUROLOGICAL","idx":15860,"count":2367615,"meanings":[{"definitions":[{"definition":"Dealing with neurology, the study of the brain"}],"partOfSpeech":"j"}]},{"word":"SUBS","idx":15861,"count":2367299,"meanings":[{"definitions":[{"definition":"A submarine."},{"definition":"A submarine sandwich: a sandwich made on a long bun.","example":"We can get subs at that deli."},{"definition":"A substitute, often in sports.","example":"She worked as a sub until she got her teaching certificate."},{"definition":"(often in plural) A subscription: a payment made for membership of a club, etc."},{"definition":"A subtitle.","example":"I've just noticed a mistake in the subs for this film."},{"definition":"A subroutine (sometimes one that does not return a value, as distinguished from a function, which does)."},{"definition":"A subeditor."},{"definition":"A subcontractor."},{"definition":"(BDSM) A submissive."},{"definition":"A subordinate."},{"definition":"A subaltern."},{"definition":"A subscription (or (by extension) a subscriber) to an online channel or feed.","example":"I'm totally stoked; just got 10 new subs after my last video."},{"definition":"Subsistence money: part of a worker's wages paid before the work is finished."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To substitute for."},{"definition":"To work as a substitute teacher, especially in primary and secondary education."},{"definition":"To replace (a player) with a substitute.","example":"He never really made a contribution to the match, so it was no surprise when he was subbed at half time."},{"definition":"Less commonly, and often as sub on, to bring on (a player) as a substitute.","example":"He was subbed on half way through the second half, and scored within minutes."},{"definition":"To perform the work of a subeditor or copy editor; to subedit."},{"definition":"To lend."},{"definition":"To subscribe."},{"definition":"(BDSM) To take a submissive role."},{"definition":"To coat with a layer of adhering material; to planarize by means of such a coating."},{"definition":"To prepare (a slide) with a layer of transparent substance to support and/or fix the sample."}],"partOfSpeech":"ve"}]},{"word":"SPECIALIZATION","idx":15862,"count":2367296,"meanings":[{"definitions":[{"definition":"The act or process of specializing."},{"definition":"The area in which someone specializes."},{"definition":"The adaptation of an organism to a specific environment, or adaptation of an organ to a particular function."},{"definition":"A proof, axiom, problem, or definition whose cases are completely covered by another, broader concept.","example":"A triangle is a specialization of a polygon to one with exactly three sides."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌspɛʃəlɪˈzeɪʃn̩/"}]},{"word":"ABSTRACTION","idx":15863,"count":2366467,"meanings":[{"definitions":[{"definition":"The act of abstracting, separating, withdrawing, or taking away; withdrawal; the state of being taken away."},{"definition":"A separation from worldly objects; a recluse life; the withdrawal from one's senses."},{"definition":"The act of focusing on one characteristic of an object rather than the object as a whole group of characteristics; the act of separating said qualities from the object or ideas.","example":"Abstraction is necessary for the classification of things into genera and species."},{"definition":"Any characteristic of an individual object when that characteristic has been separated from the object and is contemplated alone as a quality having independent existence."},{"definition":"A member of an idealized subgroup when contemplated according to the abstracted quality which defines the subgroup."},{"definition":"The act of comparing commonality between distinct objects and organizing using those similarities; the act of generalizing characteristics; the product of said generalization."},{"definition":"An idea or notion of an abstract or theoretical nature.","example":"to fight for mere abstractions."},{"definition":"Absence or absorption of mind; inattention to present objects; preoccupation."},{"definition":"An abstract creation, or piece of art; qualities of artwork that are free from representational aspects."},{"definition":"A separation of volatile parts by the act of distillation."},{"definition":"An idea of an idealistic, unrealistic or visionary nature."},{"definition":"The result of mentally abstracting an idea; the product of any mental process involving a synthesis of: separation, despecification, generalization, and ideation in any of a number of combinations."},{"definition":"The merging of two river valleys by the larger of the two deepening and widening so much so, as to assimilate the smaller."},{"definition":"Any generalization technique that ignores or hides details to capture some kind of commonality between different instances for the purpose of controlling the intellectual complexity of engineered systems, particularly software systems."},{"definition":"Any intellectual construct produced through the technique of abstraction."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"abstraction-us","text":"/æbˈstɹæk.ʃn̩/"}]},{"word":"WATCHDOG","idx":15865,"count":2365031,"meanings":[{"definitions":[{"definition":"A guard dog"},{"definition":"An individual or group that monitors the activities of another entity (such as an individual, corporation, non-profit group, or governmental organization) on behalf of the public to ensure that entity does not behave illegally or unethically."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform a function analogous to that of a watchdog; to guard and warn."},{"definition":"To be continuously reset by a watchdog timer."}],"partOfSpeech":"ve"}]},{"word":"VIABILITY","idx":15869,"count":2364054,"meanings":[{"definitions":[{"definition":"The property of being viable; the ability to live or to succeed"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌvaɪəˈbɪlɪti/"}]},{"word":"DETAINED","idx":15871,"count":2363691,"meanings":[{"definitions":[{"definition":"To keep someone from proceeding by holding them back or making claims on their attention."},{"definition":"To put under custody."},{"definition":"To keep back or from; to withhold."},{"definition":"To seize goods for official purposes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"detained-us","text":"/dɨˈtejnd/"}]},{"word":"LUNCHEON","idx":15872,"count":2363638,"meanings":[{"definitions":[{"definition":"A formal meal served in the middle of the day."},{"definition":"Any midday meal; lunch."},{"definition":"A lump of food."},{"definition":"A portion of food taken at any time except at a regular meal; an informal or light repast."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat luncheon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"luncheon-us"},{"text":"/ˈlʌntʃ.ən/"}]},{"word":"FILLER","idx":15873,"count":2363583,"meanings":[{"definitions":[{"definition":"One who fills."},{"definition":"Something added to fill a space or add weight or size."},{"definition":"Any semisolid substance used to fill gaps, cracks or pores."},{"definition":"A relatively inert ingredient added to modify physical characteristics."},{"definition":"A short article in a newspaper or magazine."},{"definition":"A short piece of music or an announcement between radio or TV programmes."},{"definition":"Any spoken sound or word used to fill gaps in speech; filled pause."},{"definition":"Cut tobacco used to make up the body of a cigar."},{"definition":"In COBOL, the description of an unnamed part of a record that contains no data relevant to a given context (normally capitalised when in a data division)."},{"definition":"A plant that lacks a distinctive shape and can fill inconvenient spaces around other plants in pots or gardens."},{"definition":"(usually in the plural) Any standing tree or standard higher than the surrounding coppice in the form of forest known as \"coppice under standards\"."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"filler-uk","text":"/ˈfɪl.ə(ɹ)/"}]},{"word":"SMILEY","idx":15874,"count":2363430,"meanings":[{"definitions":[{"definition":"A simplified representation of a smiling face."},{"definition":"A sequence of keyboard characters used to represent a happy mood, especially :) or :-) or other depiction of smiling."},{"definition":"An improvised street weapon consisting of a length of chain with padlocks and other heavy objects affixed to one end."},{"definition":"A roasted sheep's head."},{"definition":"The type of piercing of the upper frenulum (upper lip)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Cheerful and happy; smiling."},{"definition":"Having one's throat slit from side to side."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"smiley-au","text":"/ˈsmaɪli/"}]},{"word":"ZENITH","idx":15875,"count":2363349,"meanings":[{"definitions":[{"definition":"The point in the sky vertically above a given position or observer; the point in the celestial sphere opposite the nadir."},{"definition":"The highest point in the sky reached by a celestial body."},{"definition":"(by extension) Highest point or state; peak.","example":"Winning the continental championship was the zenith of my career."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"zenith-us","text":"/ˈzi.nɪθ/"},{"audio":"zenith-uk","text":"/ˈzɛn.ɪθ/"},{"audio":"zenith-au","text":"/ˈzɛn.ɪθ/"}]},{"word":"GENOMICS","idx":15876,"count":2363286,"meanings":[{"definitions":[{"definition":"The study of the complete genome of an organism"}],"partOfSpeech":"n"}]},{"word":"YI","idx":15877,"count":2363178,"meanings":[{"definitions":[{"definition":"The Cyrillic letter Ї ї, used in the Ukrainian and Rusyn alphabets."},{"definition":"The Armenian letter Յ, յ."}],"partOfSpeech":"p"}]},{"word":"YUM","idx":15878,"count":2362952,"meanings":[{"definitions":[{"definition":"Delicious.","example":"This apple pie is yum!"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Yellowdog Updater, Modified, a popular package manager in Linux","example":"Please run yum in non-caching mode to correct this header."}],"partOfSpeech":"pn"},{"definitions":[{"definition":"Indicating delight at the flavor of food.","example":"Yum! This apple pie is delicious!"}],"partOfSpeech":"i"}],"phonetics":[{"text":"/jʌm/"},{"audio":"yum-au"}]},{"word":"BROWNS","idx":15879,"count":2362811,"meanings":[{"definitions":[{"definition":"A colour like that of chocolate or coffee.","example":"The browns and greens in this painting give it a nice woodsy feel."},{"definition":"One of the colour balls used in snooker, with a value of 4 points."},{"definition":"Black tar heroin."},{"definition":"A copper coin."},{"definition":"A brown horse or other animal."},{"definition":"(sometimes capitalised) A person of Middle Eastern, Latino or South Asian descent; a brown-skinned person; someone of mulatto or biracial appearance."},{"definition":"Any of various nymphalid butterflies of subfamily Satyrinae (formerly the family Satyridae)."},{"definition":"Any of certain species of nymphalid butterflies of subfamily Satyrinae, such as those of the genera Heteronympha and Melanitis."},{"definition":"A brown trout (Salmo trutta)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become brown.","example":"Fry the onions until they brown."},{"definition":"To cook something until it becomes brown.","example":"Brown the onions in a large frying pan."},{"definition":"To tan.","example":"Light-skinned people tend to brown when exposed to the sun."},{"definition":"To make brown or dusky."},{"definition":"To give a bright brown colour to, as to gun barrels, by forming a thin coating of oxide on their surface."},{"definition":"(usually derogatory) To turn progressively more Middle Eastern, Hispanic or Latino, in the context of the population of a geographic region.","example":"the browning of America"},{"definition":"To treat with deference, or respect."}],"partOfSpeech":"ve"}]},{"word":"RESEARCHED","idx":15880,"count":2362534,"meanings":[{"definitions":[{"definition":"To search or examine with continued care; to seek diligently."},{"definition":"To make an extensive investigation into."},{"definition":"To search again."}],"partOfSpeech":"ve"}]},{"word":"WAITS","idx":15881,"count":2362199,"meanings":[{"definitions":[{"definition":"A delay.","example":"I had a very long wait at the airport security check."},{"definition":"An ambush.","example":"They lay in wait for the patrol."},{"definition":"One who watches; a watchman."},{"definition":"(in the plural) Hautboys, or oboes, played by town musicians."},{"definition":"(in the plural) Musicians who sing or play at night or in the early morning, especially at Christmas time; serenaders; musical watchmen. [formerly waites, wayghtes.]"},{"definition":"A group of singers or musicians performing in the streets, especially around Christmas."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To delay movement or action until the arrival or occurrence of; to await. (Now generally superseded by “wait for”.)"},{"definition":"To delay movement or action until some event or time; to remain neglected or in readiness.","example":"Wait here until your car arrives."},{"definition":"To wait tables; to serve customers in a restaurant or other eating establishment.","example":"She used to wait down at the Dew Drop Inn."},{"definition":"To attend on; to accompany; especially, to attend with ceremony or respect."},{"definition":"To attend as a consequence; to follow upon; to accompany."},{"definition":"To defer or postpone (especially a meal).","example":"to wait dinner"},{"definition":"To remain chaste while one's lover is unavailable."}],"partOfSpeech":"ve"}]},{"word":"TENOR","idx":15882,"count":2361385,"meanings":[{"definitions":[{"definition":"A musical range or section higher than bass and lower than alto."},{"definition":"A person, instrument or group that performs in the tenor (higher than bass and lower than alto) range."},{"definition":"A musical part or section that holds or performs the main melody, as opposed to the contratenor bassus and contratenor altus, who perform countermelodies."},{"definition":"The lowest tuned in a ring of bells."},{"definition":"Tone, as of a conversation."},{"definition":"Duration; continuance; a state of holding on in a continuous course; general tendency; career."},{"definition":"The subject in a metaphor to which attributes are ascribed."},{"definition":"Time to maturity of a bond."},{"definition":"Stamp; character; nature."},{"definition":"An exact copy of a writing, set forth in the words and figures of it. It differs from purport, which is only the substance or general import of the instrument."},{"definition":"That course of thought which holds on through a discourse; the general drift or course of thought; purport; intent; meaning; understanding."},{"definition":"A tenor saxophone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the tenor part or range.","example":"He has a tenor voice."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tenor-uk","text":"/tɛnə(ɹ)/"}]},{"word":"COPIERS","idx":15883,"count":2360987,"meanings":[{"definitions":[{"definition":"A machine that copies graphical material; a duplicator."},{"definition":"A person who copies documents."},{"definition":"A program or process that copies.","example":"a file copier; a disk copier"}],"partOfSpeech":"n"}]},{"word":"OVARIAN","idx":15884,"count":2360849,"meanings":[{"definitions":[{"definition":"Relating to the ovaries."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/oʊˈvɛɹi.ən/"}]},{"word":"SOFTLY","idx":15885,"count":2360826,"meanings":[{"definitions":[{"definition":"In a soft manner; gently."},{"definition":"Not loudly; nearly inaudible."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"softly-us","text":"/ˈsɔftli/"}]},{"word":"PLENARY","idx":15886,"count":2360816,"meanings":[{"definitions":[{"definition":"Plenary session","example":"After lunch, we will all be in the main auditorium listening to the plenary."},{"definition":"(pedagogy) Part of a lesson, usually at or towards the end, designed to review or evaluate the learning that has taken place."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Fully attended; for everyone's attendance."},{"definition":"Complete; full; entire; absolute."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"plenary-us","text":"/ˈpliːnəɹi/"}]},{"word":"SCRUB","idx":15887,"count":2360299,"meanings":[{"definitions":[{"definition":"One who labors hard and lives meanly; a mean fellow."},{"definition":"One who is incompetent or unable to complete easy tasks.","example":"What a scrub! Instead of washing the dishes she put the used food on her face!"},{"definition":"A thicket or jungle, often specified by the name of the prevailing plant","example":"oak scrub"},{"definition":"(stock breeding) One of the common livestock of a region of no particular breed or not of pure breed, especially when inferior in size, etc. Often used to refer to male animals unsuited for breeding."},{"definition":"Vegetation of inferior quality, though sometimes thick and impenetrable, growing in poor soil or in sand; also, brush."},{"definition":"One not on the first team of players; a substitute."},{"definition":"An instance of scrubbing."},{"definition":"A cancellation."},{"definition":"A worn-out brush."},{"definition":"One who scrubs."},{"definition":"(in the plural) Clothing worn while performing surgery."},{"definition":"(by extension, in the plural) Any medical uniform consisting of a short-sleeved shirt and pants (trousers)."},{"definition":"An exfoliant for the body."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Mean; dirty; contemptible; scrubby."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To rub hard; to wash with rubbing; usually, to rub with a wet brush, or with something coarse or rough, for the purpose of cleaning or brightening","example":"to scrub a floor"},{"definition":"To rub anything hard, especially with a wet brush; to scour"},{"definition":"To be diligent and penurious","example":"to scrub hard for a living"},{"definition":"To call off a scheduled event; to cancel.","example":"Engineers had to scrub the satellite launch due to bad weather."},{"definition":"To eliminate or to correct data from a set of records to bring it inline with other similar datasets","example":"The street segment data from the National Post Office will need to be scrubbed before it can be integrated into our system."},{"definition":"(audio) To move a recording tape back and forth with a scrubbing motion to produce a scratching sound, or to do so by a similar use of a control on an editing system."},{"definition":"(audio, video) To maneuver the play position on a media editing system by using a scroll bar or touch-based interface."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scrub-uk","text":"/skɹʌb/"}]},{"word":"AIRPLANES","idx":15888,"count":2359533,"meanings":[{"definitions":[{"definition":"A powered heavier-than-air aircraft with fixed wings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fly in an aeroplane."},{"definition":"To transport by aeroplane."}],"partOfSpeech":"ve"}]},{"word":"LIMB","idx":15890,"count":2359067,"meanings":[{"definitions":[{"definition":"A major appendage of human or animal, used for locomotion (such as an arm, leg or wing)."},{"definition":"A branch of a tree."},{"definition":"The part of the bow, from the handle to the tip."},{"definition":"An elementary piece of the mechanism of a lock."},{"definition":"A thing or person regarded as a part or member of, or attachment to, something else."},{"definition":"The part of a corolla beyond the throat."},{"definition":"The apparent visual edge of a celestial body.","example":"solar limb"},{"definition":"(on a measuring instrument) The graduated edge of a circle or arc."},{"definition":"The border or upper spreading part of a monopetalous corolla, or of a petal or sepal; blade."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the limbs from (an animal or tree).","example":"They limbed the felled trees before cutting them into logs."},{"definition":"To supply with limbs."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"limb-us","text":"/lɪm/"}]},{"word":"INTESTINAL","idx":15891,"count":2358994,"meanings":[{"definitions":[{"definition":"Relating to the intestines."},{"definition":"Internal."}],"partOfSpeech":"j"}]},{"word":"CELLO","idx":15892,"count":2358848,"meanings":[{"definitions":[{"definition":"A large stringed instrument of the violin family with four strings, tuned from lowest to highest C-G-D-A, and played with a bow, also possessing an endpin to support the instrument's weight."},{"definition":"Cellophane"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cello-1-us","text":"/ˈtʃɛloʊ/"}]},{"word":"REFUSING","idx":15895,"count":2357765,"meanings":[{"definitions":[{"definition":"To decline (a request or demand).","example":"My request for a pay rise was refused."},{"definition":"To decline a request or demand, forbear; to withhold permission.","example":"I asked the star if I could have her autograph, but she refused."},{"definition":"To throw back, or cause to keep back (as the centre, a wing, or a flank), out of the regular alignment when troops are about to engage the enemy.","example":"to refuse the right wing while the left wing attacks"},{"definition":"To disown."},{"definition":"To melt again."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"refusing-us","text":"/ɹɪˈfjuːzɪŋ/"}]},{"word":"SUFFERS","idx":15896,"count":2357684,"meanings":[{"definitions":[{"definition":"To undergo hardship.","example":"Is anyone here afraid of suffering hardship?"},{"definition":"To feel pain.","example":"At least he didn't suffer when he died in the car crash."},{"definition":"To become worse.","example":"If you keep partying like this, your school-work will suffer."},{"definition":"To endure, undergo.","example":"I've been suffering your insults for years."},{"definition":"To allow."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"suffers-us"}]},{"word":"SWEEPSTAKES","idx":15897,"count":2357635,"meanings":[{"definitions":[{"definition":"A lottery in which the prize or prizes constitute all the money paid by the participants."},{"definition":"A prize draw."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈswipˌsteɪks/"}]},{"word":"OCCUPY","idx":15898,"count":2357306,"meanings":[{"definitions":[{"definition":"(of time) To take or use."},{"definition":"To take or use space."},{"definition":"To have sexual intercourse with."},{"definition":"To do business in; to busy oneself with."},{"definition":"To use; to expend; to make use of."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɑkjəpaɪ/"},{"text":"/ˈɒkjʊpaɪ/"}]},{"word":"ANTIGENS","idx":15899,"count":2356918,"meanings":[{"definitions":[{"definition":"A substance that induces an immune response, usually foreign."}],"partOfSpeech":"n"}]},{"word":"GAN","idx":15900,"count":2356874,"meanings":[{"definitions":[{"definition":"(thieves') Mouth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To begin."},{"definition":"(obsolete outside Northumbria) To go."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡæn/"}]},{"word":"MIDTOWN","idx":15901,"count":2356427,"meanings":[{"definitions":[{"definition":"The part of a city between uptown and downtown"}],"partOfSpeech":"n"}]},{"word":"STABILIZATION","idx":15903,"count":2355377,"meanings":[{"definitions":[{"definition":"The process of stabilizing."},{"definition":"The result of being stabilized."},{"definition":"A preliminary medical process for sick or injured people to attempt to keep their medical condition from deteriorating too much and too quickly before being treated in depth at a medical facility."}],"partOfSpeech":"n"}]},{"word":"CAVES","idx":15904,"count":2355316,"meanings":[{"definitions":[{"definition":"A large, naturally-occurring cavity formed underground or in the face of a cliff or a hillside.","example":"We found a cave on the mountainside where we could take shelter."},{"definition":"A hole, depression, or gap in earth or rock, whether natural or man-made."},{"definition":"A storage cellar, especially for wine or cheese.","example":"This wine has been aged in our cave for thirty years."},{"definition":"A place of retreat, such as a man cave.","example":"My room was a cozy cave where I could escape from my family."},{"definition":"A naturally-occurring cavity in bedrock which is large enough to be entered by an adult.","example":"It was not strictly a cave, but a narrow fissure in the rock."},{"definition":"A shielded area where nuclear experiments can be carried out."},{"definition":"(drilling) Debris, particularly broken rock, which falls into a drill hole and interferes with drilling."},{"definition":"A collapse or cave-in."},{"definition":"The vagina."},{"definition":"(often \"Cave\") A group that breaks from a larger political party or faction on a particular issue."},{"definition":"Any hollow place, or part; a cavity."},{"definition":"A code cave."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To surrender.","example":"He caved under pressure."},{"definition":"To collapse.","example":"First the braces buckled, then the roof began to cave, then we ran."},{"definition":"To hollow out or undermine.","example":"The levee has been severely caved by the river current."},{"definition":"To engage in the recreational exploration of caves.","example":"I have caved from Yugoslavia to Kentucky."},{"definition":"In room-and-pillar mining, to extract a deposit of rock by breaking down a pillar which had been holding it in place.","example":"The deposit is caved by knocking out the posts."},{"definition":"To work over tailings to dress small pieces of marketable ore."},{"definition":"To dwell in a cave."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/keɪvz/"}]},{"word":"AUTHORITATIVE","idx":15905,"count":2355249,"meanings":[{"definitions":[{"definition":"Arising or originating from a figure of authority","example":"The authoritative rules in this school come not from the headmaster but from the aged matron."},{"definition":"Highly accurate or definitive; treated or worthy of treatment as a scholarly authority","example":"This book is the world's most authoritative guide to insect breeding habits."},{"definition":"Having a commanding style.","example":"He instructed us in that booming, authoritative voice of his."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɔˈθɑɹɪtətɪv/"},{"text":"/ɔːˈθɒɹɪtətɪv/"}]},{"word":"CELESTIAL","idx":15906,"count":2355105,"meanings":[{"definitions":[{"definition":"An inhabitant of heaven."},{"definition":"(sometimes capitalized) A native of China."},{"definition":"By extension, an East Asian person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to the sky or outer space, regarded as the realm of the sun, moon, planets, and stars."},{"definition":"Of or pertaining to the highest degree of glory."},{"definition":"Of or pertaining to the heaven believed in by many religions."},{"definition":"Of or pertaining to the kingdom of God; divine."},{"definition":"Strongly or sublimely beautiful or pleasurable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"celestial-us","text":"/səˈlɛstiəl/"}]},{"word":"IMMENSE","idx":15907,"count":2354605,"meanings":[{"definitions":[{"definition":"Immense extent or expanse; immensity"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Huge, gigantic, very large."},{"definition":"Supremely good."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"immense-us","text":"/ɪˈmɛns/"}]},{"word":"MERLIN","idx":15909,"count":2354378,"meanings":[{"definitions":[{"definition":"A small falcon, Falco columbarius, that breeds in northern North America, Europe, and Asia."},{"definition":"A cytoskeletal protein active in the suppression of tumors."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɝlɪn/"}]},{"word":"KINETICS","idx":15910,"count":2354107,"meanings":[{"definitions":[{"definition":"The branch of mechanics concerned with motion of objects, as well as the reason i.e. the forces acting on such bodies. This, along with kinematics constitute dynamics, which is concerned purely with the effects of forces on moving bodies."},{"definition":"The branch of chemistry that is concerned with the rates of chemical reactions."}],"partOfSpeech":"n"}]},{"word":"COCOS","idx":15911,"count":2354000,"meanings":[{"definitions":[{"definition":"Coconut palm."},{"definition":"Coconut, the fruit of the coconut palm."}],"partOfSpeech":"n"}]},{"word":"AIMING","idx":15912,"count":2353915,"meanings":[{"definitions":[{"definition":"To point or direct a missile, or a weapon which propels as missile, towards an object or spot with the intent of hitting it","example":"He aimed at the target, but the arrow flew straight over it."},{"definition":"To direct the intention or purpose; to attempt the accomplishment of a purpose; to try to gain; to endeavor;—followed by at, or by an infinitive","example":"to aim at a pass"},{"definition":"To direct or point (e.g. a weapon), at a particular object; to direct, as a missile, an act, or a proceeding, at, to, or against an object","example":"She aimed a punch at her ex-boyfriend."},{"definition":"To direct (something verbal) towards a certain person, thing, or group","example":"to aim a satirical comment at Communists in general"},{"definition":"To guess or conjecture."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who aims."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈeɪ.mɪŋ/"}]},{"word":"SEIZURE","idx":15913,"count":2353392,"meanings":[{"definitions":[{"definition":"The act of taking possession, as by force or right of law.","example":"The search warrant permitted the seizure of evidence."},{"definition":"A sudden attack or convulsion, (e.g. an epileptic seizure).","example":"He fell to the floor and convulsed when the epileptic seizure occurred."},{"definition":"A sudden onset of pain or emotion.","example":"He felt the sudden seizure of pain as the heart attack began."},{"definition":"That which is seized, or taken possession of; a thing laid hold of, or possessed."},{"definition":"Retention within one's grasp or power; possession; ownership."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"seizure-us","text":"/ˈsizjʊɚ/"},{"audio":"seizure-uk","text":"/ˈsizjʊɚ/"}]},{"word":"DIPLOMACY","idx":15915,"count":2352610,"meanings":[{"definitions":[{"definition":"The art and practice of conducting international relations by negotiating alliances, treaties, agreements etc., bilaterally or multilaterally, between states and sometimes international organizations, or even between polities with varying status, such as those of monarchs and their princely vassals.","example":"National diplomacy typically deploys its dexterity to secure advantage for one's nation."},{"definition":"Tact and subtle skill in dealing with people so as to avoid or settle hostility."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈploʊməsi/"},{"text":"/dɪˈpləʊməsi/"},{"audio":"diplomacy-ca"}]},{"word":"DIFFERING","idx":15916,"count":2352534,"meanings":[{"definitions":[{"definition":"Not to have the same traits or characteristics; to be unalike or distinct.","example":"These shoes only differ from those ones in having slightly longer laces."},{"definition":"(people, groups, etc.) To have diverging opinions, disagree."},{"definition":"To be separated in quantity.","example":"The numbers 3 and 21 differ by 18."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Difference"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Unlike, dissimilar, distinct"}],"partOfSpeech":"j"}]},{"word":"IMPACTED","idx":15917,"count":2352224,"meanings":[{"definitions":[{"definition":"To collide or strike, the act of impinging.","example":"When the hammer impacts the nail, it bends."},{"definition":"To compress; to compact; to press into something or pack together.","example":"The footprints of birds do not impact the soil in the way those of dinosaurs do."},{"definition":"To influence; to affect; to have an impact on.","example":"I can make the changes, but it will impact the schedule."},{"definition":"To stamp or impress onto something.","example":"Ideas impacted on the mind."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having undergone an impact."},{"definition":"Of a tooth, subject to dental impaction.","example":"Being the last teeth to erupt in the oral cavity, many wisdom teeth are impacted."},{"definition":"Having lost property revenue due to Federal presence, such that it may receive impact aid."}],"partOfSpeech":"j"}]},{"word":"FOREIGNERS","idx":15918,"count":2351944,"meanings":[{"definitions":[{"definition":"A person from a foreign country."},{"definition":"A private job run by an employee at a trade factory rather than going through the business."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"foreigners-us","text":"/ˈfɑɹ.ɪ.nɚz/"}]},{"word":"LIMP","idx":15919,"count":2351899,"meanings":[{"definitions":[{"definition":"An irregular, jerky or awkward gait.","example":"She walks with a limp."},{"definition":"A scraper for removing poor ore or refuse from the sieve."},{"definition":"A scraper of board or sheet-iron shaped like half the head of a small cask, used for scraping the ore off the sieve in the operation of hand-jigging."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To walk lamely, as if favouring one leg."},{"definition":"(of a vehicle) To travel with a malfunctioning system of propulsion.","example":"The bomber limped home on one engine."},{"definition":"To move or proceed irregularly.","example":"The business limped through the recession"},{"definition":"To call, particularly in an unraised pot pre-flop."},{"definition":"To be inadequate or unsatisfactory."},{"definition":"To happen; befall; chance."},{"definition":"To come upon; meet."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Flaccid; flabby, like flesh."},{"definition":"Lacking stiffness; flimsy","example":"a limp rope"},{"definition":"(of a penis) not erect"},{"definition":"(of a man) not having an erect penis"},{"definition":"Physically weak"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"limp-us","text":"/lɪmp/"}]},{"word":"CAPITALIST","idx":15920,"count":2351271,"meanings":[{"definitions":[{"definition":"A person who is a supporter of capitalism."},{"definition":"The owner of a considerable amount of capital; a wealthy person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or pertaining to, capitalism.","example":"capitalist countries"},{"definition":"Supporting or endorsing capitalism.","example":"capitalist warriors"}],"partOfSpeech":"j"}]},{"word":"MUTE","idx":15922,"count":2351105,"meanings":[{"definitions":[{"definition":"A stopped consonant; a stop."},{"definition":"An actor who does not speak; a mime performer."},{"definition":"A person who does not have the power of speech."},{"definition":"A hired mourner at a funeral; an undertaker's assistant."},{"definition":"An object for dulling the sound of an instrument, especially a brass instrument, or damper for pianoforte; a sordine."},{"definition":"An electronic switch or control that mutes the sound."},{"definition":"A mute swan."},{"definition":"The faeces of a hawk or falcon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To silence, to make quiet."},{"definition":"To turn off the sound of.","example":"Please mute the music while I make a call."},{"definition":"Of a bird: to defecate."},{"definition":"To cast off; to moult."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not having the power of speech; dumb."},{"definition":"Silent; not making a sound."},{"definition":"Not uttered; unpronounced; silent; also, produced by complete closure of the mouth organs which interrupt the passage of breath; said of certain letters."},{"definition":"Not giving a ringing sound when struck; said of a metal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mute-us"},{"text":"/mjuːt/"}]},{"word":"BEANIE","idx":15923,"count":2351093,"meanings":[{"definitions":[{"definition":"A cap that fits the head closely, usually knitted from wool.","example":"Enrique Iglesias is often seen wearing a beanie."},{"definition":"A head-hugging brimless cap, with or without a visor, made from triangular sections of cloth, leather, or silk joined by a button at the crown and seamed together around the sides."},{"definition":"A Beanie Baby, a small soft toy filled with beans or similar stuffing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"beanie-us","text":"/ˈbiː.ni/"}]},{"word":"PROTESTANT","idx":15925,"count":2350938,"meanings":[{"definitions":[{"definition":"A member of any of several Christian denominations which separated from the Roman Catholic Church based on theological or political differences during the Reformation (or sometimes later)."},{"definition":"(history) A member of the Church of England or Church of Ireland, as distinct from Protestant nonconformists or dissenters"},{"definition":"One who protests; a protester.","example":"1915 November 3, decision in the case of the State of New Mexico v. Garrett, published in 1916 among the Decisions of the Department of the Interior in Cases Relating to Public Lands, volume 44 (edited by George J Hesselman), page 490: In the case of Hyacinthe Villeneuve a homestead entry had been allowed upon a tract of land that had been patented to the Santa Fe Railroad Company, whose grantees had expressed a willingness to reconvey in order that effect might be given to the equities of the homesteader, whereas in the present case the State stands in the position of a protestant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to several denominations of Christianity that separated from the Roman Catholic Church based on theological or political differences during the Reformation."},{"definition":"Protesting"}],"partOfSpeech":"j"}]},{"word":"METRE","idx":15926,"count":2350745,"meanings":[{"definitions":[{"definition":"To measure with a metering device."},{"definition":"To imprint a postage mark with a postage meter."},{"definition":"To regulate the flow of or to deliver in regulated amounts (usually of fluids but sometimes of other things such as anticipation or breath)."},{"definition":"To put into metrical form."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The basic unit of length in the International System of Units (SI: Système International d'Unités), equal to the distance travelled by light in a vacuum in 1/299 792 458 seconds. The metre is equal to 39 47/127 (approximately 39.37) imperial inches."},{"definition":"The rhythm or measure in verse and musical composition."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"metre-us","text":"/ˈmiːtəɹ/"},{"audio":"metre-uk","text":"/ˈmiːtə/"}]},{"word":"TRICKY","idx":15927,"count":2350431,"meanings":[{"definitions":[{"definition":"Hard to deal with, complicated","example":"They were in a tricky situation."},{"definition":"Adept at using deception","example":"A tricky salesman can sell anything."},{"definition":"Relating to or associated with a prostitution trick","example":"I don't want any of your tricky money, thank you!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tricky-us","text":"/tɹɪki/"}]},{"word":"ORDINANCES","idx":15928,"count":2350341,"meanings":[{"definitions":[{"definition":"A local law"},{"definition":"An edict or decree, authoritative order."},{"definition":"A religious practice or ritual prescribed by the church."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɔɹd(ɪ)nənsɪz/"},{"text":"/ˈɔːd(ɪ)nənsɪz/"}]},{"word":"SPACED","idx":15930,"count":2349680,"meanings":[{"definitions":[{"definition":"To roam, walk, wander."},{"definition":"To set some distance apart."},{"definition":"To insert or utilise spaces in a written text."},{"definition":"To eject into outer space, usually without a space suit."},{"definition":"To travel into and through outer space."}],"partOfSpeech":"ve"}]},{"word":"TOPAZ","idx":15933,"count":2348935,"meanings":[{"definitions":[{"definition":"A silicate mineral of aluminium and fluorine, usually tinted by impurities."},{"definition":"An often clear, yellowish-brown gemstone cut from this."},{"definition":"A yellowish-brown color, like that of the gemstone."},{"definition":"(British India) A black Catholic soldier in the British Army."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a yellowish-brown color, like that of the gemstone."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtoʊpæz/"},{"text":"/ˈtəʊpæz/"}]},{"word":"ANS","idx":15934,"count":2348913,"meanings":[{"definitions":[{"definition":"The first letter of the Georgian alphabet, ა (Mkhedruli), Ⴀ (Asomtavruli) or ⴀ (Nuskhuri)."},{"definition":"A response or reply; something said or done in reaction to a statement or question.","example":"Her answer to his proposal was a slap in the face."},{"definition":"A solution to a problem.","example":"There is no simple answer to corruption."},{"definition":"A document filed in response to a complaint, responding to each point raised in the complaint and raising counterpoints."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈænz/"}]},{"word":"SEGMENTATION","idx":15935,"count":2348439,"meanings":[{"definitions":[{"definition":"The act or an instance of dividing into segments"},{"definition":"The state of being divided into segments"},{"definition":"The partitioning of an image into groups of pixels"}],"partOfSpeech":"n"}]},{"word":"IMAGINARY","idx":15936,"count":2348396,"meanings":[{"definitions":[{"definition":"Imagination; fancy."},{"definition":"An imaginary quantity."},{"definition":"The set of values, institutions, laws, and symbols common to a particular social group and the corresponding society through which people imagine their social whole."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Existing only in the imagination.","example":"Santa Claus is imaginary."},{"definition":"(of a number) Having no real part; that part of a complex number which is a multiple of the square root of -1."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"imaginary-us","text":"/ɪˈmædʒɪˌnɛɹi/"}]},{"word":"SOAPS","idx":15938,"count":2347810,"meanings":[{"definitions":[{"definition":"A substance able to mix with both oil and water, used for cleaning, often in the form of a solid bar or in liquid form, derived from fats or made synthetically.","example":"I tried washing my hands with soap, but the stain wouldn't go away."},{"definition":"A metallic salt derived from a fatty acid"},{"definition":"Flattery or excessively complacent conversation."},{"definition":"Money, specially when used as a bribe."},{"definition":"A soap opera."},{"definition":"A solid masonry unit or brick reduced in depth or height from standard dimensions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply soap to in washing.","example":"Be sure to soap yourself well before rinsing."},{"definition":"To cover, lather or in any other form treat with soap, often as a prank.","example":"Those kids soaped my windows!"},{"definition":"To be discreet about (a topic)."},{"definition":"To flatter; to wheedle."}],"partOfSpeech":"ve"}]},{"word":"COURTHOUSE","idx":15939,"count":2347505,"meanings":[{"definitions":[{"definition":"A public building housing courts of law."},{"definition":"The public building where most American counties have their county offices."}],"partOfSpeech":"n"}]},{"word":"ENTREPRENEURIAL","idx":15941,"count":2346440,"meanings":[{"definitions":[{"definition":"Having the spirit, attitude or qualities of an entrepreneur; enterprising."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɒntɹəpɹəˈnɜːɹi.əl/"}]},{"word":"DAR","idx":15942,"count":2345848,"meanings":[{"definitions":[{"definition":"A fish found in the Severn River; a dart or dace."},{"definition":"That place."},{"definition":"That status; that position.","example":"You rinse and de-string the green beans; I'll take it from there."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(location) In a place or location (stated, implied or otherwise indicated) at some distance from the speaker (compare here)."},{"definition":"In that matter, relation, etc.; at that point, stage, etc., regarded as a distinct place.","example":"He did not stop there, but continued his speech."},{"definition":"(location) To or into that place; thither."},{"definition":"Where, there where, in which place."},{"definition":"In existence or in this world; see pronoun section below."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Used as an expletive subject of be in its sense of “exist”, with the semantic, usually indefinite subject being postponed or (occasionally) implied.","example":"Is there an answer? [=Does an answer exist?]"},{"definition":"Used with other intransitive verbs of existence, in the same sense, or with other intransitive verbs, adding a sense of existence.","example":"If x is a positive number, then there exists [=there is] a positive number y less than x."},{"definition":"Used with other verbs, when raised.","example":"I expected there to be a simpler solution. [=I expected that there would be a simpler solution.]"},{"definition":"(in combination with certain prepositions, no longer productive) That.","example":"therefor, thereat, thereunder"},{"definition":"Used to replace an unknown name, principally in greetings and farewells","example":"Hi there, young fellow."}],"partOfSpeech":"p"}]},{"word":"DART","idx":15943,"count":2345761,"meanings":[{"definitions":[{"definition":"A pointed missile weapon, intended to be thrown by the hand, for example a short lance or javelin"},{"definition":"Any sharp-pointed missile weapon, such as an arrow."},{"definition":"(sometimes figurative) Anything resembling such a missile; something that pierces or wounds like such a weapon."},{"definition":"A small object with a pointed tip at one end and feathers at the other, which is thrown at a target in the game of darts."},{"definition":"A dart-shaped target towed behind an aircraft to train shooters."},{"definition":"A plan or scheme."},{"definition":"A sudden or fast movement."},{"definition":"A fold that is stitched on a garment."},{"definition":"A fish, the dace."},{"definition":"A cigarette."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw with a sudden effort or thrust; to hurl or launch."},{"definition":"To send forth suddenly or rapidly; to emit; to shoot","example":"The sun darts forth his beams."},{"definition":"To shoot with a dart, especially a tranquilizer dart","example":"They had to dart the animal to get close enough to help"},{"definition":"To fly or pass swiftly, like a dart; to move rapidly in one direction; to shoot out quickly","example":"The flying man darted eastward."},{"definition":"To start and run with speed; to shoot rapidly along","example":"The deer darted from the thicket."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dart-us","text":"/dɑɹt/"}]},{"word":"PSYCHO","idx":15945,"count":2345581,"meanings":[{"definitions":[{"definition":"A person who is psychotic or otherwise insane.","example":"The loony bin up on the hill is full of psychos."},{"definition":"A person who acts in a bizarre or dangerous manner.","example":"She complained that he was a psycho for driving at such a high speed in heavy traffic."},{"definition":"A class, at a college or university, in which psychology is taught.","example":"I've got anthro, socio, lunch, and psycho."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Psychotic, or otherwise insane."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"psycho-au","text":"/ˈsaɪkəʊ/"}]},{"word":"WROUGHT","idx":15948,"count":2345069,"meanings":[{"definitions":[{"definition":"To do a specific task by employing physical or mental powers.","example":"He’s working in a bar."},{"definition":"To effect by gradual degrees.","example":"he worked his way through the crowd"},{"definition":"To embroider with thread."},{"definition":"To set into action.","example":"He worked the levers."},{"definition":"To cause to ferment."},{"definition":"To ferment."},{"definition":"To exhaust, by working.","example":"The mine was worked until the last scrap of ore had been extracted."},{"definition":"To shape, form, or improve a material.","example":"He used pliers to work the wire into shape."},{"definition":"To operate in a certain place, area, or speciality.","example":"she works the night clubs"},{"definition":"To operate in or through; as, to work the phones."},{"definition":"To provoke or excite; to influence.","example":"The rock musician worked the crowd of young girls into a frenzy."},{"definition":"To use or manipulate to one’s advantage.","example":"She knows how to work the system."},{"definition":"To cause to happen or to occur as a consequence.","example":"I cannot work a miracle."},{"definition":"To cause to work.","example":"He is working his servants hard."},{"definition":"To function correctly; to act as intended; to achieve the goal designed for.","example":"he pointed at the car and asked, \"Does it work\"?;  he looked at the bottle of pain pills, wondering if they would work;  my plan didn’t work"},{"definition":"To influence.","example":"They worked on her to join the group."},{"definition":"To effect by gradual degrees; as, to work into the earth."},{"definition":"To move in an agitated manner.","example":"A ship works in a heavy sea."},{"definition":"To behave in a certain way when handled","example":"this dough does not work easily;  the soft metal works well"},{"definition":"(with two objects) To cause (someone) to feel (something); to do unto somebody (something, whether good or bad)."},{"definition":"To hurt; to ache."},{"definition":"To cause something harmful; to afflict; to inflict; to harm or injury; to let out something harmful; .","example":"She wreaked her anger on his car."},{"definition":"To chasten, or chastise/chastize, or castigate, or punish, or smite.","example":"The criminal has been wreaked by the Judge to spend a year in prison."},{"definition":"To inflict or take vengeance on."},{"definition":"To take vengeance for."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been worked or prepared somehow.","example":"Is that fence made out of wrought iron?"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"wrought-us","text":"/ɹɔt/"}]},{"word":"ROBE","idx":15949,"count":2344642,"meanings":[{"definitions":[{"definition":"A long loose outer garment, often signifying honorary stature."},{"definition":"The skin of an animal, especially the bison, dressed with the fur on, and used as a wrap."},{"definition":"A wardrobe, especially one built into a bedroom."},{"definition":"The largest and strongest tobacco leaves."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clothe; to dress."},{"definition":"To put on official vestments."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"robe-us","text":"/ɹoʊb/"}]},{"word":"MULTITUDE","idx":15953,"count":2343548,"meanings":[{"definitions":[{"definition":"A great amount or number, often of people; abundance, myriad, profusion."},{"definition":"The mass of ordinary people; the masses, the populace.","example":"Pilate, wishing to please the multitude, released Barabbas to them."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"multitude-us","text":"/ˈməl-/"}]},{"word":"TUTORS","idx":15954,"count":2342956,"meanings":[{"definitions":[{"definition":"One who teaches another (usually called a student, learner, or tutee) in a one-on-one or small-group interaction.","example":"He passed the difficult class with help from his tutor."},{"definition":"A university officer responsible for students in a particular hall."},{"definition":"One who has the charge of a child or pupil and his estate; a guardian."},{"definition":"(trading card games) A card that allows you to search your deck for one or more other cards."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To instruct or teach, especially an individual or small group.","example":"To help pay her tuition, the college student began to tutor high school students in calculus and physics."},{"definition":"To treat with authority or sternness."}],"partOfSpeech":"ve"}]},{"word":"HOUSEKEEPING","idx":15956,"count":2342524,"meanings":[{"definitions":[{"definition":"The chores of maintaining a house as a residence, especially cleaning."},{"definition":"Any general tasks that involve preparation.","example":"The computer program does some general housekeeping involving initializing variables and opening files before beginning the main processing."},{"definition":"Hospitality; a liberal and hospitable table; a supply of provisions."}],"partOfSpeech":"n"}]},{"word":"CAPTIVE","idx":15957,"count":2342128,"meanings":[{"definitions":[{"definition":"One who has been captured or is otherwise confined."},{"definition":"One held prisoner."},{"definition":"One charmed or subdued by beauty, excellence, or affection; one who is captivated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To capture; to take captive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Held prisoner; not free; confined."},{"definition":"Subdued by love; charmed; captivated."},{"definition":"Of or relating to bondage or confinement; serving to confine.","example":"captive chains; captive hours"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"captive-us","text":"/ˈkæptɪv/"}]},{"word":"KETTLE","idx":15958,"count":2341770,"meanings":[{"definitions":[{"definition":"A vessel for boiling a liquid or cooking food, usually metal and equipped with a lid.","example":"There's a hot kettle of soup on the stove."},{"definition":"The quantity held by a kettle."},{"definition":"A vessel for boiling water for tea.","example":"Stick the kettle on and we'll have a nice cup of tea."},{"definition":"A kettle hole, sometimes any pothole."},{"definition":"(collective) A group of raptors riding a thermal, especially when migrating.","example":"a kettle of hawks"},{"definition":"A steam locomotive"},{"definition":"A kettledrum."},{"definition":"An instance of kettling; a group of protesters or rioters confined in a limited area."},{"definition":"A kind of fishweir resembling a wattle or fence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of the police) To contain demonstrators in a confined area."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"kettle-us","text":"/ˈkɛ.təl/"}]},{"word":"VISITATION","idx":15959,"count":2341736,"meanings":[{"definitions":[{"definition":"The act of visiting, or an instance of being visited."},{"definition":"An official visit to inspect or examine something."},{"definition":"An encounter with supernatural beings such as ghosts or aliens."},{"definition":"The right of a separated or divorced parent to visit a child; access."},{"definition":"A punishment or blessing ordained by God."},{"definition":"An unusual and extensive irruption of a species of animals into another region."}],"partOfSpeech":"n"}]},{"word":"BAGGAGE","idx":15962,"count":2340989,"meanings":[{"definitions":[{"definition":"(usually uncountable) Luggage; traveling equipment","example":"Please put your baggage in the trunk."},{"definition":"Factors, especially psychological ones, which interfere with a person's ability to function effectively.","example":"This person has got a lot of emotional baggage."},{"definition":"A woman."},{"definition":"An army's portable equipment; its baggage train."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"baggage-uk","text":"/ˈbæɡɪdʒ/"}]},{"word":"DUSTY","idx":15964,"count":2339959,"meanings":[{"definitions":[{"definition":"Covered with dust."},{"definition":"Powdery and resembling dust."},{"definition":"Grey in parts."},{"definition":"Ugly, disgusting (a general term of abuse)"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dusty-us","text":"/ˈdʌsti/"}]},{"word":"PATTY","idx":15965,"count":2339693,"meanings":[{"definitions":[{"definition":"(US, Australia, New Zealand) A flattened portion of ground meat or a vegetarian equivalent, usually round but sometimes square in shape."},{"definition":"A pastry with various fillings and spices baked inside a flaky shell, often tinted golden yellow with an egg yolk mixture or turmeric."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpæti/"}]},{"word":"SATIRE","idx":15968,"count":2338817,"meanings":[{"definitions":[{"definition":"A literary device of writing or art which principally ridicules its subject often as an intended means of provoking or preventing change. Humor, irony, and exaggeration are often used to aid this."},{"definition":"A satirical work.","example":"a stinging satire of American politics."},{"definition":"Severity of remark."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"satire-us","text":"/ˈsætaɪɹ/"}]},{"word":"OVERLOAD","idx":15969,"count":2338735,"meanings":[{"definitions":[{"definition":"An excessive load."},{"definition":"The damage done, or the outage caused by such a load."},{"definition":"An overloaded version of a function."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To load excessively"},{"definition":"To provide too much power to a circuit"},{"definition":"To create different functions for the same name, to be used in different contexts"},{"definition":"To fail due to excessive load"}],"partOfSpeech":"ve"}]},{"word":"TORTURED","idx":15970,"count":2338057,"meanings":[{"definitions":[{"definition":"To intentionally inflict severe pain or suffering on (someone).","example":"In the aftermath of 9/11, we did some things that were wrong. We did a whole lot of things that were right, but, we tortured some folks. We did some things that were contrary to our values."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been subjected to torture, mental or physical."},{"definition":"Involving suffering and difficulty.","example":"a tortured history"},{"definition":"Of literature, burdened by unnecessary complexity, obfuscation, abstruseness, etc.","example":"tortured prose"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɔɹt͡ʃɚd/"},{"text":"/ˈtɔːt͡ʃəd/"}]},{"word":"PIONEERS","idx":15971,"count":2337334,"meanings":[{"definitions":[{"definition":"One who goes before, as into the wilderness, preparing the way for others to follow."},{"definition":"A person or other entity who is first or among the earliest in any field of inquiry, enterprise, or progress.","example":"Certain politicians can be considered as pioneers of reform."},{"definition":"A soldier detailed or employed to form roads, dig trenches, and make bridges, as an army advances; a sapper."},{"definition":"A member of any of several European organizations advocating abstinence from alcohol."},{"definition":"A child of 10–16 years in the former Soviet Union, in the second of the three stages in becoming a member of the Communist Party."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be the first to do or achieve (something), preparing the way for others to follow.","example":"The young doctor pioneered a new life-saving surgical technique."}],"partOfSpeech":"ve"}]},{"word":"VIKINGS","idx":15972,"count":2336967,"meanings":[{"definitions":[{"definition":"One of the Scandinavian or other Northern European seafaring warriors that raided (and then settled) the British Isles and other parts of Europe in the 8th to the 11th centuries and, according to many historians, were the first Europeans to reach North America."},{"definition":"(by extension) A stock character common in the fantasy genre, namely a barbarian, generally equipped with an axe or sword and a helmet adorned with horns."},{"definition":"A Norseman (mediaeval Scandinavian)."},{"definition":"(mildly) An ethnic Swede, Norwegian, Dane, Icelander or Faroe Islander."},{"definition":"A player on the Minnesota Vikings NFL team."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈvaɪkɪŋs/"}]},{"word":"CRATE","idx":15973,"count":2336818,"meanings":[{"definitions":[{"definition":"A large open box or basket, used especially to transport fragile goods."},{"definition":"(mildly) A vehicle (car, aircraft, spacecraft, etc.) seen as unreliable."},{"definition":"In the Rust programming language, a binary or library."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put into a crate."},{"definition":"To keep in a crate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crate-us","text":"/kɹeɪt/"}]},{"word":"BOOTSTRAP","idx":15975,"count":2336609,"meanings":[{"definitions":[{"definition":"A loop (leather or other material) sewn at the side or top rear of a boot to help in pulling the boot on."},{"definition":"A means of advancing oneself or accomplishing something without aid.","example":"He used his business experience as a bootstrap to win voters."},{"definition":"The process by which the operating system of a computer is loaded into its memory"},{"definition":"The process necessary to compile the tools that will be used to compile the rest of the system or program."},{"definition":"Any method or instance of estimating properties of an estimator (such as its variance) by measuring those properties when sampling from an approximating distribution."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To help (oneself) without the aid of others.","example":"Sam spent years bootstrapping himself through college."},{"definition":"To load the operating system into the memory of a computer. Usually shortened to boot."},{"definition":"To compile the tools that will be used to compile the rest of the system or program.","example":"Bootstrapping means building the GNU C Library, GNU Compiler Collection and several other key system programs.http//www.gentoo.org/doc/en/handbook/handbook-x86.xml?part=1&chap=6"},{"definition":"To employ a bootstrap method."},{"definition":"To expand or advance an activity or a collection based solely on previous actions, work, findings, etc."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbuːtˌstɹæp/"}]},{"word":"EPISCOPAL","idx":15977,"count":2336299,"meanings":[{"definitions":[{"definition":"Of or relating to the affairs of a bishop in various Christian churches."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈpɪs.kə.pl̩/"}]},{"word":"HUMANE","idx":15978,"count":2336128,"meanings":[{"definitions":[{"definition":"(notcomp) Of or belonging to the species Homo sapiens or its closest relatives."},{"definition":"Having the nature or attributes of a human being.","example":"To err is human; to forgive, divine."},{"definition":"Having or showing concern for the pain or suffering of another; compassionate.","example":"As methods of execution go, beheading is more humane than drawing and quartering."},{"definition":"Pertaining to branches of learning concerned with human affairs or the humanities, especially classical literature or rhetoric."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"humane-uk","text":"/hjuːˈmeɪn/"}]},{"word":"MOONLIGHT","idx":15980,"count":2334927,"meanings":[{"definitions":[{"definition":"(sometimes attributive) The light reflected from the Moon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To work on the side (at a secondary job), often in the evening or during the night."},{"definition":"(by extension) To engage in an activity other than what one is known for."},{"definition":"(by extension, of an inanimate object) To perform a secondary function substantially different from its supposed primary function, as in protein moonlighting."},{"definition":"To carry out undeclared work."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"moonlight-us","text":"/ˈmunˌlaɪt/"}]},{"word":"MAST","idx":15981,"count":2334829,"meanings":[{"definitions":[{"definition":"A tall, slim post or tower, usually tapering upward, used to support, for example, the sails on a ship, flags, floodlights, meteorological instruments ,or communications equipment such as an aerial, usually supported by guy-wires."},{"definition":"A non-judicial punishment (\"NJP\") disciplinary hearing under which a commanding officer studies and disposes of cases involving those under his command."},{"definition":"The fruit of forest-trees (beech, oak, chestnut, pecan, etc.), especially if having fallen from the tree, used as fodder for pigs and other animals."},{"definition":"A type of heavy cue, with the broad end of which one strikes the ball."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply and fit a mast to (a ship)."},{"definition":"(of swine and other animals) To feed on forest seed or fruit."},{"definition":"(of a population of plants) To vary fruit and seed production in multi-year cycles."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mast-us","text":"/mæst/"}]},{"word":"UNFINISHED","idx":15983,"count":2333647,"meanings":[{"definitions":[{"definition":"Not finished, not completed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unfinished-us","text":"/ʌnˈfɪnɪʃt/"}]},{"word":"GOTH","idx":15985,"count":2333078,"meanings":[{"definitions":[{"definition":"A punk-derived subculture of people who predominantly dress in black, associated with mournful music and attitudes.","example":"Philip had been into goth for many years."},{"definition":"A style of punk rock influenced by glam rock; gothic rock."},{"definition":"A person who is part of the goth subculture.","example":"We saw a solitary goth hanging out on the steps of the train station."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to this music or these people.","example":"With her black clothes and dyed hair, Melanie looked very goth compared to her classmates."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"goth-ca","text":"/ɡɑθ/"}]},{"word":"CARED","idx":15986,"count":2333049,"meanings":[{"definitions":[{"definition":"To be concerned (about), to have an interest (in); to feel concern (about).","example":"\"She doesn't care what you think.\" \"I don't care, I'm still going.\""},{"definition":"(polite) To want, to desire; to like; to be inclined towards.","example":"I don't care to hear your opinion."},{"definition":"(with for) To look after or look out for.","example":"He cared for his mother while she was sick."},{"definition":"To mind; to object."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cared-us","text":"/kɛɹd/"}]},{"word":"AFFECTION","idx":15987,"count":2332707,"meanings":[{"definitions":[{"definition":"The act of affecting or acting upon."},{"definition":"The state of being affected, especially: a change in, or alteration of, the emotional state of a person or other animal, caused by a subjective affect (a subjective feeling or emotion), which arises in response to a stimulus which may result from either thought or perception."},{"definition":"An attribute; a quality or property; a condition."},{"definition":"An emotion; a feeling or natural impulse acting upon and swaying the mind."},{"definition":"A feeling of love or strong attachment.","example":"I have a lot of affection for my little sister."},{"definition":"Disease; morbid symptom; malady."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feel affection for."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"affection-us","text":"/əˈfɛkʃən/"}]},{"word":"SWORN","idx":15988,"count":2332355,"meanings":[{"definitions":[{"definition":"To take an oath, to promise."},{"definition":"To use offensive, profane, or obscene language."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Given or declared under oath.","example":"His sworn statement convinced the judge."},{"definition":"Bound as though by an oath."},{"definition":"Ardent, devout.","example":"a sworn foe"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sworn-us","text":"/swɔɹn/"}]},{"word":"TWINK","idx":15989,"count":2332335,"meanings":[{"definitions":[{"definition":"One or more very small, short bursts of light."},{"definition":"A very short moment of time."},{"definition":"The chaffinch."},{"definition":"A young, attractive, slim male, usually having little body hair."},{"definition":"A weak or effeminate man, whether gay or not."},{"definition":"A player in a multi-user dungeon or other roleplaying game who engages in obnoxious or abusive behaviour."},{"definition":"Correction fluid or correction tape."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To twinkle; sparkle"},{"definition":"To wink"},{"definition":"To engage in obnoxious or abusive behaviour in a multi-user dungeon or other roleplaying game, for example by griefing or by equipping a low-level character with advanced equipment from another player."},{"definition":"To chirp or twitter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"twink-au","text":"/twɪŋk/"}]},{"word":"VICIOUS","idx":15991,"count":2331876,"meanings":[{"definitions":[{"definition":"Violent, destructive and cruel."},{"definition":"Savage and aggressive."},{"definition":"Pertaining to vice; characterised by immorality or depravity."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"vicious-us","text":"/ˈvɪʃəs/"}]},{"word":"EDUCATING","idx":15992,"count":2331409,"meanings":[{"definitions":[{"definition":"To instruct or train","example":"Wang said such changes to the Baishui glacier provide the chance to educate visitors about global warming."}],"partOfSpeech":"ve"}]},{"word":"KIN","idx":15994,"count":2331005,"meanings":[{"definitions":[{"definition":"Race; family; breed; kind."},{"definition":"Persons of the same race or family; kindred."},{"definition":"One or more relatives, such as siblings or cousins, taken collectively."},{"definition":"Relationship; same-bloodedness or affinity; near connection or alliance, as of those having common descent."},{"definition":"Kind; sort; manner; way."},{"definition":"A primitive Chinese musical instrument of the cittern kind, with from five to twenty-five silken strings."},{"definition":"A day, in the Mesoamerican Long Count calendar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Related by blood or marriage, akin. Generally used in \"kin to\".","example":"It turns out my back-fence neighbor is kin to one of my co-workers."}],"partOfSpeech":"j"},{"definitions":[{"definition":"(auxiliary verb, defective) To know how to; to be able to.","example":"She can speak English, French, and German.   I can play football.   Can you remember your fifth birthday?"},{"definition":"(modal auxiliary verb, defective) May; to be permitted or enabled to.","example":"You can go outside and play when you're finished with your homework.   Can I use your pen?"},{"definition":"(modal auxiliary verb, defective) To have the potential to; be possible.","example":"Animals can experience emotions."},{"definition":"(auxiliary verb, defective) Used with verbs of perception.","example":"Can you hear that?."},{"definition":"To know."},{"definition":"To seal in a can.","example":"They canned air to sell as a novelty to tourists."},{"definition":"To preserve by heating and sealing in a jar or can.","example":"They spent August canning fruit and vegetables."},{"definition":"To discard, scrap or terminate (an idea, project, etc.).","example":"He canned the whole project because he thought it would fail."},{"definition":"To shut up.","example":"Can your gob."},{"definition":"To fire or dismiss an employee.","example":"The boss canned him for speaking out."},{"definition":"To hole the ball."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"kin-us","text":"/kɪn/"}]},{"word":"AFFILIATIONS","idx":15996,"count":2330795,"meanings":[{"definitions":[{"definition":"The relationship resulting from affiliating one thing with another."},{"definition":"The establishment of a child's paternity or maternity"},{"definition":"A club, society or umbrella organisation so formed, especially a trade union."}],"partOfSpeech":"n"}]},{"word":"COZY","idx":15997,"count":2330794,"meanings":[{"definitions":[{"definition":"A padded or knit covering put on an item to keep it warm, especially a teapot or egg."},{"definition":"A padded or knit covering for any item (often an electronic device such as a laptop computer)."},{"definition":"A work of crime fiction in which sex and violence are downplayed or treated humorously, and the crime and detection take place in a small, socially intimate community."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become snug and comfortable."},{"definition":"To become friendly with.","example":"He spent all day cosying up to the new boss, hoping for a plum assignment."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Affording comfort and warmth; snug; social"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cozy-us"}]},{"word":"PUSSYCAT","idx":15998,"count":2330623,"meanings":[{"definitions":[{"definition":"A cat; a pussy."},{"definition":"A gentle or soft-hearted person.","example":"He looks stern, but he’s just a big pussy-cat really."},{"definition":"The silky catkin of various willows."},{"definition":"A sexy woman."}],"partOfSpeech":"n"}]},{"word":"APPROPRIATED","idx":15999,"count":2330545,"meanings":[{"definitions":[{"definition":"To make suitable; to suit."},{"definition":"To take to oneself; to claim or use, especially as by an exclusive right.","example":"Let no man appropriate the use of a common benefit."},{"definition":"To set apart for, or assign to, a particular person or use, especially in exclusion of all others; with to or for.","example":"A spot of ground is appropriated for a garden."},{"definition":"To annex (for example a benefice, to a spiritual corporation, as its property)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Set aside for a specified purpose"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"appropriated-us"}]},{"word":"REVERSIBLE","idx":16003,"count":2329713,"meanings":[{"definitions":[{"definition":"Able to be reversed."},{"definition":"(of clothing) Able to be worn inside out."},{"definition":"(of a chemical reaction) Capable of proceeding in either direction."},{"definition":"(of a phase change) Capable of returning to the original state."},{"definition":"Capable of returning to the original state without consumption of free energy and increase of entropy."}],"partOfSpeech":"j"}]},{"word":"SLIPPERS","idx":16006,"count":2329284,"meanings":[{"definitions":[{"definition":"A low soft shoe that can be slipped on and off easily."},{"definition":"Such a shoe intended for indoor use; a bedroom or house slipper.","example":"Get out of bed, put on your slippers, and come downstairs."},{"definition":"A flip-flop (type of rubber sandal)."},{"definition":"A person who slips."},{"definition":"A kind of apron or pinafore for children."},{"definition":"A kind of brake or shoe for a wagon wheel."},{"definition":"A piece, usually a plate, applied to a sliding piece, to receive wear and permit adjustment; a gib."},{"definition":"A form of corporal punishment where the buttocks are repeatedly struck with a plimsoll; \"the slipper\"."},{"definition":"The plimsoll or gym shoe used in this form of punishment."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"slippers-us"}]},{"word":"UNCLASSIFIED","idx":16007,"count":2329160,"meanings":[{"definitions":[{"definition":"Not classified"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To declassify."}],"partOfSpeech":"ve"}]},{"word":"EARTHQUAKES","idx":16008,"count":2329102,"meanings":[{"definitions":[{"definition":"A shaking of the ground, caused by volcanic activity or movement around geologic faults."},{"definition":"(planetary geology) Such a quake specifically occurring on the planet Earth, as opposed to other celestial bodies."}],"partOfSpeech":"n"}]},{"word":"BOOKSHELF","idx":16009,"count":2328590,"meanings":[{"definitions":[{"definition":"A shelf or shelves for storing books for easy visual reference."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbʊkˌʃɛlf/"}]},{"word":"WANDERING","idx":16011,"count":2327786,"meanings":[{"definitions":[{"definition":"To move without purpose or specified destination; often in search of livelihood.","example":"to wander over the fields"},{"definition":"To stray; stray from one's course; err.","example":"A writer wanders from his subject."},{"definition":"To commit adultery."},{"definition":"To go somewhere indirectly or at varying speeds; to move in a curved path."},{"definition":"Of the mind, to lose focus or clarity of argument or attention."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Travelling with no preset route; roaming."},{"definition":"Irregular turning of the eyes."},{"definition":"Aimless thought."},{"definition":"Straying from a desired path."},{"definition":"(chiefly in the plural) Disordered speech or delirium."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Which wanders; travelling from place to place."},{"definition":"(of an organ) Abnormally capable of moving in certain directions.","example":"a wandering kidney; a wandering liver"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"wandering-us","text":"/ˈwɑndəɹɪŋ/"}]},{"word":"COMB","idx":16012,"count":2327626,"meanings":[{"definitions":[{"definition":"A toothed implement for grooming the hair or (formerly) for keeping it in place."},{"definition":"A machine used in separating choice cotton fibers from worsted cloth fibers."},{"definition":"A fleshy growth on the top of the head of some birds and reptiles; crest."},{"definition":"A structure of hexagon cells made by bees for storing honey; honeycomb."},{"definition":"An old English measure of corn equal to the half quarter."},{"definition":"The top part of a gun’s stock."},{"definition":"The toothed plate at the top and bottom of an escalator that prevents objects getting trapped between the moving stairs and fixed landings."},{"definition":"The main body of a harmonica containing the air chambers and to which the reed plates are attached."},{"definition":"A former, commonly cone-shaped, used in hat manufacturing for hardening soft fibre."},{"definition":"A toothed tool used for chasing screws on work in a lathe; a chaser."},{"definition":"The notched scale of a wire micrometer."},{"definition":"The collector of an electrical machine, usually resembling a comb."},{"definition":"One of a pair of peculiar organs on the base of the abdomen in scorpions."},{"definition":"The curling crest of a wave; a comber."},{"definition":"A toothed plate used for creating wells in agar gels for electrophoresis."},{"definition":"A toothed wooden pick used to push the weft thread tightly against the previous pass of thread to create a tight weave."},{"definition":"A connected and reduced curve with irreducible components consisting of a smooth subcurve (called the handle) and one or more additional irreducible components (called teeth) that each intersect the handle in a single point that is unequal to the unique point of intersection for any of the other teeth."},{"definition":"(abbreviation) Combination."},{"definition":"A valley, often wooded and often with no river"},{"definition":"A cirque."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(especially of hair or fur) To groom with a toothed implement; chiefly with a comb.","example":"I need to comb my hair before we leave the house"},{"definition":"To separate choice cotton fibers from worsted cloth fibers."},{"definition":"To search thoroughly as if raking over an area with a comb.","example":"Police combed the field for evidence after the assault"},{"definition":"To roll over, as the top or crest of a wave; to break with a white foam, as waves."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"comb-1-us","text":"/koʊm/"}]},{"word":"LIQUIDS","idx":16013,"count":2327187,"meanings":[{"definitions":[{"definition":"A substance that is flowing, and keeping no shape, such as water; a substance of which the molecules, while not tending to separate from one another like those of a gas, readily change their relative position, and which therefore retains no definite shape, except that determined by the containing receptacle; an inelastic fluid.","example":"A liquid can freeze to become a solid or evaporate into a gas."},{"definition":"A class of consonant sounds that includes l and r."}],"partOfSpeech":"n"}]},{"word":"BEECH","idx":16015,"count":2327119,"meanings":[{"definitions":[{"definition":"A tree of the genus Fagus having a smooth, light grey trunk, oval, pointed leaves and many branches."},{"definition":"The wood of the beech tree."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"beech-us","text":"/biːt͡ʃ/"}]},{"word":"VINEYARDS","idx":16016,"count":2327015,"meanings":[{"definitions":[{"definition":"A grape plantation, especially one used in the production of wine.","example":"The vineyard of Château Margaux stands as the producer of one of the world's greatest and most sought-after red wines."}],"partOfSpeech":"n"}]},{"word":"FROGS","idx":16019,"count":2326307,"meanings":[{"definitions":[{"definition":"A small tailless amphibian of the order Anura that typically hops."},{"definition":"The part of a violin bow (or that of other similar string instruments such as the viola, cello and contrabass) located at the end held by the player, to which the horsehair is attached."},{"definition":"Road. Shorter, more common form of frog and toad."},{"definition":"The depression in the upper face of a pressed or handmade clay brick."},{"definition":"An organ on the bottom of a horse’s hoof that assists in the circulation of blood."},{"definition":"The part of a railway switch or turnout where the running-rails cross (from the resemblance to the frog in a horse’s hoof)."},{"definition":"A French person."},{"definition":"A French-speaking person from Quebec."},{"definition":"A leather or fabric loop used to attach a sword or bayonet, or its scabbard, to a waist or shoulder belt."},{"definition":"An ornate fastener for clothing consisting of an oblong button (covered with netted thread), toggle, or knot, that fits through a loop."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hunt or trap frogs."},{"definition":"To use a pronged plater to transfer (cells) to another plate."},{"definition":"To spatchcock (a chicken)."},{"definition":"To ornament or fasten a coat, etc. with frogs."},{"definition":"To unravel part of (a knitted garment) while knitting it in order to correct a mistake."}],"partOfSpeech":"ve"}]},{"word":"FPS","idx":16020,"count":2326094,"meanings":[{"definitions":[{"definition":"Initialism of feet per second."}],"partOfSpeech":"n"}]},{"word":"CONSEQUENTIAL","idx":16021,"count":2325659,"meanings":[{"definitions":[{"definition":"Following as a result."},{"definition":"Having significant consequences; of importance."},{"definition":"Important or significant."},{"definition":"(of a person) Self-important."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌkɑnsəˈkwɛnʃəl/"},{"text":"/ˌkɒnsəˈkwɛnʃəl/"}]},{"word":"INITIALIZATION","idx":16022,"count":2325157,"meanings":[{"definitions":[{"definition":"The process of preparing something to begin."},{"definition":"An act of preparing something to begin."},{"definition":"An assignment of an initial value for a data object or variable"}],"partOfSpeech":"n"}]},{"word":"UNREASONABLE","idx":16023,"count":2324841,"meanings":[{"definitions":[{"definition":"Without the ability to reason; unreasoning."},{"definition":"Not reasonable; going beyond what could be expected or asked for."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unreasonable-uk","text":"/ʌnˈɹiːz(ə)nəbl̩/"}]},{"word":"EXPAT","idx":16024,"count":2324561,"meanings":[{"definitions":[{"definition":"An expatriate; a person who lives outside their own country."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛksˌpæt/"}]},{"word":"RAIDER","idx":16026,"count":2323603,"meanings":[{"definitions":[{"definition":"One who engages in a raid; a plunderer."},{"definition":"A person who takes or attempts to take control of a firm against the will of current management by purchasing a controlling interest of stock and acquiring proxies."},{"definition":"A special forces operative; a commando."},{"definition":"A warship which is light, maneuverable, and fast-moving."},{"definition":"A person who uncovers evidence of improper behavior within governmental or private organizations."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹeɪdɚ/"}]},{"word":"TIMERS","idx":16028,"count":2322877,"meanings":[{"definitions":[{"definition":"Someone or something which times."},{"definition":"A device used to measure amounts of time."},{"definition":"Any electronic function that causes a device to be able to do something automatically after a preset amount of time."}],"partOfSpeech":"n"}]},{"word":"STIMULUS","idx":16029,"count":2322857,"meanings":[{"definitions":[{"definition":"Any external phenomenon that has an influence on a system, by triggering or modifying an internal phenomenon.","example":"an economic stimulus"},{"definition":"Something external that elicits or influences a physiological or psychological activity or response."},{"definition":"Anything effectively impinging upon any of the sensory apparatuses of a living organism, including physical phenomena both internal and external to the body."},{"definition":"Anything that induces a person to take action."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈstɪm.jə.ləs/"}]},{"word":"ECONOMISTS","idx":16030,"count":2322843,"meanings":[{"definitions":[{"definition":"An expert in economics, especially one who studies economic data and extracts higher-level information or proposes theories."},{"definition":"One concerned with political economy."},{"definition":"One who manages a household."},{"definition":"One who economizes, or manages domestic or other concerns with frugality; one who expends money, time, or labor, judiciously, and without waste."}],"partOfSpeech":"n"}]},{"word":"MINERS","idx":16031,"count":2322828,"meanings":[{"definitions":[{"definition":"A person who works in a mine."},{"definition":"An operator of ordnance mines and similar explosives."},{"definition":"Any bird of one of four species of Australian endemic honeyeaters in the genus Manorina."},{"definition":"Any bird of one of several species of South American ovenbirds in the genus Geositta."},{"definition":"Software or hardware that mines, or creates new units of cryptocurrency."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"miners-us"}]},{"word":"CONSTITUENCY","idx":16033,"count":2322415,"meanings":[{"definitions":[{"definition":"A district represented by one or more elected officials.","example":"John was elected to parliament from the Bedford constituency."},{"definition":"(collective) The voters within such a district."},{"definition":"(collective) The residents of such a district."},{"definition":"(collective) The voters of a candidate."},{"definition":"An interest group or fan base."}],"partOfSpeech":"n"}]},{"word":"ROCKER","idx":16034,"count":2322314,"meanings":[{"definitions":[{"definition":"A curved piece of wood attached to the bottom of a rocking chair or cradle that enables it to rock back and forth."},{"definition":"A rocking chair."},{"definition":"The lengthwise curvature of a surfboard. (More rocker is a more curved board.)","example":"All modern surfboards share a similar rocker design — Bruce Jones https//web.archive.org/web/20051212041317/http://www.brucejones.com/longboar.htm"},{"definition":"The breve below as in ḫ."},{"definition":"Someone passionate about rock music."},{"definition":"A musician who plays rock music."},{"definition":"A rock music song."},{"definition":"One who rocks something."},{"definition":"A member of a British subculture of the 1960s, opposed to the mods, who dressed in black leather and were interested in 1950s music."},{"definition":"Any implement or machine working with a rocking motion, such as a trough mounted on rockers for separating gold dust from gravel, etc., by agitation in water."},{"definition":"A tool with small teeth that roughens a metal plate to produce tonality in mezzotints."},{"definition":"A rocking horse."},{"definition":"A rocker board."},{"definition":"A skate with a curved blade, somewhat resembling in shape the rocker of a cradle."},{"definition":"A rock shaft."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rocker-uk","text":"/ˈɹɒkə(ɹ)/"}]},{"word":"ACKNOWLEDGES","idx":16035,"count":2321868,"meanings":[{"definitions":[{"definition":"To admit the knowledge of; to recognize as a fact or truth; to declare one's belief in","example":"to acknowledge the being of a god"},{"definition":"To own or recognize in a particular quality, character or relationship; to admit the claims or authority of; to give recognition to."},{"definition":"To be grateful of (e.g. a benefit or a favour)","example":"to acknowledge a favor"},{"definition":"To report (the receipt of a message to its sender).","example":"This is to acknowledge your kind invitation to participate in the upcoming debate."},{"definition":"To own as genuine or valid; to assent to (a legal instrument) to give it validity; to avow or admit in legal form."}],"partOfSpeech":"ve"}]},{"word":"ALAS","idx":16036,"count":2321771,"meanings":[{"definitions":[{"definition":"Used to express sorrow, regret, compassion or grief.","example":"I wanted to catch the last bus home, but alas, I was ten minutes late and had to take a taxi instead."}],"partOfSpeech":"i"},{"definitions":[{"definition":"A type of depression which occurs in Yakutia, formed by the subsidence of permafrost."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"alas-1-us","text":"/əˈlæs/"}]},{"word":"ENROLMENT","idx":16037,"count":2321704,"meanings":[{"definitions":[{"definition":"The act of enrolling or the state of being enrolled."},{"definition":"The people enrolled, considered as a group."},{"definition":"The number of people enrolled."},{"definition":"The record of such enrolling; registration."}],"partOfSpeech":"n"}]},{"word":"SAWYER","idx":16039,"count":2321394,"meanings":[{"definitions":[{"definition":"One who saws timber, especially in a sawpit."},{"definition":"A large trunk of a tree brought down by the force of a river's current"},{"definition":"A beetle, mostly in the genus Monochamus, that lives and feeds on trees, including timber."},{"definition":"The bowfin."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɔ.jɚ/"},{"text":"/ˈsɔɪ.ə/"}]},{"word":"LAWMAKERS","idx":16041,"count":2321236,"meanings":[{"definitions":[{"definition":"One who makes or enacts laws."}],"partOfSpeech":"n"}]},{"word":"TENSE","idx":16042,"count":2320926,"meanings":[{"definitions":[{"definition":"(grammar) Any of the forms of a verb which distinguish when an action or state of being occurs or exists."},{"definition":"(grammar) An inflected form of a verb that indicates tense.","example":"English only has a present tense and a past tense; it has no future tense."},{"definition":"The property of indicating the point in time at which an action or state of being occurs or exists.","example":"Dyirbal verbs are not inflected for tense."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(grammar) To apply a tense to.","example":"tensing a verb"},{"definition":"To make or become tense."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Showing signs of stress or strain; not relaxed.","example":"You need to relax, all this overtime and stress is making you tense."},{"definition":"Pulled taut, without any slack."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tense-us","text":"/tɛns/"}]},{"word":"PREDICTING","idx":16043,"count":2320903,"meanings":[{"definitions":[{"definition":"To make a prediction: to forecast, foretell, or estimate a future event on the basis of knowledge and reasoning; to prophesy a future event on the basis of mystical knowledge or power."},{"definition":"(of theories, laws, etc.) To imply."},{"definition":"To make predictions."},{"definition":"To direct a ranged weapon against a target by means of a predictor."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A prediction."}],"partOfSpeech":"n"}]},{"word":"COOLED","idx":16045,"count":2320309,"meanings":[{"definitions":[{"definition":"To lose heat, to get colder.","example":"I like to let my tea cool before drinking it so I don't burn my tongue."},{"definition":"To make cooler, less warm."},{"definition":"To become less intense, e.g. less amicable or passionate.","example":"Relations cooled between the USA and the USSR after 1980."},{"definition":"To make less intense, e.g. less amicable or passionate."},{"definition":"To kill."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Brought to a lower temperature."},{"definition":"Brought to a lower temperature by means of (often in compounds).","example":"a water-cooled engine"},{"definition":"Brought to a reduced degree of anger or fervour."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kuːld/"}]},{"word":"PRUDENTIAL","idx":16046,"count":2319748,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) A matter requiring prudence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Characterised by the use of prudence; arising from careful thought or deliberation."},{"definition":"Of a person: exercising prudence; cautious."},{"definition":"Advisory; superintending or executive.","example":"a prudential committee"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"prudential-uk","text":"/pɹuːˈdɛnʃ(ə)l/"}]},{"word":"MIGRANT","idx":16048,"count":2319291,"meanings":[{"definitions":[{"definition":"A migratory bird or other animal."},{"definition":"Traveller or worker who moves from one region or country to another."},{"definition":"An immigrant or refugee."},{"definition":"Any of various pierid butterflies of the genus Catopsilia. Also called an emigrant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Migratory."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmaɪɡɹənt/"}]},{"word":"DEVOTION","idx":16049,"count":2319290,"meanings":[{"definitions":[{"definition":"The act or state of devoting or being devoted."},{"definition":"Feeling of strong or fervent affection; dedication"},{"definition":"Religious veneration, zeal, or piety."},{"definition":"A prayer (often found in the plural)"},{"definition":"(in the plural) Religious offerings; alms."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"devotion-us","text":"/dɪˈvoʊʃən/"}]},{"word":"INVOKE","idx":16052,"count":2318419,"meanings":[{"definitions":[{"definition":"To call upon (a person, a god) for help, assistance or guidance."},{"definition":"To solicit, petition for, appeal to a favorable attitude.","example":"The envoy invoked the King of Kings's magnanimity to reduce his province's tribute after another drought."},{"definition":"To call to mind (something) for some purpose."},{"definition":"To appeal for validation to a (notably cited) authority.","example":"In certain Christian circles, invoking the Bible constitutes irrefutable proof."},{"definition":"To conjure up with incantations.","example":"This satanist ritual invokes Beelzebub."},{"definition":"To bring about as an inevitable consequence.","example":"Blasphemy is taboo as it may invoke divine wrath."},{"definition":"To cause (a program or subroutine) to execute.","example":"Interactive programs let the users enter choices and invoke the corresponding routines."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪnˈvoʊk/"}]},{"word":"LEANING","idx":16054,"count":2318144,"meanings":[{"definitions":[{"definition":"A tendency or propensity.","example":"a man of socialist leanings"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To incline, deviate, or bend, from a vertical position; to be in a position thus inclining or deviating.","example":"She leaned out of the window."},{"definition":"To incline in opinion or desire; to conform in conduct; often with to, toward, etc.","example":"I’m leaning towards voting Conservative in the next election.  The Hispanic vote leans Democratic."},{"definition":"Followed by against, on, or upon: to rest or rely, for support, comfort, etc."},{"definition":"To hang outwards."},{"definition":"To press against."},{"definition":"To thin out (a fuel-air mixture): to reduce the fuel flow into the mixture so that there is more air or oxygen."},{"definition":"To conceal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"leaning-us","text":"/ˈliːnɪŋ/"}]},{"word":"CENTRALLY","idx":16055,"count":2317496,"meanings":[{"definitions":[{"definition":"(location) In a central manner or situation; at, to, through or from the centre."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈsɛnt.ɹə.li/"}]},{"word":"PADDLE","idx":16058,"count":2316636,"meanings":[{"definitions":[{"definition":"A two-handed, single-bladed oar used to propel a canoe or a small boat."},{"definition":"A double-bladed oar used for kayaking."},{"definition":"Time spent on paddling.","example":"We had a nice paddle this morning."},{"definition":"A slat of a paddleboat's wheel."},{"definition":"A paddlewheel."},{"definition":"A blade of a waterwheel."},{"definition":"A game controller with a round wheel used to control player movement along one axis of the video screen."},{"definition":"A meandering walk or dabble through shallow water, especially at the seaside."},{"definition":"A kitchen utensil shaped like a paddle and used for mixing, beating etc."},{"definition":"A bat-shaped spanking implement","example":"The paddle practically ousted the British cane for spankings in the independent US."},{"definition":"A ping-pong bat."},{"definition":"A flat limb of an aquatic animal, adapted for swimming.","example":"A sea turtle's paddles make it swim almost as fast as land tortoises are slow."},{"definition":"In a sluice, a panel that controls the flow of water."},{"definition":"A group of inerts"},{"definition":"A handheld defibrillation/cardioversion electrode"},{"definition":"Hand"},{"definition":"Padel (sport)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To propel something through water with a paddle, oar, hands, etc."},{"definition":"To row a boat with less than one's full capacity."},{"definition":"To spank with a paddle."},{"definition":"To pat or stroke amorously or gently."},{"definition":"To tread upon; to trample."},{"definition":"To walk or dabble playfully in shallow water, especially at the seaside."},{"definition":"To toddle."},{"definition":"To toy or caress using hands or fingers."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"paddle-au","text":"/ˈpæ.dəl/"}]},{"word":"ANTERIOR","idx":16061,"count":2316239,"meanings":[{"definitions":[{"definition":"Before in place."},{"definition":"Before or earlier in time; prior to; preceding."},{"definition":"Nearer the forward end; nearer the head of an animal or the front of a human."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"anterior-us","text":"/ænˈtɪəriə(r)/"}]},{"word":"DEALERSHIP","idx":16062,"count":2316058,"meanings":[{"definitions":[{"definition":"A place that sells items, especially cars.","example":"I visited the car dealership today."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdiːləʃɪp/"}]},{"word":"CHOP","idx":16063,"count":2315541,"meanings":[{"definitions":[{"definition":"A cut of meat, often containing a section of a rib.","example":"I only like lamb chops with mint jelly."},{"definition":"A blow with an axe, cleaver, or similar utensil.","example":"It should take just one good chop to fell the sapling."},{"definition":"A blow delivered with the hand rigid and outstretched.","example":"A karate chop."},{"definition":"Ocean waves, generally caused by wind, distinguished from swell by being smaller and not lasting as long."},{"definition":"A hand where two or more players have an equal-valued hand, resulting in the chips being shared equally between them.","example":"With both players having an ace-high straight, the pot was a chop."},{"definition":"(with \"the\") Termination, especially from employment; the sack."},{"definition":"A woodchopping competition."},{"definition":"A crack or cleft; a chap."},{"definition":"A turn of fortune; change; a vicissitude."},{"definition":"(chiefly in the plural) A jaw of an animal."},{"definition":"A movable jaw or cheek, as of a vice."},{"definition":"The land at each side of the mouth of a river, harbour, or channel.","example":"East Chop; West Chop"},{"definition":"An official stamp or seal, as in China and India."},{"definition":"A mark indicating nature, quality, or brand.","example":"silk of the first chop"},{"definition":"A license or passport that has been sealed."},{"definition":"A complete shipment.","example":"a chop of tea"},{"definition":"An IRC channel operator."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut into pieces with short, vigorous cutting motions.","example":"chop wood; chop an onion"},{"definition":"To sever with an axe or similar implement.","example":"Chop off his head."},{"definition":"To give a downward cutting blow or movement, typically with the side of the hand."},{"definition":"To hit the ball downward so that it takes a high bounce."},{"definition":"To divide the pot (or tournament prize) between two or more players."},{"definition":"To make a quick, heavy stroke or a series of strokes, with or as with an ax."},{"definition":"To do something suddenly with an unexpected motion; to catch or attempt to seize."},{"definition":"To interrupt; with in or out."},{"definition":"(Perl) To remove the final character from (a text string)."},{"definition":"To exchange, to barter; to swap."},{"definition":"To chap or crack."},{"definition":"To vary or shift suddenly.","example":"The wind chops about."},{"definition":"To twist words."},{"definition":"To converse, discuss, or speak with another."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chop-us"},{"text":"/tʃɒp/"}]},{"word":"EYEWEAR","idx":16064,"count":2315532,"meanings":[{"definitions":[{"definition":"A vision aid or similar device worn over the eyes, such as eyeglasses, contact lenses, or protective goggles."}],"partOfSpeech":"n"}]},{"word":"ROOTED","idx":16065,"count":2315294,"meanings":[{"definitions":[{"definition":"To grow roots; to enter the earth, as roots; to take root and begin to grow.","example":"The cuttings are starting to root."},{"definition":"To prepare, oversee, or otherwise cause the rooting of cuttings","example":"We rooted some cuttings last summer."},{"definition":"To be firmly fixed; to be established."},{"definition":"To get root or priviledged access on a computer system or mobile phone, often through bypassing some security mechanism.","example":"I want to root my Android phone so I can remove the preinstalled crapware."},{"definition":"To turn up or dig with the snout.","example":"A pig roots the earth for truffles."},{"definition":"(by extension) To seek favour or advancement by low arts or grovelling servility; to fawn."},{"definition":"To rummage; to search as if by digging in soil.","example":"rooting about in a junk-filled drawer"},{"definition":"To root out; to abolish."},{"definition":"To have sexual intercourse."},{"definition":"(with \"for\" or \"on\") To cheer (on); to show support (for) and hope for the success of. (See root for.)","example":"I'm rooting for you, don't let me down!"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having roots, or certain type of roots.","example":"deep-rooted"},{"definition":"Fixed in one position; immobile; unable to move.","example":"She stayed rooted in place."},{"definition":"Ingrained, as through repeated use; entrenched; habitual or instinctive."},{"definition":"(usually with \"in\") Having a basic or fundamental connection (to a thing); based, originating (from)."},{"definition":"(of a tree or graph) Having a root."},{"definition":"In trouble or in strife, screwed.","example":"I am absolutely rooted if Ferris finds out about this"},{"definition":"Broken, damaged, non-functional.","example":"I'm going to have to call a mechanic, my car's rooted."},{"definition":"Having a root (superuser) account that has been compromised."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rooted-us","text":"/ɹʊtɪd/"},{"audio":"rooted-au","text":"/ɹʊtɪd/"}]},{"word":"ONYX","idx":16066,"count":2315135,"meanings":[{"definitions":[{"definition":"A banded variety of chalcedony, a cryptocrystalline form of quartz."},{"definition":"A jet-black color, named after the gemstone."},{"definition":"Any of various lycaenid butterflies of the genus Horaga."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Jet-black"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɒnɪks/"}]},{"word":"BENCHES","idx":16067,"count":2315058,"meanings":[{"definitions":[{"definition":"A long seat with or without a back, found for example in parks and schools.","example":"They sat on a park bench and tossed bread crumbs to the ducks and pigeons."},{"definition":"The people who decide on the verdict; the judiciary.","example":"They are awaiting a decision on the motion from the bench."},{"definition":"The place where the judges sit.","example":"She sat on the bench for 30 years before she retired."},{"definition":"The dignity of holding an official seat.","example":"the bench of bishops"},{"definition":"The place where players (substitutes) and coaches sit when not playing.","example":"He spent the first three games on the bench, watching."},{"definition":"The number of players on a team able to participate, expressed in terms of length.","example":"Injuries have shortened the bench."},{"definition":"A place where assembly or hand work is performed; a workbench.","example":"She placed the workpiece on the bench, inspected it closely, and opened the cover."},{"definition":"A horizontal padded surface, usually adjustable in height and inclination and often with attached weight rack, used for proper posture during exercise."},{"definition":"A bracket used to mount land surveying equipment onto a stone or a wall.","example":"After removing the bench, we can use the mark left on the wall as a reference point."},{"definition":"A flat ledge in the slope of an earthwork, work of masonry, or similar."},{"definition":"A thin strip of relatively flat land bounded by steeper slopes above and below."},{"definition":"A kitchen surface on which to prepare food, a counter."},{"definition":"A bathroom surface which holds the washbasin, a vanity."},{"definition":"A collection or group of dogs exhibited to the public, traditionally on benches or raised platforms."},{"definition":"The weight one is able to bench press, especially the maximum weight capable of being pressed.","example":"He became frustrated when his bench increased by only 10 pounds despite a month of training."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove a player from play.","example":"They benched him for the rest of the game because they thought he was injured."},{"definition":"To remove someone from a position of responsibility temporarily."},{"definition":"To push a person backward against a conspirator behind them who is on their hands and knees, causing them to fall over."},{"definition":"To furnish with benches."},{"definition":"To place on a bench or seat of honour."},{"definition":"To lift by bench pressing","example":"I heard he can bench 150 pounds."},{"definition":"To recite the Birkat Hamazon."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɛntʃɪz/"}]},{"word":"ILLUMINATION","idx":16068,"count":2314953,"meanings":[{"definitions":[{"definition":"The act of illuminating, or supplying with light; the state of being illuminated."},{"definition":"Festive decoration of houses or buildings with lights."},{"definition":"Adornment of books and manuscripts with colored illustrations. See illuminate (transitive verb)."},{"definition":"Splendour; brightness."},{"definition":"Enlightening influence; inspiration."}],"partOfSpeech":"n"}]},{"word":"FREEDOMS","idx":16069,"count":2314731,"meanings":[{"definitions":[{"definition":"The state of being free, of not being imprisoned or enslaved.","example":"Having recently been released from prison, he didn't know what to do with his newfound freedom."},{"definition":"The lack of a specific constraint, or of constraints in general; a state of being free, unconstrained.","example":"Every child has a right to freedom from fear and freedom from want."},{"definition":"Frankness; openness; unreservedness."},{"definition":"Improper familiarity; violation of the rules of decorum."}],"partOfSpeech":"n"}]},{"word":"FOOLISH","idx":16071,"count":2314452,"meanings":[{"definitions":[{"definition":"(of a person, an action, etc.) Lacking good sense or judgement; unwise."},{"definition":"Resembling or characteristic of a fool."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"foolish-us","text":"/ˈfuː.lɪʃ/"},{"audio":"foolish-uk","text":"/ˈfuː.lɪʃ/"}]},{"word":"FINALE","idx":16072,"count":2314315,"meanings":[{"definitions":[{"definition":"The grand end of something, especially a show or piece of music."},{"definition":"The chronological conclusion of a series of narrative works."}],"partOfSpeech":"n"}]},{"word":"WEAKER","idx":16073,"count":2314182,"meanings":[{"definitions":[{"definition":"Lacking in force (usually strength) or ability.","example":"The child was too weak to move the boulder."},{"definition":"Unable to sustain a great weight, pressure, or strain.","example":"a weak timber; a weak rope"},{"definition":"Unable to withstand temptation, urgency, persuasion, etc.; easily impressed, moved, or overcome; accessible; vulnerable.","example":"weak resolutions; weak virtue"},{"definition":"Dilute, lacking in taste or potency.","example":"We were served stale bread and weak tea."},{"definition":"(grammar) Displaying a particular kind of inflection, including:"},{"definition":"That does not ionize completely into anions and cations in a solution.","example":"a weak acid;  a weak base"},{"definition":"One of the four fundamental forces associated with nuclear decay."},{"definition":"Bad or uncool.","example":"This place is weak."},{"definition":"Having a narrow range of logical consequences; narrowly applicable. (Often contrasted with a strong statement which implies it.)"},{"definition":"Resulting from, or indicating, lack of judgment, discernment, or firmness; unwise; hence, foolish."},{"definition":"Not having power to convince; not supported by force of reason or truth; unsustained.","example":"The prosecution advanced a weak case."},{"definition":"Lacking in vigour or expression.","example":"a weak sentence; a weak style"},{"definition":"Not prevalent or effective, or not felt to be prevalent; not potent; feeble."},{"definition":"Tending towards lower prices.","example":"a weak market; wheat is weak at present"},{"definition":"Lacking contrast.","example":"a weak negative"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈwikɚ/"},{"text":"/ˈwiːkə/"}]},{"word":"FOLEY","idx":16074,"count":2314106,"meanings":[{"definitions":[{"definition":"The creation of sound effects, and their addition to film and TV images"},{"definition":"A foley artist"},{"definition":"A Foley catheter."}],"partOfSpeech":"n"}]},{"word":"FIR","idx":16075,"count":2312692,"meanings":[{"definitions":[{"definition":"A conifer of the genus Abies."},{"definition":"Any pinaceous conifer of related genera, especially a Douglas fir (Pseudotsuga) or a Scots pine (Pinus sylvestris)."},{"definition":"Wood of such trees."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fir-us","text":"/fɝ/"},{"audio":"fir-uk","text":"/fɜː(ɹ)/"}]},{"word":"MORAN","idx":16077,"count":2312457,"meanings":[{"definitions":[{"definition":"An unmarried Maasai or Samburu warrior."}],"partOfSpeech":"n"}]},{"word":"DECAL","idx":16078,"count":2311933,"meanings":[{"definitions":[{"definition":"A design or picture produced in order to be transferred to another surface either permanently or temporarily."},{"definition":"A decorative sticker."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply decals to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"decal-ca","text":"/dɪˈkæl/"}]},{"word":"COMPOSE","idx":16079,"count":2311784,"meanings":[{"definitions":[{"definition":"To make something by merging parts.","example":"The editor composed a historical journal from many individual letters."},{"definition":"To make up the whole; to constitute.","example":"A church is composed of its members."},{"definition":"To comprise."},{"definition":"To construct by mental labor; to think up; particularly, to produce or create a literary or musical work.","example":"It's difficult to compose without absolute silence."},{"definition":"(sometimes reflexive) To calm; to free from agitation.","example":"The defendant couldn't compose herself and was found in contempt."},{"definition":"To arrange the elements of a photograph or other picture."},{"definition":"To settle (an argument, dispute etc.); to come to a settlement."},{"definition":"To arrange in proper form; to reduce to order; to put in proper state or condition."},{"definition":"To arrange (types) in a composing stick for printing; to typeset."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"compose-us","text":"/kəmˈpoʊz/"}]},{"word":"NAUSEA","idx":16080,"count":2311479,"meanings":[{"definitions":[{"definition":"A feeling of illness or discomfort in the digestive system, usually characterized by a strong urge to vomit."},{"definition":"Strong dislike or disgust."},{"definition":"Motion sickness."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnɑsi.ə/"},{"text":"/ˈnɔsi.ə/"},{"text":"/ˈnɔːsɪə/"}]},{"word":"COMFORTABLY","idx":16081,"count":2310081,"meanings":[{"definitions":[{"definition":"In a comfortable manner.","example":"I snuggled comfortably into the blankets."},{"definition":"Easily; without effort or difficulty."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"comfortably-us","text":"/ˈkʌmftɚbli/"}]},{"word":"HOOP","idx":16082,"count":2310001,"meanings":[{"definitions":[{"definition":"A circular band of metal used to bind a barrel."},{"definition":"A ring; a circular band; anything resembling a hoop.","example":"the cheese hoop, or cylinder in which the curd is pressed in making cheese"},{"definition":"A circular band of metal, wood, or similar material used for forming part of a framework such as an awning or tent."},{"definition":"A circle, or combination of circles, of thin whalebone, metal, or other elastic material, used for expanding the skirts of ladies' dresses; (hence, by extension) a hoop petticoat or hoop skirt."},{"definition":"A quart pot; so called because originally bound with hoops, like a barrel. Also, a portion of the contents measured by the distance between the hoops."},{"definition":"An old measure of capacity, variously estimated at from one to four pecks."},{"definition":"The rim part of a basketball net."},{"definition":"(in plural, metonym) The game of basketball."},{"definition":"A hoop earring."},{"definition":"(metonym) A jockey; from a common pattern on the blouse."},{"definition":"(usually in the plural) A horizontal stripe on the jersey"},{"definition":"(usually in the plural) A requirement that must be met in order to proceed."},{"definition":"A shout; a whoop, as in whooping cough."},{"definition":"The hoopoe."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bind or fasten using a hoop.","example":"to hoop a barrel or puncheon"},{"definition":"To clasp; to encircle; to surround."},{"definition":"To utter a loud cry, or a sound imitative of the word, by way of call or pursuit; to shout."},{"definition":"To whoop, as in whooping cough."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hoop-au","text":"/huːp/"}]},{"word":"ADDICTIVE","idx":16083,"count":2309956,"meanings":[{"definitions":[{"definition":"A drug that causes an addiction."},{"definition":"Anything that is very habit-forming."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing or tending to cause addiction; habit-forming.","example":"These are addictive drugs."},{"definition":"Enjoyable.","example":"Have you seen that new TV show? It's so addictive."},{"definition":"Characterized by or susceptible to addiction.","example":"He has an addictive personality."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈdɪktɪv/"}]},{"word":"CLARINET","idx":16084,"count":2309907,"meanings":[{"definitions":[{"definition":"A woodwind musical instrument that has a distinctive liquid tone whose characteristics vary among its three registers: chalumeau (low), clarion (medium), and altissimo (high)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"clarinet-us","text":"/ˌklæɹɪˈnɛt/"}]},{"word":"TEMPS","idx":16085,"count":2309859,"meanings":[{"definitions":[{"definition":"A temporary employee, usually in an office."},{"definition":"A temporary storage location."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To work as a temporary employee."}],"partOfSpeech":"ve"}]},{"word":"CLEARER","idx":16087,"count":2309498,"meanings":[{"definitions":[{"definition":"Transparent in colour.","example":"as clear as crystal"},{"definition":"Bright, not dark or obscured.","example":"Congress passed the President’s Clear Skies legislation."},{"definition":"Free of obstacles.","example":"The coast is clear."},{"definition":"Without clouds.","example":"clear weather; a clear day"},{"definition":"Of the sky, such that less than one eighth of its area is obscured by clouds."},{"definition":"Free of ambiguity or doubt.","example":"Do I make myself clear? Crystal clear."},{"definition":"Distinct, sharp, well-marked."},{"definition":"Free of guilt, or suspicion.","example":"a clear conscience"},{"definition":"(of a soup) Without a thickening ingredient."},{"definition":"Possessing little or no perceptible stimulus.","example":"clear of texture;  clear of odor"},{"definition":"Free from the influence of engrams; see Clear (Scientology)."},{"definition":"Able to perceive clearly; keen; acute; penetrating; discriminating.","example":"a clear intellect; a clear head"},{"definition":"Not clouded with passion; serene; cheerful."},{"definition":"Easily or distinctly heard; audible."},{"definition":"Unmixed; entirely pure.","example":"clear sand"},{"definition":"Without defects or blemishes, such as freckles or knots.","example":"a clear complexion; clear lumber"},{"definition":"Without diminution; in full; net.","example":"a clear profit"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Someone who or something which clears."},{"definition":"A tool by which the hemp for lines and twines, used by sailmakers, is finished."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"clearer-us","text":"/ˈklɪɹɚ/"}]},{"word":"FLOODS","idx":16089,"count":2309318,"meanings":[{"definitions":[{"definition":"A (usually disastrous) overflow of water from a lake or other body of water due to excessive rainfall or other input of water."},{"definition":"A large number or quantity of anything appearing more rapidly than can easily be dealt with.","example":"a flood of complaints"},{"definition":"The flowing in of the tide, opposed to the ebb."},{"definition":"A floodlight."},{"definition":"Menstrual discharge; menses."},{"definition":"Water as opposed to land."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To overflow, as by water from excessive rainfall."},{"definition":"To cover or partly fill as if by a flood.","example":"The floor was flooded with beer."},{"definition":"To provide (someone or something) with a larger number or quantity of something than can easily be dealt with.","example":"The station's switchboard was flooded with listeners making complaints."},{"definition":"To paste numerous lines of text to (a chat system) in order to disrupt the conversation."},{"definition":"To bleed profusely, as after childbirth."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/flʌdz/"}]},{"word":"GIGABYTE","idx":16090,"count":2309317,"meanings":[{"definitions":[{"definition":"(SI) 109, one billion (1,000,000,000) bytes. SI symbol: GB"},{"definition":"A gibibyte or 10243 (1,073,741,824) bytes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʒɪɡəbaɪt/"},{"text":"/ˈɡɪɡəbaɪt/"}]},{"word":"FRITZ","idx":16091,"count":2309089,"meanings":[{"definitions":[{"definition":"The state of being defective."},{"definition":"(chiefly South Australia) A type of processed meat sausage; devon"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go wrong or become defective."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fritz-au","text":"/fɹɪts/"}]},{"word":"MOVER","idx":16092,"count":2309084,"meanings":[{"definitions":[{"definition":"Someone who or something that moves."},{"definition":"A dancer."},{"definition":"A person employed to help people move their possessions from one residence to another."},{"definition":"Someone who proposes a motion at a meeting."}],"partOfSpeech":"n"}]},{"word":"MODELED","idx":16094,"count":2307095,"meanings":[{"definitions":[{"definition":"To display for others to see, especially in regard to wearing clothing while performing the role of a fashion model","example":"She modelled the shoes for her friends to see."},{"definition":"To use as an object in the creation of a forecast or model","example":"They modelled the data with a computer to analyze the experiment’s results."},{"definition":"To make a miniature model of","example":"He takes great pride in his skill at modeling airplanes."},{"definition":"To create from a substance such as clay","example":"The sculptor modelled the clay into the form of a dolphin."},{"definition":"To make a model or models"},{"definition":"To be a model of any kind","example":"The actress used to model before being discovered by Hollywood."}],"partOfSpeech":"ve"}]},{"word":"ERICA","idx":16095,"count":2307054,"meanings":[{"definitions":[{"definition":"Any of many heathers, of the genus Erica, used as garden plants"}],"partOfSpeech":"n"}]},{"word":"RAINFOREST","idx":16097,"count":2305867,"meanings":[{"definitions":[{"definition":"A forest in a climate with high annual rainfall and no dry season."}],"partOfSpeech":"n"}]},{"word":"FEDERALLY","idx":16098,"count":2305397,"meanings":[{"definitions":[{"definition":"In a federal manner."}],"partOfSpeech":"v"}]},{"word":"SUSTAINING","idx":16099,"count":2305240,"meanings":[{"definitions":[{"definition":"To maintain, or keep in existence.","example":"The city came under sustained attack by enemy forces."},{"definition":"To provide for or nourish.","example":"provisions to sustain an army"},{"definition":"To encourage or sanction (something)."},{"definition":"To experience or suffer (an injury, etc.).","example":"The building sustained major damage in the earthquake."},{"definition":"To confirm, prove, or corroborate; to uphold.","example":"to sustain a charge, an accusation, or a proposition"},{"definition":"To keep from falling; to bear; to uphold; to support.","example":"A foundation sustains the superstructure; an animal sustains a load; a rope sustains a weight."},{"definition":"To aid, comfort, or relieve; to vindicate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is sustained or upheld."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That sustains, supports or provides sustenance."}],"partOfSpeech":"j"}]},{"word":"REPAIRED","idx":16101,"count":2304344,"meanings":[{"definitions":[{"definition":"To restore to good working order, fix, or improve damaged condition; to mend; to remedy.","example":"to repair a house, a road, a shoe, or a ship"},{"definition":"To make amends for, as for an injury, by an equivalent; to indemnify for.","example":"to repair a loss or damage"},{"definition":"To transfer oneself to another place.","example":"to repair to sanctuary for safety"},{"definition":"To pair again"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"repaired-us","text":"/ɹɪˈpɛɹd/"}]},{"word":"DIOCESE","idx":16102,"count":2304337,"meanings":[{"definitions":[{"definition":"Administrative division of the later Roman Empire, starting with the tetrarchy."},{"definition":"Region administered by a bishop."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-siːz/"}]},{"word":"OBITUARY","idx":16104,"count":2304274,"meanings":[{"definitions":[{"definition":"A brief notice of a person’s death, as published in a newspaper."},{"definition":"A biography of a recently deceased person, written by a journalist and published in a newspaper."},{"definition":"A register of deaths in a monastery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to the death of a person."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"obituary-uk","text":"/əʊ̯ˈbɪtjʊəɹiː/"}]},{"word":"MULTINATIONAL","idx":16105,"count":2304039,"meanings":[{"definitions":[{"definition":"A multinational company."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or involving more than two countries."},{"definition":"(of a business organization) Operating, or having subsidiary companies in multiple countries (especially more than two)."}],"partOfSpeech":"j"}]},{"word":"PAINTERS","idx":16106,"count":2303826,"meanings":[{"definitions":[{"definition":"An artist who paints pictures."},{"definition":"A laborer or workman who paints surfaces using a paintbrush or other means."},{"definition":"A chain or rope used to attach the shank of an anchor to the side of a ship when not in use."},{"definition":"A rope connected to the bow of a boat, used to attach it to e.g. a jetty or another boat."},{"definition":"A mountain lion."}],"partOfSpeech":"n"}]},{"word":"THISTLE","idx":16107,"count":2303759,"meanings":[{"definitions":[{"definition":"Any of several perennial composite plants, especially of genera Cirsium, Carduus, Cynara, or Onopordum, having prickly leaves and showy flower heads with prickly bracts."},{"definition":"This plant seen as the national emblem of Scotland."},{"definition":"This plant used as a charge."},{"definition":"The Order of the Thistle, or membership thereof."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"thistle-us","text":"/θɪsl̩/"}]},{"word":"SLEEPY","idx":16110,"count":2303460,"meanings":[{"definitions":[{"definition":"The gum that builds up in the eye; sleep, gound."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Tired; feeling the need for sleep."},{"definition":"Suggesting tiredness."},{"definition":"Tending to induce sleep; soporific.","example":"a sleepy drink or potion"},{"definition":"Dull; lazy; heavy; sluggish."},{"definition":"Quiet; without bustle or activity.","example":"a sleepy English village"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sleepy-us","text":"/ˈsliːpi/"}]},{"word":"NOPE","idx":16111,"count":2303364,"meanings":[{"definitions":[{"definition":"A negative reply, no.","example":"I'll take that as a nope, then."},{"definition":"An intensely undesirable thing, such as a circumstance or an animal, eliciting immediate repulsion without possibility of further consideration."},{"definition":"(except near Staffordshire) A bullfinch"},{"definition":"A blow to the head."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit someone on the head."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"nope-1-au","text":"/noʊp/"}]},{"word":"FOOTNOTES","idx":16112,"count":2303110,"meanings":[{"definitions":[{"definition":"A short piece of text, often numbered, placed at the bottom of a printed page, that adds a comment, citation, reference etc, to a designated part of the main text.","example":"consult the footnotes for more details"},{"definition":"(by extension) An event of lesser importance than some larger event to which it is related.","example":"a mere footnote in history"},{"definition":"A qualification to the import of something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add footnotes to a text."}],"partOfSpeech":"ve"}]},{"word":"SHRINE","idx":16115,"count":2302579,"meanings":[{"definitions":[{"definition":"A holy or sacred place dedicated to a specific deity, ancestor, hero, martyr, saint, or similar figure of awe and respect, at which said figure is venerated or worshipped."},{"definition":"A case, box, or receptacle, especially one in which are deposited sacred relics, as the bones of a saint."},{"definition":"A place or object hallowed from its history or associations.","example":"a shrine of art"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enshrine; to place reverently, as if in a shrine."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shrine-us","text":"/ʃɹaɪ̯n/"}]},{"word":"ASPIRIN","idx":16116,"count":2302297,"meanings":[{"definitions":[{"definition":"An analgesic drug, acetylsalicylic acid"},{"definition":"A tablet containing this substance"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæspɪɹɪn/"}]},{"word":"PURIFIED","idx":16117,"count":2302093,"meanings":[{"definitions":[{"definition":"Made or rendered pure or more pure.","example":"He will only drink purified water."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To cleanse, or rid of impurities."},{"definition":"To free from guilt or sin."},{"definition":"To become pure."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"purified-us"}]},{"word":"STRIVING","idx":16118,"count":2301814,"meanings":[{"definitions":[{"definition":"Effort; the act of one who strives."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"striving-us","text":"/ˈstɹaɪvɪŋ/"}]},{"word":"DIRE","idx":16119,"count":2301525,"meanings":[{"definitions":[{"definition":"Warning of bad consequences: ill-boding; portentous.","example":"dire omens"},{"definition":"Requiring action to prevent bad consequences: urgent, pressing.","example":"dire need"},{"definition":"Expressing bad consequences: dreadful; dismal","example":"dire consequences;  to be in dire straits"},{"definition":"Bad in quality, awful, terrible."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dire-us","text":"/ˈdaɪ̯ə(ɹ)/"}]},{"word":"ATTENDANT","idx":16120,"count":2301496,"meanings":[{"definitions":[{"definition":"One who attends; one who works with or watches over something.","example":"Give your keys to the parking attendants and they will park your car for you."},{"definition":"A servant or valet."},{"definition":"A visitor or caller."},{"definition":"That which accompanies or follows."},{"definition":"One who owes a duty or service to another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Going with; associated; concomitant.","example":"They promoted him to supervisor, with all the attendant responsibilities and privileges."},{"definition":"Depending on, or owing duty or service to.","example":"the widow attendant to the heir"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"attendant-us","text":"/əˈtɛndənt/"}]},{"word":"GULL","idx":16121,"count":2301164,"meanings":[{"definitions":[{"definition":"A seabird of the genus Larus or of the family Laridae."},{"definition":"Any of various pierid butterflies of the genus Cepora."},{"definition":"A cheating trick; a fraud."},{"definition":"One easily cheated; a dupe."},{"definition":"(Oxford University slang) A swindler or trickster."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deceive or cheat."},{"definition":"To mislead."},{"definition":"To trick and defraud."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gull-us","text":"/ˈɡʌl/"}]},{"word":"SPOILERS","idx":16124,"count":2300642,"meanings":[{"definitions":[{"definition":"One who spoils; a plunderer; a pillager; a robber; a despoiler."},{"definition":"One who corrupts, mars, or renders useless."},{"definition":"A document, review or comment that discloses the ending or some key surprise or twist in a story, or the internal rules controlling the behaviour of a video game, etc."},{"definition":"A device to reduce lift."},{"definition":"A device to reduce lift and increase downforce"},{"definition":"An individual (or organisation etc.), unable to win themselves, who spoils the chances of another's victory."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark (a document or message) with a spoiler warning, to prevent readers from accidentally learning details they would prefer not to know."},{"definition":"To tell (a person) details of how a story ends etc.","example":"I've been spoilered, so I doubt I'll be able to enjoy the final episode."}],"partOfSpeech":"ve"}]},{"word":"MACHINING","idx":16126,"count":2300268,"meanings":[{"definitions":[{"definition":"To make by machinery."},{"definition":"To shape or finish by machinery."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process of machining, of manufacturing or finishing by machine."}],"partOfSpeech":"n"}]},{"word":"MALIBU","idx":16127,"count":2300139,"meanings":[{"definitions":[{"definition":"A type of lightweight longboard known for its stability."}],"partOfSpeech":"n"}]},{"word":"MEMOIR","idx":16128,"count":2299845,"meanings":[{"definitions":[{"definition":"An autobiography; a book describing the personal experiences of an author.","example":"When I retire, I'm going to write my memoirs."},{"definition":"A biography; a book describing the experiences of a subject from personal knowledge of the subject or from sources with personal knowledge of the subject.","example":"James wrote a memoir of his grandmother shortly after she passed away."},{"definition":"Any form of narrative describing the personal experiences of a writer."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɛmˌwɑɹ/"},{"text":"/ˈmɛmˌwɑː/"}]},{"word":"REDUNDANCY","idx":16132,"count":2299058,"meanings":[{"definitions":[{"definition":"The state of being redundant"},{"definition":"A superfluity; something redundant or excessive; a needless repetition in language"},{"definition":"Duplication of components or circuits to provide survival of the total system in case of failure of single components."},{"definition":"Duplication of parts of a message to guard against transmission errors."},{"definition":"The state of being unemployed because one's job is no longer necessary; the dismissal of such an employee; a layoff."},{"definition":"Surplusage inserted in a pleading which may be rejected by the court without impairing the validity of what remains."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹə-/"},{"text":"/ɹɪˈdʌnd(ə)nsi/"},{"audio":"redundancy-au"}]},{"word":"FAUNA","idx":16134,"count":2298940,"meanings":[{"definitions":[{"definition":"Animals considered as a group; especially those of a particular country, region, time.","example":"the fauna of China"},{"definition":"A book, cataloguing the animals of a country."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɔː.nə/"}]},{"word":"CLIFFS","idx":16135,"count":2298828,"meanings":[{"definitions":[{"definition":"A symbol found on a musical staff that indicates the pitches represented by the lines and the spaces on the staff"},{"definition":"A vertical (or nearly vertical) rock face."},{"definition":"A point where something abruptly fails or decreases in value etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/klɪfs/"}]},{"word":"EMO","idx":16137,"count":2298484,"meanings":[{"definitions":[{"definition":"(early 1990s) A particular style of hardcore punk rock"},{"definition":"(early 1990s) An individual or group of people associated with that subculture and musical style."},{"definition":"(late 1990s-current) Any form of guitar-driven alternative rock that is particularly or notably emotional"},{"definition":"(late 1990s-current) An individual or group of people associated with a fashion or stereotype of that style of rock."},{"definition":"(2000s) A young person who is considered to be over-emotional or stereotypically emo."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Emotional; sensitive."},{"definition":"Depressed."},{"definition":"Associated with youth subcultures embodying emotional sensitivity."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈi.moʊ/"}]},{"word":"ROADSIDE","idx":16138,"count":2298262,"meanings":[{"definitions":[{"definition":"The area on either side of a road.","example":"I pulled over to the roadside to check the map."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Located beside a road.","example":"The roadside stand did a good business just selling products to people who merely wanted directions."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"roadside-us","text":"/ˈɹoʊdsaɪd/"}]},{"word":"SMELLS","idx":16139,"count":2298156,"meanings":[{"definitions":[{"definition":"A sensation, pleasant or unpleasant, detected by inhaling air (or, the case of water-breathing animals, water) carrying airborne molecules of a substance.","example":"I love the smell of fresh bread."},{"definition":"The sense that detects odours."},{"definition":"A conclusion or intuition that a situation is wrong, more complex than it seems, or otherwise inappropriate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sense a smell or smells.","example":"I can smell fresh bread."},{"definition":"Followed by like or of if descriptive: to have a particular smell, whether good or bad.","example":"Her feet smell of cheese."},{"definition":"(without a modifier) To smell bad; to stink.","example":"Ew, this stuff smells."},{"definition":"To have a particular tincture or smack of any quality; to savour.","example":"A report smells of calumny."},{"definition":"To exercise sagacity."},{"definition":"To detect or perceive; often with out."},{"definition":"To give heed to."}],"partOfSpeech":"ve"}]},{"word":"DISPOSE","idx":16140,"count":2298026,"meanings":[{"definitions":[{"definition":"The disposal or management of something."},{"definition":"Behaviour; disposition."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(used with \"of\") To eliminate or to get rid of something.","example":"I dispose of my trash in the garbage can."},{"definition":"To distribute or arrange; to put in place."},{"definition":"To deal out; to assign to a use."},{"definition":"To incline.","example":"In these uncertain times, I am disposed towards caution."},{"definition":"To bargain; to make terms."},{"definition":"To regulate; to adjust; to settle; to determine."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dispose-us","text":"/dɪsˈpoʊz/"}]},{"word":"DETOX","idx":16141,"count":2297343,"meanings":[{"definitions":[{"definition":"Detoxification, especially of the body from alcohol or illegal, addictive drugs."},{"definition":"A detoxification unit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To detoxify, especially from alcohol or recreational drugs."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdiːtɒks/"}]},{"word":"WAKING","idx":16142,"count":2297304,"meanings":[{"definitions":[{"definition":"(often followed by up) To stop sleeping.","example":"I woke up at four o'clock this morning."},{"definition":"(often followed by up) To make somebody stop sleeping; to rouse from sleep.","example":"The neighbour's car alarm woke me from a strange dream."},{"definition":"To put in motion or action; to arouse; to excite."},{"definition":"To be excited or roused up; to be stirred up from a dormant, torpid, or inactive state; to be active."},{"definition":"To lay out a body prior to burial in order to allow family and friends to pay their last respects."},{"definition":"To watch, or sit up with, at night, as a dead body."},{"definition":"To be or remain awake; not to sleep."},{"definition":"To be alert; to keep watch","example":"Command unto the guards that they diligently wake."},{"definition":"To sit up late for festive purposes; to hold a night revel."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of becoming awake from sleep, or a period of time spent awake."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Occurring during wakefulness."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈweɪkɪŋ/"}]},{"word":"FEATHERS","idx":16143,"count":2297128,"meanings":[{"definitions":[{"definition":"A branching, hair-like structure that grows on the bodies of birds, used for flight, swimming, protection and display."},{"definition":"Long hair on the lower legs of a dog or horse, especially a draft horse, notably the Clydesdale breed. Narrowly only the rear hair."},{"definition":"One of the fins or wings on the shaft of an arrow."},{"definition":"A longitudinal strip projecting from an object to strengthen it, or to enter a channel in another object and thereby prevent displacement sideways but permit motion lengthwise; a spline."},{"definition":"Kind; nature; species (from the proverbial phrase \"birds of a feather\")."},{"definition":"One of the two shims of the three-piece stone-splitting tool known as plug and feather or plug and feathers; the feathers are placed in a borehole and then a wedge is driven between them, causing the stone to split."},{"definition":"The angular adjustment of an oar or paddle-wheel float, with reference to a horizontal axis, as it leaves or enters the water."},{"definition":"Anything petty or trifling; a whit or jot."},{"definition":"(in the plural) Partridges and pheasants, as opposed to rabbits and hares (called fur)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or furnish with feathers."},{"definition":"To arrange in the manner or appearance of feathers.","example":"The stylist feathered my hair."},{"definition":"To rotate the oars while they are out of the water to reduce wind resistance."},{"definition":"To streamline the blades of an aircraft's propeller by rotating them perpendicular to the axis of the propeller when the engine is shut down so that the propeller does not windmill during flight.","example":"After striking the bird, the pilot feathered the left, damaged engine’s propeller."},{"definition":"To finely shave or bevel an edge."},{"definition":"To intergrade or blend the pixels of an image with those of a background or neighboring image."},{"definition":"To adorn, as with feathers; to fringe."},{"definition":"To render light as a feather; to give wings to."},{"definition":"To enrich; to exalt; to benefit."},{"definition":"To tread, as a cock."},{"definition":"To accidentally touch the cue ball with the tip of the cue when taking aim"}],"partOfSpeech":"ve"}]},{"word":"SKATEBOARD","idx":16144,"count":2296744,"meanings":[{"definitions":[{"definition":"A narrow, wooden or plastic platform mounted on pairs of wheels, on which one stands and propels oneself by pushing along the ground with one foot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a skateboard."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"skateboard-us"}]},{"word":"REFLEX","idx":16145,"count":2296477,"meanings":[{"definitions":[{"definition":"An automatic response to a simple stimulus which does not require mental processing."},{"definition":"The descendant of an earlier language element, such as a word or phoneme, in a daughter language."},{"definition":"The descendant of anything from an earlier time, such as a cultural myth."},{"definition":"Reflection or an image produced by reflection. The light reflected from an illuminated surface to one in shade."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bend, turn back or reflect."},{"definition":"To respond to a stimulus."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Bent, turned back or reflected."},{"definition":"Produced automatically by a stimulus."},{"definition":"(of an angle) Having greater than 180 degrees but less than 360 degrees."},{"definition":"Illuminated by light reflected from another part of the same picture."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"reflex-uk"}]},{"word":"FALCONS","idx":16146,"count":2296397,"meanings":[{"definitions":[{"definition":"Any bird of the genus Falco, all of which are birds of prey."},{"definition":"A female such bird, a male being a tiercel."},{"definition":"A light cannon used from the 15th to the 17th century; a falconet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hunt with a falcon or falcons."}],"partOfSpeech":"ve"}]},{"word":"AUTOMATE","idx":16147,"count":2296259,"meanings":[{"definitions":[{"definition":"To replace or enhance human labor with machines.","example":"Many offices still need to automate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"automate-us","text":"/ˈɔtoʊˌmeɪt/"}]},{"word":"DROSOPHILA","idx":16148,"count":2295980,"meanings":[{"definitions":[{"definition":"Any fruit fly of the genus Drosophila"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɹoʊˈsɑfələ/"}]},{"word":"SPURS","idx":16150,"count":2295629,"meanings":[{"definitions":[{"definition":"To ask, to inquire"},{"definition":"To prod (especially a horse) on the side or flank, with the intent to urge motion or haste, to gig."},{"definition":"To urge or encourage to action, or to a more vigorous pursuit of an object"},{"definition":"To put spurs on.","example":"to spur boots"},{"definition":"To press forward; to travel in great haste."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A rigid implement, often roughly y-shaped, that is fixed to one's heel for the purpose of prodding a horse. Often worn by, and emblematic of, the cowboy or the knight."},{"definition":"A jab given with the spurs."},{"definition":"Anything that inspires or motivates, as a spur does a horse."},{"definition":"An appendage or spike pointing rearward, near the foot, for instance that of a rooster."},{"definition":"Any protruding part connected at one end, for instance a highway that extends from another highway into a city."},{"definition":"Roots, tree roots."},{"definition":"A mountain that shoots from another mountain or range and extends some distance in a lateral direction, or at right angles."},{"definition":"A spiked iron worn by seamen upon the bottom of the boot, to enable them to stand upon the carcass of a whale to strip off the blubber."},{"definition":"A brace strengthening a post and some connected part, such as a rafter or crossbeam; a strut."},{"definition":"The short wooden buttress of a post."},{"definition":"A projection from the round base of a column, occupying the angle of a square plinth upon which the base rests, or bringing the bottom bed of the base to a nearly square form. It is generally carved in leafage."},{"definition":"Ergotized rye or other grain."},{"definition":"A wall in a fortification that crosses a part of a rampart and joins to an inner wall."},{"definition":"A piece of timber fixed on the bilgeways before launching, having the upper ends bolted to the vessel's side."},{"definition":"A curved piece of timber serving as a half to support the deck where a whole beam cannot be placed."},{"definition":"A branch of a vein."},{"definition":"A very short branch line of a railway line."},{"definition":"A short thin side shoot from a branch, especially one that bears fruit or, in conifers, the shoots that bear the leaves."},{"definition":"A tern."},{"definition":"A spurious tone, one that interferes with a signal in a circuit and is often masked underneath that signal."},{"definition":"The track of an animal, such as an otter; a spoor."}],"partOfSpeech":"n"}]},{"word":"SION","idx":16151,"count":2295561,"meanings":[{"definitions":[{"definition":"A descendant, especially a first-generation descendant of a distinguished family."},{"definition":"The heir to a throne."},{"definition":"A guardian."},{"definition":"A detached shoot or twig containing buds from a woody plant, used in grafting; a shoot or twig in a general sense."}],"partOfSpeech":"n"}]},{"word":"ORTHO","idx":16152,"count":2295530,"meanings":[{"definitions":[{"definition":"An isomer of a benzene derivative having two substituents adjacent on the ring."},{"definition":"A certain type of flat eyepiece."},{"definition":"An orthochromatic plate."},{"definition":"(imaging) An orthophoto."},{"definition":"Orthopedics."}],"partOfSpeech":"n"}]},{"word":"CRASHED","idx":16153,"count":2295284,"meanings":[{"definitions":[{"definition":"To collide with something destructively, fall or come down violently."},{"definition":"To severely damage or destroy something by causing it to collide with something else.","example":"I'm sorry for crashing the bike into a wall. I'll pay for repairs."},{"definition":"(via gatecrash) To attend a social event without invitation, usually with unfavorable intentions.","example":"We weren't invited to the party so we decided to crash it."},{"definition":"To accelerate a project or a task or its schedule by devoting more resources to it."},{"definition":"To make or experience informal temporary living arrangements, especially overnight.","example":"Hey dude, can I crash at your pad?"},{"definition":"To give, as a favor."},{"definition":"To lie down for a long rest, sleep or nap, as from tiredness or exhaustion."},{"definition":"(hardware) To terminate extraordinarily.","example":"If the system crashes again, we'll have it fixed in the computer shop."},{"definition":"(hardware) To cause to terminate extraordinarily.","example":"Double-clicking this icon crashes the desktop."},{"definition":"To experience a period of depression and/or lethargy after a period of euphoria, as after the euphoric effect of a psychotropic drug has dissipated."},{"definition":"To hit or strike with force"},{"definition":"(of a patient's condition) To take a sudden and severe turn for the worse; to rapidly deteriorate."},{"definition":"To make a sudden loud noise.","example":"Thunder crashed directly overhead."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɹæʃt/"}]},{"word":"APPRAISALS","idx":16154,"count":2294795,"meanings":[{"definitions":[{"definition":"The act or process of developing an opinion of value."},{"definition":"A judgment or assessment of the value of something, especially a formal one."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈpɹeɪzəlz/"}]},{"word":"TRAVELLED","idx":16155,"count":2294125,"meanings":[{"definitions":[{"definition":"To be on a journey, often for pleasure or business and with luggage; to go from one place to another."},{"definition":"To pass from here to there; to move or transmit; to go from one place to another.","example":"Soundwaves can travel through water."},{"definition":"To move illegally by walking or running without dribbling the ball."},{"definition":"To travel throughout (a place).","example":"I’ve travelled the world."},{"definition":"To force to journey."},{"definition":"To labour; to travail."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Frequented by travelers.","example":"We climbed up a well traveled path."},{"definition":"Experienced in travel.","example":"Our guide was a much traveled young man."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"travelled-us","text":"/ˈtɹævl̩d/"}]},{"word":"URGENCY","idx":16156,"count":2294018,"meanings":[{"definitions":[{"definition":"The quality or condition of being urgent","example":"the urgency of a demand"},{"definition":"Insistence, pressure","example":"I have this sudden urgency to use the toilet."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɝ.dʒən.si/"}]},{"word":"FLASHES","idx":16157,"count":2293952,"meanings":[{"definitions":[{"definition":"A device that produces a short flash of light to help illuminate a scene, mostly for night-time or indoors photography."},{"definition":"A sudden, short, temporary burst of light."},{"definition":"A very short amount of time."},{"definition":"A flashlight; an electric torch."},{"definition":"A sudden and brilliant burst, as of genius or wit."},{"definition":"Material left around the edge of a moulded part at the parting line of the mould."},{"definition":"(Cockney) The strips of bright cloth or buttons worn around the collars of market traders."},{"definition":"A pattern where each prop is thrown and caught only once."},{"definition":"A language, created by a minority to maintain cultural identity, that cannot be understood by the ruling class."},{"definition":"A preparation of capsicum, burnt sugar, etc., for colouring liquor to make it look stronger."},{"definition":"A form of military insignia.","example":"I just got my first commando flash."},{"definition":"Any of various lycaenid butterflies of the genera Artipe, Deudorix and Rapala."},{"definition":"A tattoo flash."},{"definition":"The sudden sensation of being \"high\" after taking a recreational drug."},{"definition":"A newsflash."},{"definition":"A pool."},{"definition":"A reservoir and sluiceway beside a navigable stream, just above a shoal, so that the stream may pour in water as boats pass, and thus bear them over the shoal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to shine briefly or intermittently.","example":"He flashed the light at the water, trying to see what made the noise."},{"definition":"To blink; to shine or illuminate intermittently.","example":"The light flashed on and off."},{"definition":"To be visible briefly.","example":"The scenery flashed by quickly."},{"definition":"To make visible briefly.","example":"A number will be flashed on the screen."},{"definition":"To briefly, and often unintentionally, expose one's naked body or underwear, or part of it, in public. (Contrast streak.)","example":"Her skirt was so short that she flashed her underpants as she was getting out of her car."},{"definition":"To show or expose an \"inappropriate\" part of the body to someone for humorous reasons or as an act of contempt."},{"definition":"To break forth like a sudden flood of light; to show a momentary brilliance."},{"definition":"To flaunt; to display in a showy manner.","example":"He flashed a wad of hundred-dollar bills."},{"definition":"To communicate quickly.","example":"The news services flashed the news about the end of the war to all corners of the globe."},{"definition":"To move, or cause to move, suddenly.","example":"Flash forward to the present day."},{"definition":"To telephone a person, only allowing the phone to ring once, in order to request a call back.","example":"Susan flashed Jessica, and then Jessica called her back, because Susan didn't have enough credit on her phone to make the call."},{"definition":"(of liquid) To evaporate suddenly. (See flash evaporation.)"},{"definition":"To climb (a route) successfully on the first attempt."},{"definition":"To write to the memory of (an updatable component such as a BIOS chip or games cartridge)."},{"definition":"(glassmaking) To cover with a thin layer, as objects of glass with glass of a different colour."},{"definition":"(glassmaking) To expand (blown glass) into a disc."},{"definition":"To send by some startling or sudden means."},{"definition":"To burst out into violence."},{"definition":"To perform a flash."},{"definition":"To release the pressure from a pressurized vessel."},{"definition":"To trick up in a showy manner."},{"definition":"To strike and throw up large bodies of water from the surface; to splash."}],"partOfSpeech":"ve"}]},{"word":"BRIT","idx":16160,"count":2293348,"meanings":[{"definitions":[{"definition":"To break in pieces; divide."},{"definition":"To bruise; indent."},{"definition":"To fall out or shatter (as overripe hops or grain)."},{"definition":"To fade away; alter."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"One of the young of herrings, sprats, etc."},{"definition":"One of the tiny crustaceans, of the genus Calanus, that are part of the diet of right whales."},{"definition":"Brit milah"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bɹɪt/"}]},{"word":"CARERS","idx":16164,"count":2291799,"meanings":[{"definitions":[{"definition":"Someone who regularly looks after another person, either as a job or often through family responsibilities.","example":"Have you thought of a job as a carer for disabled people?"}],"partOfSpeech":"n"}]},{"word":"GRADUATING","idx":16166,"count":2291215,"meanings":[{"definitions":[{"definition":"To be recognized by a school or university as having completed the requirements of a degree studied at the institution.","example":"The man graduated in 1967."},{"definition":"To be certified as having earned a degree from; to graduate from (an institution).","example":"Trisha graduated college."},{"definition":"To certify (a student) as having earned a degree","example":"Indiana University graduated the student."},{"definition":"To mark (something) with degrees; to divide into regular steps or intervals, as the scale of a thermometer, a scheme of punishment or rewards, etc."},{"definition":"To change gradually.","example":"sandstone which graduates into gneiss; carnelian sometimes graduates into quartz"},{"definition":"To prepare gradually; to arrange, temper, or modify by degrees or to a certain degree; to determine the degrees of.","example":"to graduate the heat of an oven"},{"definition":"To bring to a certain degree of consistency, by evaporation, as a fluid."},{"definition":"To taper, as the tail of certain birds."}],"partOfSpeech":"ve"}]},{"word":"RIMS","idx":16167,"count":2291023,"meanings":[{"definitions":[{"definition":"An edge around something, especially when circular."},{"definition":"A wheelrim."},{"definition":"A semicircular copydesk."},{"definition":"A membrane."},{"definition":"The membrane enclosing the intestines; the peritoneum, hence loosely, the intestines; the lower part of the abdomen; belly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a rim on."},{"definition":"To follow the contours, possibly creating a circuit.","example":"A walking path rims the island."},{"definition":"(of a ball) To roll around a rim.","example":"The basketball rimmed in and out."},{"definition":"To lick the anus of a partner as a sexual act."}],"partOfSpeech":"ve"}]},{"word":"HARMONIC","idx":16168,"count":2290965,"meanings":[{"definitions":[{"definition":"A component frequency of the signal of a wave that is an integer multiple of the fundamental frequency."},{"definition":"The place where, on a bowed string instrument, a note in the harmonic series of a particular string can be played without the fundamental present."},{"definition":"One of a class of functions that enter into the development of the potential of a nearly spherical mass due to its attraction."},{"definition":"One's child."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to harmony"},{"definition":"Pleasant to hear; harmonious; melodious"},{"definition":"Used to characterize various mathematical entities or relationships supposed to bear some resemblance to musical consonance","example":"The harmonic polar line of an inflection point of a cubic curve is the component of the polar conic other than the tangent line."},{"definition":"Recurring periodically"},{"definition":"Exhibiting or applying constraints on what vowels (e.g. front/back vowels only) may be found near each other and sometimes in the entire word."},{"definition":"Of or relating to a generation an even number of generations distant from a particular person."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"harmonic-uk","text":"/hɑː(ɹ)ˈmɒnɪk/"}]}]