[{"word":"REGRET","idx":12120,"count":3716789,"meanings":[{"definitions":[{"definition":"Emotional pain on account of something done or experienced in the past, with a wish that it had been different; a looking back with dissatisfaction or with longing."},{"definition":"Dislike; aversion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feel sorry about (a thing that has or has not happened), afterthink: to wish that a thing had not happened, that something else had happened instead.","example":"He regretted his words."},{"definition":"(more generally) To feel sorry about (any thing).","example":"I regret that I have to do this, but I don't have a choice."},{"definition":"To miss; to feel the loss or absence of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"regret-us","text":"/ɹiˈɡɹɛt/"}]},{"word":"VALIDATE","idx":12121,"count":3715972,"meanings":[{"definitions":[{"definition":"To render valid."},{"definition":"To check or prove the validity of; verify."},{"definition":"To have its validity successfully proven.","example":"The data file cannot be imported because it doesn't validate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"validate-uk","text":"/ˈvæl.ɪ.deɪt/"}]},{"word":"STAKES","idx":12122,"count":3715795,"meanings":[{"definitions":[{"definition":"A piece of wood or other material, usually long and slender, pointed at one end so as to be easily driven into the ground as a marker or a support or stay.","example":"We have surveyor's stakes at all four corners of this field, to mark exactly its borders."},{"definition":"A piece of wood driven in the ground, placed in the middle of the court, that is used as the finishing point after scoring 12 hoops in croquet."},{"definition":"A stick inserted upright in a lop, eye, or mortise, at the side or end of a cart, flat car, flatbed trailer, or the like, to prevent goods from falling off."},{"definition":"(with definite article) The piece of timber to which a person condemned to death was affixed to be burned.","example":"Thomas Cranmer was burnt at the stake."},{"definition":"A share or interest in a business or a given situation.","example":"The owners let the managers eventually earn a stake in the business."},{"definition":"That which is laid down as a wager; that which is staked or hazarded; a pledge."},{"definition":"A small anvil usually furnished with a tang to enter a hole in a bench top, as used by tinsmiths, blacksmiths, etc., for light work, punching hole in or cutting a work piece, or for specific forming techniques etc."},{"definition":"A territorial division comprising all the Mormons (typically several thousand) in a geographical area."},{"definition":"The money wagered in gambling."},{"definition":"Risks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten, support, defend, or delineate with stakes.","example":"to stake vines or plants"},{"definition":"To pierce or wound with a stake."},{"definition":"To put at risk upon success in competition, or upon a future contingency."},{"definition":"To provide another with money in order to engage in an activity as betting or a business venture.","example":"His family staked him $10,000 to get his business started."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stakes-us","text":"/steɪks/"}]},{"word":"ROTATING","idx":12123,"count":3715660,"meanings":[{"definitions":[{"definition":"To spin, turn, or revolve.","example":"He rotated in his chair to face me."},{"definition":"To advance through a sequence; to take turns.","example":"The nurses' shifts rotate each week."},{"definition":"(of aircraft) To lift the nose, just prior to takeoff.","example":"The aircraft rotates at sixty knots."},{"definition":"To spin, turn, or revolve something.","example":"Rotate the dial to the left."},{"definition":"To advance something through a sequence; to allocate or deploy in turns."},{"definition":"To replace older materials or to place older materials in front of newer ones so that older ones get used first.","example":"The supermarket rotates the stock daily so that old foods don't sit around."},{"definition":"To grow or plant (crops) in a certain order."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Undergoing physical rotation","example":"rotating machinery"},{"definition":"That proceeds in sequence or in turns","example":"a rotating presidency"}],"partOfSpeech":"j"}]},{"word":"BRIGADE","idx":12125,"count":3711855,"meanings":[{"definitions":[{"definition":"A group of people organized for a common purpose.","example":"a work brigade; a fire brigade"},{"definition":"Military unit composed of several regiments (or battalions) and including soldiers from different arms of service."},{"definition":"A group of people who share views or beliefs.","example":"More sympathy for career criminals from the bleeding-heart brigade!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form or unite into a brigade; to group together."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"brigade-us","text":"/bɹɪˈɡeɪd/"}]},{"word":"MOVABLE","idx":12126,"count":3710553,"meanings":[{"definitions":[{"definition":"Something which is movable; an article of wares or goods; a commodity; a piece of property not fixed, or not a part of real estate; generally, in the plural, goods; wares; furniture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Capable of being moved, lifted, carried, drawn, turned, or conveyed, or in any way made to change place or posture; not fixed or stationary"},{"definition":"Changing from one time to another","example":"This feast is movable - its date varies from year to year."}],"partOfSpeech":"j"}]},{"word":"DOUBLES","idx":12127,"count":3709489,"meanings":[{"definitions":[{"definition":"Twice the number, amount, size, etc."},{"definition":"A person who resembles and stands in for another person, often for safety purposes","example":"Saddam Hussein was rumored to have many doubles."},{"definition":"A drink with two portions of alcohol.","example":"On second thought, make that a double."},{"definition":"A ghostly apparition of a living person; doppelgänger."},{"definition":"A sharp turn, especially a return on one's own tracks."},{"definition":"A redundant item for which an identical item already exists.","example":"Before printing the photos, Liam deleted the doubles."},{"definition":"A two-base hit.","example":"The catcher hit a double to lead off the ninth."},{"definition":"A call that increases certain scoring points if the last preceding bid becomes the contract."},{"definition":"A strike in which the object ball is struck so as to make it rebound against the cushion to an opposite pocket."},{"definition":"A bet on two horses in different races in which any winnings from the first race are placed on the horse in the later race."},{"definition":"The narrow outermost ring on a dartboard."},{"definition":"A hit on this ring."},{"definition":"A tile that has the same value (i.e., the same number of pips) on both sides."},{"definition":"A double-precision floating-point number."},{"definition":"Two competitions, usually one league and one cup, won by the same team in a single season."},{"definition":"A boat for two scullers."},{"definition":"The feat of scoring twice in one game."},{"definition":"(chiefly swimming and track) The feat of winning two events in a single meet or competition.","example":"In 1996, Michael Johnson achieved a double by winning both the 200 and 400 meter dashes."},{"definition":"A former French coin worth one-sixth of a sou."},{"definition":"(Guernsey) A copper coin worth one-eighth of a penny."},{"definition":"Playing the same part on two instruments, alternately."},{"definition":"A double feast."},{"definition":"The double time, a marching cadence (pace) approaching running speed."},{"definition":"A game between pairs of players","example":"Seeing as we've got four people, let's play doubles."},{"definition":"(campanology) bell changes rung on five bells","example":"A quarter peal of plain bob doubles was rung."},{"definition":"A sandwich of Trinidad and Tobago, made with two bara (flat fried bread) filled with curried chickpeas."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To multiply by two.","example":"The company doubled their earnings per share over last quarter."},{"definition":"To fold over so as to make two folds.","example":"To make a pleat, double the material at the waist."},{"definition":"To be the double of; to exceed by twofold; to contain or be worth twice as much as."},{"definition":"To increase by 100%, to become twice as large in size.","example":"Our earnings have doubled in the last year."},{"definition":"To get a two-base hit.","example":"The batter doubled into the corner."},{"definition":"(sometimes followed by up) To clench (a fist)."},{"definition":"(often followed by together or up) To join or couple."},{"definition":"To repeat exactly; copy."},{"definition":"(often followed by as) To play a second part or serve a second role.","example":"A spork is a kind of fork that doubles as a spoon."},{"definition":"To turn sharply, following a winding course."},{"definition":"To sail around (a headland or other point)."},{"definition":"To duplicate (a part) either in unison or at the octave above or below it."},{"definition":"(usually followed by \"on\") To be capable of performing (upon an additional instrument)."},{"definition":"To make a call that will double certain scoring points if the preceding bid becomes the contract."},{"definition":"To double down."},{"definition":"To cause (a ball) to rebound from a cushion before entering the pocket."},{"definition":"(followed by for) To act as substitute."},{"definition":"To go or march at twice the normal speed."},{"definition":"To multiply the strength or effect of by two.","example":"Sorry, this store does not double coupons."},{"definition":"To unite, as ranks or files, so as to form one from each two."},{"definition":"(of a station) To transmit simultaneously on the same channel as another station, either unintentionally or deliberately, causing interference.","example":"Could you please repeat your last transmission? Another station was doubling with you."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"doubles-uk"}]},{"word":"BLISS","idx":12129,"count":3708978,"meanings":[{"definitions":[{"definition":"Perfect happiness"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/blɪs/"}]},{"word":"FILMOGRAPHY","idx":12130,"count":3708823,"meanings":[{"definitions":[{"definition":"A selective list of movie titles that share a similar characteristic such as the same genre, the same director, the same actor etc."}],"partOfSpeech":"n"}]},{"word":"HUMILIATION","idx":12131,"count":3707732,"meanings":[{"definitions":[{"definition":"The act of humiliating or humbling someone; abasement of pride; mortification."},{"definition":"The state of being humiliated, humbled or reduced to lowliness or submission."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/hjuːˌmɪliˈeɪʃən/"}]},{"word":"TENS","idx":12132,"count":3707380,"meanings":[{"definitions":[{"definition":"A set or group with ten elements.","example":"We divided the chocolates into tens to hand out to Hallowe'en visitors."},{"definition":"A card in a given suit with a value of ten."},{"definition":"A denomination of currency, such as a banknote, with a value of ten units. See also tenner.","example":"Can you give me two tens for this twenty?"},{"definition":"A perfect specimen, a physically attractive person."},{"definition":"A high level of intensity."},{"definition":"The act of rowing ten strokes flat out."},{"definition":"A pair of tens."},{"definition":"The second decade of a century: the 1910s, 2010s, etc. The teens, the oneties."}],"partOfSpeech":"n"}]},{"word":"LITTER","idx":12133,"count":3706640,"meanings":[{"definitions":[{"definition":"A platform mounted on two shafts, or a more elaborate construction, designed to be carried by two (or more) people to transport one (in luxury models sometimes more) third person(s) or (occasionally in the elaborate version) a cargo, such as a religious idol."},{"definition":"(collective) The offspring of a mammal born in one birth."},{"definition":"Material used as bedding for animals.","example":"sleep in the litter"},{"definition":"Collectively, items discarded on the ground.","example":"drop litter"},{"definition":"Absorbent material used in an animal's litter tray","example":"the cat's litter"},{"definition":"Layer of fallen leaves and similar organic matter in a forest floor."},{"definition":"A covering of straw for plants."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drop or throw trash without properly disposing of it (as discarding in public areas rather than trash receptacles).","example":"By tossing the bottle out the window, he was littering."},{"definition":"To scatter carelessly about."},{"definition":"To strew (a place) with scattered articles."},{"definition":"To give birth to, used of animals."},{"definition":"To produce a litter of young."},{"definition":"To supply (cattle etc.) with litter; to cover with litter, as the floor of a stall."},{"definition":"To be supplied with litter as bedding; to sleep or make one's bed in litter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"litter-us","text":"/ˈlɪtɚ/"}]},{"word":"REFLECTIVE","idx":12134,"count":3705748,"meanings":[{"definitions":[{"definition":"That reflects, or redirects back to the source.","example":"Mirrors are reflective."},{"definition":"Pondering, especially thinking back on the past.","example":"He always becomes reflective in preparation for the new year."},{"definition":"That reveals or shows; revealing; indicative of."},{"definition":"Involving reflection."},{"definition":"(grammar) Reciprocal."}],"partOfSpeech":"j"}]},{"word":"OUTERWEAR","idx":12135,"count":3705282,"meanings":[{"definitions":[{"definition":"Clothing (such as a dress) worn over one's underwear"},{"definition":"Clothing (such as a rain jacket) worn over one's clothes when outdoors"}],"partOfSpeech":"n"}]},{"word":"ABBREVIATIONS","idx":12136,"count":3703739,"meanings":[{"definitions":[{"definition":"The result of shortening or reducing; abridgment."},{"definition":"A shortened or contracted form of a word or phrase, used to represent the whole, utilizing omission of letters, and sometimes substitution of letters, or duplication of initial letters to signify plurality, including signs such as +, =, @."},{"definition":"The process of abbreviating."},{"definition":"A notation used in music score to denote a direction, as pp or mf."},{"definition":"One or more dashes through the stem of a note, dividing it respectively into quavers, semiquavers, demisemiquavers, or hemidemisemiquavers."},{"definition":"Any convenient short form used as a substitution for an understood or inferred whole."},{"definition":"Loss during evolution of the final stages of the ancestral ontogenetic pattern."},{"definition":"Reduction to lower terms, as a fraction."}],"partOfSpeech":"n"}]},{"word":"EXECUTING","idx":12137,"count":3703273,"meanings":[{"definitions":[{"definition":"To kill as punishment for capital crimes.","example":"There are certain states where it is lawful to execute prisoners convicted of certain crimes."},{"definition":"To carry out; to put into effect.","example":"I'll execute your orders as soon as this meeting is adjourned."},{"definition":"To perform.","example":"to execute a difficult piece of music brilliantly"},{"definition":"To carry out, to perform an act; to put into effect or cause to become legally binding or valid (as a contract) by so doing.","example":"to execute a contract"},{"definition":"To start, launch or run","example":"to execute a program"},{"definition":"To run, usually successfully.","example":"The program executed, but data problems were discovered."}],"partOfSpeech":"ve"}]},{"word":"FLOODING","idx":12139,"count":3699696,"meanings":[{"definitions":[{"definition":"To overflow, as by water from excessive rainfall."},{"definition":"To cover or partly fill as if by a flood.","example":"The floor was flooded with beer."},{"definition":"To provide (someone or something) with a larger number or quantity of something than can easily be dealt with.","example":"The station's switchboard was flooded with listeners making complaints."},{"definition":"To paste numerous lines of text to (a chat system) in order to disrupt the conversation."},{"definition":"To bleed profusely, as after childbirth."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of flooding; a flood or gush."},{"definition":"Emotional overwhelm sometimes leading to a primal state of rage or panic."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈflʌdɪŋ/"}]},{"word":"PARSE","idx":12140,"count":3698919,"meanings":[{"definitions":[{"definition":"An act of parsing.","example":"The parse will fail if the program contains an unrecognised keyword."},{"definition":"The result of such an act.","example":"This parse is incorrect and indicates a fault in the parser."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To resolve (a sentence, etc.) into its elements, pointing out the several parts of speech, and their relation to each other by agreement or government; to analyze and describe grammatically."},{"definition":"To examine closely; to scrutinize."},{"definition":"To split (a file or other input) into pieces of data that can be easily manipulated or stored."},{"definition":"To resolve (a string of code or text) into its elements to determine if it conforms to a particular grammar."},{"definition":"Of a string of code or text, sentence, etc.: to conform to rules of grammar, to be syntactically valid.","example":"This sentence doesn't parse."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"parse-us","text":"/pɑɹs/"}]},{"word":"RUGGED","idx":12141,"count":3698606,"meanings":[{"definitions":[{"definition":"Broken into sharp or irregular points; uneven; not smooth; rough."},{"definition":"Not neat or regular; irregular, uneven."},{"definition":"Rough with bristles or hair; shaggy."},{"definition":"(of a person) Strong, sturdy, well-built."},{"definition":"(of land) Rocky and bare of plantlife."},{"definition":"(of temper, character, or people) Harsh; austere; hard; crabbed"},{"definition":"Stormy; turbulent; tempestuous; rude."},{"definition":"(of sound, style etc.) Harsh; grating; rough to the ear"},{"definition":"(of looks, appearance etc.) Sour; surly; frowning; wrinkled"},{"definition":"(of behaviour) Violent; rude; boisterous"},{"definition":"(of health, physique etc.) Vigorous; robust; hardy"},{"definition":"(of a computer) Designed to reliably operate in harsh usage environments and conditions."},{"definition":"Having a rug or rugs."},{"definition":"Covered with a rug."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To pull roughly or hastily; to plunder; to spoil; to tear."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rugged-1-us","text":"/ˈɹʌɡɪd/"}]},{"word":"JELLY","idx":12142,"count":3698541,"meanings":[{"definitions":[{"definition":"An explosive mixture of nitroglycerine and nitrate absorbed onto a base of wood pulp."},{"definition":"A dessert made by boiling gelatine, sugar and some flavouring (often derived from fruit) and allowing it to set, known as \"jello\" in North America."},{"definition":"A clear or translucent fruit preserve, made from fruit juice and set using either naturally occurring, or added, pectin. Known as \"jam\" in Commonwealth English."},{"definition":"A savoury substance, derived from meat, that has the same texture as the dessert."},{"definition":"Any substance or object having the consistency of jelly.","example":"calf's-foot jelly"},{"definition":"A jellyfish."},{"definition":"A pretty girl; a girlfriend."},{"definition":"A large backside, especially a woman's."},{"definition":"A jelly shoe."},{"definition":"Blood."},{"definition":"A coconut with soft or gelatinous meat inside as well as the meat itself (which is of regular quality if the coconut is immature)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wiggle like jelly."},{"definition":"To make jelly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Jealous."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"jelly-us","text":"/ˈd͡ʒɛl.i/"},{"audio":"jelly-au","text":"/ˈd͡ʒɛl.i/"}]},{"word":"IMPLEMENTATIONS","idx":12144,"count":3697837,"meanings":[{"definitions":[{"definition":"The process of moving an idea from concept to reality. In business, engineering and other fields, implementation refers to the building process rather than the design process."},{"definition":"A result of implementing something; a finished product, system or device.","example":"His implementation works, but it needs some fine-tuning."}],"partOfSpeech":"n"}]},{"word":"GRANDMOTHER","idx":12145,"count":3697756,"meanings":[{"definitions":[{"definition":"A mother of someone's parent."},{"definition":"A female ancestor or progenitor."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"grandmother-us","text":"/ˈɡɹæn(d)ˌmʌðɚ/"},{"audio":"grandmother-uk","text":"/ˈɡɹæn(d)ˌmʌðə(r)/"}]},{"word":"RENOVATION","idx":12146,"count":3697379,"meanings":[{"definitions":[{"definition":"An act, or the process, of renovating."},{"definition":"Regeneration."}],"partOfSpeech":"n"}]},{"word":"PUMA","idx":12147,"count":3696953,"meanings":[{"definitions":[{"definition":"The mountain lion or cougar, Puma concolor."},{"definition":"A woman in her 20s or 30s who seeks relationships with younger men; a younger cougar."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"puma-au","text":"/pjuːmə/"}]},{"word":"APPOINT","idx":12148,"count":3696615,"meanings":[{"definitions":[{"definition":"To set, fix or determine (a time or place for something such as a meeting, or the meeting itself) by authority or agreement."},{"definition":"To name (someone to a post or role)."},{"definition":"To furnish or equip (a place) completely; to provide with all the equipment or furnishings necessary; to fit out."},{"definition":"To equip (someone) with (something); to assign (someone) authoritatively (some equipment)."},{"definition":"To fix the disposition of (property) by designating someone to take use of (it)."},{"definition":"To fix with power or firmness by decree or command; to ordain or establish."},{"definition":"To resolve; to determine; to ordain."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"appoint-uk","text":"/əˈpɔɪnt/"}]},{"word":"ATTENDEES","idx":12149,"count":3696467,"meanings":[{"definitions":[{"definition":"A person who is in attendance or in the audience of an event."},{"definition":"A visitor or participant of an event."},{"definition":"A person who is attended."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"attendees"}]},{"word":"PANTHERS","idx":12150,"count":3695915,"meanings":[{"definitions":[{"definition":"Any of various big cats with black fur; most especially, the black-coated leopard of India."},{"definition":"Any big cat of the genus Panthera."},{"definition":"A cougar; especially the Florida panther."},{"definition":"A creature resembling a big cat with a multicolored hide, found in Ancient Greek mythology."}],"partOfSpeech":"n"}]},{"word":"PERCEPTIONS","idx":12151,"count":3695044,"meanings":[{"definitions":[{"definition":"The organisation, identification and interpretation of sensory information."},{"definition":"Conscious understanding of something."},{"definition":"Vision (ability)"},{"definition":"Acuity"},{"definition":"(cognition) That which is detected by the five senses; not necessarily understood (imagine looking through fog, trying to understand if you see a small dog or a cat); also that which is detected within consciousness as a thought, intuition, deduction, etc."}],"partOfSpeech":"n"}]},{"word":"GREENWOOD","idx":12152,"count":3694021,"meanings":[{"definitions":[{"definition":"A forest in full leaf, as in summer."},{"definition":"Wood that is green; in other words, not seasoned."},{"definition":"Certain half-shrubby species of genista."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹinwʊd/"},{"text":"/ˈɡɹiːnwʊd/"},{"audio":"greenwood-au"}]},{"word":"IGNITION","idx":12153,"count":3693724,"meanings":[{"definitions":[{"definition":"The act of igniting."},{"definition":"The initiation of combustion."},{"definition":"A system for activating combustion in a combustion engine."},{"definition":"Receptacle for a key used to start the engine in a vehicle."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪɡˈnɪʃən/"}]},{"word":"HUMBLE","idx":12154,"count":3693501,"meanings":[{"definitions":[{"definition":"(Baltimore) An arrest based on weak evidence intended to demean or punish the subject."},{"definition":"A stag that has failed to grow antlers; a cow that has not developed horns."},{"definition":"Especially in hummel corn: grain that lacks awns (beards or bristles), or has had its awns removed (barley, oats, etc.)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To defeat or reduce the power, independence, or pride of"},{"definition":"To make humble or lowly; to make less proud or arrogant; to make meek and submissive."},{"definition":"Of an animal: to remove the horns; to poll."},{"definition":"To separate (barley, oats, etc.) from the awns."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not pretentious or magnificent; unpretending; unassuming.","example":"He lives in a humble one-bedroom cottage."},{"definition":"Having a low opinion of oneself; not proud, arrogant, or assuming; modest."},{"definition":"Near the ground."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"humble-us","text":"/ˈhʌmbəl/"}]},{"word":"DOWNSTREAM","idx":12156,"count":3691197,"meanings":[{"definitions":[{"definition":"To stream downward."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lower down, in relation to a river, stream or flow of fluid","example":"She lives downstream from the dam."},{"definition":"In the direction from the server to the client."},{"definition":"Towards the 3' end of a DNA molecule."},{"definition":"(metaphoric) Influenced by something; being a consequence of something."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Following the path of a river or stream","example":"We spent the day paddling downstream in our canoes."}],"partOfSpeech":"v"}]},{"word":"PETROL","idx":12157,"count":3690703,"meanings":[{"definitions":[{"definition":"Petroleum, a fluid consisting of a mixture of refined petroleum hydrocarbons, primarily consisting of octane, commonly used as a motor fuel."},{"definition":"A motor vehicle powered by petrol (as opposed to diesel)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"petrol-uk","text":"/ˈpɛt.ɹəl/"},{"audio":"petrol-au","text":"/ˈpɛt.ɹəl/"}]},{"word":"MIDWAY","idx":12158,"count":3690431,"meanings":[{"definitions":[{"definition":"The middle; the midst."},{"definition":"A middle way or manner; a mean or middle course between extremes."},{"definition":"The part of a fair or circus where rides, entertainments, and booths are concentrated."},{"definition":"The widest aisle in the middle of an industrial complex (such as railroad shops or a coach yard) along which various buildings are aligned"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Being in the middle of the way or distance; middle."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Halfway; equidistant from either end point; in the middle between two points"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"midway-uk","text":"/mɪdweɪ/"}]},{"word":"MANIA","idx":12159,"count":3688699,"meanings":[{"definitions":[{"definition":"Violent derangement of mind; madness; insanity."},{"definition":"Excessive or unreasonable desire; insane passion affecting one or many people; fanaticism."},{"definition":"The state of abnormally elevated or irritable mood, arousal, and/or energy levels."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmeɪ.ni.ə/"}]},{"word":"WEBCASTS","idx":12161,"count":3688493,"meanings":[{"definitions":[{"definition":"A video and/or audio broadcast transmitted via the Internet"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make such a broadcast"}],"partOfSpeech":"ve"}]},{"word":"AX","idx":12162,"count":3687441,"meanings":[{"definitions":[{"definition":"A tool for felling trees or chopping wood etc. consisting of a heavy head flattened to a blade on one side, and a handle attached to it."},{"definition":"An ancient weapon consisting of a head that has one or two blades and a long handle."},{"definition":"A dismissal or rejection.","example":"His girlfriend/boss/schoolmaster gave him the axe."},{"definition":"A gigging musician's particular instrument, especially a guitar in rock music or a saxophone in jazz."},{"definition":"A position, interest, or reason in buying and selling stock, often with ulterior motives.","example":"A financial dealer has an axe in a stock that his buyers don't know about, giving him an advantage in making the most profit."},{"definition":"The axle of a wheel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fell or chop with an axe."},{"definition":"To lay off, terminate or drastically reduce, especially in a rough or ruthless manner; to cancel.","example":"He got axed in the last round of firings."},{"definition":"To furnish with an axle."},{"definition":"To request (information, or an answer to a question).","example":"I asked her age."},{"definition":"To put forward (a question) to be answered.","example":"to ask a question"},{"definition":"To interrogate or enquire of (a person).","example":"I'm going to ask this lady for directions."},{"definition":"To request or petition; usually with for.","example":"to ask for a second helping at dinner"},{"definition":"To request permission to do something.","example":"Did you ask to use the car?"},{"definition":"To require, demand, claim, or expect, whether by way of remuneration or return, or as a matter of necessity.","example":"What price are you asking for the house?"},{"definition":"To invite.","example":"Don't ask them to the wedding."},{"definition":"To publish in church for marriage; said of both the banns and the persons."},{"definition":"To take (a person's situation) as an example."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ax-uk","text":"/æks/"}]},{"word":"ACCELERATOR","idx":12163,"count":3687315,"meanings":[{"definitions":[{"definition":"One who, or that which, accelerates."},{"definition":"A device for causing acceleration."},{"definition":"A substance which speeds up chemical reactions."},{"definition":"A pedal causing the vehicle to accelerate when it is pressed."},{"definition":"A chemical that reduces development time."},{"definition":"A device that accelerates charged subatomic particles."},{"definition":"A muscle or nerve that speed the performance of an action."},{"definition":"An accelerator key."},{"definition":"A light van to take mails between a post office and a railway station."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"accelerator-us","text":"/æk.ˈsɛl.ə.ˌɹeɪ.tɚ/"}]},{"word":"FLYERS","idx":12166,"count":3685163,"meanings":[{"definitions":[{"definition":"That which flies, as a bird or insect."},{"definition":"A machine that flies."},{"definition":"An airplane pilot."},{"definition":"A person who travels by airplane."},{"definition":"A leaflet, often for advertising."},{"definition":"The part of a spinning machine that twists the thread as it takes it to and winds it on the bobbin"},{"definition":"An arch that connects a flying buttress into the structure it supports."},{"definition":"(acrobatics, cheerleading, synchronized swimming) The person who is lifted and/or thrown by another person or persons."},{"definition":"A stray shot away from the group on a target."},{"definition":"A standard rectangular step of a staircase (as opposed to a winder)."},{"definition":"A female kangaroo; a roo; a doe; a jill."},{"definition":"A leap or jump."},{"definition":"A risky investment or other venture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To distribute flyers (leaflets)."},{"definition":"To distribute flyers in (a location) or to (recipients)."}],"partOfSpeech":"ve"}]},{"word":"RECOGNISE","idx":12167,"count":3685011,"meanings":[{"definitions":[{"definition":"To match (something or someone which one currently perceives) to a memory of some previous encounter with the same person or thing.","example":"I recognised his face immediately."},{"definition":"To acknowledge the existence or legality of; to treat as valid or worthy of consideration.","example":"The US and a number of EU countries are expected to recognize Kosovo on Monday."},{"definition":"(or with clause) To acknowledge or consider (as being a certain thing or having a certain quality or property).","example":"I recognize that my behaviour has been unacceptable."},{"definition":"To realize or discover the nature of something; apprehend quality in."},{"definition":"To show formal appreciation of, as with an award, commendation etc.","example":"His services were recognized in a testimonial."},{"definition":"To review; to examine again."},{"definition":"To reconnoiter."},{"definition":"To have the property to bind to specific antigens."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"recognise-us","text":"/ˈɹɛkənaɪz/"}]},{"word":"HOSTILE","idx":12169,"count":3684268,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) An enemy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not friendly, appropriate to an enemy; showing the disposition of an enemy; showing ill will and malevolence, or a desire to thwart and injure","example":"a hostile country"},{"definition":"Aggressive, antagonistic."},{"definition":"Unwilling"},{"definition":"Of a hostile takeover.","example":"Microsoft may go hostile in its bid for Yahoo as soon as Friday, according to a published report."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hostile-us","text":"/ˈhɑstaɪl/"}]},{"word":"RADIOLOGY","idx":12171,"count":3683754,"meanings":[{"definitions":[{"definition":"The use of radioactive substances in diagnosis and treatment."},{"definition":"The use of radiation (including ionizing radiation, especially X-rays) in diagnosis, usually through the formation of images."},{"definition":"Radioscopy."}],"partOfSpeech":"n"}]},{"word":"ESTABLISHES","idx":12172,"count":3683462,"meanings":[{"definitions":[{"definition":"To make stable or firm; to confirm."},{"definition":"To form; to found; to institute; to set up in business."},{"definition":"To appoint or adopt, as officers, laws, regulations, guidelines, etc.; to enact; to ordain."},{"definition":"To prove and cause to be accepted as true; to establish a fact; to demonstrate."}],"partOfSpeech":"ve"}]},{"word":"WHITES","idx":12173,"count":3683340,"meanings":[{"definitions":[{"definition":"The color/colour of snow or milk; the colour of light containing equal amounts of all visible wavelengths."},{"definition":"A person of European descent with light-coloured skin."},{"definition":"Any butterfly of the family Pieridae."},{"definition":"White wine."},{"definition":"Any object or substance that is of the color white."},{"definition":"The central part of the butt, which was formerly painted white; the centre of a mark at which a missile is shot."},{"definition":"The enclosed part of a letter of the alphabet, especially when handwritten."},{"definition":"A set of white clothes, especially as a uniform."},{"definition":"Linen, especially laundry, that is white."},{"definition":"Leukorrhea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make white; to whiten; to bleach."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"whites-au","text":"/(h)waɪts/"}]},{"word":"RANT","idx":12174,"count":3683247,"meanings":[{"definitions":[{"definition":"A criticism done by ranting."},{"definition":"A wild, emotional, and sometimes incoherent articulation."},{"definition":"A type of dance step usually performed in clogs, and particularly (but not exclusively) associated with the English North West Morris tradition. The rant step consists of alternately bringing one foot across and in front of the other and striking the ground, with the other foot making a little hop."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To speak or shout at length in uncontrollable anger."},{"definition":"To criticize by ranting."},{"definition":"To speak extravagantly, as in merriment."},{"definition":"To dance rant steps."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rant-uk","text":"/ɹænt/"}]},{"word":"TRAPPED","idx":12175,"count":3683039,"meanings":[{"definitions":[{"definition":"To physically capture, to catch in a trap or traps, or something like a trap.","example":"to trap foxes"},{"definition":"To ensnare; to take by stratagem; to entrap."},{"definition":"To provide with a trap.","example":"to trap a drain"},{"definition":"To set traps for game; to make a business of trapping game","example":"trap for beaver"},{"definition":"To leave suddenly, to flee."},{"definition":"To sell illegal drugs, especially in a public area."},{"definition":"To capture (e.g. an error) in order to handle or process it."},{"definition":"To attend to and open and close a (trap-)door."},{"definition":"To dress with ornaments; to adorn (especially said of horses)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Caught in a trap"}],"partOfSpeech":"j"}]},{"word":"BOLTS","idx":12176,"count":3682849,"meanings":[{"definitions":[{"definition":"A (usually) metal fastener consisting of a cylindrical body that is threaded, with a larger head on one end. It can be inserted into an unthreaded hole up to the head, with a nut then threaded on the other end; a heavy machine screw."},{"definition":"A sliding pin or bar in a lock or latch mechanism."},{"definition":"A bar of wood or metal dropped in horizontal hooks on a door and adjoining wall or between the two sides of a double door, to prevent the door(s) from being forced open."},{"definition":"A sliding mechanism to chamber and unchamber a cartridge in a firearm."},{"definition":"A small personal-armour-piercing missile for short-range use, or (in common usage though deprecated by experts) a short arrow, intended to be shot from a crossbow or a catapult."},{"definition":"A lightning spark, i.e., a lightning bolt."},{"definition":"A sudden event, action or emotion.","example":"The problem's solution struck him like a bolt from the blue."},{"definition":"A large roll of fabric or similar material, as a bolt of cloth.","example":"24 March 1774 - Newspaper: Stamford Mercury - \"Mr. Cole, Basket-maker...has lost near 300 boults of rods\" https//www.britishnewspaperarchive.co.uk/viewer/bl/0000254/17740324/001/0001"},{"definition":"A sudden spring or start; a sudden leap aside.","example":"The horse made a bolt."},{"definition":"A sudden flight, as to escape creditors."},{"definition":"A refusal to support a nomination made by the party with which one has been connected; a breaking away from one's party."},{"definition":"An iron to fasten the legs of a prisoner; a shackle; a fetter."},{"definition":"A burst of speed or efficiency."},{"definition":"A sieve, especially a long fine sieve used in milling for bolting flour and meal; a bolter."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To connect or assemble pieces using a bolt.","example":"Bolt the vice to the bench."},{"definition":"To secure a door by locking or barring it.","example":"Bolt the door."},{"definition":"To flee, to depart, to accelerate suddenly.","example":"Seeing the snake, the horse bolted."},{"definition":"To cause to start or spring forth; to dislodge (an animal being hunted).","example":"to bolt a rabbit"},{"definition":"To strike or fall suddenly like a bolt."},{"definition":"To escape."},{"definition":"Of a plant, to grow quickly; to go to seed.","example":"Lettuce and spinach will bolt as the weather warms up."},{"definition":"To swallow food without chewing it."},{"definition":"To drink one's drink very quickly; to down a drink.","example":"Come on, everyone, bolt your drinks; I want to go to the next pub!"},{"definition":"To refuse to support a nomination made by a party or caucus with which one has been connected; to break away from a party."},{"definition":"To utter precipitately; to blurt or throw out."},{"definition":"To sift, especially through a cloth."},{"definition":"To sift the bran and germ from wheat flour.","example":"Graham flour is unbolted flour."},{"definition":"To separate, assort, refine, or purify by other means."},{"definition":"To discuss or argue privately, and for practice, as cases at law."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/boʊlts/"},{"text":"/bəʊlts/"}]},{"word":"DIPLOMATIC","idx":12177,"count":3682737,"meanings":[{"definitions":[{"definition":"The science of diplomas, or the art of deciphering ancient writings and determining their age, authenticity, etc.; paleography."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Concerning the relationships between the governments of countries.","example":"Albania immediately severed diplomatic relations with Zimbabwe."},{"definition":"Exhibiting diplomacy; exercising tact or courtesy; using discussion to avoid hard feelings, fights or arguments.","example":"Thoughtful corrections can be diplomatic as well as instructional."},{"definition":"Describing a publication of a text which follows a single basic manuscript, but with variants in other manuscripts noted in the critical apparatus","example":"Whereas a diplomatic edition uses as its base text a single, \"best\" manuscript, to which other textual evidence is collated and organized into an apparatus, a critical text of the LXX/OG [= Septuagint or Old Greek] may be described as a collection of the oldest recoverable texts, carefully restored book by book (or section by section), aiming at achieving the closest approximation to the original translations (from Hebrew or Aramaic) or compositions (in Greek), systematically reconstructed from the widest array of relevant textual data (including controlled conjecture).  The International Organization for Septuagint and Cognate Studies, Critical Editions of Septuagint/Old Greek Texts."},{"definition":"Relating to diplomatics, or the study of old texts; paleographic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"diplomatic-us","text":"/ˌdɪpləˈmætɪk/"}]},{"word":"LOCALS","idx":12178,"count":3682503,"meanings":[{"definitions":[{"definition":"A person who lives near a given place.","example":"It's easy to tell the locals from the tourists."},{"definition":"A branch of a nationwide organization such as a trade union.","example":"I'm in the TWU, too. Local 6."},{"definition":"A train that stops at all, or almost all, stations between its origin and destination, including very small ones.","example":"The expresses skipped my station, so I had to take a local."},{"definition":"One's nearest or regularly frequented public house or bar.","example":"I got barred from my local, so I've started going all the way into town for a drink."},{"definition":"A locally scoped identifier.","example":"Functional programming languages usually don't allow changing the immediate value of locals once they've been initialized, unless they're explicitly marked as being mutable."},{"definition":"An item of news relating to the place where the newspaper is published."},{"definition":"An anesthetic (anesthetic substance) that causes loss of sensation only to the area to which it is applied."}],"partOfSpeech":"n"}]},{"word":"FRINGE","idx":12179,"count":3682385,"meanings":[{"definitions":[{"definition":"Hair hanging over the forehead."},{"definition":"A hairstyle including such hair, especially cut straight across the forehead."},{"definition":"Brucellosis, a bacterial disease."},{"definition":"A decorative border.","example":"the fringe of a picture"},{"definition":"A marginal or peripheral part."},{"definition":"Those members of a political party, or any social group, holding unorthodox views."},{"definition":"The periphery of a town or city.","example":"He lives in the fringe of London."},{"definition":"A light or dark band formed by the diffraction of light.","example":"interference fringe"},{"definition":"Non-mainstream theatre.","example":"The Fringe; Edinburgh Fringe; Adelaide Fringe"},{"definition":"The peristome or fringe-like appendage of the capsules of most mosses."},{"definition":"The area around the green"},{"definition":"Used attributively with reference to Aboriginal people living on the edge of towns etc."},{"definition":"A daypart that precedes or follows prime time."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate with fringe."},{"definition":"To serve as a fringe."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Outside the mainstream."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fringe-us","text":"/fɹɪndʒ/"}]},{"word":"LINGUISTIC","idx":12180,"count":3682256,"meanings":[{"definitions":[{"definition":"Of or relating to language."},{"definition":"Of or relating to linguistics."},{"definition":"Relating to a computer language."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"linguistic-us","text":"/lɪŋˈɡwɪstɪk/"}]},{"word":"INTERNALLY","idx":12181,"count":3682046,"meanings":[{"definitions":[{"definition":"In an internal manner; within or inside of external limits; in an inner part or situation."},{"definition":"With regard to internal affairs."},{"definition":"Inwardly; spiritually."}],"partOfSpeech":"v"}]},{"word":"PLANETARY","idx":12182,"count":3681473,"meanings":[{"definitions":[{"definition":"A planetary nebula."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to planets, or the orbital motion of planets."},{"definition":"Of, or relating to the Earth; terrestrial."},{"definition":"Of, or relating to the whole Earth; global."},{"definition":"(of a gear train) epicyclic"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"planetary-uk","text":"/ˈplæ.nə.ˌtɛr.i/"}]},{"word":"TUNGSTEN","idx":12184,"count":3681180,"meanings":[{"definitions":[{"definition":"A rare metallic chemical element (symbol W, from Latin wolframium) with an atomic number of 74."},{"definition":"A light bulb containing tungsten."},{"definition":"Scheelite, calcium tungstate"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tungsten-us","text":"/ˈtʌŋstən/"}]},{"word":"TYPED","idx":12185,"count":3681027,"meanings":[{"definitions":[{"definition":"To put text on paper using a typewriter."},{"definition":"To enter text or commands into a computer using a keyboard."},{"definition":"To determine the blood type of.","example":"The doctor ordered the lab to type the patient for a blood transfusion."},{"definition":"To represent by a type, model, or symbol beforehand; to prefigure."},{"definition":"To furnish an expression or copy of; to represent; to typify."},{"definition":"To categorize into types."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Typewritten","example":"a typed document"},{"definition":"(of a variable, expression, or value) Having a specific data type.","example":"A typed variable can only store one kind of data."},{"definition":"(of a programming language) In which variables are typed.","example":"Scheme is a typed language."}],"partOfSpeech":"j"}]},{"word":"DATASHEET","idx":12187,"count":3680819,"meanings":[{"definitions":[{"definition":"A document summarizing the performance and other technical characteristics of a product."},{"definition":"A display of the records in a table, arranged in rows and columns."}],"partOfSpeech":"n"}]},{"word":"SHUTDOWN","idx":12189,"count":3678890,"meanings":[{"definitions":[{"definition":"The action of stopping operations; a closing, of a computer, business, event, etc.","example":"You need to enter your password at startup, but it's not required at shutdown."},{"definition":"A statement, insult, etc. that prevents the opponent from replying further.","example":"When he insulted me, my reply was such a shutdown that he left the room."},{"definition":"An autistic response to stress, etc. where the individual becomes silent and motionless."}],"partOfSpeech":"n"}]},{"word":"EGO","idx":12190,"count":3678432,"meanings":[{"definitions":[{"definition":"The self, especially with a sense of self-importance."},{"definition":"(Freudian) The most central part of the mind, which mediates with one's surroundings."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈiɡoʊ/"},{"text":"/ˈiːɡəʊ/"}]},{"word":"INFLUENZA","idx":12195,"count":3673978,"meanings":[{"definitions":[{"definition":"An acute contagious disease of the upper airways and lungs, caused by a virus, which rapidly spreads around the world in seasonal epidemics."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"influenza-us","text":"/ˌɪn.flu.ˈɛn.zə/"}]},{"word":"GILL","idx":12196,"count":3672989,"meanings":[{"definitions":[{"definition":"(animal anatomy) a breathing organ of fish and other aquatic animals"},{"definition":"(of a fish) a gill slit or gill cover","example":"Gill nets are designed to catch a fish by the gills."},{"definition":"One of the radial folds on the underside of the cap of a mushroom, on the surface of which the spore-producing organs are borne"},{"definition":"(animal anatomy) the fleshy flap that hangs below the beak of a fowl; a wattle"},{"definition":"The flesh under or about the chin; a wattle"},{"definition":"(spinning) one of the combs of closely ranged steel pins which divide the ribbons of flax fiber or wool into fewer parallel filaments"},{"definition":"A drink measure for spirits and wine (size varies regionally but it is about one quarter of a pint)"},{"definition":"A measuring jug holding a quarter or half a pint"},{"definition":"Rivulet"},{"definition":"Ravine"},{"definition":"A two-wheeled frame for transporting timber"},{"definition":"A leech"},{"definition":"A female ferret"},{"definition":"A promiscuous woman; harlot, wanton"},{"definition":"A prostitute"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the gills from a fish as part of gutting and cleaning it"},{"definition":"To catch (a fish) in a gillnet"},{"definition":"To be or become entangled in a gillnet"},{"definition":"To act as a prostitute."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gill-1-us","text":"/ɡɪl/"}]},{"word":"TATTOOS","idx":12197,"count":3672724,"meanings":[{"definitions":[{"definition":"An image made in the skin with ink and a needle."},{"definition":"A method of decorating the skin by inserting colored substances under the surface with a sharp instrument (usually a solenoid-driven needle)."},{"definition":"A signal played five minutes before taps (lights out)."},{"definition":"A signal by drum or bugle ordering soldiers to return to their quarters."},{"definition":"A military display or pageant."},{"definition":"A breed of pony from India; a pony of that breed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply a tattoo to (someone or something)."},{"definition":"To hit the ball hard, as if to figuratively leave a tattoo on the ball.","example":"Jones tattoos one into the gap in left; that will clear the bases."},{"definition":"To tap rhythmically on, to drum."}],"partOfSpeech":"ve"}]},{"word":"RUDE","idx":12198,"count":3672620,"meanings":[{"definitions":[{"definition":"Bad-mannered.","example":"Karen broke up with Fred because he was often rude to her."},{"definition":"Somewhat obscene, pornographic, offensive."},{"definition":"Tough, robust."},{"definition":"Undeveloped, unskilled, basic."},{"definition":"Hearty, vigorous; found particularly in the phrase rude health."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rude-us","text":"/ɹud/"}]},{"word":"SANG","idx":12199,"count":3669266,"meanings":[{"definitions":[{"definition":"To produce musical or harmonious sounds with one’s voice.","example":"\"I really want to sing in the school choir,\" said Vera."},{"definition":"To express audibly by means of a harmonious vocalization."},{"definition":"To soothe with singing.","example":"to sing somebody to sleep"},{"definition":"To confess under interrogation."},{"definition":"To make a small, shrill sound.","example":"The air sings in passing through a crevice."},{"definition":"To relate in verse; to celebrate in poetry."},{"definition":"To display fine qualities; to stand out as excellent.","example":"The sauce really makes this lamb sing."},{"definition":"To be capable of being sung; to produce a certain effect by being sung."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A Chinese wind instrument, a free-reed mouth organ consisting of 13 or more bamboo pipes of various lengths, which are fixed at their bases in a wind chest made from a dried gourd (or, more recently, wood or chrome-plated brass)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sang-us","text":"[seɪŋ]"}]},{"word":"CITING","idx":12201,"count":3668594,"meanings":[{"definitions":[{"definition":"To quote; to repeat, as a passage from a book, or the words of another."},{"definition":"To list the source(s) from which one took information, words or literary or verbal context."},{"definition":"To summon officially or authoritatively to appear in court."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Citation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsaɪtɪŋ/"}]},{"word":"VIEWPOINT","idx":12202,"count":3667923,"meanings":[{"definitions":[{"definition":"The position from which something is observed or considered; an angle, outlook or point of view."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"viewpoint-us","text":"/ˈvjuː.pɔɪnt/"}]},{"word":"PEPTIDE","idx":12203,"count":3667831,"meanings":[{"definitions":[{"definition":"Any of a class of organic compounds consisting of various numbers of amino acids in which the amine of one is reacted with the carboxylic acid of the next to form an amide bond."},{"definition":"The peptide bond itself."}],"partOfSpeech":"n"}]},{"word":"NAY","idx":12204,"count":3667089,"meanings":[{"definitions":[{"definition":"A vote against.","example":"I vote nay, even though the motion is popular, because I would rather be right than popular."},{"definition":"A person who voted against.","example":"The vote is 4 in favor and 20 opposed; the nays have it."},{"definition":"A denial; a refusal. https//books.google.com/books?id=uysQzJy9IwMC&pg=PA818&dq=%22word+nay+a+denial+refusal%22&hl=en&sa=X&ved=0ahUKEwij_5CHi-3cAhWJ2FMKHWjCDdMQ6AEIJzAA#v=onepage&q=%22word%20nay%20a%20denial%20refusal%22&f=false"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To refuse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Nary."}],"partOfSpeech":"j"},{"definitions":[{"definition":"No."},{"definition":"Introducing a statement, without direct negation."},{"definition":"Or rather, or should I say; moreover (introducing a stronger and more appropriate expression than the preceding one).","example":"His face was dirty, nay, filthy."}],"partOfSpeech":"v"},{"definitions":[{"definition":"No."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"nay-us","text":"/neɪ/"}]},{"word":"SWEATSHIRT","idx":12205,"count":3666728,"meanings":[{"definitions":[{"definition":"A loose shirt, usually made of a knit fleece, for athletic wear and now often used as casual apparel."},{"definition":"A shirt worn against the skin, usually under other clothing, to absorb sweat."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sweatshirt-us"}]},{"word":"HASSLE","idx":12206,"count":3665939,"meanings":[{"definitions":[{"definition":"Trouble, bother, unwanted annoyances or problems.","example":"I went through a lot of hassle to be the first to get a ticket."},{"definition":"A fight or argument."},{"definition":"An action which is not worth the difficulty involved."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To trouble, to bother, to annoy.","example":"The unlucky boy was hassled by a gang of troublemakers on his way home."},{"definition":"To pick a fight or start an argument."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hassle-au","text":"/ˈhæsl/"}]},{"word":"REGENTS","idx":12207,"count":3665656,"meanings":[{"definitions":[{"definition":"A ruler."},{"definition":"One who rules in place of the monarch, especially because the monarch is too young, absent, or disabled."},{"definition":"A member of a municipal or civic body of governors, especially in certain European cities."},{"definition":"A member of governing board of a college or university; also a governor of the Smithsonian Institute in Washington DC."},{"definition":"The chief executive of a regency"}],"partOfSpeech":"n"}]},{"word":"SERVANTS","idx":12208,"count":3665322,"meanings":[{"definitions":[{"definition":"One who is hired to perform regular household or other duties, and receives compensation. As opposed to a slave.","example":"There are three servants in the household, the butler and two maids."},{"definition":"One who serves another, providing help in some manner.","example":"She is quite the humble servant, the poor in this city owe much to her but she expects nothing."},{"definition":"A person who dedicates themselves to God."},{"definition":"A professed lover."},{"definition":"A person of low condition or spirit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To subject."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"servants-us","text":"/ˈsɝvənts/"}]},{"word":"MEANINGS","idx":12209,"count":3664177,"meanings":[{"definitions":[{"definition":"(of words or symbols) The entity, perception, feeling or concept thereby represented or evoked."},{"definition":"The value, purpose, importance, point or significance (of something beyond the fact of that thing's existence).","example":"the meaning of life"},{"definition":"The object or concept that a word or phrase denotes, or that which a sentence says."},{"definition":"Intention."}],"partOfSpeech":"n"}]},{"word":"CONCEPTION","idx":12210,"count":3663294,"meanings":[{"definitions":[{"definition":"The act of conceiving."},{"definition":"The state of being conceived; the beginning."},{"definition":"The fertilization of an ovum by a sperm to form a zygote."},{"definition":"The start of pregnancy."},{"definition":"The formation of a conceptus or an implanted embryo."},{"definition":"The power or faculty of apprehending of forming an idea in the mind; the power of recalling a past sensation or perception; the ability to form mental abstractions."},{"definition":"An image, idea, or notion formed in the mind; a concept, plan or design."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"conception-us","text":"/kənˈsɛpʃən/"}]},{"word":"UNEMPLOYED","idx":12211,"count":3663204,"meanings":[{"definitions":[{"definition":"Unemployed people.","example":"The unemployed are a growing portion of the population."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having no job despite being able and willing to work."},{"definition":"Having no use, not doing work"}],"partOfSpeech":"j"}]},{"word":"HEAVENLY","idx":12212,"count":3663141,"meanings":[{"definitions":[{"definition":"Relating to the sky or outer space, regarded as the realm of the sun, moon, planets, and stars."},{"definition":"Of or pertaining to the highest degree of glory."},{"definition":"Of or pertaining to the heaven believed in by many religions."},{"definition":"Of or pertaining to the kingdom of God; divine."},{"definition":"Strongly or sublimely beautiful or pleasurable."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a manner like that of heaven; by the influence or agency of heaven; divinely, miraculously."},{"definition":"To a degree such as to elicit great pleasure."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"heavenly-us","text":"/ˈhɛvənli/"}]},{"word":"DOCKET","idx":12215,"count":3661940,"meanings":[{"definitions":[{"definition":"A summary; a brief digest."},{"definition":"A short entry of the proceedings of a court; the register containing them; the office containing the register."},{"definition":"A schedule of cases awaiting action in a court."},{"definition":"An agenda of things to be done."},{"definition":"A ticket or label fixed to something, showing its contents or directions to its use."},{"definition":"A receipt."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enter or inscribe in a docket, or list of causes for trial."},{"definition":"To label a parcel, etc.","example":"to docket goods"},{"definition":"To make a brief abstract of (a writing) and endorse it on the back of the paper, or to endorse the title or contents on the back of; to summarize.","example":"to docket letters and papers"},{"definition":"To make a brief abstract of and inscribe in a book.","example":"judgments regularly docketed"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdɒkɪt/"},{"audio":"docket-au"}]},{"word":"AMUSEMENT","idx":12216,"count":3661819,"meanings":[{"definitions":[{"definition":"Entertainment."},{"definition":"An activity that is entertaining or amusing, such as dancing, gunning, or fishing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"amusement-us","text":"/əˈmjuzmənt/"}]},{"word":"NORDIC","idx":12219,"count":3660365,"meanings":[{"definitions":[{"definition":"Of or relating to the Nordic countries."},{"definition":"Of or relating to the light colouring and tall stature of Nordic peoples."},{"definition":"Of or relating to the family of North Germanic languages."},{"definition":"Of or relating to cross-country skiing or ski jumping. (Compare alpine.)"},{"definition":"Of or relating to cross-country skiing (Compare alpine)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈnɔː(ɹ).dɪk/"}]},{"word":"CURL","idx":12221,"count":3659178,"meanings":[{"definitions":[{"definition":"A piece or lock of curling hair; a ringlet."},{"definition":"A curved stroke or shape."},{"definition":"A spin making the trajectory of an object curve."},{"definition":"Movement of a moving rock away from a straight line."},{"definition":"Any exercise performed by bending the arm, wrist, or leg on the exertion against resistance, especially those that train the biceps."},{"definition":"The vector field denoting the rotationality of a given vector field.","example":"The curl of the vector field \\vec{F}(x,y,z) is the vector field \\operatorname{curl}\\,\\vec{F} \\equiv \\vec{\\nabla}\\times\\vec{F}=\\left( \\frac{\\partial F_z}{\\partial y} - \\frac{\\partial F_y}{\\partial z}, \\frac{\\partial F_x}{\\partial z} - \\frac{\\partial F_z}{\\partial x}, \\frac{\\partial F_y}{\\partial x} - \\frac{\\partial F_x}{\\partial y} \\right)."},{"definition":"(proper noun) The vector operator, denoted \\rm{curl}\\; or \\vec{\\nabla}\\times\\vec{\\left(\\cdot\\right)}, that generates this field."},{"definition":"Any of various diseases of plants causing the leaves or shoots to curl up; often specifically the potato curl."},{"definition":"The contrasting light and dark figure seen in wood used for stringed instrument making; the flame.","example":"The one-piece back is of a medium curl."},{"definition":"A pattern where the receiver appears to be running a fly pattern but after a set number of steps or yards quickly stops and turns around, looking for a pass."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to move in a curve."},{"definition":"To make into a curl or spiral."},{"definition":"To assume the shape of a curl or spiral."},{"definition":"To move in curves."},{"definition":"To take part in the sport of curling.","example":"I curl at my local club every weekend."},{"definition":"To exercise by bending the arm, wrist, or leg on the exertion against resistance, especially of the biceps."},{"definition":"To twist or form (the hair, etc.) into ringlets."},{"definition":"To deck with, or as if with, curls; to ornament."},{"definition":"To raise in waves or undulations; to ripple."},{"definition":"(hat-making) To shape (the brim of a hat) into a curve."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"curl-us","text":"/kɝl/"}]},{"word":"OVERFLOW","idx":12224,"count":3657788,"meanings":[{"definitions":[{"definition":"The spillage resultant from overflow; excess."},{"definition":"Outlet for escape of excess material."},{"definition":"The situation where a value exceeds the available numeric range."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flow over the brim of (a container).","example":"The river overflowed the levee."},{"definition":"To cover with a liquid, literally or figuratively.","example":"The flash flood overflowed most of the parkland and some homes."},{"definition":"To cause an overflow."},{"definition":"To flow over the edge of a container.","example":"The waters overflowed into the Ninth Ward."},{"definition":"To exceed limits or capacity.","example":"The hospital ER was overflowing with flu cases."},{"definition":"To be superabundant; to abound."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"overflow-uk","text":"/ˈəʊvəˌfləʊ/"}]},{"word":"GEOMETRIC","idx":12225,"count":3657640,"meanings":[{"definitions":[{"definition":"Of or relating to geometry.","example":"The architect used geometric techniques to design her home."},{"definition":"Increasing or decreasing in a geometric progression.","example":"Bacteria exhibit geometric increase in numbers when the environment is not limiting."},{"definition":"Using simple shapes such as circles, triangles and lines in a decorative object.","example":"The building's profile was strikingly geometric."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌdʒi.oʊˈmɛt.ɹɪk/"},{"text":"/ˌdʒi.əˈmɛt.ɹɪk/"}]},{"word":"SUBSIDIES","idx":12227,"count":3656280,"meanings":[{"definitions":[{"definition":"Financial support or assistance, such as a grant.","example":"Manufacturing firms are supported by government subsidies in some countries."},{"definition":"Money granted by parliament to the British Crown."}],"partOfSpeech":"n"}]},{"word":"TAXONOMY","idx":12228,"count":3655978,"meanings":[{"definitions":[{"definition":"The science or the technique used to make a classification."},{"definition":"A classification; especially, a classification in a hierarchical system."},{"definition":"The science of finding, describing, classifying and naming organisms."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tækˈsɑːnəmi/"},{"text":"/tækˈsɒnəmi/"}]},{"word":"THIRDS","idx":12229,"count":3655965,"meanings":[{"definitions":[{"definition":"The person or thing in the third position.","example":"Jones came in third."},{"definition":"One of three equal parts of a whole.","example":"He ate a third of the pie. Divided by two-thirds."},{"definition":"The third gear of a gearbox.","example":"Now put it into third."},{"definition":"An interval consisting of the first and third notes in a scale.","example":"They sing in thirds."},{"definition":"Third base","example":"The play ended with Jones standing on third."},{"definition":"A handicap of one stroke every third hole."},{"definition":"A third-class degree, awarded to the lowest achievers in an honours degree programme"},{"definition":"One sixtieth of a second, i.e., the third in a series of fractional parts in a sexagesimal number system. Also formerly known as a tierce."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To agree with a proposition or statement after it has already been seconded."},{"definition":"To divide into three equal parts."}],"partOfSpeech":"ve"}]},{"word":"DELI","idx":12230,"count":3655555,"meanings":[{"definitions":[{"definition":"A shop that sells cooked or prepared food ready for serving.","example":"Delis usually offer a broader, fresher menu than fast food chains."},{"definition":"Food sold at a delicatessen."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"deli-us","text":"/ˈdɛli/"}]},{"word":"WILLINGNESS","idx":12231,"count":3654922,"meanings":[{"definitions":[{"definition":"The state of being willing","example":"All it takes is a willingness to learn."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"willingness-us","text":"/ˈwɪlɪŋnəs/"}]},{"word":"INTERN","idx":12232,"count":3654560,"meanings":[{"definitions":[{"definition":"A person who is interned, forcibly or voluntarily."},{"definition":"A student or recent graduate who works in order to gain experience in their chosen field"},{"definition":"A medical student or recent graduate working in a hospital as a final part of medical training"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To imprison somebody, usually without trial.","example":"The US government interned thousands of Japanese-Americans during World War II."},{"definition":"To internalize."},{"definition":"To work as an intern. Usually with little or no pay or other legal prerogatives of employment, for the purpose of furthering a program of education.","example":"I'll be interning at Universal Studios this summer."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Internal."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈtɝn/"},{"text":"/ɪnˈtɜːn/"}]},{"word":"IMPLICIT","idx":12233,"count":3654411,"meanings":[{"definitions":[{"definition":"Implied indirectly, without being directly expressed"},{"definition":"Contained in the essential nature of something but not openly shown"},{"definition":"Having no reservations or doubts; unquestioning or unconditional; usually said of faith or trust."},{"definition":"Entangled, twisted together."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"implicit-us","text":"/ɪmˈplɪsɪt/"},{"audio":"implicit-au","text":"/ɪmˈplɪsɪt/"}]},{"word":"PATRIOTIC","idx":12235,"count":3654140,"meanings":[{"definitions":[{"definition":"Inspired by or showing patriotism; done out of love of one's country; zealously and unselfishly devoted to the service of one's country","example":"a patriotic song"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"patriotic-us","text":"/ˈpeɪ.t(ʃ)ɹi.ɑ.tɪk/"}]},{"word":"SIMPLIFY","idx":12236,"count":3654131,"meanings":[{"definitions":[{"definition":"To make simpler, either by reducing in complexity, reducing to component parts, or making easier to understand."},{"definition":"To become simpler."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsɪmpləfaɪ/"}]},{"word":"DARLING","idx":12237,"count":3653817,"meanings":[{"definitions":[{"definition":"A person who is dear to one.","example":"Mary, the youngest daughter, was always her mother's darling."},{"definition":"A kind or sweet person; sweetheart.","example":"The girl next door picks up all my shopping for me. She is such a darling."},{"definition":"An affectionate term of address.","example":"Pass the wine, would you darling?"},{"definition":"(by extension) A person or thing very popular with a certain group.","example":"a darling of the theatre"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Dear; cherished.","example":"She is my darling wife of twenty-two years."},{"definition":"Charming","example":"Well isn't that a darling little outfit she has on."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"darling-us","text":"/ˈdɑɹlɪŋ/"}]},{"word":"ORNAMENTS","idx":12240,"count":3653618,"meanings":[{"definitions":[{"definition":"An element of decoration; that which embellishes or adorns."},{"definition":"A Christmas tree decoration."},{"definition":"A musical flourish that is unnecessary to the overall melodic or harmonic line, but serves to decorate or \"ornament\" that line."},{"definition":"(in the plural) The articles used in church services."},{"definition":"A characteristic that has a decorative function (typically in order to attract a mate)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate.","example":"We will ornament the windows with trim to make the room seem brighter."},{"definition":"To add to.","example":"The editor ornamented his plain writing, making it fancier but less clear."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ornaments-us"}]},{"word":"OPPOSE","idx":12241,"count":3653137,"meanings":[{"definitions":[{"definition":"To attempt to stop the progression of; to resist or antagonize by physical means, or by arguments, etc.; to contend against.","example":"There is still time to oppose this plan."},{"definition":"To object to.","example":"Many religious leaders oppose cloning humans."},{"definition":"To present or set up in opposition; to pose.","example":"They are opposed to any form of hierarchy."},{"definition":"To place in front of, or over against; to set opposite; to exhibit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"oppose-us","text":"/əˈpoʊz/"}]},{"word":"TERRIFIC","idx":12243,"count":3652629,"meanings":[{"definitions":[{"definition":"Terrifying, causing terror; terrible; sublime, awe-inspiring."},{"definition":"Very strong or intense; excessive, tremendous.","example":"I've got a terrific hangover this morning."},{"definition":"Extremely good; excellent, amazing.","example":"I say! She's a terrific tennis player."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"terrific-us","text":"/təˈɹɪfɪk/"},{"audio":"terrific-uk","text":"/təˈɹɪfɪk/"}]},{"word":"ALLERGIES","idx":12246,"count":3651862,"meanings":[{"definitions":[{"definition":"A disorder of the immune system causing adverse reactions to substances (allergens) not harmful to most and marked by the body's production of histamines and associated with atopy, anaphylaxis, and asthma."},{"definition":"Any condition of hypersensitivity to a substance."},{"definition":"Altered susceptibility to a first treatment as exhibited in reaction to a subsequent one."},{"definition":"An antipathy, as toward a person or activity."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[ˈæl.ɚ.dʒiz]"},{"text":"[ˈæl.ə.dʒiz]"}]},{"word":"DEFINITE","idx":12247,"count":3651600,"meanings":[{"definitions":[{"definition":"(grammar) A word or phrase that designates a specified or identified person or entity."},{"definition":"Anything that is defined or determined."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having distinct limits.","example":"definite dimensions; a definite measure; a definite period or interval"},{"definition":"Free from any doubt.","example":"definite knowledge"},{"definition":"Determined; resolved; decided."},{"definition":"Designating an identified or immediately identifiable person or thing, or group of persons or things","example":"the definite article"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"definite-us","text":"/ˈdɛfənɪt/"}]},{"word":"CONGREGATION","idx":12249,"count":3649518,"meanings":[{"definitions":[{"definition":"The act of congregating or collecting together."},{"definition":"A gathering of faithful in a temple, church, synagogue, mosque or other place of worship. It can also refer to the people who are present at a devotional service in the building, particularly in contrast to the pastor, minister, imam, rabbi etc. and/or choir, who may be seated apart from the general congregation or lead the service (notably in responsory form)."},{"definition":"A Roman Congregation, a main department of the Vatican administration of the Catholic Church."},{"definition":"A corporate body whose members gather for worship, or the members of such a body."},{"definition":"Any large gathering of people."},{"definition":"A group of eagles."},{"definition":"(Oxford University) The main body of university staff, comprising academics, administrative staff, heads of colleges, etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌkɑŋɡɹəˈɡeɪʃən/"},{"text":"/ˌkɒŋɡɹɪˈɡeɪʃən/"}]},{"word":"REGIMENT","idx":12250,"count":3649264,"meanings":[{"definitions":[{"definition":"A unit of armed troops under the command of an officer, and consisting of several smaller units; now specifically, usually composed of two or more battalions."},{"definition":"Rule or governance over a person, place etc.; government, authority."},{"definition":"The state or office of a ruler; rulership."},{"definition":"Influence or control exercised by someone or something (especially a planet)."},{"definition":"A place under a particular rule; a kingdom or domain."},{"definition":"A regimen."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form soldiers into a regiment."},{"definition":"To systematize, or put in rigid order."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"regiment-us"},{"text":"/ˈɹɛdʒɪmənt/"}]},{"word":"CHEER","idx":12251,"count":3648929,"meanings":[{"definitions":[{"definition":"A cheerful attitude; happiness; a good, happy, or positive mood."},{"definition":"That which promotes good spirits or cheerfulness; provisions prepared for a feast; entertainment.","example":"a table loaded with good cheer"},{"definition":"A cry expressing joy, approval or support such as \"hurray\".","example":"A cheer rose from the crowd."},{"definition":"A chant made in support of a team at a sports event."},{"definition":"One's facial expression or countenance."},{"definition":"One's attitude, mood."},{"definition":"Cheerleading.","example":"I'm going to wear my new cheer shoes at cheer today."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To gladden; to make cheerful; often with up.","example":"We were cheered by the offer of a cup of tea."},{"definition":"To infuse life, courage, animation, or hope, into; to inspirit; to solace or comfort."},{"definition":"To applaud or encourage with cheers or shouts.","example":"The crowd cheered in support of the athletes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cheer-us","text":"/t͡ʃɪɹ/"}]},{"word":"REVIEWERS","idx":12253,"count":3648745,"meanings":[{"definitions":[{"definition":"A person who writes reviews for a newspaper or other publication; a critic."},{"definition":"An inspector."}],"partOfSpeech":"n"}]},{"word":"CLUTTER","idx":12254,"count":3648587,"meanings":[{"definitions":[{"definition":"A confused disordered jumble of things."},{"definition":"Background echoes, from clouds etc., on a radar or sonar screen."},{"definition":"A group of cats; the collective noun for cats."},{"definition":"Clatter; confused noise."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fill something with clutter."},{"definition":"To clot or coagulate, like blood."},{"definition":"To make a confused noise; to bustle."},{"definition":"To utter words hurriedly, especially (but not exclusively) as a speech disorder (compare cluttering)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈklʌtɚ/"},{"text":"/ˈklʌtə(ɹ)/"}]},{"word":"MISLEADING","idx":12255,"count":3646794,"meanings":[{"definitions":[{"definition":"To lead astray, in a false direction."},{"definition":"To deceive by telling lies or otherwise giving a false impression."},{"definition":"To deceptively trick into something wrong.","example":"The preacher elaborated Satan's ways to mislead us into sin"},{"definition":"To accidentally or intentionally confuse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A deception that misleads."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Deceptive or tending to mislead or create a false impression."}],"partOfSpeech":"j"}]},{"word":"PREDATOR","idx":12257,"count":3646243,"meanings":[{"definitions":[{"definition":"Any animal or other organism that hunts and kills other organisms (their prey), primarily for food."},{"definition":"Someone who attacks and plunders for gain."},{"definition":"A sexual predator."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɹɛd.ə.təɹ/"}]},{"word":"VINE","idx":12258,"count":3646014,"meanings":[{"definitions":[{"definition":"The climbing plant that produces grapes."},{"definition":"Any plant of the genus Vitis."},{"definition":"(by extension) Any similar climbing or trailing plant."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vine-us","text":"/vaɪn/"}]},{"word":"VALE","idx":12259,"count":3645802,"meanings":[{"definitions":[{"definition":"A valley."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually seen in obituaries) Farewell.","example":"Vale, Sarah Smith"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"vale-1-us","text":"/veɪl/"}]},{"word":"WHEREBY","idx":12260,"count":3645304,"meanings":[{"definitions":[{"definition":"(interrogative) By what, in which direction; how.","example":"Whereby goest thou?"},{"definition":"By which."},{"definition":"Where, wherein, in which."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"whereby-us","text":"/wɛə(ɹ)ˈbaɪ/"}]},{"word":"DECEASED","idx":12261,"count":3645162,"meanings":[{"definitions":[{"definition":"A dead person.","example":"The deceased was interred in his local churchyard."},{"definition":"One who has died. In property law, the alternate term decedent is generally used in US English. In criminal law, “the deceased” refers to the victim of a homicide."}],"partOfSpeech":"n"},{"definitions":[{"definition":"No longer alive, dead"},{"definition":"Belonging to the dead.","example":"The executor’s commission for winding up the deceased estate was 3.5%."},{"definition":"One who has died. In property law, the alternate term decedent is generally used. In criminal law, “the deceased” refers to the victim of a homicide."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"deceased-us","text":"/diˈsist/"}]},{"word":"SPARKS","idx":12262,"count":3644341,"meanings":[{"definitions":[{"definition":"A small particle of glowing matter, either molten or on fire."},{"definition":"A short or small burst of electrical discharge."},{"definition":"A small, shining body, or transient light; a sparkle."},{"definition":"A small amount of something, such as an idea or romantic affection, that has the potential to become something greater, just as a spark can start a fire."},{"definition":"Any of various lycaenid butterflies of the Indomalayan genus Sinthusa."},{"definition":"(in plural sparks but treated as a singular) A ship's radio operator."},{"definition":"An electrician."},{"definition":"A gallant; a foppish young man."},{"definition":"A beau, lover."},{"definition":"An electrician"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To trigger, kindle into activity (an argument, etc)."},{"definition":"To light; to kindle."},{"definition":"To give off a spark or sparks."},{"definition":"Appalachian To court."},{"definition":"To woo, court; to act the gallant or beau."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sparks-us"}]},{"word":"ADOLESCENTS","idx":12265,"count":3642412,"meanings":[{"definitions":[{"definition":"A person who is in adolescence; someone who has reached puberty but is not yet an adult."}],"partOfSpeech":"n"}]},{"word":"SIMPLER","idx":12267,"count":3642315,"meanings":[{"definitions":[{"definition":"Uncomplicated; taken by itself, with nothing added."},{"definition":"Without ornamentation; plain."},{"definition":"Free from duplicity; guileless, innocent, straightforward."},{"definition":"Undistinguished in social condition; of no special rank."},{"definition":"Trivial; insignificant."},{"definition":"Feeble-minded; foolish."},{"definition":"(heading) Structurally uncomplicated."},{"definition":"Mere; not other than; being only."}],"partOfSpeech":"j"},{"definitions":[{"definition":"One who grows or gathers simples (medicinal herbs)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɪmplɚ/"}]},{"word":"CAPTURES","idx":12268,"count":3642295,"meanings":[{"definitions":[{"definition":"An act of capturing; a seizing by force or stratagem."},{"definition":"The securing of an object of strife or desire, as by the power of some attraction.","example":"the capture of a lover's heart"},{"definition":"Something that has been captured; a captive."},{"definition":"The recording or storage of something for later playback.","example":"video capture"},{"definition":"A particular match found for a pattern in a text string."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take control of; to seize by force or stratagem.","example":"to capture an enemy, a vessel, or a criminal"},{"definition":"To store (as in sounds or image) for later revisitation.","example":"She captured the details of the fresco in a series of photographs."},{"definition":"To reproduce convincingly.","example":"His film adaptation captured the spirit of the original work."},{"definition":"To remove or take control of an opponent’s piece in a game (e.g., chess, go, checkers).","example":"He captured his opponent’s queen on the 15th move."}],"partOfSpeech":"ve"}]},{"word":"CAPITALISM","idx":12270,"count":3640757,"meanings":[{"definitions":[{"definition":"A socio-economic system based on private ownership of resources or capital."},{"definition":"An economic system based on private ownership of the means of production and their operation for profit."},{"definition":"(economic liberalism) A socio-economic system based on private property rights, including the private ownership of resources or capital, with economic decisions made largely through the operation of a market unregulated by the state."},{"definition":"(economic liberalism) An economic system based on the abstraction of resources into the form of privately owned capital, with economic decisions made largely through the operation of a market unregulated by the state."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæpɪ̈tl̩ˌɪzm̩/"},{"text":"/ˈkapɪt(ə)lɪz(ə)m/"}]},{"word":"CLAMP","idx":12273,"count":3639509,"meanings":[{"definitions":[{"definition":"A brace, band, or clasp for strengthening or holding things together."},{"definition":"An instrument used to temporarily shut off blood vessels, etc."},{"definition":"A parking enforcement device used to immobilise a car until it can be towed or a fine is paid; a wheel clamp."},{"definition":"A mass of bricks heaped up to be burned; or of ore for roasting, or of coal coking."},{"definition":"A pile of root vegetables stored under a layer of earth."},{"definition":"A piece of wood (batten) across the grain of a board end to keep it flat, as in a breadboard."},{"definition":"An electronic circuit that fixes either the positive or the negative peak excursions of a signal to a defined value by shifting its DC value."},{"definition":"A heavy footstep; a tramp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten in place or together with (or as if with) a clamp."},{"definition":"To hold or grip tightly."},{"definition":"To modify (a numeric value) so it lies within a specific range."},{"definition":"To cover (vegetables, etc.) with earth."},{"definition":"To tread heavily or clumsily; to clump or clomp."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"clamp-us","text":"/klæmp/"}]},{"word":"CUR","idx":12274,"count":3639449,"meanings":[{"definitions":[{"definition":"A contemptible or inferior dog."},{"definition":"A detestable person."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[kɝ]"},{"text":"[kɜː]"}]},{"word":"MAMMALS","idx":12276,"count":3639188,"meanings":[{"definitions":[{"definition":"An animal of the class Mammalia, characterized by being warm-blooded, having hair and feeding milk to its young."},{"definition":"A vertebrate with three bones in the inner ear and one in the jaw."}],"partOfSpeech":"n"}]},{"word":"GRAPE","idx":12277,"count":3638159,"meanings":[{"definitions":[{"definition":"A small, round, smooth-skinned edible fruit, usually purple, red, or green, that grows in bunches on vines of genus Vitis."},{"definition":"A woody vine that bears clusters of grapes; a grapevine; of genus Vitis."},{"definition":"A dark purplish-red colour, the colour of many grapes."},{"definition":"Grapeshot."},{"definition":"A mangy tumour on a horse's leg."},{"definition":"A person's head."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pick grapes."},{"definition":"(of livestock) To develop tubercules as a result of tuberculosis."},{"definition":"To develop a texture with small grape-like clusters of a contaminant or foreign substance."},{"definition":"(north) To grope."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Containing grapes or having a grape flavor."},{"definition":"Of a dark purplish red colour."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"grape-us","text":"/ɡɹeɪp/"},{"audio":"grape-uk","text":"/ɡɹeɪp/"}]},{"word":"CLONING","idx":12278,"count":3638136,"meanings":[{"definitions":[{"definition":"To create a clone of.","example":"The scientists were able to clone a sheep."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The production of an exact copy of an object."},{"definition":"The production of a cloned embryo by transplanting the nucleus of a somatic cell into an ovum."}],"partOfSpeech":"n"}]},{"word":"MADDEN","idx":12280,"count":3637266,"meanings":[{"definitions":[{"definition":"To make angry."},{"definition":"To make insane; to inflame with passion."},{"definition":"To become furious."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmædən/"},{"audio":"madden-uk"}]},{"word":"PEPPERS","idx":12282,"count":3636873,"meanings":[{"definitions":[{"definition":"A plant of the family Piperaceae."},{"definition":"A spice prepared from the fermented, dried, unripe berries of this plant."},{"definition":"A bell pepper, a fruit of the capsicum plant: red, green, yellow or white, hollow and containing seeds, and in very spicy and mild varieties."},{"definition":"A game used by baseball players to warm up where fielders standing close to a batter rapidly return the batted ball to be hit again","example":"Some ballparks have signs saying \"No pepper games\"."},{"definition":"A randomly-generated value that is added to another value (such as a password) prior to hashing. Unlike a salt, a new one is generated for each value and it is held separately from the value."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add pepper to."},{"definition":"To strike with something made up of small particles."},{"definition":"To cover with lots of (something made up of small things).","example":"After the hailstorm, the beach was peppered with holes."},{"definition":"To add (something) at frequent intervals.","example":"He liked to pepper his conversation with long words."}],"partOfSpeech":"ve"}]},{"word":"DEEDS","idx":12283,"count":3636121,"meanings":[{"definitions":[{"definition":"An action or act; something that is done."},{"definition":"A brave or noteworthy action; a feat or exploit."},{"definition":"Action or fact, as opposed to rhetoric or deliberation.","example":"I have fulfilled my promise in word and in deed."},{"definition":"A legal instrument that is executed under seal or before witnesses.","example":"I inherited the deed to the house."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transfer real property by deed.","example":"He deeded over the mineral rights to some fellas from Denver."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"deeds-us","text":"/diːdz/"}]},{"word":"LIVELY","idx":12284,"count":3635880,"meanings":[{"definitions":[{"definition":"Term of address."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Full of life; energetic."},{"definition":"Bright, glowing, vivid; strong, vigorous."},{"definition":"Endowed with or manifesting life; living."},{"definition":"Representing life; lifelike."},{"definition":"Airy; animated; spirited."},{"definition":"(of beer) Fizzy; foamy; tending to produce a large head in the glass."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Vigorously."},{"definition":"Vibrantly, vividly."},{"definition":"In a lifelike manner."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"lively-us","text":"/ˈlaɪvli/"}]},{"word":"INEQUALITY","idx":12285,"count":3635529,"meanings":[{"definitions":[{"definition":"An unfair, not equal, state."},{"definition":"A statement that of two quantities one is specifically less than (or greater than) another. Symbol: < or \\leq or > or \\geq or \\ne, as appropriate."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɪnɪˈkwɒlɪti/"}]},{"word":"EDUCATOR","idx":12287,"count":3634348,"meanings":[{"definitions":[{"definition":"A person distinguished for his/her educational work, a teacher."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛdʒəkeɪtɚ/"},{"text":"/ˈɛdjʊkeɪtə/"}]},{"word":"PREMATURE","idx":12288,"count":3634239,"meanings":[{"definitions":[{"definition":"An infant born prematurely"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Occurring before a state of readiness or maturity has arrived","example":"a premature birth"},{"definition":"Taking place earlier than anticipated, prepared for, or desired"},{"definition":"Suffering from premature ejaculation"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"premature-uk","text":"/ˈpɹɛ.mə.tjə/"}]},{"word":"VISUALLY","idx":12289,"count":3633998,"meanings":[{"definitions":[{"definition":"By means of sight.","example":"The radar's detection was confirmed visually, because seeing is believing."}],"partOfSpeech":"v"}]},{"word":"TRIPOD","idx":12290,"count":3633813,"meanings":[{"definitions":[{"definition":"A three-legged stand or mount.","example":"Recent cell phones offer tripod attachments to take steady photographs."},{"definition":"A man with macrophallism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enter the tripod position showing signs of exhaustion or distress.","example":"I tripodded after my 6-mile run."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtɹaɪpɑd/"},{"text":"/ˈtɹaɪpɒd/"},{"audio":"tripod-au"}]},{"word":"IMMIGRANT","idx":12291,"count":3633715,"meanings":[{"definitions":[{"definition":"A non-native person who comes to a country from another country in order to permanently settle there."},{"definition":"A plant or animal that establishes itself in an area where it previously did not exist."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to immigrants or the act of immigrating."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɪmɪɡɹənt/"}]},{"word":"ALRIGHT","idx":12292,"count":3632981,"meanings":[{"definitions":[{"definition":"Good; in acceptable, if not excellent condition.","example":"The car is all right. It gets me there, anyway."},{"definition":"In good health, unharmed.","example":"I had a headache earlier, but now I'm all right."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Used to indicate acknowledgement or acceptance; OK."},{"definition":"A generic greeting; hello; how are you."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"alright-uk","text":"/ɒˈɹaɪt/"}]},{"word":"LIMO","idx":12294,"count":3631696,"meanings":[{"definitions":[{"definition":"An automobile body with seats and permanent top like a coupe, and with the top projecting over the driver and a projecting front."},{"definition":"An automobile with such a body."},{"definition":"A luxury sedan or saloon car, especially one with a lengthened wheelbase or driven by a chauffeur."},{"definition":"An automobile for transportation to or from an airport, including sedans, vans, and buses."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɪ.moʊ/"},{"text":"/ˈlɪ.məʊ/"},{"audio":"limo-au"}]},{"word":"DEMONSTRATIONS","idx":12295,"count":3630982,"meanings":[{"definitions":[{"definition":"The act of demonstrating; showing or explaining something."},{"definition":"An event at which something will be demonstrated.","example":"I have to give a demonstration to the class tomorrow, and I'm ill-prepared."},{"definition":"Expression of one's feelings by outward signs."},{"definition":"A public display of group opinion, such as a protest march."},{"definition":"A show of military force."},{"definition":"A mathematical proof."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɛmənˈstɹeɪʃənz/"}]},{"word":"OBSOLETE","idx":12296,"count":3630687,"meanings":[{"definitions":[{"definition":"(of words, equipment, etc.) No longer in use; gone into disuse; disused or neglected (often by preference for something newer, which replaces the subject).","example":"It is speculated that, within a few years, the Internet's speedy delivery of news worldwide will make newspapers obsolete."},{"definition":"Imperfectly developed; not very distinct."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To cause to become obsolete.","example":"This software component has been obsoleted."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"obsolete-us","text":"/ɑbsəˈliːt/"}]},{"word":"ALIGNED","idx":12297,"count":3630260,"meanings":[{"definitions":[{"definition":"To form a line; to fall into line."},{"definition":"To adjust or form to a line; to range or form in line; to bring into line."},{"definition":"To store (data) in a way that is consistent with the memory architecture, i.e. by beginning each item at an offset equal to some multiple of the word size."},{"definition":"To identify with or match the behaviour, thoughts, etc of another person."},{"definition":"To organize a linear arrangement of DNA, RNA or protein sequences which have regions of similarity."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been placed, arranged or formed in alignment (with something)."},{"definition":"Allied or working together with a common goal."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈlaɪnd/"}]},{"word":"RUST","idx":12298,"count":3629881,"meanings":[{"definitions":[{"definition":"The deteriorated state of iron or steel as a result of moisture and oxidation.","example":"The rust on my bicycle chain made cycling to work very dangerous."},{"definition":"A similar substance based on another metal (usually with qualification, such as \"copper rust\").","example":"aerugo. Green or blue-green copper rust; verdigris. (American Heritage Dictionary, 1973)"},{"definition":"A reddish-brown color."},{"definition":"A disease of plants caused by a reddish-brown fungus."},{"definition":"Damage caused to stamps and album pages by a fungal infection."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To oxidize, especially of iron or steel.","example":"The patio furniture had rusted in the wind-driven spray."},{"definition":"To cause to oxidize.","example":"The wind-driven spray had thoroughly rusted the patio furniture."},{"definition":"To be affected with the parasitic fungus called rust."},{"definition":"To (cause to) degenerate in idleness; to make or become dull or impaired by inaction."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rust-us","text":"/ɹʌst/"}]},{"word":"PESTICIDE","idx":12300,"count":3628927,"meanings":[{"definitions":[{"definition":"Anything, especially a synthetic substance but also any substance (e.g. sulfur), or virus, bacterium, or other organism, which kills or suppresses the activities of pests."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pesticide-uk","text":"/ˈpɛstɨsaɪd/"}]},{"word":"INTERFERE","idx":12301,"count":3628881,"meanings":[{"definitions":[{"definition":"To get involved or involve oneself, causing disturbance.","example":"I always try not to interfere with other people’s personal affairs."},{"definition":"(of waves) To be correlated with each other when overlapped or superposed.","example":"Correlated waves interfere to produce interesting patterns, while uncorrelated waves overlap without interfering."},{"definition":"(mostly of horses) To strike one foot against the opposite foot or ankle in using the legs."},{"definition":"(followed by \"with\") To sexually molest, especially of a child.","example":"The investigation found the boys had been interfered with."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"interfere-us","text":"/ˌɪntɚˈfɪɹ/"}]},{"word":"TRAPS","idx":12302,"count":3628684,"meanings":[{"definitions":[{"definition":"A machine or other device designed to catch (and sometimes kill) animals, either by holding them in a container, or by catching hold of part of the body.","example":"I put down some traps in my apartment to try and deal with the mouse problem."},{"definition":"A trick or arrangement designed to catch someone in a more general sense; a snare.","example":"Unfortunately she fell into the trap of confusing biology with destiny."},{"definition":"A covering over a hole or opening; a trapdoor.","example":"Close the trap, would you, before someone falls and breaks their neck."},{"definition":"A kind of movable stepladder or set of stairs."},{"definition":"A wooden instrument shaped somewhat like a shoe, used in the game of trapball"},{"definition":"The game of trapball itself."},{"definition":"Any device used to hold and suddenly release an object.","example":"They shot out of the school gates like greyhounds out of the trap."},{"definition":"A bend, sag, or other device in a waste-pipe arranged so that the liquid contents form a seal which prevents the escape of noxious gases, but permits the flow of liquids."},{"definition":"A place in a water pipe, pump, etc., where air accumulates for lack of an outlet."},{"definition":"A light two-wheeled carriage with springs."},{"definition":"A person's mouth.","example":"Keep your trap shut."},{"definition":"(in the plural) Belongings."},{"definition":"A cubicle (in a public toilet).","example":"I've just laid a cable in trap 2 so I'd give it 5 minutes if I were you."},{"definition":"Trapshooting."},{"definition":"A geological structure that creates a petroleum reservoir."},{"definition":"An exception generated by the processor or by an external event."},{"definition":"A mining license inspector during the Australian gold rush."},{"definition":"A vehicle, residential building, or sidewalk corner where drugs are manufactured, packaged, or sold. (Also used attributively to describe things which are used for the sale of drugs, e.g. \"a trap phone\", \"a trap car\".)"},{"definition":"A fictional character from anime, or related media, who is coded as or has qualities typically associated with a gender other than the character's ostensible gender; otokonoko."},{"definition":"A trans woman, transfeminine person, or crossdressing man."},{"definition":"A genre of hip-hop music, with half-time drums and heavy sub-bass."},{"definition":"The money earned by a prostitute for a pimp."},{"definition":"A dark coloured igneous rock, now used to designate any non-volcanic, non-granitic igneous rock; trap rock."},{"definition":"The trapezius muscle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To physically capture, to catch in a trap or traps, or something like a trap.","example":"to trap foxes"},{"definition":"To ensnare; to take by stratagem; to entrap."},{"definition":"To provide with a trap.","example":"to trap a drain"},{"definition":"To set traps for game; to make a business of trapping game","example":"trap for beaver"},{"definition":"To leave suddenly, to flee."},{"definition":"To sell illegal drugs, especially in a public area."},{"definition":"To capture (e.g. an error) in order to handle or process it."},{"definition":"To attend to and open and close a (trap-)door."},{"definition":"To dress with ornaments; to adorn (especially said of horses)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"traps-us","text":"/tɹæps/"}]},{"word":"SHUFFLE","idx":12303,"count":3627654,"meanings":[{"definitions":[{"definition":"The act of shuffling cards.","example":"He made a real mess of the last shuffle."},{"definition":"The act of reordering anything, such as music tracks in a media player."},{"definition":"An instance of walking without lifting one's feet.","example":"The sad young girl left with a tired shuffle."},{"definition":"(by extension) A rhythm commonly used in blues music. Consists of a series of triplet notes with the middle note missing, so that it sounds like a long note followed by a short note. Sounds like a walker dragging one foot."},{"definition":"A trick; an artifice; an evasion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put in a random order.","example":"Don't forget to shuffle the cards."},{"definition":"To change; modify the order of something."},{"definition":"To move in a slovenly, dragging manner; to drag or scrape the feet in walking or dancing.","example":"He shuffled out of the room."},{"definition":"To change one's position; to shift ground; to evade questions; to resort to equivocation; to prevaricate."},{"definition":"To use arts or expedients; to make shift."},{"definition":"To shove one way and the other; to push from one to another.","example":"to shuffle money from hand to hand"},{"definition":"To remove or introduce by artificial confusion."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shuffle-us","text":"/ˈʃʌfəl/"}]},{"word":"WARDROBE","idx":12304,"count":3627616,"meanings":[{"definitions":[{"definition":"A room for keeping clothes and armor safe, particularly a dressing room or walk-in closet beside a bedroom."},{"definition":"A governmental office or department in a monarchy which purchases, keeps, and cares for royal clothes."},{"definition":"The building housing such a department."},{"definition":"Any closet used for storing anything."},{"definition":"A room for keeping costumes and other property safe at a theater; a prop room."},{"definition":"The department of a theater, movie studio, etc which purchases, keeps, and cares for costumes; its staff; its room(s) or building(s)."},{"definition":"A movable cupboard or cabinet designed for storing clothes, particularly as a large piece of bedroom furniture."},{"definition":"A tall built-in cupboard or closet for storing clothes, often including a rail for coat-hangers, and usually located in a bedroom."},{"definition":"Anything that similarly stores or houses something."},{"definition":"The contents of a wardrobe: an individual's entire collection of clothing."},{"definition":"Any collection of clothing."},{"definition":"Any collection of anything."},{"definition":"A private chamber, particularly one used for sleeping or urinating and defecating."},{"definition":"Badger feces, particularly used in tracking game."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a wardrobe department, to provide clothing or sets of clothes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wardrobe-us","text":"/ˈwɔɹdɹoʊb/"},{"audio":"wardrobe-uk","text":"/ ˈwɔːdɹəʊb/"}]},{"word":"TRANSFORMERS","idx":12306,"count":3627334,"meanings":[{"definitions":[{"definition":"(toys) A toy in the Transformers toyline which has mechanical parts that allow it to be altered in appearance from its original form as a humanoid robot action figure to another form, usually a vehicle, depending on the toy."},{"definition":"One of the characters in the Transformers franchise who is an alien humanoid robot that can mechanically alter its appearance, or \"transform\", into a vehicle, creature, or (rarely) a tool."},{"definition":"Something that transforms, changing its own or another thing's shape."},{"definition":"A static device that transfers electric energy from one circuit to another by magnetic coupling. Their main use is to transfer energy between different voltage levels, which allows choosing most appropriate voltage for power generation, transmission and distribution separately."}],"partOfSpeech":"n"}]},{"word":"SUCCESSES","idx":12307,"count":3626751,"meanings":[{"definitions":[{"definition":"The achievement of one's aim or goal.","example":"His third attempt to pass the entrance exam was a success."},{"definition":"Financial profitability.","example":"Don't let success go to your head."},{"definition":"One who, or that which, achieves assumed goals.","example":"Scholastically, he was a success."},{"definition":"The fact of getting or achieving wealth, respect or fame.","example":"She is country music's most recent success."},{"definition":"Something which happens as a consequence; the outcome or result."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"successes-us"}]},{"word":"RACER","idx":12308,"count":3625077,"meanings":[{"definitions":[{"definition":"Someone who takes part in a race."},{"definition":"A racehorse."},{"definition":"An animal known for its fast speed, or suitable for racing; applied especially to a number of North American snakes, certain kinds of lake trout, etc."},{"definition":"A vehicle or other device used for racing."},{"definition":"Any of several genera of colubrid snakes."},{"definition":"A video game involving racing of any kind."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹeɪsəɹ/"},{"text":"/ˈɹeɪsə/"},{"audio":"racer-au"}]},{"word":"FABRICATION","idx":12309,"count":3624802,"meanings":[{"definitions":[{"definition":"The act of fabricating, framing, or constructing; construction; manufacture","example":"the fabrication of a bridge, a church, or a government"},{"definition":"That which is fabricated; a falsehood","example":"The story is doubtless a fabrication."},{"definition":"The act of cutting up an animal carcass as preparation for cooking; butchery."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fæbɹɪˈkeɪʃən/"}]},{"word":"GUILT","idx":12310,"count":3623942,"meanings":[{"definitions":[{"definition":"Responsibility for wrongdoing."},{"definition":"The state of having been found guilty or admitted guilt in legal proceedings."},{"definition":"The regret of having done wrong."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To commit offenses; act criminally."},{"definition":"To cause someone to feel guilt, particularly in order to influence their behaviour.","example":"He didn't want to do it, but his wife guilted him into it."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɪlt/"}]},{"word":"SWEEP","idx":12311,"count":3623863,"meanings":[{"definitions":[{"definition":"A single action of sweeping.","example":"Give the front steps a quick sweep to get rid of those fallen leaves."},{"definition":"The person who steers a dragon boat."},{"definition":"A person who stands at the stern of a surf boat, steering with a steering oar and commanding the crew."},{"definition":"A chimney sweep."},{"definition":"A methodical search, typically for bugs (electronic listening devices)."},{"definition":"A batsman's shot, played from a kneeling position with a swinging horizontal bat.","example":"Bradman attempted a sweep, but in fact top edged the ball to the wicket keeper"},{"definition":"A lottery, usually on the results of a sporting event, where players win if their randomly chosen team wins.","example":"Jim will win fifty dollars in the office sweep if Japan wins the World Cup."},{"definition":"A flow of water parallel to shore caused by wave action at an ocean beach or at a point or headland."},{"definition":"A throw or takedown that primarily uses the legs to attack an opponent's legs."},{"definition":"Violent and general destruction.","example":"the sweep of an epidemic disease"},{"definition":"A movable templet for making moulds, in loam moulding."},{"definition":"In the game casino, the act of capturing all face-up cards from the table."},{"definition":"The compass of any turning body or of any motion.","example":"the sweep of a door; the sweep of the eye"},{"definition":"Direction or departure of a curve, a road, an arch, etc. away from a rectilinear line."},{"definition":"A large oar used in small vessels, partly to propel them and partly to steer them."},{"definition":"A rowing style in which each rower rows with oar on either the port or starboard side.","example":"I am primarily a sweep rower."},{"definition":"(refining) The almond furnace."},{"definition":"A long pole, or piece of timber, moved on a horizontal fulcrum fixed to a tall post and used to raise and lower a bucket in a well for drawing water."},{"definition":"Any of the blades of a windmill."},{"definition":"(in the plural) The sweepings of workshops where precious metals are worked, containing filings, etc."},{"definition":"Any of several sea chub in the kyphosid subfamily Scorpidinae."},{"definition":"An expanse or a swath, a strip of land."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clean (a surface) by means of a stroking motion of a broom or brush.","example":"to sweep a floor, the street, or a chimney"},{"definition":"To move through a (horizontal) arc or similar long stroke.","example":"The offended countess swept out of the ballroom."},{"definition":"To search (a place) methodically."},{"definition":"To travel quickly."},{"definition":"To play a sweep shot."},{"definition":"To brush the ice in front of a moving stone, causing it to travel farther and to curl less."},{"definition":"To move something in a long sweeping motion, as a broom."},{"definition":"To win (a series) without drawing or losing any of the games in that series."},{"definition":"To defeat (a team) in a series without drawing or losing any of the games in that series."},{"definition":"To remove something abruptly and thoroughly.","example":"She swept the peelings off the table onto the floor."},{"definition":"To brush against or over; to rub lightly along.","example":"Their long descending train, / With rubies edg'd and sapphires, swept the plain."},{"definition":"To carry with a long, swinging, or dragging motion; hence, to carry in a stately or proud fashion."},{"definition":"To strike with a long stroke."},{"definition":"To row with one oar to either the port or starboard side."},{"definition":"To draw or drag something over.","example":"to sweep the bottom of a river with a net"},{"definition":"To pass over, or traverse, with the eye or with an instrument of observation.","example":"to sweep the heavens with a telescope"},{"definition":"(including) to vacuum a carpet or rug"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sweep-us","text":"/swiːp/"},{"audio":"sweep-au","text":"/swiːp/"}]},{"word":"EXPLOITED","idx":12313,"count":3621998,"meanings":[{"definitions":[{"definition":"To use for one’s own advantage."},{"definition":"To forcibly deprive someone of something to which she or he has a natural right.","example":"Materialistic monsters who exploit \"kind\" folks will not have good outcomes, no matter how much comforts were ill-gained."}],"partOfSpeech":"ve"}]},{"word":"AVID","idx":12314,"count":3621749,"meanings":[{"definitions":[{"definition":"Enthusiastic; keen; eager; showing great interest in something or desire to do something","example":"I'm an avid reader."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ævəd/"}]},{"word":"OUTPATIENT","idx":12315,"count":3621475,"meanings":[{"definitions":[{"definition":"A patient who receives treatment at a hospital or clinic but is not admitted overnight; a receiver of ambulatory care."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Provided without requiring an overnight stay by the patient."}],"partOfSpeech":"j"}]},{"word":"BLADDER","idx":12316,"count":3621454,"meanings":[{"definitions":[{"definition":"A flexible sac that can expand and contract and that holds liquids or gases."},{"definition":"Specifically, the urinary bladder."},{"definition":"A hollow, inflatable organ of a plant."},{"definition":"The inflatable bag inside various balls used in sports, such as footballs and rugby balls."},{"definition":"A sealed plastic bag that contains wine and is usually packaged in a cask."},{"definition":"Anything inflated, empty, or unsound."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To swell out like a bladder with air; to inflate."},{"definition":"To store or put up in bladders.","example":"bladdered lard"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bladder-us","text":"/ˈblæɾɚ/"}]},{"word":"LAM","idx":12317,"count":3621434,"meanings":[{"definitions":[{"definition":"To beat or thrash."},{"definition":"To flee or run away."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The twenty-third letter of the Arabic alphabet, ل. It is preceded by ك and followed by م."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lam-au","text":"/læm/"}]},{"word":"INFLAMMATORY","idx":12318,"count":3621413,"meanings":[{"definitions":[{"definition":"Any material that causes inflammation"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Tending to inflame or provoke somebody.","example":"Sam posted an inflammatory comment to the newsgroup."},{"definition":"Relating to, causing or caused by inflammation."}],"partOfSpeech":"j"}]},{"word":"IMMUNITY","idx":12320,"count":3620582,"meanings":[{"definitions":[{"definition":"The state of being insusceptible to something; notably:"},{"definition":"A resistance to a specific thing.","example":"Superbugs are bacteria that develop an immunity to antibiotics."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪˈmjuːnəti/"}]},{"word":"ENCRYPTED","idx":12321,"count":3620536,"meanings":[{"definitions":[{"definition":"To conceal information by means of a code or cipher."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Being in code; having been encrypted.","example":"The encrypted text was unreadable."}],"partOfSpeech":"j"}]},{"word":"BETS","idx":12322,"count":3619444,"meanings":[{"definitions":[{"definition":"A wager, an agreement between two parties that a stake (usually money) will be paid by the loser to the winner (the winner being the one who correctly forecast the outcome of an event).","example":"Dylan owes Fletcher $30 from an unsuccessful bet."},{"definition":"A degree of certainty.","example":"It’s a safe bet that it will rain tomorrow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stake or pledge upon the outcome of an event; to wager."},{"definition":"To be sure of something; to be able to count on something.","example":"Fancy going for a drink after work?\nYou bet I do!"},{"definition":"To place money into the pot in order to require others do the same, usually only used for the first person to place money in the pot on each round."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bɛts/"}]},{"word":"WHOLESALERS","idx":12323,"count":3619253,"meanings":[{"definitions":[{"definition":"A person or company that buys merchandise from manufacturers, importers, or distributors and resells the merchandise to retail businesses and to business and institutional end users."}],"partOfSpeech":"n"}]},{"word":"DUCKS","idx":12325,"count":3618693,"meanings":[{"definitions":[{"definition":"To quickly lower the head or body in order to prevent it from being struck by something."},{"definition":"To quickly lower (the head) in order to prevent it from being struck by something."},{"definition":"To lower (something) into water; to thrust or plunge under liquid and suddenly withdraw."},{"definition":"To go under the surface of water and immediately reappear; to plunge one's head into water or other liquid."},{"definition":"To bow."},{"definition":"To evade doing something."},{"definition":"To lower the volume of (a sound) so that other sounds in the mix can be heard more clearly."},{"definition":"To enter a place for a short moment.","example":"I'm just going to duck into the loo for a minute, can you hold my bag?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An aquatic bird of the family Anatidae, having a flat bill and webbed feet."},{"definition":"Specifically, an adult female duck; contrasted with drake and with duckling."},{"definition":"The flesh of a duck used as food."},{"definition":"A batsman's score of zero after getting out. (short for duck's egg, since the digit \"0\" is round like an egg.)"},{"definition":"A playing card with the rank of two."},{"definition":"A partly-flooded cave passage with limited air space."},{"definition":"A building intentionally constructed in the shape of an everyday object to which it is related.","example":"A luncheonette in the shape of a coffee cup is particularly conspicuous, as is intended of an architectural duck or folly."},{"definition":"A marble to be shot at with another marble (the shooter) in children's games."},{"definition":"A cairn used to mark a trail."},{"definition":"One of the weights used to hold a spline in place for the purpose of drawing a curve."},{"definition":"A long-necked medical urinal for men."},{"definition":"A tightly-woven cotton fabric used as sailcloth."},{"definition":"(in plural) Trousers made of such material."},{"definition":"A term of endearment; pet; darling.","example":"And hold-fast is the only dog, my duck (William Shakespeare - The Life of King Henry the Fifth, Act 2, Scene 3)."},{"definition":"Dear, mate (informal way of addressing a friend or stranger).","example":"Ay up duck, ow'a'tha?"},{"definition":"A pair of twos."},{"definition":"(used vocatively) Dear (used as a pet name).","example":"Hello ducks, how are you today?"},{"definition":"The light trousers worn by sailors in hot climates."},{"definition":"A person or thing that is helpless, inefficient or disabled."},{"definition":"An elected official who has lost the recent election or is not eligible for reelection and is marking time until leaving office.","example":"Congressman Jones was a lame duck and did not vote on many issues that were important to his constituents."},{"definition":"A person who cannot fulfill their contracts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ducks-us","text":"/dʌks/"}]},{"word":"SHOOTER","idx":12328,"count":3617812,"meanings":[{"definitions":[{"definition":"Someone who shoots something; a gunner, archer etc."},{"definition":"A firearm."},{"definition":"A video game in which shooting enemies (or targets) is the main objective."},{"definition":"A professional wrestler who uses actual fighting moves as part of his style, or who speaks his mind during a live or televised event (instead of speaking from a script)."},{"definition":"A large marble used for knocking smaller marbles out of a chalk circle."},{"definition":"An alcoholic beverage typically served in a shot glass."},{"definition":"A shooting star."},{"definition":"A device supposed to accumulate orgone."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"shooter-au","text":"/ˈʃuːtə(ɹ)/"}]},{"word":"SWITCHBOARD","idx":12329,"count":3617718,"meanings":[{"definitions":[{"definition":"The electronic panel that is used to direct telephone calls to the desired recipient."},{"definition":"A device that directs electricity from one source to another."}],"partOfSpeech":"n"}]},{"word":"PAINTS","idx":12330,"count":3617496,"meanings":[{"definitions":[{"definition":"A substance that is applied as a liquid or paste, and dries into a solid coating that protects or adds color/colour to an object or surface to which it has been applied."},{"definition":"(in the plural) A set of containers or blocks of paint of different colors/colours, used for painting pictures."},{"definition":"The free-throw lane, construed with the.","example":"The Nimrods are strong on the outside, but not very good in the paint."},{"definition":"Paintballs.","example":"I am running low on paint for my marker."},{"definition":"A face card (king, queen, or jack)."},{"definition":"Graphics drawn using an input device, not scanned or generated."},{"definition":"Makeup."},{"definition":"Any substance fixed with latex to harden it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply paint to."},{"definition":"To apply in the manner that paint is applied."},{"definition":"To cover (something) with spots of colour, like paint."},{"definition":"To create (an image) with paints.","example":"to paint a portrait or a landscape"},{"definition":"To practise the art of painting pictures.","example":"I've been painting since I was a young child."},{"definition":"To draw an element in a graphical user interface."},{"definition":"To depict or portray.","example":"She sued the author of the biography, claiming it painted her as a duplicitous fraud."},{"definition":"To color one's face by way of beautifying it."},{"definition":"To direct a radar beam toward.","example":"\"We'll paint the target for the flyboys,\" the JTAC said."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/peɪnts/"}]},{"word":"NEIGHBOURHOOD","idx":12332,"count":3616133,"meanings":[{"definitions":[{"definition":"The quality of being a neighbor, of living nearby, next to each-other; proximity.","example":"Our neighborhood was our only reason to exchange hollow greetings."},{"definition":"Close proximity, nearby area; particularly, close proximity to one's home.","example":"He lives in my neighborhood."},{"definition":"The inhabitants of a residential area.","example":"The fire alarmed the neighborhood."},{"definition":"A formal or informal division of a municipality or region.","example":"We have just moved to a pleasant neighborhood."},{"definition":"An approximate amount.","example":"He must be making in the neighborhood of $200,000 per year."},{"definition":"The quality of physical proximity.","example":"The slums and the palace were in awful neighborhood."},{"definition":"The disposition becoming a neighbor; neighborly kindness or good will."},{"definition":"Within a topological space:"},{"definition":"Within a metric space:"},{"definition":"The infinitesimal open set of all points that may be reached directly from a given point."},{"definition":"The set of all the vertices adjacent to a given vertex."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"neighbourhood-us"}]},{"word":"CHEATING","idx":12333,"count":3615902,"meanings":[{"definitions":[{"definition":"To violate rules in order to gain advantage from a situation.","example":"My brother flunked biology because he cheated on his mid-term."},{"definition":"To be unfaithful to one's spouse or partner.","example":"After he found out his wife cheated, he left her."},{"definition":"To manage to avoid something even though it seemed unlikely.","example":"He cheated death when his car collided with a moving train."},{"definition":"To deceive; to fool; to trick.","example":"He cheated his way into office."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of deception, fraud, trickery, imposture, imposition or infidelity."},{"definition":"The arrangement of people or items in a film so as to give the (false) impression that shots are taken from different angles in the same location."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Unsporting or underhand."},{"definition":"Unfaithful or adulterous."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cheating-uk","text":"/ˈtʃiːtɪŋ/"}]},{"word":"CARR","idx":12334,"count":3615873,"meanings":[{"definitions":[{"definition":"A bog or marsh; marshy ground, swampland."},{"definition":"A marsh or fen on which low trees or bushes grow; a marshy woodland."},{"definition":"A wheeled vehicle that moves independently, with at least three wheels, powered mechanically, steered by a driver and mostly for personal transportation.","example":"She drove her car to the mall."},{"definition":"A wheeled vehicle, drawn by a horse or other animal; a chariot."},{"definition":"An unpowered unit in a railroad train.","example":"The conductor coupled the cars to the locomotive."},{"definition":"An individual vehicle, powered or unpowered, in a multiple unit.","example":"The 11:10 to London was operated by a 4-car diesel multiple unit."},{"definition":"A passenger-carrying unit in a subway or elevated train, whether powered or not.","example":"From the frontmost car of the subway, he filmed the progress through the tunnel."},{"definition":"A rough unit of quantity approximating the amount which would fill a railroad car.","example":"We ordered five hundred cars of gypsum."},{"definition":"The moving, load-carrying component of an elevator or other cable-drawn transport mechanism.","example":"Fix the car of the express elevator - the door is sticking."},{"definition":"The passenger-carrying portion of certain amusement park rides, such as Ferris wheels.","example":"The most exciting part of riding a Ferris wheel is when your car goes over the top."},{"definition":"The part of an airship, such as a balloon or dirigible, which houses the passengers and control apparatus."},{"definition":"A sliding fitting that runs along a track."},{"definition":"The aggregate of desirable characteristics of a car.","example":"Buy now! You can get more car for your money."},{"definition":"A floating perforated box for living fish."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɑɹ/"},{"text":"/kɑː/"}]},{"word":"FADE","idx":12335,"count":3615179,"meanings":[{"definitions":[{"definition":"A golf shot that (for the right-handed player) curves intentionally to the right. See slice, hook, draw."},{"definition":"A haircut where the hair is short or shaved on the sides of the head and longer on top. See also high-top fade and low fade."},{"definition":"A fight."},{"definition":"A gradual decrease in the brightness of a shot or the volume of sound or music (as a means of cutting to a new scene or starting a new song)."},{"definition":"The act of disappearing from a place so as not to be found; covert departure."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grow weak; to lose strength; to decay; to perish gradually; to wither, as a plant."},{"definition":"To lose freshness, color, or brightness; to become faint in hue or tint; hence, to be wanting in color."},{"definition":"To sink away; to disappear gradually; to grow dim; to vanish.","example":"The milkman's whistling faded into the distance."},{"definition":"To cause to fade."},{"definition":"To bet against."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Weak; insipid; tasteless."},{"definition":"Strong; bold; doughty."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fade-au","text":"/feɪd/"}]},{"word":"FLUORESCENT","idx":12336,"count":3614260,"meanings":[{"definitions":[{"definition":"A fluorescent light.","example":"The fluorescents hummed day and night."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to fluorescence."},{"definition":"Exhibiting or produced by fluorescence.","example":"The fluorescent plants shimmered in the darkness."},{"definition":"Emitting visible light as a result of the excitation of phosphors by ultraviolet photons produced by the passage of an electrical current through an inert gas infused with mercury.","example":"The quality of fluorescent lighting technology has improved dramatically in recent years."},{"definition":"Glowing as if with fluorescence; vivid","example":"Her shirt was fluorescent orange."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/flɔˈɹɛsɨnt/"},{"text":"/ˌflʊəˈɹɛsənt/"}]},{"word":"TASTES","idx":12337,"count":3613970,"meanings":[{"definitions":[{"definition":"One of the sensations produced by the tongue in response to certain chemicals; the quality of giving this sensation.","example":"He had a strange taste in his mouth."},{"definition":"The sense that consists in the perception and interpretation of this sensation.","example":"His taste was impaired by an illness."},{"definition":"A small sample of food, drink, or recreational drugs."},{"definition":"A person's implicit set of preferences, especially esthetic, though also culinary, sartorial, etc.","example":"Dr. Parker has good taste in wine."},{"definition":"Personal preference; liking; predilection.","example":"I have developed a taste for fine wine."},{"definition":"A small amount of experience with something that gives a sense of its quality as a whole."},{"definition":"A kind of narrow and thin silk ribbon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sample the flavor of something orally."},{"definition":"To have a taste; to excite a particular sensation by which flavour is distinguished.","example":"The chicken tasted great, but the milk tasted like garlic."},{"definition":"To experience.","example":"I tasted in her arms the delights of paradise."},{"definition":"To take sparingly."},{"definition":"To try by eating a little; to eat a small quantity of."},{"definition":"To try by the touch; to handle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tastes-us","text":"/teɪsts/"}]},{"word":"COOKWARE","idx":12338,"count":3613638,"meanings":[{"definitions":[{"definition":"The assorted objects, such as pots, pans, baking sheets, etc., used for cooking"}],"partOfSpeech":"n"}]},{"word":"STORMS","idx":12339,"count":3613499,"meanings":[{"definitions":[{"definition":"Any disturbed state of the atmosphere, especially as affecting the earth's surface, and strongly implying destructive or unpleasant weather."},{"definition":"A violent agitation of human society; a civil, political, or domestic commotion; violent outbreak.","example":"The proposed reforms have led to a political storm."},{"definition":"A wind scale for very strong wind, stronger than a gale, less than a hurricane (10 or higher on the Beaufort scale)."},{"definition":"A violent assault on a stronghold or fortified position."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(with adverbial of direction) To move quickly and noisily like a storm, usually in a state of uproar or anger.","example":"She stormed out of the room."},{"definition":"To rage or fume; to be in a violent temper."},{"definition":"To assault (a stronghold or fortification) with military forces.","example":"Troops stormed the complex."},{"definition":"To have the weather be violent, with strong winds and usually rain, thunder, lightning, or snow.","example":"It stormed throughout the night."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"storms-us","text":"/stɔɹmz/"}]},{"word":"SMILED","idx":12342,"count":3613070,"meanings":[{"definitions":[{"definition":"To have (a smile) on one's face.","example":"I don't know what he's smiling about."},{"definition":"To express by smiling.","example":"to smile consent, or a welcome"},{"definition":"To express amusement, pleasure, or love and kindness."},{"definition":"To look cheerful and joyous; to have an appearance suited to excite joy.","example":"The sun smiled down from a clear summer sky."},{"definition":"To be propitious or favourable; to countenance.","example":"The gods smiled on his labours."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"smiled-us","text":"/smaɪld/"}]},{"word":"JURISDICTIONS","idx":12343,"count":3613001,"meanings":[{"definitions":[{"definition":"The power, right, or authority to interpret and apply the law."},{"definition":"The power or right to exercise authority."},{"definition":"The power or right to perform some action as part of applying the law."},{"definition":"The authority of a sovereign power to govern or legislate."},{"definition":"The limits or territory within which authority may be exercised."}],"partOfSpeech":"n"}]},{"word":"SCRUTINY","idx":12344,"count":3611860,"meanings":[{"definitions":[{"definition":"Intense study of someone or something."},{"definition":"Thorough inspection of a situation or a case."},{"definition":"An examination of catechumens, in the last week of Lent, who were to receive baptism on Easter Day."},{"definition":"A ticket, or little paper billet, on which a vote is written."},{"definition":"An examination by a committee of the votes given at an election, for the purpose of correcting the poll."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To scrutinize."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scrutiny-uk","text":"/ˈskɹuː.tɪ.ni/"}]},{"word":"REGENERATION","idx":12345,"count":3611850,"meanings":[{"definitions":[{"definition":"Rebuilding or restructuring; large scale repair or renewal.","example":"The conversion of so many old industrial buildings into living quarters was a major factor in the regeneration."},{"definition":"Spiritual rebirth; the change from a carnal or material life to a pious one"},{"definition":"The renewal of the world at the second coming of Christ."},{"definition":"An ability possessed by certain creatures to rapidly heal substantial physical damage to their body"},{"definition":"Spontaneous restoration of hit points"}],"partOfSpeech":"n"}]},{"word":"LUNAR","idx":12346,"count":3611744,"meanings":[{"definitions":[{"definition":"The middle bone of the proximal series of the carpus in the wrist, which is shaped like a half-moon."},{"definition":"An observation of a lunar distance, especially for establishing the longitude of a ship at sea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, pertaining to, or resembling the Moon (that is, Luna, the Earth's moon); Lunar.","example":"lunar observations  a lunar eclipse"},{"definition":"Shaped like a crescent moon; lunate."},{"definition":"(Believed to be) influenced by the Moon, as in character, growth, or properties."},{"definition":"Of or pertaining to silver (which was symbolically associated with the Moon by alchemists)."},{"definition":"Of or pertaining to travel through space between the Earth and the Moon, or exploration and scientific investigation of the Moon."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lunar-us","text":"/ˈlunɚ/"}]},{"word":"DIFFERENTIATION","idx":12347,"count":3611085,"meanings":[{"definitions":[{"definition":"The act of differentiating."},{"definition":"The act of distinguishing or describing a thing, by giving its different, or specific difference; exact definition or determination."},{"definition":"The gradual formation or production of organs or parts by a process of evolution or development, as when the seed develops the root and the stem, the initial stem develops the leaf, branches, and flower buds; or in animal life, when the germ evolves the digestive and other organs and members, or when the animals as they advance in organization acquire special organs for specific purposes."},{"definition":"(geology) The process of separation of cooling magma into various rock types."},{"definition":"The process of determining the derived function of a function."}],"partOfSpeech":"n"}]},{"word":"SHIELDS","idx":12348,"count":3610577,"meanings":[{"definitions":[{"definition":"Anything that protects or defends; defense; shelter; protection."},{"definition":"A shape like that of a shield; usually, an inverted triangle with sides that curve inward to form a pointed bottom, commonly used for police identifications and company logos."},{"definition":"A large expanse of exposed stable Precambrian rock."},{"definition":"A place with a toilet seat: an outhouse; a lavatory."},{"definition":"Parts at the front and back of a vehicle which are meant to absorb the impact of a collision"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To protect, to defend."},{"definition":"To protect from the influence of"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shields-us"}]},{"word":"ENVIRONMENTALLY","idx":12349,"count":3610401,"meanings":[{"definitions":[{"definition":"In a manner affecting the environment."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"environmentally-us"}]},{"word":"NONSENSE","idx":12350,"count":3609585,"meanings":[{"definitions":[{"definition":"Letters or words, in writing or speech, that have no meaning or pattern or seem to have no meaning.","example":"After my father had a stroke, every time he tried to talk, it sounded like nonsense."},{"definition":"An untrue statement.","example":"He says that I stole his computer, but that's just nonsense."},{"definition":"That which is silly, illogical and lacks any meaning, reason or value; that which does not make sense."},{"definition":"Something foolish."},{"definition":"A type of poetry that contains strange or surreal ideas, as, for example, that written by Edward Lear."},{"definition":"A damaged DNA sequence whose products are not biologically active, that is, that does nothing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make nonsense of;"},{"definition":"To attempt to dismiss as nonsense; to ignore or belittle the significance of something; to render unimportant or puny."},{"definition":"To joke around, to waste time"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Resulting from the substitution of a nucleotide in a sense codon, causing it to become a stop codon (not coding for an amino-acid)."},{"definition":"Nonsensical"}],"partOfSpeech":"j"},{"definitions":[{"definition":"An emphatic rejection of something one has just heard and does not believe or agree with."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"nonsense-us","text":"/ˈnɑnsɛns/"}]},{"word":"INVENTED","idx":12351,"count":3607460,"meanings":[{"definitions":[{"definition":"To design a new process or mechanism.","example":"After weeks of hard work, I invented a new way to alphabetize matchbooks."},{"definition":"To create something fictional for a particular purpose.","example":"I knew I had to invent an excuse, and quickly."},{"definition":"To come upon; to find; to discover."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fictional, made up, imaginary.","example":"The invented alibi didn't stand up long."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"invented-us","text":"/ɪnˈvɛntɪd/"}]},{"word":"GRADIENT","idx":12352,"count":3607228,"meanings":[{"definitions":[{"definition":"A slope or incline."},{"definition":"A rate of inclination or declination of a slope."},{"definition":"Of a function y = f(x) or the graph of such a function, the rate of change of y with respect to x that is, the amount by which y changes for a certain (often unit) change in x equivalently, the inclination to the X axis of the tangent to the curve of the graph."},{"definition":"The rate at which a physical quantity increases or decreases relative to change in a given variable, especially distance."},{"definition":"A differential operator that maps each point of a scalar field to a vector pointed in the direction of the greatest rate of change of the scalar. Notation for a scalar field φ: ∇φ"},{"definition":"A gradual change in color. A color gradient; gradation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Moving by steps; walking.","example":"gradient automata"},{"definition":"Rising or descending by regular degrees of inclination.","example":"the gradient line of a railroad"},{"definition":"Adapted for walking, as the feet of certain birds."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gradient-us"}]},{"word":"INSERTS","idx":12354,"count":3606774,"meanings":[{"definitions":[{"definition":"An image inserted into text."},{"definition":"A promotional or instructive leaflet inserted into a magazine, newspaper, tape or disk package, etc.","example":"This software can print compact disc inserts if you have the right size of paper."},{"definition":"A mechanical component inserted into another.","example":"a threaded insert"},{"definition":"An expression, such as \"please\" or an interjection, that may occur at various points in an utterance."},{"definition":"A sequence of DNA inserted into another DNA molecule."},{"definition":"A pre-recorded segment included as part of a live broadcast."},{"definition":"A close-up shot used to draw attention to a particular element of a larger scene."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put in between or into.","example":"In order to withdraw money from a cash machine, you have to insert your debit card."}],"partOfSpeech":"ve"}]},{"word":"PROGRAMMABLE","idx":12357,"count":3605039,"meanings":[{"definitions":[{"definition":"A calculator that allows the user to write programs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Capable of being programmed."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹəʊˈɡɹæməbəl/"}]},{"word":"POSED","idx":12358,"count":3604888,"meanings":[{"definitions":[{"definition":"To place in an attitude or fixed position, for the sake of effect.","example":"To pose a model for a picture."},{"definition":"To ask; to set (a test, quiz, riddle, etc.)."},{"definition":"To constitute (a danger, a threat, a risk, etc.)."},{"definition":"(in the phrase \"to pose as\") To falsely impersonate (another person or occupation) primarily for the purpose of accomplishing something or reaching a goal."},{"definition":"To assume or maintain a pose; to strike an attitude."},{"definition":"To behave affectedly in order to attract interest or admiration."},{"definition":"To interrogate; to question."},{"definition":"To question with a view to puzzling; to embarrass by questioning or scrutiny; to bring to a stand."},{"definition":"To ask (someone) questions; to interrogate."},{"definition":"To puzzle, non-plus, or embarrass with difficult questions."},{"definition":"To perplex or confuse (someone)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Firm; determined; fixed."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/poʊzd/"},{"text":"/pəʊzd/"}]},{"word":"SUBJECTED","idx":12359,"count":3603968,"meanings":[{"definitions":[{"definition":"(construed with to) To cause (someone or something) to undergo a particular experience, especially one that is unpleasant or unwanted.","example":"I came here to buy souvenirs, not to be subjected to a tirade of abuse!"},{"definition":"To make subordinate or subservient; to subdue or enslave."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"subjected-us","text":"/səbˈdʒɛktɪd/"}]},{"word":"TASTING","idx":12360,"count":3603798,"meanings":[{"definitions":[{"definition":"A small amount of food or drink."},{"definition":"The taking of a small amount of food or drink into the mouth in order to taste it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sample the flavor of something orally."},{"definition":"To have a taste; to excite a particular sensation by which flavour is distinguished.","example":"The chicken tasted great, but the milk tasted like garlic."},{"definition":"To experience.","example":"I tasted in her arms the delights of paradise."},{"definition":"To take sparingly."},{"definition":"To try by eating a little; to eat a small quantity of."},{"definition":"To try by the touch; to handle."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈteɪstɪŋ/"}]},{"word":"CHEMOTHERAPY","idx":12362,"count":3601490,"meanings":[{"definitions":[{"definition":"Any chemical treatment intended to be therapeutic with respect to a disease state."},{"definition":"(most common usage) chemical treatment to kill or halt the replication and/or spread of cancerous cells in a patient."}],"partOfSpeech":"n"}]},{"word":"MOB","idx":12364,"count":3599356,"meanings":[{"definitions":[{"definition":"A large or disorderly group of people; especially one bent on riotous or destructive action."},{"definition":"A group of animals such as horses or cattle."},{"definition":"A flock of emus."},{"definition":"The Mafia, or a similar group that engages in organized crime (preceded by the)."},{"definition":"A non-player character, especially one that exists to be fought or killed to further the progression of the story or game."},{"definition":"The lower classes of a community; the rabble."},{"definition":"(Australian Aboriginal) A group of Aboriginal people associated with an extended family group, clan group or wider community group, from a particular place or country."},{"definition":"A promiscuous woman; a harlot or wench; a prostitute."},{"definition":"A mob cap."},{"definition":"Mobile phone"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To crowd around (someone), sometimes with hostility.","example":"The fans mobbed a well-dressed couple who resembled their idols."},{"definition":"To crowd into or around a place.","example":"The shoppers mobbed the store on the first day of the sale."},{"definition":"To wrap up in, or cover with, a cowl."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mob-us","text":"/mɑb/"}]},{"word":"EXPOSE","idx":12365,"count":3598867,"meanings":[{"definitions":[{"definition":"To reveal, uncover, make visible, bring to light, introduce to."},{"definition":"To subject photographic film to light thereby recording an image."},{"definition":"To abandon, especially an unwanted baby in the wilderness."},{"definition":"To submit to an active (mostly dangerous) substance like an allergen, ozone, nicotine, solvent, or to any other stress, in order to test the reaction, resistance, etc."},{"definition":"To make available to other parts of a program, or to other programs."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"expose-us","text":"/ɛkˈspoʊz/"}]},{"word":"BORROWING","idx":12366,"count":3598089,"meanings":[{"definitions":[{"definition":"To receive (something) from somebody temporarily, expecting to return it."},{"definition":"To take money from a bank under the agreement that the bank will be paid over the course of time."},{"definition":"To adopt (an idea) as one's own.","example":"to borrow the style, manner, or opinions of another"},{"definition":"To adopt a word from another language."},{"definition":"In a subtraction, to deduct (one) from a digit of the minuend and add ten to the following digit, in order that the subtraction of a larger digit in the subtrahend from the digit in the minuend to which ten is added gives a positive result."},{"definition":"(Upper Midwestern United States) To lend."},{"definition":"To temporarily obtain (something) for (someone)."},{"definition":"To feign or counterfeit."},{"definition":"(obsolete except in ballads) To secure the release of (someone) from prison."},{"definition":"To receive (something) from somebody, with little possibility of returning it.","example":"Can I borrow a sheet of paper?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An instance of something being borrowed."},{"definition":"A borrowed word, adopted from a foreign language; loanword."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"borrowing-us"}]},{"word":"ARISES","idx":12367,"count":3597654,"meanings":[{"definitions":[{"definition":"To come up from a lower to a higher position.","example":"to arise from a kneeling posture"},{"definition":"To come up from one's bed or place of repose; to get up.","example":"He arose early in the morning."},{"definition":"To spring up; to come into action, being, or notice; to become operative, sensible, or visible; to begin to act a part; to present itself.","example":"A cloud arose and covered the sun."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Arse"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"arises-1-us","text":"/əˈɹaɪzɪz/"}]},{"word":"PRECAUTIONS","idx":12370,"count":3596326,"meanings":[{"definitions":[{"definition":"Previous caution or care; caution previously employed to prevent misfortune or to secure good","example":"his life was saved by precaution"},{"definition":"A measure taken beforehand to ward off evil or secure good or success; a precautionary act.","example":"to take precautions against risks of accident"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɹiːˈkɔːʃənz/"}]},{"word":"BRANDED","idx":12371,"count":3595078,"meanings":[{"definitions":[{"definition":"To burn the flesh with a hot iron, either as a marker (for criminals, slaves etc.) or to cauterise a wound.","example":"When they caught him, he was branded and then locked up."},{"definition":"To mark (especially cattle) with a brand as proof of ownership.","example":"The ranch hands had to brand every new calf by lunchtime."},{"definition":"To make an indelible impression on the memory or senses.","example":"Her face is branded upon my memory."},{"definition":"To stigmatize, label (someone).","example":"He was branded a fool by everyone that heard his story."},{"definition":"To associate a product or service with a trademark or other name and related images.","example":"They branded the new detergent \"Suds-O\", with a nature scene inside a green O on the muted-colored recycled-cardboard box."}],"partOfSpeech":"ve"}]},{"word":"DYSFUNCTION","idx":12372,"count":3593314,"meanings":[{"definitions":[{"definition":"A failure to function in an expected or complete manner. Usually refers to a disorder in a bodily organ (e.g. erectile dysfunction), a mental disorder, or the improper behavior of a social group."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fail to function correctly; to malfunction."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪsˈfʌŋk.ʃən/"}]},{"word":"MANNING","idx":12373,"count":3593144,"meanings":[{"definitions":[{"definition":"To supply (something) with staff or crew (of either sex).","example":"The ship was manned with a small crew."},{"definition":"To take up position in order to operate (something).","example":"Man the machine guns!"},{"definition":"(possibly obsolete) To brace (oneself), to fortify or steel (oneself) in a manly way. (Compare man up.)"},{"definition":"To wait on, attend to or escort."},{"definition":"To accustom (a raptor or other type of bird) to the presence of people."}],"partOfSpeech":"ve"}]},{"word":"FORKS","idx":12375,"count":3592612,"meanings":[{"definitions":[{"definition":"A pronged tool having a long straight handle, used for digging, lifting, throwing etc."},{"definition":"A pronged tool for use in the garden; a smaller hand fork for weeding etc., or larger for turning over the soil."},{"definition":"A gallows."},{"definition":"A utensil with spikes used to put solid food into the mouth, or to hold food down while cutting."},{"definition":"A tuning fork."},{"definition":"An intersection in a road or path where one road is split into two."},{"definition":"One of the parts into which anything is furcated or divided; a prong; a branch of a stream, a road, etc.; a barbed point, as of an arrow."},{"definition":"A point where a waterway, such as a river, splits and goes two (or more) different directions."},{"definition":"Used in the names of some river tributaries.","example":"West Fork White River and East Fork White River join together to form the White River of Indiana."},{"definition":"A point in time where one has to make a decision between two life paths."},{"definition":"The simultaneous attack of two adversary pieces with one single attacking piece (especially a knight)."},{"definition":"A splitting-up of an existing process into itself and a child process executing parts of the same program."},{"definition":"The splitting of a software development effort into two or more separate projects, especially in free and open-source software."},{"definition":"Any of the software projects resulting from such a split.","example":"LibreOffice is a fork of OpenOffice."},{"definition":"(cryptocurrency, by extension) A split in a blockchain resulting from protocol disagreements, or a branch of the blockchain resulting from such a split."},{"definition":"The crotch."},{"definition":"A forklift.","example":"Are you qualified to drive a fork?"},{"definition":"The set of blades of a forklift, on which the goods to be raised are loaded."},{"definition":"In a bicycle or motorcycle, the portion of the frameset holding the front wheel, allowing the rider to steer and balance, also called front fork.","example":"The fork can be equipped with a suspension on mountain bikes."},{"definition":"The upper front brow of a saddle bow, connected in the tree by the two saddle bars to the cantle on the other end."},{"definition":"The bottom of a sump into which the water of a mine drains."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide into two or more branches.","example":"A road, a tree, or a stream forks."},{"definition":"To move with a fork (as hay or food)."},{"definition":"To spawn a new child process in some sense duplicating the existing process."},{"definition":"To split a (software) project into several projects."},{"definition":"To split a (software) distributed version control repository"},{"definition":"To kick someone in the crotch."},{"definition":"To shoot into blades, as corn does."},{"definition":"To bale a shaft dry."},{"definition":"To have sexual intercourse, to copulate.","example":"Fighting for peace is like fucking for virginity."},{"definition":"To have sexual intercourse with."},{"definition":"To insert one’s penis, a dildo or other phallic object, into a specified orifice or cleft."},{"definition":"To put in an extremely difficult or impossible situation.","example":"I'm afraid they're gonna fuck you on this one."},{"definition":"To defraud, deface or otherwise treat badly.","example":"I got fucked at the used car lot."},{"definition":"Used to express great displeasure with someone or something.","example":"Fuck those jerks, and fuck their stupid rules!"},{"definition":"(usually followed by up) To break, to destroy."},{"definition":"To make a joke at one's expense; to make fun of in an embarrassing manner."},{"definition":"To throw, to lob something. (angrily)","example":"He fucked the dirty cloth out the window."},{"definition":"To scold","example":"The sergeant fucked me upside down."}],"partOfSpeech":"ve"}]},{"word":"MONK","idx":12376,"count":3592443,"meanings":[{"definitions":[{"definition":"A male member of a monastic order who has devoted his life for religious service."},{"definition":"In earlier usage, an eremite or hermit devoted to solitude, as opposed to a cenobite, who lived communally."},{"definition":"A male who leads an isolated life; a loner, a hermit."},{"definition":"An unmarried man who does not have sexual relationships."},{"definition":"A judge."},{"definition":"A blotch or spot of ink on a printed page, caused by the ink not being properly distributed; distinguished from a friar, or white spot caused by a deficiency of ink."},{"definition":"A piece of tinder made of agaric, used in firing the powder hose or train of a mine."},{"definition":"A South American monkey (Pithecia monachus); also applied to other species, as Cebus xanthosternos."},{"definition":"The bullfinch, common bullfinch, European bullfinch, or Eurasian bullfinch (Pyrrhula pyrrhula)."},{"definition":"The monkfish."},{"definition":"A fuse for firing mines."},{"definition":"A monkey."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be a monk."},{"definition":"To act like a monk; especially to be contemplative."},{"definition":"To monkey or meddle; to behave in a manner that is not systematic."},{"definition":"To be intoxicated or confused."},{"definition":"To be attached in a way that sticks out."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"monk-au","text":"/mʌŋk/"}]},{"word":"BOXER","idx":12377,"count":3592432,"meanings":[{"definitions":[{"definition":"A participant (fighter) in a boxing match.","example":"You can tell she's a boxer by looking at her nose."},{"definition":"A breed of stocky, medium-sized, short-haired dog with a square-jawed muzzle."},{"definition":"A type of internal combustion engine in which cylinders are arranged in two banks on either side of a single crankshaft."},{"definition":"The person running a game of two-up."},{"definition":"One who packs boxes."},{"definition":"A letterboxer."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɑːksɚ/"},{"text":"/ˈbɒksə/"}]},{"word":"SHINING","idx":12378,"count":3592416,"meanings":[{"definitions":[{"definition":"To emit light."},{"definition":"To reflect light."},{"definition":"To distinguish oneself; to excel.","example":"My nephew tried other sports before deciding on football, which he shone at right away, quickly becoming the star of his school team."},{"definition":"To be effulgent in splendour or beauty."},{"definition":"To be eminent, conspicuous, or distinguished; to exhibit brilliant intellectual powers."},{"definition":"To be immediately apparent."},{"definition":"To create light with (a flashlight, lamp, torch, or similar).","example":"I shone my light into the darkness to see what was making the noise."},{"definition":"To cause to shine, as a light."},{"definition":"To make bright; to cause to shine by reflected light.","example":"in hunting, to shine the eyes of a deer at night by throwing a light on them"},{"definition":"To cause (something) to shine; put a shine on (something); polish (something).","example":"He shined my shoes until they were polished smooth and gleaming."},{"definition":"To polish a cricket ball using saliva and one’s clothing."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A bright emission of light; a gleam."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Emitting light."},{"definition":"Reflecting light."},{"definition":"Having a high polish or sheen."},{"definition":"Having exceptional merit.","example":"a shining example"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shining-us","text":"/ˈʃaɪnɪŋ/"}]},{"word":"DIAZEPAM","idx":12380,"count":3588990,"meanings":[{"definitions":[{"definition":"A tranquilizing muscle relaxant drug (trademark Valium) used chiefly to relieve anxiety.","example":"2001: The most effective anti-anxiety drugs (tranquillizers) are the benzodiazepines, epitomized by diazepam (Valium®). — Leslie Iversen, Drugs: A Very Short Introduction (Oxford 2001, p. 57)"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/daɪˈæz.əˌpæm/"},{"text":"/dʌɪˈeɪ.zɪp.æm/"}]},{"word":"WEIGH","idx":12381,"count":3587993,"meanings":[{"definitions":[{"definition":"To determine the weight of an object."},{"definition":"Often with \"out\", to measure a certain amount of something by its weight, e.g. for sale.","example":"He weighed out two kilos of oranges for a client."},{"definition":"To determine the intrinsic value or merit of an object, to evaluate.","example":"You have been weighed in the balance and found wanting."},{"definition":"To judge; to estimate."},{"definition":"To consider a subject."},{"definition":"To have a certain weight.","example":"I weigh ten and a half stone."},{"definition":"To have weight; to be heavy; to press down."},{"definition":"To be considered as important; to have weight in the intellectual balance."},{"definition":"To raise an anchor free of the seabed."},{"definition":"To weigh anchor."},{"definition":"To bear up; to raise; to lift into the air; to swing up."},{"definition":"To consider as worthy of notice; to regard."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"weigh-us","text":"/weɪ/"}]},{"word":"RODEO","idx":12382,"count":3587192,"meanings":[{"definitions":[{"definition":"A gathering of cattle to be branded."},{"definition":"A North American sport involving skills with horses, cows and other livestock."},{"definition":"An entertainment event associated with the sport."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform in a rodeo show."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rodeo-uk","text":"/ɹoʊ.ˈdeɪ.oʊ/"}]},{"word":"CLERICAL","idx":12383,"count":3586609,"meanings":[{"definitions":[{"definition":"A member of the clergy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to clerks or their work."},{"definition":"Of or relating to the clergy."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"clerical-us"},{"text":"/ˈklɛɹɪkəl/"}]},{"word":"SAMPLER","idx":12386,"count":3583120,"meanings":[{"definitions":[{"definition":"A piece of needlework embroidered with a variety of designs."},{"definition":"Someone whose job is to take samples."},{"definition":"A device that takes samples."},{"definition":"A digital device that records or merges together samples of recordings."},{"definition":"A representative selection of a larger group."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsamplɚ/"}]},{"word":"MOOSE","idx":12387,"count":3581329,"meanings":[{"definitions":[{"definition":"The largest member of the deer family (Alces americanus, sometimes included in Alces alces), of which the male has very large, palmate antlers.","example":"We saw a moose at the edge of the woods."},{"definition":"An ugly person."},{"definition":"An Asian girl taken as a lover."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"moose-us","text":"/muːs/"},{"audio":"moose-au","text":"/muːs/"}]},{"word":"TIMETABLE","idx":12389,"count":3579372,"meanings":[{"definitions":[{"definition":"A tabular schedule of events with the times at which they occur, especially times of arrivals and departures","example":"The timetable has been changed several times since it was first announced."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To arrange a specific time for (an event, a class, etc).","example":"I've timetabled the meeting for Monday afternoon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"timetable-us","text":"/ˈtaɪmˌteɪbəl/"}]},{"word":"CORROSION","idx":12391,"count":3578504,"meanings":[{"definitions":[{"definition":"The act of corroding or the condition so produced."},{"definition":"A substance (such as rust) so formed."},{"definition":"Erosion by chemical action, especially oxidation."},{"definition":"(by extension) The gradual destruction or undermining of something."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kəˈɹoʊʒən/"},{"text":"/kəˈɹəʊʒən/"}]},{"word":"POSITIONED","idx":12392,"count":3578050,"meanings":[{"definitions":[{"definition":"To put into place."}],"partOfSpeech":"ve"}]},{"word":"CHECKER","idx":12393,"count":3577995,"meanings":[{"definitions":[{"definition":"One who checks or verifies something."},{"definition":"One who makes a check mark."},{"definition":"The clerk who tallies cost of purchases and accepts payment.","example":"There was a long line at the grocery store because the checker was so slow."},{"definition":"One who hinders or stops something."},{"definition":"A playing piece in the game of checkers (British: draughts)."},{"definition":"A pattern of alternating colours as on a chessboard."},{"definition":"The fruit of the wild service tree or chequer tree, Photinia villosa, syn. Sorbus terminalis"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark in a pattern of alternating light and dark positions, like a checkerboard."},{"definition":"To develop markings in a pattern of alternating light and dark positions, like a checkerboard."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtʃɛkɚ/"},{"text":"/ˈtʃɛkə/"}]},{"word":"WORKSTATIONS","idx":12395,"count":3577167,"meanings":[{"definitions":[{"definition":"A desktop computer, normally more powerful than a normal PC and often dedicated to a specific task, such as graphics"},{"definition":"An area, at a workplace, for a single worker"}],"partOfSpeech":"n"}]},{"word":"CONSCIENCE","idx":12396,"count":3576906,"meanings":[{"definitions":[{"definition":"The moral sense of right and wrong, chiefly as it affects one's own behaviour.","example":"Your conscience is your highest authority."},{"definition":"(chiefly fiction) A personification of the moral sense of right and wrong, usually in the form of a person, a being or merely a voice that gives moral lessons and advices."},{"definition":"Consciousness; thinking; awareness, especially self-awareness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"conscience-us","text":"/kɒnʃəns/"}]},{"word":"CRUSH","idx":12397,"count":3576348,"meanings":[{"definitions":[{"definition":"A violent collision or compression; a crash; destruction; ruin."},{"definition":"Violent pressure, as of a moving crowd."},{"definition":"A crowd that produces uncomfortable pressure.","example":"a crush at a reception"},{"definition":"A violent crowding."},{"definition":"A crowd control barrier."},{"definition":"A drink made by squeezing the juice out of fruit."},{"definition":"An infatuation with somebody one is not dating.","example":"I've had a huge crush on her since we met many years ago."},{"definition":"A standing stock or cage with movable sides used to restrain livestock for safe handling."},{"definition":"A party or festive function."},{"definition":"The process of crushing cane to remove the raw sugar, or the season when this process takes place."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press between two hard objects; to squeeze so as to alter the natural shape or integrity of it, or to force together into a mass.","example":"to crush grapes"},{"definition":"To reduce to fine particles by pounding or grinding","example":"to crush quartz"},{"definition":"To overwhelm by pressure or weight.","example":"After the corruption scandal, the opposition crushed the ruling party in the elections"},{"definition":"To oppress or grievously burden."},{"definition":"To overcome completely; to subdue totally.","example":"The sultan's black guard crushed every resistance bloodily."},{"definition":"To be or become broken down or in, or pressed into a smaller compass, by external weight or force","example":"an eggshell crushes easily"},{"definition":"To feel infatuation or unrequited love.","example":"She's crushing on him."},{"definition":"To give a compressed or foreshortened appearance to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crush-us","text":"/kɹʌʃ/"},{"audio":"crush-au","text":"/kɹʌʃ/"}]},{"word":"MYSTIC","idx":12399,"count":3575548,"meanings":[{"definitions":[{"definition":"Someone who practices mysticism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to mystics, mysticism or occult mysteries; mystical.","example":"a mystic dance"},{"definition":"Mysterious and strange; arcane, obscure or enigmatic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mystic-us","text":"/ˈmɪstɪk/"}]},{"word":"SOLICITATION","idx":12400,"count":3575386,"meanings":[{"definitions":[{"definition":"The action or instance of soliciting; petition; proposal"},{"definition":"An inchoate offense that consists of a person offering money or inducing another to commit a crime with the specific intent that the person solicited commit the crime"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˌlɪsɪˈteɪʃən/"}]},{"word":"RECTANGULAR","idx":12403,"count":3574522,"meanings":[{"definitions":[{"definition":"Having a shape like a rectangle."},{"definition":"Having axes that meet each other with right angles."}],"partOfSpeech":"j"}]},{"word":"POOH","idx":12405,"count":3574313,"meanings":[{"definitions":[{"definition":"Feces."},{"definition":"A piece of feces or an act of defecation."},{"definition":"Cannabis resin."},{"definition":"Champagne.","example":"Who wants another glass of poo?"},{"definition":"Short for shampoo."},{"definition":"An instance of saying \"pooh\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To defecate."},{"definition":"To dirty something with feces."},{"definition":"To say \"pooh\"."},{"definition":"To say \"pooh\" to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Expressing annoyance, frustration, etc.: a minced oath for 'shit'."},{"definition":"Expressing dismissal, contempt, impatience, etc."},{"definition":"Expressing disgust at an unpleasant smell."}],"partOfSpeech":"i"}],"phonetics":[{"text":"/pu/"},{"text":"/phuː/"}]},{"word":"ENTHUSIAST","idx":12406,"count":3574305,"meanings":[{"definitions":[{"definition":"A person filled with or guided by enthusiasm."},{"definition":"A person exhibiting over-zealous religious fervour."}],"partOfSpeech":"n"}]},{"word":"POSITIVELY","idx":12408,"count":3573575,"meanings":[{"definitions":[{"definition":"(manner) In a positive manner.","example":"He approached the interview positively."},{"definition":"(modal) With certainty.","example":"I will positively be there at 8 a.m."},{"definition":"(degree) Very.","example":"I had a positively wonderful time."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"positively-us","text":"/ˈpɒzɪtɪvli/"}]},{"word":"STS","idx":12409,"count":3573433,"meanings":[{"definitions":[{"definition":"A title given to a saint, often prefixed to the person's name.","example":"\"Saint Stephen was the first martyr.\""},{"definition":"Someone connected with any of the sports teams known as the Saints, as a fan, player, coach etc."},{"definition":"Saint class, a class of steam locomotives used on the GWR."},{"definition":"A condition; a set of circumstances applying at any given time."},{"definition":"High social standing or circumstance."},{"definition":"A polity."},{"definition":"(stochastic processes) An element of the range of the random variables that define a random process."},{"definition":"(grammar) The lexical aspect (aktionsart) of verbs or predicates that do not change over time."},{"definition":"A single pass of a needle in sewing; the loop or turn of the thread thus made."},{"definition":"An arrangement of stitches in sewing, or method of stitching in some particular way or style.","example":"cross stitch"},{"definition":"An intense stabbing pain under the lower edge of the ribcage, brought on by exercise."},{"definition":"A single turn of the thread round a needle in knitting; a link, or loop, of yarn","example":"drop a stitch"},{"definition":"An arrangement of stitches in knitting, or method of knitting in some particular way or style."},{"definition":"A space of work taken up, or gone over, in a single pass of the needle."},{"definition":"A fastening, as of thread or wire, through the back of a book to connect the pages."},{"definition":"(by extension) Any space passed over; distance."},{"definition":"A local sharp pain; an acute pain, like the piercing of a needle.","example":"a stitch in the side"},{"definition":"A contortion, or twist."},{"definition":"Any least part of a fabric or dress.","example":"She didn't have a stitch on."},{"definition":"A furrow."},{"definition":"The space between two double furrows."},{"definition":"A hard earthen substance that can form large rocks."},{"definition":"A small piece of stone, a pebble."},{"definition":"A gemstone, a jewel, especially a diamond."},{"definition":"(plural: stone) A unit of mass equal to 14 pounds. Used to measure the weights of people, animals, cheese, wool, etc. 1 stone ≈ 6.3503 kilograms"},{"definition":"The central part of some fruits, particularly drupes; consisting of the seed and a hard endocarp layer.","example":"a peach stone"},{"definition":"A hard, stone-like deposit.","example":"kidney stone"},{"definition":"A playing piece made of any hard material, used in various board games such as backgammon, and go."},{"definition":"A dull light grey or beige, like that of some stones."},{"definition":"A 42-pound, precisely shaped piece of granite with a handle attached, which is bowled down the ice."},{"definition":"A monument to the dead; a gravestone or tombstone."},{"definition":"A mirror, or its glass."},{"definition":"A testicle of an animal."},{"definition":"A stand or table with a smooth, flat top of stone, commonly marble, on which to arrange the pages of a book, newspaper, etc. before printing; also called imposing stone."},{"definition":"A place where items may be accumulated or routinely kept.","example":"This building used to be a store for old tires."},{"definition":"A supply held in storage."},{"definition":"(mainly North American) A place where items may be purchased; a shop.","example":"I need to get some milk from the grocery store."},{"definition":"Memory.","example":"The main store of 1000 36-bit words seemed large at the time."},{"definition":"A great quantity or number; abundance."},{"definition":"A paved part of road, usually in a village or a town.","example":"Walk down the street until you see a hotel on the right."},{"definition":"A road as above but including the sidewalks (pavements) and buildings.","example":"I live on the street down from Joyce Avenue."},{"definition":"The people who live in such a road, as a neighborhood."},{"definition":"The people who spend a great deal of time on the street in urban areas, especially, the young, the poor, the unemployed, and those engaged in illegal activities."},{"definition":"An illicit or contraband source, especially of drugs.","example":"I got some pot cheap on the street."},{"definition":"Streetwise slang."},{"definition":"A great distance.","example":"He's streets ahead of his sister in all the subjects in school."},{"definition":"Each of the three opportunities that players have to bet, after the flop, turn and river."},{"definition":"Living in the streets.","example":"a street cat; a street urchin"},{"definition":"(urban toponymy) By restriction, the streets that run perpendicular to avenues."}],"partOfSpeech":"n"}]},{"word":"SHAPING","idx":12410,"count":3573290,"meanings":[{"definitions":[{"definition":"To create or make.","example":"Earth was shapen by God for God's folk."},{"definition":"To give something a shape and definition.","example":"Shape the dough into a pretzel.   For my art project, I plan to shape my clay lump into a bowl."},{"definition":"To form or manipulate something into a certain shape."},{"definition":"(of a country, person, etc) To give influence to."},{"definition":"To suit; to be adjusted or conformable."},{"definition":"To imagine; to conceive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to shape."},{"definition":"A method of positive reinforcement of behaviour patterns in operant conditioning."}],"partOfSpeech":"n"}]},{"word":"AFGHAN","idx":12412,"count":3571609,"meanings":[{"definitions":[{"definition":"A blanket or throw, usually crocheted or knitted."},{"definition":"A type of iced chocolate biscuit, sometimes containing cornflakes and topped with a walnut."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"afghan-us"},{"audio":"afghan-au"}]},{"word":"INSPIRE","idx":12413,"count":3569444,"meanings":[{"definitions":[{"definition":"To infuse into the mind; to communicate to the spirit; to convey, as by a divine or supernatural influence; to disclose preternaturally; to produce in, as by inspiration."},{"definition":"To infuse into; to affect, as with a superior or supernatural influence; to fill with what animates, enlivens or exalts; to communicate inspiration to.","example":"Elders should inspire children with sentiments of virtue."},{"definition":"To draw in by the operation of breathing; to inhale."},{"definition":"To infuse by breathing, or as if by breathing."},{"definition":"To breathe into; to fill with the breath; to animate."},{"definition":"To spread rumour indirectly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"inspire-uk","text":"/ɪn.ˈspaɪə(ɹ)/"}]},{"word":"TORN","idx":12415,"count":3569094,"meanings":[{"definitions":[{"definition":"To rend (a solid material) by holding or restraining in two places and pulling apart, whether intentionally or not; to destroy or separate.","example":"He tore his coat on the nail."},{"definition":"To injure as if by pulling apart.","example":"He has a torn ligament."},{"definition":"To destroy or reduce abstract unity or coherence, such as social, political or emotional.","example":"He was torn by conflicting emotions."},{"definition":"To make (an opening) with force or energy.","example":"A piece of debris tore a tiny straight channel through the satellite."},{"definition":"(often with off or out) To remove by tearing.","example":"Tear the coupon out of the newspaper."},{"definition":"(of structures, with down) To demolish","example":"The slums were torn down to make way for the new development."},{"definition":"To become torn, especially accidentally.","example":"My dress has torn."},{"definition":"To move or act with great speed, energy, or violence.","example":"He tore into the backlog of complaints."},{"definition":"To smash or enter something with great force.","example":"The chain shot tore into the approaching line of infantry."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"torn-us","text":"/tɔɹn/"},{"audio":"torn-uk","text":"/tɔːn/"}]},{"word":"MEANTIME","idx":12416,"count":3568612,"meanings":[{"definitions":[{"definition":"The time spent waiting for another event; time in between.","example":"I'll get started tomorrow but, in the meantime, let's see if we can get a few more opinions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"During the interval; meanwhile"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"meantime-us","text":"/ˈmiːntaɪm/"}]},{"word":"PUMPING","idx":12417,"count":3568469,"meanings":[{"definitions":[{"definition":"To use a pump to move (liquid or gas).","example":"I've pumped over 1000 gallons of water in the last ten minutes."},{"definition":"(often followed by up) To fill with air.","example":"He pumped up the air-bed by hand, but used the service station air to pump up the tyres."},{"definition":"To move rhythmically, as the motion of a pump.","example":"I pumped my fist with joy when I won the race."},{"definition":"To shake (a person's hand) vigorously."},{"definition":"To gain information from (a person) by persistent questioning."},{"definition":"To use a pump to move liquid or gas.","example":"I've been pumping for over a minute but the water isn't coming through."},{"definition":"To be going very well.","example":"Last night's party was really pumping."},{"definition":"To kick, throw or hit the ball far and high."},{"definition":"To pass gas; to fart."},{"definition":"To pass (messages) into a program so that it can obey them."},{"definition":"(British slang) To copulate."},{"definition":"To weightlift."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is pumped."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpʌmpɪŋ/"}]},{"word":"PATENTED","idx":12418,"count":3568094,"meanings":[{"definitions":[{"definition":"To successfully register an invention with a government agency; to secure a letter patent."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"For which a patent has been granted."}],"partOfSpeech":"j"}]},{"word":"REVIVAL","idx":12419,"count":3567939,"meanings":[{"definitions":[{"definition":"The act of reviving, or the state of being revived"},{"definition":"Renewed attention to something, as to letters or literature."},{"definition":"Renewed performance of, or interest in, something, such as drama or literature."},{"definition":"Renewed interest in religion, after indifference and decline; a period of religious awakening; special religious interest."},{"definition":"A Christian religious meeting held to inspire active members of a church body or to gain new converts."},{"definition":"Reanimation from a state of languor or depression; applied to health, a person's spirits, etc."},{"definition":"Renewed pursuit, or cultivation, or flourishing state of something, as of commerce, arts, agriculture."},{"definition":"Renewed prevalence of something, as a practice or a fashion.","example":"the revival of hot pants"},{"definition":"Restoration of force, validity, or effect; renewal; reinstatement of a legal action.","example":"the revival of a debt barred by limitation; the revival of a revoked will"},{"definition":"Revivification, as of a metal."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪˈvaɪvəl/"}]},{"word":"DISAPPEAR","idx":12420,"count":3567706,"meanings":[{"definitions":[{"definition":"To vanish."},{"definition":"To make vanish; especially, to abduct and murder surreptitiously for political reasons."},{"definition":"To go away; to become lost."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"disappear-us","text":"/dɪsəˈpɪɹ/"}]},{"word":"LEVER","idx":12421,"count":3566558,"meanings":[{"definitions":[{"definition":"(except in generalized senses below) A crowbar."},{"definition":"A rigid piece which is capable of turning about one point, or axis (the fulcrum), and in which are two or more other points where forces are applied; — used for transmitting and modifying force and motion."},{"definition":"A small such piece to trigger or control a mechanical device (like a button)."},{"definition":"A bar, as a capstan bar, applied to a rotatory piece to turn it."},{"definition":"An arm on a rock shaft, to give motion to the shaft or to obtain motion from it."},{"definition":"A levee."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move with a lever.","example":"With great effort and a big crowbar I managed to lever the beam off the floor."},{"definition":"To use, operate or move (something) like a lever (physically)."},{"definition":"To use (something) like a lever (in an abstract sense)."},{"definition":"To increase the share of debt in the capitalization of a business."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Rather."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"lever-us","text":"/ˈlɛ.vɚ/"},{"audio":"lever-uk","text":"/ˈliː.və/"}]},{"word":"REDUNDANT","idx":12422,"count":3566311,"meanings":[{"definitions":[{"definition":"Superfluous; exceeding what is necessary."},{"definition":"(of words, writing, etc) Repetitive or needlessly wordy."},{"definition":"Dismissed from employment because no longer needed.","example":"Four employees were made redundant."},{"definition":"Duplicating or able to duplicate the function of another component of a system, providing backup in the event the other component fails."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"redundant-au","text":"/ɹɪˈdʌn.dənt/"}]},{"word":"REGENCY","idx":12423,"count":3565737,"meanings":[{"definitions":[{"definition":"A system of government that substitutes for the reign of a king or queen when that king or queen becomes unable to rule."},{"definition":"The time during which a regent is in power."},{"definition":"An administrative division ranking below a province in Indonesia."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹiːd͡ʒənsi/"}]},{"word":"TASTY","idx":12425,"count":3565676,"meanings":[{"definitions":[{"definition":"Having a pleasant or satisfying flavor; delicious.","example":"You could make this tasty meal for breakfast."},{"definition":"Having or showing good taste; tasteful.","example":"These items will make an attractive and tasty display."},{"definition":"Appealing; when applied to persons, sexually appealing."},{"definition":"Skillful; highly competent."},{"definition":"Potentially violent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tasty-us","text":"/ˈteɪsti/"}]},{"word":"MIDLAND","idx":12427,"count":3564344,"meanings":[{"definitions":[{"definition":"The region of a country not near the borders; the interior."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Resembling or relating to the interior region of a country."}],"partOfSpeech":"j"}]},{"word":"GAG","idx":12428,"count":3563372,"meanings":[{"definitions":[{"definition":"A device to restrain speech, such as a rag in the mouth secured with tape or a rubber ball threaded onto a cord or strap."},{"definition":"An order or rule forbidding discussion of a case or subject."},{"definition":"A joke or other mischievous prank."},{"definition":"A device or trick used to create a practical effect; a gimmick"},{"definition":"A convulsion of the upper digestive tract."},{"definition":"A mouthful that makes one retch or choke."},{"definition":"Mycteroperca microlepis, a species of grouper."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To experience the vomiting reflex.","example":"He gagged when he saw the open wound."},{"definition":"To cause to heave with nausea."},{"definition":"To restrain someone's speech by blocking his or her mouth."},{"definition":"To pry or hold open by means of a gag."},{"definition":"To restrain someone's speech without using physical means.","example":"When the financial irregularities were discovered, the CEO gagged everyone in the accounting department."},{"definition":"To choke; to retch."},{"definition":"To deceive (someone); to con."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gag-uk","text":"/ɡæɡ/"}]},{"word":"SYNCHRONIZATION","idx":12429,"count":3562753,"meanings":[{"definitions":[{"definition":"The state or property of being synchronized.","example":"The generator went off line when it lost synchronization with the power line."},{"definition":"The arrangement of military actions in time, space, and purpose to produce maximum relative combat power at a decisive place and time."},{"definition":"In an intelligence context, application of intelligence sources and methods in concert with the operation plan."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"synchronization-us"}]},{"word":"INFORMATICS","idx":12431,"count":3562229,"meanings":[{"definitions":[{"definition":"A branch of information science and of computer science that focuses on the study of information processing, particularly with respect to systems integration and human interactions with machine and data."}],"partOfSpeech":"n"}]},{"word":"HECK","idx":12433,"count":3561865,"meanings":[{"definitions":[{"definition":"Hell.","example":"You can go to heck as far as I'm concerned."},{"definition":"The bolt or latch of a door."},{"definition":"A rack for cattle to feed at."},{"definition":"A door, especially one partly of latticework."},{"definition":"A latticework contrivance for catching fish."},{"definition":"An apparatus for separating the threads of warps into sets, as they are wound upon the reel from the bobbins, in a warping machine."},{"definition":"A bend or winding of a stream."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Hell.","example":"What the heck are you doing?"}],"partOfSpeech":"i"}],"phonetics":[{"text":"/hɛk/"}]},{"word":"RANTS","idx":12434,"count":3561826,"meanings":[{"definitions":[{"definition":"A criticism done by ranting."},{"definition":"A wild, emotional, and sometimes incoherent articulation."},{"definition":"A type of dance step usually performed in clogs, and particularly (but not exclusively) associated with the English North West Morris tradition. The rant step consists of alternately bringing one foot across and in front of the other and striking the ground, with the other foot making a little hop."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To speak or shout at length in uncontrollable anger."},{"definition":"To criticize by ranting."},{"definition":"To speak extravagantly, as in merriment."},{"definition":"To dance rant steps."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rants-uk","text":"/ˈɹænts/"}]},{"word":"TAROT","idx":12435,"count":3561389,"meanings":[{"definitions":[{"definition":"(singular or plural) A card game played in various different variations."},{"definition":"Any of the set of 78 playing cards (divided into five suits, including one of permanent trumps), often used for mystical divination."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtæɹəʊ/"},{"text":"/ˈtɛɹoʊ/"}]},{"word":"CIVILIANS","idx":12438,"count":3560187,"meanings":[{"definitions":[{"definition":"A person following the pursuits of civil life, especially one who is not an active member of the armed forces.","example":"Three civilians were apprehended by the soldiers and taken away in a military vehicle."},{"definition":"A person who does not belong to a particular group or engage in a particular activity.","example":"The bathroom was for employees only, so no civilians were allowed to use it."},{"definition":"One skilled in civil law."},{"definition":"A student of civil law at a university or college."}],"partOfSpeech":"n"}]},{"word":"BARK","idx":12439,"count":3559940,"meanings":[{"definitions":[{"definition":"The short, loud, explosive sound uttered by a dog, a fox, and some other animals."},{"definition":"An abrupt loud vocal utterance."},{"definition":"The exterior covering of the trunk and branches of a tree."},{"definition":"Peruvian bark or Jesuit's bark, the bark of the cinchona from which quinine is produced."},{"definition":"Hard candy made in flat sheets, for instance out of chocolate, peanut butter, toffee or peppermint."},{"definition":"The crust formed on barbecued meat that has had a rub applied to it."},{"definition":"The envelopment or outer covering of anything."},{"definition":"A small sailing vessel, e.g. a pinnace or a fishing smack; a rowing boat or barge."},{"definition":"A sailing vessel or boat of any kind."},{"definition":"A vessel, typically with three (or more) masts, with the foremasts (or fore- and mainmasts) square-rigged, and mizzenmast schooner-rigged."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a short, loud, explosive noise with the vocal organs (said of animals, especially dogs).","example":"The neighbour's dog is always barking."},{"definition":"To make a clamor; to make importunate outcries."},{"definition":"To speak sharply.","example":"The sergeant barked an order."},{"definition":"To strip the bark from; to peel."},{"definition":"To abrade or rub off any outer covering from.","example":"to bark one’s heel"},{"definition":"To girdle."},{"definition":"To cover or inclose with bark, or as with bark.","example":"bark the roof of a hut"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bark-us","text":"/bɑɹk/"},{"audio":"bark-uk","text":"/bɑːk/"}]},{"word":"CARTS","idx":12440,"count":3559795,"meanings":[{"definitions":[{"definition":"A small, open, wheeled vehicle, drawn or pushed by a person or animal, more often used for transporting goods than passengers.","example":"The grocer delivered his goods by cart."},{"definition":"A small motor vehicle resembling a car; a go-cart."},{"definition":"A shopping cart."},{"definition":"A tape cartridge used for pre-recorded material such as jingles and advertisements."},{"definition":"A cartridge for a video game system.","example":"My Final Fantasy cart on the NES is still alive and kicking."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To carry goods.","example":"I've been carting these things around all day."},{"definition":"To carry or convey in a cart."},{"definition":"To remove, especially involuntarily or for disposal."},{"definition":"To expose in a cart by way of punishment."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"carts-us","text":"/kɑɹts/"}]},{"word":"WASTED","idx":12441,"count":3559742,"meanings":[{"definitions":[{"definition":"To devastate, destroy"},{"definition":"To squander (money or resources) uselessly; to spend (time) idly.","example":"We wasted millions of dollars and several years on that project."},{"definition":"To kill; to murder."},{"definition":"To wear away by degrees; to impair gradually; to diminish by constant loss; to use up; to consume; to spend; to wear out."},{"definition":"Gradually lose weight, weaken, become frail."},{"definition":"To be diminished; to lose bulk, substance, strength, value etc. gradually."},{"definition":"To damage, impair, or injure (an estate, etc.) voluntarily, or by allowing the buildings, fences, etc., to fall into decay."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not profitably used."},{"definition":"Ravaged or deteriorated."},{"definition":"Emaciated and haggard."},{"definition":"Very drunk or stoned."},{"definition":"Low weight-for-height (for a person)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"wasted-us","text":"/ˈweɪstɪd/"}]},{"word":"COCOA","idx":12443,"count":3557169,"meanings":[{"definitions":[{"definition":"The dried and partially fermented fatty seeds of the cacao tree from which chocolate is made."},{"definition":"An unsweetened brown powder made from roasted, ground cocoa beans, used in making chocolate, and in cooking."},{"definition":"A hot drink made with milk, cocoa powder, and sugar.","example":"Do you like cocoa?"},{"definition":"A serving of this drink.","example":"I like to watch TV with a cocoa."},{"definition":"A light to medium brown colour."},{"definition":"Coconut palm."},{"definition":"Coconut, the fruit of the coconut palm."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a light to medium brown colour, like that of cocoa powder."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cocoa-1-us","text":"/ˈkoʊ.koʊ/"}]},{"word":"INVITES","idx":12444,"count":3556927,"meanings":[{"definitions":[{"definition":"To ask for the presence or participation of someone or something.","example":"We invited our friends round for dinner."},{"definition":"To request formally.","example":"I invite you all to be seated."},{"definition":"To encourage.","example":"I always invite criticism of my definitions."},{"definition":"To allure; to draw to; to tempt to come; to induce by pleasure or hope; to attract."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An invitation."}],"partOfSpeech":"n"}]},{"word":"CUSHION","idx":12445,"count":3556775,"meanings":[{"definitions":[{"definition":"A soft mass of material stuffed into a cloth bag, used for comfort or support; for sitting on, kneeling on, resting one's head on etc."},{"definition":"Something acting as a cushion, especially to absorb a shock or impact."},{"definition":"A sufficient quantity of an intangible object (like points or minutes) to allow for some of those points, for example, to be lost without hurting one's chances for successfully completing an objective."},{"definition":"A riotous dance, formerly common at weddings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To furnish with cushions.","example":"to cushion a sofa"},{"definition":"To seat or place on, or as on a cushion."},{"definition":"To absorb or deaden the impact of.","example":"to cushion a blow"},{"definition":"To conceal or cover up, as under a cushion."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cushion-us","text":"/ˈkʊʃən/"}]},{"word":"REVERSED","idx":12446,"count":3556556,"meanings":[{"definitions":[{"definition":"To turn something around so that it faces the opposite direction or runs in the opposite sequence.","example":"to reverse a portion of video footage"},{"definition":"To turn something inside out or upside down."},{"definition":"To transpose the positions of two things."},{"definition":"To change totally; to alter to the opposite."},{"definition":"To return, come back."},{"definition":"To turn away; to cause to depart."},{"definition":"To cause to return; to recall."},{"definition":"To revoke a law, or to change a decision into its opposite.","example":"to reverse a judgment, sentence, or decree"},{"definition":"To cause a mechanism or a vehicle to operate or move in the opposite direction to normal."},{"definition":"To change the direction of a reaction such that the products become the reactants and vice-versa."},{"definition":"To place a set of points in the reverse position"},{"definition":"(of points) to move from the normal position to the reverse position"},{"definition":"To overthrow; to subvert."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Turned or changed to the contrary; inside out."},{"definition":"Resupinate."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"reversed-us"}]},{"word":"LYNX","idx":12447,"count":3555424,"meanings":[{"definitions":[{"definition":"Any of several medium-sized wild cats, mostly of the genus Lynx."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lynx-us","text":"/lɪŋks/"}]},{"word":"FIGURINES","idx":12449,"count":3555042,"meanings":[{"definitions":[{"definition":"A small carved or molded figure; a statuette."}],"partOfSpeech":"n"}]},{"word":"FOOTER","idx":12450,"count":3554458,"meanings":[{"definitions":[{"definition":"A footgoer; pedestrian"},{"definition":"A line of information printed at the bottom of a page as identification of the document (compare foot, 13)."},{"definition":"(in combination) something that is a stated number of feet in some dimension - such as a six-footer."},{"definition":"(in combination) someone who has a preference for a certain foot - such as right-footer/left-footer"},{"definition":"Football / soccer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To meddle with or pass time without accomplishing anything meaningful."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"footer-au","text":"/ˈfʊtə/"}]},{"word":"MATERNAL","idx":12451,"count":3554398,"meanings":[{"definitions":[{"definition":"A mother."},{"definition":"A person related through the mother, or her side of the family; a maternal relative."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to a mother; having the characteristics of a mother; motherly.","example":"His weakness seemed to bring out her maternal instincts."},{"definition":"Related through the mother, or her side of the family.","example":"Toby is my maternal uncle."},{"definition":"Derived from the mother as opposed to the foetus during pregnancy."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"maternal-uk","text":"/məˈtɜːnəl/"}]},{"word":"SPECIMEN","idx":12452,"count":3554108,"meanings":[{"definitions":[{"definition":"An individual instance that represents a class; an example.","example":"early specimens of the art of Picasso"},{"definition":"A sample, especially one used for diagnostic analysis."},{"definition":"(often preceded with “fine”) An eligible man."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈspɛsɪmɪn/"}]},{"word":"SEAMLESS","idx":12454,"count":3553583,"meanings":[{"definitions":[{"definition":"Having no seams."},{"definition":"Without interruption; coherent","example":"a seamless transition"}],"partOfSpeech":"j"}]},{"word":"ANCESTORS","idx":12455,"count":3553506,"meanings":[{"definitions":[{"definition":"One from whom a person is descended, whether on the father's or mother's side, at any distance of time; a progenitor; a forefather."},{"definition":"An earlier type; a progenitor","example":"This fossil animal is regarded as the ancestor of the horse."},{"definition":"One from whom an estate has descended;—the correlative of heir."},{"definition":"One who had the same role or function in former times."},{"definition":"A word or phrase which serves as the origin of a term in another language."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be an ancestor of."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈæn.sɛs.tɚz/"},{"text":"/ˈæn.sɛs.təz/"}]},{"word":"PANTHER","idx":12456,"count":3552330,"meanings":[{"definitions":[{"definition":"Any of various big cats with black fur; most especially, the black-coated leopard of India."},{"definition":"Any big cat of the genus Panthera."},{"definition":"A cougar; especially the Florida panther."},{"definition":"A creature resembling a big cat with a multicolored hide, found in Ancient Greek mythology."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpænθɚ/"},{"text":"/ˈpænθə/"}]},{"word":"MIXES","idx":12457,"count":3552046,"meanings":[{"definitions":[{"definition":"To stir together.","example":"Mix the eggs and milk with the flour until the consistency is smooth."},{"definition":"To combine (items from two or more sources normally kept separate).","example":"Don't mix the meat recipes with the dairy recipes."},{"definition":"To form by mingling; to produce by the stirring together of ingredients; to concoct from different parts.","example":"Yellow and blue paint mix to make green."},{"definition":"To blend by the use of a mixer (machine).","example":"Mix the egg whites until they are stiff."},{"definition":"To combine (several tracks).","example":"I'll mix the rhythm tracks down to a single track."},{"definition":"To produce a finished version of (a recording).","example":"I'm almost done mixing this song."},{"definition":"To unite with in company; to join; to associate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The result of mixing two or more substances; a mixture.","example":"Now add the raisins to the mix."},{"definition":"The result of combining items normally kept separate.","example":"My recipe file was now a mix of meat and dairy."},{"definition":"The result of mixing several tracks.","example":"The rhythm mix sounds muddy."},{"definition":"The finished version of a recording.","example":"I've almost finished the mix for this song."}],"partOfSpeech":"n"}]},{"word":"GRAVES","idx":12458,"count":3552013,"meanings":[{"definitions":[{"definition":"An excavation in the earth as a place of burial"},{"definition":"Any place of interment; a tomb; a sepulcher."},{"definition":"(by extension) Death, destruction."},{"definition":"A written accent used in French, Italian, and other languages. è is an e with a grave accent (`)."},{"definition":"A count, prefect, or person holding office."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dig."},{"definition":"To carve or cut, as letters or figures, on some hard substance; to engrave."},{"definition":"To carve out or give shape to, by cutting with a chisel; to sculpture.","example":"to grave an image"},{"definition":"To impress deeply (on the mind); to fix indelibly."},{"definition":"To entomb; to bury."},{"definition":"To write or delineate on hard substances, by means of incised lines; to practice engraving."},{"definition":"To clean, as a vessel's bottom, of barnacles, grass, etc., and pay it over with pitch — so called because graves or greaves was formerly used for this purpose."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɹeɪvz/"}]},{"word":"BRANDING","idx":12459,"count":3551398,"meanings":[{"definitions":[{"definition":"To burn the flesh with a hot iron, either as a marker (for criminals, slaves etc.) or to cauterise a wound.","example":"When they caught him, he was branded and then locked up."},{"definition":"To mark (especially cattle) with a brand as proof of ownership.","example":"The ranch hands had to brand every new calf by lunchtime."},{"definition":"To make an indelible impression on the memory or senses.","example":"Her face is branded upon my memory."},{"definition":"To stigmatize, label (someone).","example":"He was branded a fool by everyone that heard his story."},{"definition":"To associate a product or service with a trademark or other name and related images.","example":"They branded the new detergent \"Suds-O\", with a nature scene inside a green O on the muted-colored recycled-cardboard box."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process in which a mark, usually a symbol or ornamental pattern, is burned into the skin of a living person or animal."},{"definition":"The promotion of a commercial brand of product in order to give it greater public awareness."}],"partOfSpeech":"n"}]},{"word":"GHETTO","idx":12460,"count":3550613,"meanings":[{"definitions":[{"definition":"An (often walled) area of a city in which Jews are concentrated by force and law. (Used particularly of areas in medieval Italy and in Nazi-controlled Europe.)"},{"definition":"An (often impoverished) area of a city inhabited predominantly by members of a specific nationality, ethnicity or race."},{"definition":"An area in which people who are distinguished by sharing something other than ethnicity concentrate or are concentrated."},{"definition":"(sometimes derogatory) An isolated, self-contained, segregated subsection, area or field of interest; often of minority or specialist interest."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To confine (a specified group of people) to a ghetto."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to a ghetto or to ghettos in general."},{"definition":"Unseemly and indecorous or of low quality; cheap; shabby, crude."},{"definition":"Characteristic of the style, speech, or behavior of residents of a predominantly black or other ghetto in the United States."},{"definition":"Having been raised in a ghetto in the United States."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɛtoʊ/"},{"text":"/ˈɡɛtəʊ/"},{"audio":"ghetto-au"}]},{"word":"EXAMINER","idx":12462,"count":3550006,"meanings":[{"definitions":[{"definition":"A person who investigates someone or something."},{"definition":"A person who sets an examination."},{"definition":"A person who marks an examination."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əɡˈzæmɪnɚ/"}]},{"word":"VINEYARD","idx":12463,"count":3549097,"meanings":[{"definitions":[{"definition":"A grape plantation, especially one used in the production of wine.","example":"The vineyard of Château Margaux stands as the producer of one of the world's greatest and most sought-after red wines."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vineyard-us","text":"/ˈvɪn.jɚd/"}]},{"word":"MEADOW","idx":12464,"count":3549050,"meanings":[{"definitions":[{"definition":"A field or pasture; a piece of land covered or cultivated with grass, usually intended to be mown for hay."},{"definition":"Low land covered with coarse grass or rank herbage near rivers and in marshy places by the sea.","example":"the salt meadows near Newark Bay"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"meadow-us","text":"/ˈmɛdoʊ/"}]},{"word":"PANTY","idx":12465,"count":3546636,"meanings":[{"definitions":[{"definition":"(in the plural) Short trousers for men, or more usually boys."},{"definition":"(usually in the plural, or in compounds) An article of clothing worn as underpants by women.","example":"pantyhose"},{"definition":"A helmet cover."}],"partOfSpeech":"n"}]},{"word":"FEEDER","idx":12466,"count":3545920,"meanings":[{"definitions":[{"definition":"One who feeds, or gives food to another."},{"definition":"One who feeds, or takes in food."},{"definition":"One who, or that which, feeds material into something."},{"definition":"That which is used to feed.","example":"a bird feeder"},{"definition":"A tributary stream, especially of a canal."},{"definition":"A branch line of a railway."},{"definition":"A transmission line that feeds the electricity for an electricity substation, or for a transmitter."},{"definition":"A feeder school."},{"definition":"A feeder ship."},{"definition":"A judge whose law clerks are often selected to become clerks for the Supreme Court."},{"definition":"(1800s) The pitcher."},{"definition":"A player whose character is killed by the opposing player or team more than once, deliberately or through lack of skills and experience, thus helping the opposing side."},{"definition":"One who abets another."},{"definition":"A parasite."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfidɚ/"},{"audio":"feeder-au"}]},{"word":"MERCER","idx":12467,"count":3545626,"meanings":[{"definitions":[{"definition":"A merchant dealing in fabrics and textiles, especially silks and other fine cloths."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈməːsə/"},{"text":"/ˈmɚsɚ/"}]},{"word":"GOODMAN","idx":12469,"count":3544327,"meanings":[{"definitions":[{"definition":"A familiar appellation of civility."},{"definition":"A husband; the master of a house or family."}],"partOfSpeech":"n"}]},{"word":"LISTENER","idx":12470,"count":3543996,"meanings":[{"definitions":[{"definition":"Someone who listens, especially to a speech or a broadcast."},{"definition":"(chiefly Java) A function that runs in response to an event; an event handler."},{"definition":"A person's ear."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"listener-us"},{"text":"/ˈlɪs(ə)nə/"}]},{"word":"SUBUNIT","idx":12471,"count":3543568,"meanings":[{"definitions":[{"definition":"Any subdivision of a larger unit."},{"definition":"A protein subunit."}],"partOfSpeech":"n"}]},{"word":"CHLORIDE","idx":12472,"count":3543235,"meanings":[{"definitions":[{"definition":"Any salt of hydrochloric acid, such as sodium chloride, or any binary compound of chlorine and another element or radical"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈklɔːɹaɪd/"}]},{"word":"AWAITING","idx":12473,"count":3541630,"meanings":[{"definitions":[{"definition":"To wait for.","example":"I await your reply to my letter."},{"definition":"To expect."},{"definition":"To be in store for; to be ready or in waiting for.","example":"Glorious rewards await the good in heaven; eternal suffering awaits mortal sinners in hell."},{"definition":"To serve or attend; to wait on, wait upon."},{"definition":"To watch, observe."},{"definition":"To wait; to stay in waiting."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈweɪtɪŋ/"}]},{"word":"BULLS","idx":12477,"count":3540837,"meanings":[{"definitions":[{"definition":"An adult male of domesticated cattle or oxen."},{"definition":"A male of domesticated cattle or oxen of any age."},{"definition":"Any adult male bovine."},{"definition":"An adult male of certain large mammals, such as whales, elephants, camels and seals."},{"definition":"A large, strong man."},{"definition":"An investor who buys (commodities or securities) in anticipation of a rise in prices."},{"definition":"A policeman."},{"definition":"A crown coin; its value, 5 shillings."},{"definition":"(Philadelphia) A man."},{"definition":"A man who has sex with another man's wife or girlfriend with the consent of both."},{"definition":"A drink made by pouring water into a cask that previously held liquor."},{"definition":"A papal bull, an official document or edict from the Pope."},{"definition":"A seal affixed to a document, especially a document from the Pope."},{"definition":"(16th century) A bubble."},{"definition":"The centre of a target, inside the inner and magpie."},{"definition":"A shot which hits the centre of a target."},{"definition":"The two central rings on a dartboard."},{"definition":"A hard striped peppermint-flavoured boiled sweet."},{"definition":"Thick glass set into the side of a ship to let in light."},{"definition":"A hand-cancelled postmark issued by a counter clerk at a post office, typically done on a receipt for proof of mailing."},{"definition":"The central part of a crown glass disk, with concentric ripple effect."},{"definition":"A convex glass lens which is placed in front of a lamp to concentrate the light so as to make it more conspicuous as a signal; also the lantern itself."},{"definition":"A £50 banknote."},{"definition":"Any of the first postage stamps produced in Brazil from 1843."},{"definition":"The faeces of a bull."},{"definition":"False or exaggerated statements made to impress and deceive the listener rather than inform; nonsense.","example":"Don't pay any attention to him. He talks a lot of bullshit."},{"definition":"A card game in which the object is to bluff about cards laid down and to determine when one's opponents are bluffing.","example":"Anyone want to play a few hands of bullshit?"},{"definition":"An object of frustration and/or disgust, often caused by a perceived deception.","example":"That's total bullshit! I called your office and they said you never came in!"},{"definition":"Statements that may be true but misleading nonetheless."},{"definition":"Statements made without any particular reference to their truth value."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bʊlz/"}]},{"word":"COMMERCIALS","idx":12479,"count":3538093,"meanings":[{"definitions":[{"definition":"An advertisement in a common media format, usually radio or television."},{"definition":"A commercial trader, as opposed to an individual speculator."}],"partOfSpeech":"n"}]},{"word":"COUNCILLOR","idx":12480,"count":3537961,"meanings":[{"definitions":[{"definition":"A member of a council."},{"definition":"In particular, a representative elected to a local authority, such as a city council: a city councillor"}],"partOfSpeech":"n"}]},{"word":"REGULATORS","idx":12481,"count":3537214,"meanings":[{"definitions":[{"definition":"A device that controls or limits something.","example":"The voltage regulator stopped working and the resulting overload destroyed the device."},{"definition":"A person or group that sets standards of practice, especially those established by law."},{"definition":"A very accurate clock, used by clockmakers to measure the timekeeping of each newly made clock."},{"definition":"A gene involved in controlling the expression of one or more other genes."},{"definition":"A device that controls the supply of steam to the cylinders of a steam locomotive."},{"definition":"A bulldozer (member of intimidating group of white US Southerners)."}],"partOfSpeech":"n"}]},{"word":"HURRY","idx":12482,"count":3536968,"meanings":[{"definitions":[{"definition":"Rushed action.","example":"Why are you in such a big hurry?"},{"definition":"Urgency.","example":"There is no hurry on that paperwork."},{"definition":"An incidence of a defensive player forcing the quarterback to act faster than the quarterback was prepared to, resulting in a failed offensive play."},{"definition":"A tremolando passage for violins, etc., accompanying an exciting situation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To do things quickly.","example":"He's hurrying because he's late."},{"definition":"Often with up, to speed up the rate of doing something.","example":"If you don't hurry (up) you won't finish on time."},{"definition":"To cause to be done quickly."},{"definition":"To hasten; to impel to greater speed; to urge on."},{"definition":"To impel to precipitate or thoughtless action; to urge to confused or irregular activity."},{"definition":"To put: to convey coal in the mine, e.g. from the working to the tramway."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hurry-us","text":"/ˈhʌ.ɹi/"},{"audio":"hurry-uk","text":"/ˈhʌ.ɹi/"}]},{"word":"INFLUENTIAL","idx":12483,"count":3536369,"meanings":[{"definitions":[{"definition":"A person who has influence"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having or exerting influence.","example":"Jane was very influential in getting the motion passed."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnfluˈɛnʃəl/"}]},{"word":"BENEFICIARY","idx":12487,"count":3534626,"meanings":[{"definitions":[{"definition":"One who benefits or receives an advantage.","example":"You are the lucky beneficiary of this special offer."},{"definition":"One who benefits from the distribution, especially of an estate.","example":"If any beneficiary does not survive the Settlor for a period of 30 days then the Trustee shall distribute that beneficiary’s share to the surviving beneficiaries by right of representation."},{"definition":"One who benefits from the payout of an insurance policy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Holding some office or valuable possession, in subordination to another; holding under a feudal or other superior; having a dependent and secondary possession."},{"definition":"Bestowed as a gratuity.","example":"beneficiary gifts"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/bɛn.əˈfɪʃ.iˌɚ.i/"},{"text":"/ˌbɛn.əˈfɪʃ.əɹ.i/"},{"audio":"beneficiary-au"}]},{"word":"BENCHMARKS","idx":12488,"count":3533985,"meanings":[{"definitions":[{"definition":"A standard by which something is evaluated or measured."},{"definition":"A surveyor's mark made on some stationary object and shown on a map; used as a reference point."},{"definition":"A computer program that is executed to assess the performance of the runtime environment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To measure the performance or quality of (an item) relative to another similar item in an impartial scientific manner."}],"partOfSpeech":"ve"}]},{"word":"OFFSPRING","idx":12491,"count":3533336,"meanings":[{"definitions":[{"definition":"A person's daughter(s) and/or son(s); a person's children."},{"definition":"All of a person's descendants, including further generations."},{"definition":"An animal or plant's progeny or young."},{"definition":"Anything produced; the result of an entity's efforts.","example":"Artists often treasure their works as their immortal offspring."},{"definition":"A process launched by another process."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"offspring-uk","text":"/ˈɒfspɹɪŋ/"}]},{"word":"PANORAMA","idx":12493,"count":3532463,"meanings":[{"definitions":[{"definition":"An unbroken view of an entire surrounding area."},{"definition":"A picture or series of pictures representing a continuous scene."},{"definition":"A comprehensive survey."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌpæ.nəˈɹæ.mə/"}]},{"word":"RETRIEVING","idx":12494,"count":3532453,"meanings":[{"definitions":[{"definition":"To regain or get back something.","example":"to retrieve one's character or independence; to retrieve a thrown ball"},{"definition":"To rescue (a creature)."},{"definition":"To salvage something"},{"definition":"To remedy or rectify something."},{"definition":"To remember or recall something."},{"definition":"To fetch or carry back something."},{"definition":"To fetch and bring in game.","example":"The cook doesn't care what's shot, only what's actually retrieved."},{"definition":"To fetch and bring in game systematically.","example":"Dog breeds called 'retrievers' were selected for retrieving."},{"definition":"To fetch or carry back systematically, notably as a game.","example":"Most dogs love retrieving, regardless of what object is thrown."},{"definition":"To make a difficult but successful return of the ball."},{"definition":"To remedy the evil consequence of, to repair (a loss or damage)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of retrieval."}],"partOfSpeech":"n"}]},{"word":"ODOR","idx":12496,"count":3532168,"meanings":[{"definitions":[{"definition":"Any smell, whether fragrant or offensive."},{"definition":"A strong, pervasive quality."},{"definition":"Esteem."},{"definition":"Something which produces a scent; incense, a perfume."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"odor-us","text":"/ˈoʊ.dɚ/"}]},{"word":"DEMANDED","idx":12497,"count":3531986,"meanings":[{"definitions":[{"definition":"To request forcefully.","example":"I demand to see the manager."},{"definition":"To claim a right to something.","example":"The bank is demanding the mortgage payment."},{"definition":"To ask forcefully for information.","example":"I demand an immediate explanation."},{"definition":"To require of someone.","example":"This job demands a lot of patience."},{"definition":"To issue a summons to court."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"demanded-us","text":"/dɪˈmændɪd/"}]},{"word":"REACTOR","idx":12498,"count":3531860,"meanings":[{"definitions":[{"definition":"A person who responds to a suggestion, stimulation or other influence."},{"definition":"(industrial) A structure used to contain chemical or other reactions."},{"definition":"A device which uses atomic energy to produce heat."},{"definition":"A chemical substance which responds to the presence or contact with another substance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"reactor-uk","text":"/ɹiːˈæktə/"}]},{"word":"WASTES","idx":12500,"count":3531476,"meanings":[{"definitions":[{"definition":"Excess of material, useless by-products or damaged, unsaleable products; garbage; rubbish."},{"definition":"Excrement or urine.","example":"The cage was littered with animal waste"},{"definition":"A waste land; an uninhabited desolate region; a wilderness or desert."},{"definition":"A place that has been laid waste or destroyed."},{"definition":"A large tract of uncultivated land."},{"definition":"The part of the land of a manor (of whatever size) not used for cultivation or grazing, nowadays treated as common land."},{"definition":"A vast expanse of water."},{"definition":"A disused mine or part of one."},{"definition":"The action or progress of wasting; extravagant consumption or ineffectual use.","example":"Her life seemed a waste"},{"definition":"Large abundance of something, specifically without it being used."},{"definition":"Gradual loss or decay."},{"definition":"A decaying of the body by disease; wasting away."},{"definition":"Destruction or devastation caused by war or natural disasters; See \"to lay waste\""},{"definition":"A cause of action which may be brought by the owner of a future interest in property against the current owner of that property to prevent the current owner from degrading the value or character of the property, either intentionally or through neglect."},{"definition":"Material derived by mechanical and chemical erosion from the land, carried by streams to the sea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To devastate, destroy"},{"definition":"To squander (money or resources) uselessly; to spend (time) idly.","example":"We wasted millions of dollars and several years on that project."},{"definition":"To kill; to murder."},{"definition":"To wear away by degrees; to impair gradually; to diminish by constant loss; to use up; to consume; to spend; to wear out."},{"definition":"Gradually lose weight, weaken, become frail."},{"definition":"To be diminished; to lose bulk, substance, strength, value etc. gradually."},{"definition":"To damage, impair, or injure (an estate, etc.) voluntarily, or by allowing the buildings, fences, etc., to fall into decay."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/weɪsts/"}]},{"word":"TELNET","idx":12501,"count":3531383,"meanings":[{"definitions":[{"definition":"A network protocol that enables one computer to communicate with another via the Internet; the program that acts as the client in this situation"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use such a program to make such a connection"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"telnet-uk"}]},{"word":"CLASH","idx":12502,"count":3531117,"meanings":[{"definitions":[{"definition":"A loud sound, like the crashing together of metal objects.","example":"I heard a clash from the kitchen, and rushed in to find the cat had knocked over some pots and pans."},{"definition":"A skirmish, a hostile encounter."},{"definition":"A match; a game between two sides."},{"definition":"An angry argument"},{"definition":"Opposition; contradiction; such as between differing or contending interests, views, purposes etc.","example":"a clash of beliefs"},{"definition":"A combination of garments that do not look good together, especially because of conflicting colours.","example":"She was wearing a horrible clash of red and orange."},{"definition":"An instance of restarting the game after a \"dead ball\", where it is dropped between two opposing players, who can fight for possession."},{"definition":"Chatter; gossip; idle talk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a clashing sound.","example":"The cymbals clashed."},{"definition":"To cause to make a clashing sound."},{"definition":"To come into violent conflict.","example":"Fans from opposing teams clashed on the streets after the game."},{"definition":"To argue angrily."},{"definition":"(in games or sports) To face each other in an important game."},{"definition":"(of clothes, decor, colours) To fail to look good together; to contrast unattractively; to fail to harmonize.","example":"The hotel room was ugly, and the wallpaper clashed with the carpet."},{"definition":"(of events) To coincide, to happen at the same time, thereby rendering it impossible to attend all.","example":"I can't come to your wedding because it clashes with a friend's funeral."},{"definition":"To chatter or gossip."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"clash-us","text":"/klæʃ/"}]},{"word":"BIKER","idx":12503,"count":3530897,"meanings":[{"definitions":[{"definition":"A person whose lifestyle is centered on motorcycles, sometimes a member of a motorcycle club."},{"definition":"Cyclist"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbaɪkɚ/"}]},{"word":"FIDELITY","idx":12504,"count":3530896,"meanings":[{"definitions":[{"definition":"Faithfulness to one's duties.","example":"the fidelity of the civil servants"},{"definition":"Loyalty to one's spouse or partner, including abstention from extramarital affairs."},{"definition":"Accuracy, or exact correspondence to some given quality or fact."},{"definition":"The degree to which a system accurately reproduces an input."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/faɪˈdɛl.ɪ.ti/"}]},{"word":"PARKED","idx":12505,"count":3530425,"meanings":[{"definitions":[{"definition":"To bring (something such as a vehicle) to a halt or store in a specified place.","example":"I parked the drive heads of my hard disk before travelling with my laptop."},{"definition":"To defer (a matter) until a later date.","example":"Let's park that until next week's meeting."},{"definition":"To bring together in a park, or compact body.","example":"to park artillery, wagons, automobiles, etc."},{"definition":"To enclose in a park, or as in a park."},{"definition":"To hit a home run, to hit the ball out of the park.","example":"He really parked that one."},{"definition":"To engage in romantic or sexual activities inside a nonmoving vehicle.","example":"They stopped at a romantic overlook, shut off the engine, and parked."},{"definition":"(sometimes reflexive) To sit, recline, or put, especially in a manner suggesting an intent to remain for some time.","example":"He came in and parked himself in our living room."},{"definition":"To invest money temporarily in an investment instrument considered to relatively free of risk, especially while awaiting other opportunities.","example":"We decided to park our money in a safe, stable, low-yield bond fund until market conditions improve."},{"definition":"To register a domain name, but make no use of it (See domain parking)"},{"definition":"(oyster culture) To enclose in a park, or partially enclosed basin."},{"definition":"To promenade or drive in a park."},{"definition":"(of horses) To display style or gait on a park drive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Left somewhere when not in use.","example":"a row of parked cars"}],"partOfSpeech":"j"}]},{"word":"SIS","idx":12506,"count":3530367,"meanings":[{"definitions":[{"definition":"A daughter of the same parents as another person; a female sibling.","example":"My sister is always driving me crazy."},{"definition":"A female member of a religious order; especially one devoted to more active service; (informally) a nun.","example":"Michelle left behind her bank job and became a sister at the local convent."},{"definition":"Any butterfly in the genus Adelpha, so named for the resemblance of the dark-colored wings to the black habit traditionally worn by nuns."},{"definition":"A senior or supervisory nurse, often in a hospital."},{"definition":"Any woman or girl with whom a bond is felt through common membership of a race, profession, religion or organization, such as feminism.","example":"Connie was very close to her friend Judy and considered her to be her sister."},{"definition":"(sometimes capitalized) A black woman."},{"definition":"A form of address to a woman.","example":"What’s up, sister?"},{"definition":"A woman, in certain labour or socialist circles; also as a form of address.","example":"Thank you, sister. I would like to thank the sister who just spoke."},{"definition":"An entity that has a special or affectionate, non-hierarchical relationship with another.","example":"sister city"},{"definition":"A node in a data structure that shares its parent with another node."},{"definition":"(usually attributively) Something in the same class.","example":"sister facility"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɪs/"}]},{"word":"FINANCIALS","idx":12507,"count":3530231,"meanings":[{"definitions":[{"definition":"Financial statements."},{"definition":"Financial institutions, as a group, such as banks and insurance companies.","example":"Financials generally pay high dividends."}],"partOfSpeech":"n"}]},{"word":"FLEW","idx":12509,"count":3529715,"meanings":[{"definitions":[{"definition":"(chiefly plural) The thick, dangling upper lip of certain breeds of dog, or the canine equivalent of the upper lip.","example":"The raging hound's flews were twisted upwards in an angry snarl."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel through the air, another gas or a vacuum, without being in contact with a grounded surface.","example":"Birds of passage fly to warmer regions as it gets colder in winter."},{"definition":"To flee, to escape (from).","example":"Fly, my lord! The enemy are upon us!"},{"definition":"To cause to fly (travel or float in the air): to transport via air or the like.","example":"Birds fly their prey to their nest to feed it to their young."},{"definition":"(of a proposal, project or idea) To be accepted, come about or work out.","example":"Let's see if that idea flies."},{"definition":"To travel very fast, hasten."},{"definition":"To move suddenly, or with violence; to do an act suddenly or swiftly.","example":"a door flies open;  a bomb flies apart"},{"definition":"To display (a flag) on a flagpole."},{"definition":"To hunt with a hawk."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Shallow; flat"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"flew-us","text":"/fluː/"}]},{"word":"PEANUT","idx":12510,"count":3529318,"meanings":[{"definitions":[{"definition":"A legume resembling a nut, the fruit of the plant Arachis hypogaea."},{"definition":"A very small clam."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pull on somebody's tie as a prank, causing the knot to tighten."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"peanut-us","text":"/ˈpinət/"}]},{"word":"ALE","idx":12512,"count":3528963,"meanings":[{"definitions":[{"definition":"A beer made without hops."},{"definition":"A beer produced by so-called warm fermentation and not pressurized."},{"definition":"A festival in English country places, so called from the liquor drunk."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ale-us","text":"/eɪl/"}]},{"word":"SEM","idx":12513,"count":3528520,"meanings":[{"definitions":[{"definition":"Half of a school year or academic year such as fall or spring semester."},{"definition":"A period or term of six months."},{"definition":"The punctuation mark ;."},{"definition":"A theological school for the training of rabbis, priests, or ministers."},{"definition":"A private residential school for girls."},{"definition":"A class of religious education for youths ages 14–18 that accompanies normal secular education."},{"definition":"A piece of ground where seed is sown for producing plants for transplantation."},{"definition":"(by extension) The place or original stock from which anything is brought or produced."},{"definition":"Seminal state or polity."},{"definition":"A Roman Catholic priest educated in a foreign seminary; a seminarist."},{"definition":"An academic seminar."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɛm/"}]},{"word":"CONVERTERS","idx":12514,"count":3528203,"meanings":[{"definitions":[{"definition":"A person or thing that converts."},{"definition":"A patient with a certain condition that subsequently develops into another condition."},{"definition":"A retort, used in the Bessemer process, in which molten cast iron is decarburized and converted into steel by a blast of air forced through the liquid metal."}],"partOfSpeech":"n"}]},{"word":"RHAPSODY","idx":12516,"count":3527039,"meanings":[{"definitions":[{"definition":"An ancient Greek epic poem (or part of one) suitable for uninterrupted recitation."},{"definition":"A random collection or medley; a miscellany or confused string of stories, words etc."},{"definition":"An exalted or exaggeratedly enthusiastic expression of feeling in speech or writing."},{"definition":"An instrumental composition of irregular form often incorporating improvisation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹapsədi/"}]},{"word":"TRUMPET","idx":12517,"count":3526876,"meanings":[{"definitions":[{"definition":"A musical instrument of the brass family, generally tuned to the key of B-flat; by extension, any type of lip-vibrated aerophone, most often valveless and not chromatic.","example":"The royal herald sounded a trumpet to announce their arrival."},{"definition":"Someone who plays the trumpet; a trumpeter.","example":"The trumpets were assigned to stand at the rear of the orchestra pit."},{"definition":"The cry of an elephant, or any similar loud cry.","example":"The large bull gave a basso trumpet as he charged the hunters."},{"definition":"One who praises, or propagates praise, or is the instrument of propagating it."},{"definition":"A funnel, or short flaring pipe, used as a guide or conductor, as for yarn in a knitting machine."},{"definition":"A kind of traffic interchange involving at least one loop ramp connecting traffic either entering or leaving the terminating expressway with the far lanes of the continuous highway."},{"definition":"A powerful reed stop in organs, having a trumpet-like sound."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sound loudly, be amplified","example":"The music trumpeted from the speakers, hurting my ears."},{"definition":"To play the trumpet.","example":"Cedric made a living trumpeting for the change of passersby in the subway."},{"definition":"Of an elephant, to make its cry.","example":"The circus trainer cracked the whip, signaling the elephant to trumpet."},{"definition":"To give a loud cry like that of an elephant."},{"definition":"To proclaim loudly; to promote enthusiastically","example":"Andy trumpeted Jane's secret across the school, much to her embarrassment."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"trumpet-us","text":"/ˈtɹʌmpɪt/"}]},{"word":"SOLITAIRE","idx":12518,"count":3526423,"meanings":[{"definitions":[{"definition":"A person who lives alone; a recluse or hermit."},{"definition":"A game for one person, played on a board with pegs or balls, in which the object is, beginning with all the places filled except one, to remove all but one of the pieces by \"jumping\", as in draughts."},{"definition":"Any of various card games that can be played by one person. Called patience in the rest of the world."},{"definition":"An extinct bird related to the dodo, Pezophaps solitaria, Rodrigues solitaire, that lived on the island of Rodrigues."},{"definition":"An extinct bird formerly believed to be related to the dodo, more precisely Réunion solitaire, Raphus solitarius, now preferably Réunion ibis, Threskiornis solitarius."},{"definition":"One of several American species of bird in the genus Myadestes in the thrush family."},{"definition":"A single gem, usually a diamond, mounted in a piece of jewellery by itself."},{"definition":"A black neck ribbon worn with a bag wig in the 18th century."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Living or being alone; solitary"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɒlɪˌtɛəɹ/"}]},{"word":"DECREASING","idx":12519,"count":3525931,"meanings":[{"definitions":[{"definition":"Of a quantity, to become smaller."},{"definition":"To make (a quantity) smaller."}],"partOfSpeech":"ve"}]},{"word":"FREEZING","idx":12520,"count":3525702,"meanings":[{"definitions":[{"definition":"Especially of a liquid, to become solid due to low temperature.","example":"The lake froze solid."},{"definition":"To lower something's temperature to the point that it freezes or becomes hard.","example":"Don't freeze meat twice."},{"definition":"To drop to a temperature below zero degrees celsius, where water turns to ice.","example":"It didn't freeze this winter, but last winter was very harsh."},{"definition":"To be affected by extreme cold.","example":"Don't go outside wearing just a t-shirt; you'll freeze!"},{"definition":"(of machines and software) To come to a sudden halt, stop working (functioning).","example":"Since the last update, the program freezes / freezes up after a few minutes of use."},{"definition":"(of people and other animals) To stop (become motionless) or be stopped due to attentiveness, fear, surprise, etc.","example":"Despite all of the rehearsals, I froze up as soon as I got on stage."},{"definition":"To cause someone to become motionless."},{"definition":"To lose or cause to lose warmth of feeling; to shut out; to ostracize.","example":"Over time, he froze towards her, and ceased to react to her friendly advances."},{"definition":"To cause loss of animation or life in, from lack of heat; to give the sensation of cold to; to chill."},{"definition":"To prevent the movement or liquidation of a person's financial assets","example":"The court froze the criminal's bank account."},{"definition":"Of prices, spending etc., to keep at the same level, without any increase."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The change in state of a substance from liquid to solid by cooling to a critically low temperature."},{"definition":"The action of numbing with anesthetics."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Suffering or causing frost"},{"definition":"(by extension) Very cold"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɹiːz.ɪŋ/"}]},{"word":"KAISER","idx":12521,"count":3525640,"meanings":[{"definitions":[{"definition":"An emperor of a German-speaking country, particularly the Holy Roman Empire (962–1806), the Austrian Empire (1806–1918), or the German Empire (1871–1918) — often specifically Wilhelm II — or any emperor."},{"definition":"A Kaiser roll."},{"definition":"A person who exercises or tries to exercise absolute authority; autocrat."}],"partOfSpeech":"n"}]},{"word":"DISHWASHER","idx":12522,"count":3525376,"meanings":[{"definitions":[{"definition":"A machine for washing dishes."},{"definition":"Someone who washes dishes, especially one hired to wash dishes in a restaurant."},{"definition":"A European bird, the wagtail."},{"definition":"A bird, the restless flycatcher (Myiagra inquieta)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dishwasher-us","text":"/ˈdɪʃˌwɑʃɚ/"}]},{"word":"CRIMINALS","idx":12525,"count":3522903,"meanings":[{"definitions":[{"definition":"A person who is guilty of a crime, notably breaking the law."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹɪmɪnəlz/"}]},{"word":"NEURONS","idx":12526,"count":3522853,"meanings":[{"definitions":[{"definition":"A cell of the nervous system, which conducts nerve impulses; consisting of an axon and several dendrites. Neurons are connected by synapses."},{"definition":"A nervure of an insect's wing."},{"definition":"An artificial neuron (mathematical function serving as an essential unit of an artificial neural network)"}],"partOfSpeech":"n"}]},{"word":"IOS","idx":12527,"count":3522845,"meanings":[{"definitions":[{"definition":"A type of moth, the io moth."}],"partOfSpeech":"n"}]},{"word":"RETIRE","idx":12528,"count":3522241,"meanings":[{"definitions":[{"definition":"The act of retiring, or the state of being retired."},{"definition":"A place to which one retires."},{"definition":"A call sounded on a bugle, announcing to skirmishers that they are to retire, or fall back.","example":"At the retire, the cavalry fell back."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stop working on a permanent basis, usually because of old age or illness.","example":"Having made a large fortune, he retired."},{"definition":"(sometimes reflexive) To withdraw; to take away."},{"definition":"To cease use or production of something.","example":"The steamship made thousands of trips over several decades before it was retired by the shipping company."},{"definition":"To withdraw from circulation, or from the market; to take up and pay.","example":"The central bank retired those notes five years ago."},{"definition":"To cause to retire; specifically, to designate as no longer qualified for active service; to place on the retired list.","example":"The board retired the old major."},{"definition":"(of a batsman) To voluntarily stop batting before being dismissed so that the next batsman can bat.","example":"Jones retired in favour of Smith."},{"definition":"(of a fielder) To make a play which results in a runner or the batter being out, either by means of a put out, fly out or strikeout.","example":"Jones retired Smith 6-3."},{"definition":"To go back or return; to withdraw or retreat, especially from public view; to go into privacy.","example":"I will retire to the study."},{"definition":"To retreat from action or danger; to withdraw for safety or pleasure.","example":"The regiment retired from the fray after the Major was killed."},{"definition":"To recede; to fall or bend back.","example":"Past the point, the shore retires into a sequence of coves."},{"definition":"To go to bed.","example":"I will retire for the night."},{"definition":"To remove or cease to use.","example":"When a hurricane becomes so deadly or destructive that future use would be insensitive, officials may retire the name of the hurricane."},{"definition":"To fit (a vehicle) with new tires."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹəˈtaɪɹ/"},{"text":"/ɹəˈtaɪə(ɹ)/"},{"audio":"retire-1-au"}]},{"word":"RUMORS","idx":12529,"count":3522170,"meanings":[{"definitions":[{"definition":"A statement or claim of questionable accuracy, from no known reliable source, usually spread by word of mouth.","example":"There's a rumor going round that he's going to get married."},{"definition":"Information or misinformation of the kind contained in such claims.","example":"They say he used to be a thief, but that's just rumor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually used in the passive voice) To tell a rumor about; to gossip.","example":"John is rumored to be next in line for a promotion."}],"partOfSpeech":"ve"}]},{"word":"ACCOMPLISHMENTS","idx":12530,"count":3521534,"meanings":[{"definitions":[{"definition":"The act of accomplishing; completion; fulfilment.","example":"the accomplishment of an enterprise, of a prophecy, etc"},{"definition":"That which completes, perfects, or equips thoroughly; acquirement; attainment; that which constitutes excellence of mind, or elegance of manners, acquired by education or training."},{"definition":"Something accomplished; an achievement."},{"definition":"(grammar) The lexical aspect (aktionsart) of verbs or predicates that change over time until a natural end point."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"accomplishments-us","text":"/ə.ˈkɑm.plɪʃ.mənts/"}]},{"word":"EMERGENCE","idx":12531,"count":3521074,"meanings":[{"definitions":[{"definition":"The act of rising out of a fluid, or coming forth from envelopment or concealment, or of rising into view; sudden uprising or appearance."},{"definition":"In particular: the arising of emergent structure in complex systems."},{"definition":"An emergency."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪˈmɜːdʒ(ə)ns/"}]},{"word":"FEMINIST","idx":12532,"count":3519958,"meanings":[{"definitions":[{"definition":"An advocate of feminism; a person who believes in bringing about the equality of the sexes (of women and men) in all aspects of public and private life"},{"definition":"A member of a feminist political movement"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to or in accordance with feminism."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɛmənɪst/"}]},{"word":"THEATRES","idx":12533,"count":3518346,"meanings":[{"definitions":[{"definition":"A place or building, consisting of a stage and seating, in which an audience gathers to watch plays, musical performances, public ceremonies, and so on."},{"definition":"A region where a particular action takes place; a specific field of action, usually with reference to war.","example":"His grandfather was in the Pacific theater during the war."},{"definition":"A lecture theatre."},{"definition":"An operating theatre or locale for human experimentation.","example":"This man is about to die, get him into theater at once!"},{"definition":"A cinema.","example":"We sat in the back row of the theater and threw popcorn at the screen."},{"definition":"Drama or performance as a profession or art form.","example":"I worked in theater for twenty-five years."},{"definition":"Any place rising by steps like the seats of a theater."}],"partOfSpeech":"n"}]},{"word":"APEX","idx":12534,"count":3518314,"meanings":[{"definitions":[{"definition":"Conical priest cap"},{"definition":"The highest or the greatest point of something.","example":"the apex of the building"},{"definition":"The moment of greatest success, expansion, etc.","example":"the apex of civilization"},{"definition":"The topmost vertex of a cone or pyramid (in their conventional orientation)."},{"definition":"The \"pointed\" fine end of something."},{"definition":"The end of a leaf, petal or similar organ opposed to the end where it is attached to its support; the tip."},{"definition":"The point on the celestial sphere toward which the sun appears to move relative to nearby stars."},{"definition":"The lowest point on a pendant drop of a liquid."},{"definition":"The end or edge of a vein nearest the surface."},{"definition":"A diacritic in Classical Latin that resembles and gave rise to the acute."},{"definition":"A diacritic in Middle Vietnamese that indicates /ŋ͡m/."},{"definition":"A sharp upward point formed by two strokes that meet at an acute angle, as in \"W\", uppercase \"A\", and closed-top \"4\", or by a tapered stroke, as in lowercase \"t\"."},{"definition":"The top of the food chain"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈeɪˌpɛks/"}]},{"word":"CRIMSON","idx":12535,"count":3518175,"meanings":[{"definitions":[{"definition":"A deep, slightly bluish red."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become crimson or deep red; to blush."},{"definition":"To dye with crimson or deep red; to redden."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a deep red colour."},{"definition":"Immodest."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹɪmsən/"},{"text":"/ˈkɹɪmzən/"}]},{"word":"COMPASSION","idx":12536,"count":3517842,"meanings":[{"definitions":[{"definition":"Deep awareness of the suffering of another, coupled with the wish to relieve it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pity."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"compassion-us","text":"/kəmˈpæʃ.ən/"}]},{"word":"NEEDING","idx":12538,"count":3515408,"meanings":[{"definitions":[{"definition":"To have an absolute requirement for.","example":"Living things need water to survive."},{"definition":"To want strongly; to feel that one must have something.","example":"After ten days of hiking, I needed a shower and a shave."},{"definition":"(modal verb) To be obliged or required (to do something).","example":"You need not go if you don't want to."},{"definition":"To be required; to be necessary."},{"definition":"To be necessary (to someone)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A need."}],"partOfSpeech":"n"}]},{"word":"TWENTIETH","idx":12539,"count":3514981,"meanings":[{"definitions":[{"definition":"A person or thing in the twentieth position."},{"definition":"One of twenty equal parts of a whole."}],"partOfSpeech":"n"},{"definitions":[{"definition":"The ordinal form of the number twenty."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"twentieth-us","text":"/ˈtwɛni.əθ/"}]},{"word":"ECOSYSTEMS","idx":12541,"count":3514000,"meanings":[{"definitions":[{"definition":"A system formed by an ecological community and its environment that functions as a unit."},{"definition":"The interconnectedness of organisms (plants, animals, microbes) with each other and their environment."},{"definition":"A set of interconnected products and services."}],"partOfSpeech":"n"}]},{"word":"PRONOUNCED","idx":12542,"count":3513365,"meanings":[{"definitions":[{"definition":"To declare formally, officially or ceremoniously.","example":"I hereby pronounce you man and wife."},{"definition":"To declare authoritatively, or as a formal expert opinion.","example":"The doctor pronounced them legally dead."},{"definition":"To pass judgment.","example":"The judge had pronounced often before, but never in front of such a crowd."},{"definition":"To sound out (a word or phrase); to articulate."},{"definition":"To produce the components of speech.","example":"Actors must be able to pronounce perfectly or deliberately disabled."},{"definition":"To read aloud."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Uttered, articulated."},{"definition":"Strongly marked."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pronounced-us","text":"/pɹəˈnaʊnst/"}]},{"word":"EXTENSIVELY","idx":12543,"count":3513040,"meanings":[{"definitions":[{"definition":"In an extensive manner, widely.","example":"He has read and traveled extensively."},{"definition":"To a great extent.","example":"He became more extensively involved than he intended."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"extensively-us"}]},{"word":"STAIN","idx":12544,"count":3512824,"meanings":[{"definitions":[{"definition":"A discoloured spot or area."},{"definition":"A blemish on one's character or reputation."},{"definition":"A substance used to soak into a surface and colour it."},{"definition":"A reagent or dye used to stain microscope specimens so as to make some structures visible."},{"definition":"Any of a number of non-standard tinctures used in modern heraldry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To discolour.","example":"armour stained with blood"},{"definition":"To taint or tarnish someone's character or reputation"},{"definition":"To coat a surface with a stain","example":"the stained glass used for church windows"},{"definition":"To become stained; to take a stain."},{"definition":"To treat (a microscopic specimen) with a dye, especially one that dyes specific features"},{"definition":"To cause to seem inferior or soiled by comparison."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stain-uk","text":"/steɪn/"}]},{"word":"WISHED","idx":12546,"count":3512525,"meanings":[{"definitions":[{"definition":"To desire; to want.","example":"I'll come tomorrow, if you wish it."},{"definition":"To hope (+ object clause with may or in present subjunctive)."},{"definition":"(followed by for) To hope (for a particular outcome)."},{"definition":"(ditransitive) To bestow (a thought or gesture) towards (someone or something).","example":"We wish you a Merry Christmas."},{"definition":"(followed by to and an infinitive) To request or desire to do an activity."},{"definition":"To recommend; to seek confidence or favour on behalf of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wished-us","text":"/wɪʃt/"}]},{"word":"TRANSIENT","idx":12547,"count":3512340,"meanings":[{"definitions":[{"definition":"Something which is transient."},{"definition":"A transient phenomenon, especially an electric current; a very brief surge."},{"definition":"(acoustics) A relatively loud, non-repeating signal in an audio waveform which occurs very quickly, such as the attack of a snare drum."},{"definition":"A person who passes through a place for a short time; a traveller; a migrant worker"},{"definition":"A homeless person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Passing or disappearing with time; transitory.","example":"a transient pleasure"},{"definition":"Remaining for only a brief time.","example":"a transient disease"},{"definition":"Decaying with time, especially exponentially."},{"definition":"(stochastic processes, of a state) having a positive probability of being left and never being visited again."},{"definition":"Occasional; isolated; one-off"},{"definition":"Passing through; passing from one person to another."},{"definition":"Intermediate."},{"definition":"Operating beyond itself; having an external effect."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"transient-us"}]},{"word":"KICKED","idx":12548,"count":3510100,"meanings":[{"definitions":[{"definition":"To strike or hit with the foot or other extremity of the leg.","example":"Did you kick your brother?"},{"definition":"To make a sharp jerking movement of the leg, as to strike something.","example":"He enjoyed the simple pleasure of watching the kickline kick."},{"definition":"To direct to a particular place by a blow with the foot or leg.","example":"Kick the ball into the goal."},{"definition":"(with \"off\" or \"out\") To eject summarily."},{"definition":"To forcibly remove a participant from an online activity.","example":"He was kicked by ChanServ for flooding."},{"definition":"To overcome (a bothersome or difficult issue or obstacle); to free oneself of (a problem).","example":"I still smoke, but they keep telling me to kick the habit."},{"definition":"To move or push suddenly and violently.","example":"He was kicked sideways by the force of the blast."},{"definition":"(of a firearm) To recoil; to push by recoiling."},{"definition":"To attack (a piece) in order to force it to move."},{"definition":"To accelerate quickly with a few pedal strokes in an effort to break away from other riders.","example":"Contador kicks again to try to rid himself of Rasmussen."},{"definition":"To show opposition or resistance."},{"definition":"To work a press by impact of the foot on a treadle."},{"definition":"To die."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(smoking, of a pipe) Empty with nothing left to smoke but ash."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"kicked-us","text":"/kɪkt/"}]},{"word":"COLORING","idx":12549,"count":3509922,"meanings":[{"definitions":[{"definition":"To give something color.","example":"We could color the walls red."},{"definition":"To apply colors to the areas within the boundaries of a line drawing using colored markers or crayons.","example":"My kindergartener loves to color."},{"definition":"(of a person or their face) To become red through increased blood flow.","example":"Her face colored as she realized her mistake."},{"definition":"To affect without completely changing.","example":"That interpretation certainly colors my perception of the book."},{"definition":"To attribute a quality to; to portray (as).","example":"Color me confused."},{"definition":"To assign colors to the vertices of a graph (or the regions of a map) so that no two vertices connected by an edge (regions sharing a border) have the same color.","example":"Can this graph be 2-colored?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act or process which applies color."},{"definition":"Any substance used to give color.","example":"Our cookies contain no artificial flavorings or colorings."},{"definition":"The appearance as to color."},{"definition":"A disguise or discoloration."},{"definition":"An assignment of a color to each vertex of a graph such that no two vertices connected by an edge are given the same color."}],"partOfSpeech":"n"}]},{"word":"CURB","idx":12550,"count":3509257,"meanings":[{"definitions":[{"definition":"A concrete margin along the edge of a road; a kerb (UK, Australia, New Zealand)"},{"definition":"A raised margin along the edge of something, such as a well or the eye of a dome, as a strengthening."},{"definition":"Something that checks or restrains; a restraint."},{"definition":"A riding or driving bit for a horse that has rein action which amplifies the pressure in the mouth by leverage advantage placing pressure on the poll via the crown piece of the bridle and chin groove via a curb chain."},{"definition":"A sidewalk, covered or partially enclosed, bordering the airport terminal road system with adjacent paved areas to permit vehicles to off-load or load passengers."},{"definition":"A swelling on the back part of the hind leg of a horse, just behind the lowest part of the hock joint, generally causing lameness."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To check, restrain or control.","example":"\"Curb your dog.\""},{"definition":"To rein in."},{"definition":"To furnish with a curb, as a well; to restrain by a curb, as a bank of earth."},{"definition":"To force to \"bite the curb\" (hit the pavement curb); see curb stomp."},{"definition":"To damage vehicle wheels or tires by running into or over a pavement curb."},{"definition":"To bend or curve."},{"definition":"To crouch; to cringe."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"curb-uk","text":"/kɜːb/"}]},{"word":"GADGET","idx":12551,"count":3508749,"meanings":[{"definitions":[{"definition":"A thing whose name cannot be remembered; thingamajig, doohickey."},{"definition":"Any device or machine, especially one whose name cannot be recalled. Often either clever or complicated.","example":"He bought a neat new gadget for shredding potatoes."},{"definition":"Any consumer electronics product."},{"definition":"A sequence of machine code instructions crafted as part of an exploit that attempts to divert execution to a memory location chosen by the attacker."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gadget-us","text":"/ɡædʒɪt/"}]},{"word":"LEUKEMIA","idx":12553,"count":3506364,"meanings":[{"definitions":[{"definition":"A type of malignancy affecting the blood cells or blood-forming tissues."},{"definition":"Any specific form or type of cancer of the blood-forming tissues.","example":"The subjects suffered from lymphoblastic and myeloid leukemias."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/luːˈkiːmi.ə/"}]},{"word":"REIGN","idx":12554,"count":3505605,"meanings":[{"definitions":[{"definition":"The exercise of sovereign power.","example":"England prospered under Elizabeth I's reign."},{"definition":"The period during which a monarch rules.","example":"The reign of Victoria was a long one."},{"definition":"The territory or sphere over which a kingdom; empire; realm; dominion, etc. is ruled."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To exercise sovereign power, to rule as a monarch.","example":"He reigned in an autocratic manner."},{"definition":"To reign over (a country)"},{"definition":"To be the winner of the most recent iteration of a competition."},{"definition":"To be a dominant quality of a place or situation; to prevail, predominate, rule.","example":"Silence reigned."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"reign-us","text":"[ɹeɪn]"}]},{"word":"TRIVIAL","idx":12555,"count":3505592,"meanings":[{"definitions":[{"definition":"Any of the three liberal arts forming the trivium."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Ignorable; of little significance or value."},{"definition":"Commonplace, ordinary."},{"definition":"Concerned with or involving trivia."},{"definition":"Relating to or designating the name of a species; specific as opposed to generic."},{"definition":"Of, relating to, or being the simplest possible case."},{"definition":"Self-evident."},{"definition":"Pertaining to the trivium."},{"definition":"Indistinguishable in case of truth or falsity."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"trivial-us","text":"/ˈtɹɪ.vi.əl/"}]},{"word":"DECO","idx":12556,"count":3505499,"meanings":[{"definitions":[{"definition":"(underwater diving) Decompression."},{"definition":"A friendship book in which people add decorative elements such as drawings, stickers and sequins."}],"partOfSpeech":"n"}]},{"word":"TICKER","idx":12557,"count":3505466,"meanings":[{"definitions":[{"definition":"One who makes a tick mark."},{"definition":"A measuring or reporting device, particularly one which makes a ticking sound as the measured events occur.","example":"The ticker was showing an increased rate of flow."},{"definition":"A ticker tape, either the traditional paper kind or a scrolling message on a screen.","example":"I checked the prices on the ticker one last time before placing the trade."},{"definition":"A heart, especially a human one.","example":"My ticker gave out and I had to go to the hospital for surgery."},{"definition":"A birdwatcher who aims to see (and tick off on a list) as many bird species as possible."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ticker-au","text":"/tɪkə(ɹ)/"}]},{"word":"COKE","idx":12558,"count":3505322,"meanings":[{"definitions":[{"definition":"Solid residue from roasting coal in a coke oven; used principally as a fuel and in the production of steel and formerly as a domestic fuel.","example":"The plant should produce approximately 550,000 tons of screened blast furnace coke per year."},{"definition":"Cocaine."},{"definition":"Cola-based soft drink."},{"definition":"A bottle, glass or can of a cola-based soft drink."},{"definition":"Any soft drink, regardless of type."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce coke from coal."},{"definition":"To turn into coke."},{"definition":"To add deleterious carbon deposits as a byproduct of combustion."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/koʊk/"},{"text":"/kəʊk/"},{"audio":"coke-au"}]},{"word":"HABITATS","idx":12559,"count":3505167,"meanings":[{"definitions":[{"definition":"Conditions suitable for an organism or population of organisms to live.","example":"This park offers important amphibian habitat and breeding area."},{"definition":"A place or type of site where an organism or population naturally occurs."},{"definition":"A terrestrial or aquatic area distinguished by geographic, abiotic and biotic features, whether entirely natural or semi-natural."},{"definition":"A place in which a person lives."}],"partOfSpeech":"n"}]},{"word":"CLAUSES","idx":12560,"count":3504800,"meanings":[{"definitions":[{"definition":"(grammar) A verb, its necessary grammatical arguments, and any adjuncts affecting them."},{"definition":"(grammar) A verb along with its subject and their modifiers. If a clause provides a complete thought on its own, then it is an independent (superordinate) clause; otherwise, it is (subordinate) dependent."},{"definition":"A separate part of a contract, a will or another legal document."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(shipping) To amend (a bill of lading or similar document)."}],"partOfSpeech":"ve"}]},{"word":"BARON","idx":12561,"count":3504549,"meanings":[{"definitions":[{"definition":"The male ruler of a barony."},{"definition":"A male member of the lowest rank of English nobility (the equivalent rank in Scotland is lord)."},{"definition":"A particular cut of beef, made up of a double sirloin."},{"definition":"A person of great power in society, especially in business and politics."},{"definition":"A prisoner who gains power and influence by lending or selling tobacco."},{"definition":"A husband.","example":"baron and feme: husband and wife"},{"definition":"Any of various nymphalid butterflies of the genus Euthalia."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"baron-uk","text":"/ˈbæɹən/"}]},{"word":"SENSIBLE","idx":12563,"count":3503935,"meanings":[{"definitions":[{"definition":"Sensation; sensibility."},{"definition":"That which impresses itself on the senses; anything perceptible."},{"definition":"That which has sensibility; a sensitive being."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Perceptible by the senses."},{"definition":"Easily perceived; appreciable."},{"definition":"Able to feel or perceive."},{"definition":"Liable to external impression; easily affected; sensitive.","example":"a sensible thermometer"},{"definition":"Of or pertaining to the senses; sensory."},{"definition":"Cognizant; having the perception of something; aware of something."},{"definition":"Acting with or showing good sense; able to make good judgements based on reason."},{"definition":"Characterized more by usefulness or practicality than by fashionableness, especially of clothing."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sensible-us","text":"/ˈsɛn.sɪ.bl̩/"}]},{"word":"UNLAWFUL","idx":12564,"count":3503931,"meanings":[{"definitions":[{"definition":"Prohibited; not permitted by law (either civil or criminal law; see illegal).","example":"He was charged with unlawful use of a car."}],"partOfSpeech":"j"}]},{"word":"BATES","idx":12565,"count":3503755,"meanings":[{"definitions":[{"definition":"To reduce the force of something; to abate."},{"definition":"To restrain, usually with the sense of being in anticipation"},{"definition":"(sometimes figurative) To cut off, remove, take away."},{"definition":"To leave out, except, bar."},{"definition":"To waste away."},{"definition":"To deprive of."},{"definition":"To lessen by retrenching, deducting, or reducing; to abate; to beat down; to lower."},{"definition":"To allow by way of abatement or deduction."},{"definition":"To contend or strive with blows or arguments."},{"definition":"Of a falcon: To flap the wings vigorously; to bait."},{"definition":"To soak leather so as to remove chemicals used in tanning; to steep in bate."},{"definition":"To masturbate.","example":"I could go out and take a walk in the park, but I'd rather stay home and bate all day."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/beɪts/"}]},{"word":"INCORPORATES","idx":12566,"count":3503733,"meanings":[{"definitions":[{"definition":"To include (something) as a part.","example":"The design of his house incorporates a spiral staircase."},{"definition":"To mix (something in) as an ingredient; to blend","example":"Incorporate air into the mixture."},{"definition":"To admit as a member of a company"},{"definition":"To form into a legal company.","example":"The company was incorporated in 1980."},{"definition":"To include (another clause or guarantee of the US constitution) as a part (of the Fourteenth Amendment, such that the clause binds not only the federal government but also state governments)."},{"definition":"To form into a body; to combine, as different ingredients, into one consistent mass."},{"definition":"To unite with a material body; to give a material form to; to embody."}],"partOfSpeech":"ve"}]},{"word":"WEBS","idx":12568,"count":3501990,"meanings":[{"definitions":[{"definition":"The silken structure which a spider builds using silk secreted from the spinnerets at the caudal tip of its abdomen; a spiderweb.","example":"The sunlight glistened in the dew on the web."},{"definition":"(by extension) Any interconnected set of persons, places, or things, which when diagrammed resembles a spider's web."},{"definition":"(sometimes capitalized) Specifically, the World Wide Web.","example":"Let me search the web for that."},{"definition":"The part of a baseball mitt between the forefinger and thumb, the webbing.","example":"He caught the ball in the web."},{"definition":"A latticed or woven structure.","example":"The gazebo's roof was a web made of thin strips of wood."},{"definition":"(usually with \"spin\", \"weave\", or similar verbs) A tall tale with more complexity than a myth or legend.","example":"Careful—she knows how to spin a good web, but don't lean too hard on what she says."},{"definition":"A plot or scheme."},{"definition":"The interconnection between flanges in structural members, increasing the effective lever arm and so the load capacity of the member."},{"definition":"The thinner vertical section of a railway rail between the top (head) and bottom (foot) of the rail."},{"definition":"A fold of tissue connecting the toes of certain birds, or of other animals."},{"definition":"The series of barbs implanted on each side of the shaft of a feather, whether stiff and united together by barbules, as in ordinary feathers, or soft and separate, as in downy feathers."},{"definition":"A continuous strip of material carried by rollers during processing."},{"definition":"(lithography) A long sheet of paper which is fed from a roll into a printing press, as opposed to individual sheets of paper."},{"definition":"A band of webbing used to regulate the extension of the hood of a carriage."},{"definition":"A thin metal sheet, plate, or strip, as of lead."},{"definition":"A major broadcasting network."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To construct or form a web."},{"definition":"To cover with a web or network."},{"definition":"To ensnare or entangle."},{"definition":"To provide with a web."},{"definition":"To weave."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/wɛbz/"}]},{"word":"SWINGING","idx":12569,"count":3501986,"meanings":[{"definitions":[{"definition":"To rotate about an off-centre fixed point.","example":"The plant swung in the breeze."},{"definition":"To dance."},{"definition":"To ride on a swing.","example":"The children laughed as they swung."},{"definition":"To participate in the swinging lifestyle; to participate in wife-swapping."},{"definition":"To hang from the gallows."},{"definition":"(of a ball) to move sideways in its trajectory."},{"definition":"To fluctuate or change.","example":"It wasn't long before the crowd's mood swung towards restless irritability."},{"definition":"To move (an object) backward and forward; to wave.","example":"He swung his sword as hard as he could."},{"definition":"To change (a numerical result); especially to change the outcome of an election."},{"definition":"To make (something) work; especially to afford (something) financially.","example":"If it’s not too expensive, I think we can swing it."},{"definition":"To play notes that are in pairs by making the first of the pair slightly longer than written (augmentation) and the second shorter, resulting in a bouncy, uneven rhythm."},{"definition":"(of a bowler) to make the ball move sideways in its trajectory."},{"definition":"To move one's arm in a punching motion."},{"definition":"In dancing, to turn around in a small circle with one's partner, holding hands or arms.","example":"\"to swing one's partner\", or simply \"to swing\""},{"definition":"To admit or turn something for the purpose of shaping it; said of a lathe.","example":"The lathe can swing a pulley of 12 inches diameter."},{"definition":"To put (a door, gate, etc.) on hinges so that it can swing or turn."},{"definition":"To turn round by action of wind or tide when at anchor.","example":"A ship swings with the tide."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Huge, immense."},{"definition":"Heavy, powerful, scathing.","example":"a swingeing verbal attack"},{"definition":"Fine, good, successful.","example":"The party was swinging."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The act or motion of that which swings."},{"definition":"An activity where couples engage in sexual activity with different partners."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈswɪŋɪŋ/"}]}]