[{"word":"PROTEUS","idx":40047,"count":488496,"meanings":[{"definitions":[{"definition":"Any of many gram-negative bacteria, of the genus Proteus, several of which are responsible for human infections."}],"partOfSpeech":"n"}]},{"word":"SIMIAN","idx":40049,"count":488490,"meanings":[{"definitions":[{"definition":"An ape or monkey, especially an anthropoid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to apes; apelike."},{"definition":"Bearing resemblance to an ape."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"simian-us","text":"/ˈsɪm.i.ən/"}]},{"word":"DENOTING","idx":40051,"count":488432,"meanings":[{"definitions":[{"definition":"To indicate; to mark.","example":"The yellow blazes denote the trail."},{"definition":"To make overt."},{"definition":"To refer to literally; to convey as meaning."}],"partOfSpeech":"ve"}]},{"word":"APIECE","idx":40053,"count":488388,"meanings":[{"definitions":[{"definition":"Each by itself; for or to each one","example":"These melons cost a dollar apiece."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"apiece-us","text":"/əˈpis/"}]},{"word":"GAMMON","idx":40056,"count":488354,"meanings":[{"definitions":[{"definition":"A cut of quick-cured pork leg."},{"definition":"A victory in backgammon achieved when the opponent has not borne off a single stone."},{"definition":"Backgammon (the game itself)."},{"definition":"A rope fastening a bowsprit to the stem of a ship (usually called a gammoning)."},{"definition":"Chatter, ridiculous nonsense."},{"definition":"A middle-aged or older right-wing, reactionary white man, or such men collectively."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cure bacon by salting."},{"definition":"To beat by a gammon (without the opponent bearing off a stone)."},{"definition":"To lash with ropes (on a ship)."},{"definition":"To deceive; to lie plausibly to."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡæmən/"}]},{"word":"MULTIMODE","idx":40058,"count":488288,"meanings":[{"definitions":[{"definition":"Having, or employing multiple modes."}],"partOfSpeech":"j"}]},{"word":"STORMING","idx":40065,"count":488160,"meanings":[{"definitions":[{"definition":"(with adverbial of direction) To move quickly and noisily like a storm, usually in a state of uproar or anger.","example":"She stormed out of the room."},{"definition":"To rage or fume; to be in a violent temper."},{"definition":"To assault (a stronghold or fortification) with military forces.","example":"Troops stormed the complex."},{"definition":"To have the weather be violent, with strong winds and usually rain, thunder, lightning, or snow.","example":"It stormed throughout the night."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is stormed.","example":"the stormings of cities throughout history"},{"definition":"The act of one who storms or rages."}],"partOfSpeech":"n"}]},{"word":"ISLET","idx":40069,"count":488105,"meanings":[{"definitions":[{"definition":"A small island"},{"definition":"An isolated piece of tissue that has a specific function"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈaɪ.lət/"}]},{"word":"UNIVERSES","idx":40070,"count":488084,"meanings":[{"definitions":[{"definition":"The sum of everything that exists in the cosmos, including time and space itself.","example":"I think that the universe was created by a life force rather than a deity."},{"definition":"An entity similar to our universe; one component of a larger entity known as the multiverse."},{"definition":"Everything under consideration.","example":"In all this universe of possibilities, there is only one feasible option."},{"definition":"A sample taken from the population."},{"definition":"An imaginary collection of worlds.","example":"The universe in this comic book series is richly imagined."},{"definition":"(films) A collection of stories with characters and settings that are less interrelated than those of sequels or prequels."},{"definition":"A whole world, in the sense of perspective or social setting.","example":"That didn’t just rock my world, it rocked my universe."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"universes-uk"}]},{"word":"GANGLIA","idx":40071,"count":488078,"meanings":[{"definitions":[{"definition":"An encapsulated collection of nerve-cell bodies, located outside the brain and spinal cord."},{"definition":"Any of certain masses of gray matter in the brain, as the basal ganglia."},{"definition":"(by extension) A centre of intellectual or industrial force, activity, etc."},{"definition":"A cystic tumour on a tendon sheath or joint capsule; a ganglion cyst."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡæŋɡli.ə/"}]},{"word":"CONDUITS","idx":40072,"count":488074,"meanings":[{"definitions":[{"definition":"A pipe or channel for conveying water etc."},{"definition":"A duct or tube into which electrical cables may be pulled; a type of raceway."},{"definition":"A means by which something is transmitted."},{"definition":"An investment vehicle that issues short-term commercial paper to finance long-term off-balance sheet bank assets."}],"partOfSpeech":"n"}]},{"word":"HEADWAY","idx":40074,"count":488012,"meanings":[{"definitions":[{"definition":"Movement ahead or forward."},{"definition":"Forward motion, or its rate."},{"definition":"The interval of time or distance between the fronts of two vehicles (e.g. buses) moving in succession in the same direction, especially along the same pre-determined route."},{"definition":"Progress toward a goal."},{"definition":"The clearance beneath an object, such as an arch, ceiling or bridge; headroom."},{"definition":"(coal-mining) A cross-heading."}],"partOfSpeech":"n"}]},{"word":"RESONANCES","idx":40076,"count":487858,"meanings":[{"definitions":[{"definition":"The quality of being resonant."},{"definition":"A resonant sound, echo, or reverberation, such as that produced by blowing over the top of a bottle."},{"definition":"The sound produced by a hollow body part such as the chest cavity upon auscultation, especially that produced while the patient is speaking."},{"definition":"Something that evokes an association, or a strong emotion."},{"definition":"The increase in the amplitude of an oscillation of a system under the influence of a periodic force whose frequency is close to that of the system's natural frequency."},{"definition":"A short-lived subatomic particle or state of atomic excitation that results from the collision of atomic particles.","example":"2004, When experiments with the first ‘atom-smashers’ took place in the 1950s to 1960s, many short-lived heavier siblings of the proton and neutron, known as ‘resonances’, were discovered. — Frank Close, Particle Physics: A Very Short Introduction (Oxford 2004, p. 35)"},{"definition":"An increase in the strength or duration of a musical tone produced by sympathetic vibration."},{"definition":"The property of a compound that can be visualized as having two structures differing only in the distribution of electrons; mesomerism."},{"definition":"A influence of the gravitational forces of one orbiting object on the orbit of another, causing periodic perturbations."},{"definition":"The condition where the inductive and capacitive reactances have equal magnitude."}],"partOfSpeech":"n"}]},{"word":"FRIARS","idx":40077,"count":487835,"meanings":[{"definitions":[{"definition":"A member of a mendicant Christian order such as the Augustinians, Carmelites (white friars), Franciscans (grey friars) or the Dominicans (black friars)."},{"definition":"A white or pale patch on a printed page."},{"definition":"An American fish, the silverside."}],"partOfSpeech":"n"}]},{"word":"SUBJECTIVITY","idx":40078,"count":487811,"meanings":[{"definitions":[{"definition":"The state of being subjective."},{"definition":"A subjective thought or idea."}],"partOfSpeech":"n"}]},{"word":"MAPLES","idx":40079,"count":487774,"meanings":[{"definitions":[{"definition":"A tree of the Acer genus, characterised by its usually palmate leaves and winged seeds."},{"definition":"The wood of such a tree, prized for its hardness and attractive appearance"}],"partOfSpeech":"n"}]},{"word":"ALLURING","idx":40080,"count":487763,"meanings":[{"definitions":[{"definition":"To entice; to attract."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb allure."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the power to allure."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɚˈluɚ.ɹɪŋ/"},{"text":"/ɚˈlʊɚ.ɹɪŋ/"}]},{"word":"MICROARRAYS","idx":40081,"count":487741,"meanings":[{"definitions":[{"definition":"Any of several devices, containing a two-dimensional array of small quantities of biological material, used for various types of assay; the assay itself"}],"partOfSpeech":"n"}]},{"word":"COBBLE","idx":40086,"count":487693,"meanings":[{"definitions":[{"definition":"A cobblestone."},{"definition":"A particle from 64 to 256 mm in diameter, following the Wentworth scale."},{"definition":"Small flat-bottomed fishing boat suitable for launching from a beach, found on the north-east coast of England and in Scotland."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make shoes (what a cobbler does)."},{"definition":"To assemble in an improvised way.","example":"I cobbled something together to get us through till morning."},{"definition":"To use cobblestones to pave a road, walkway, etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cobble-us","text":"/ˈkɑb.l̩/"}]},{"word":"BUZZARD","idx":40092,"count":487611,"meanings":[{"definitions":[{"definition":"Any of several Old World birds of prey of the genus Buteo with broad wings and a broad tail."},{"definition":"Any scavenging bird such as the American black vulture (Coragyps atratus) or the turkey vulture (Cathartes aura)."},{"definition":"(often preceded by \"old\", the \"old buzzard\") In North America, a curmudgeonly or cantankerous man; an old person; a mean, greedy person."},{"definition":"A blockhead; a dunce."},{"definition":"A score of two over par (for one hole)"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"buzzard-au","text":"/ˈbʌzəɹd/"}]},{"word":"BONY","idx":40093,"count":487592,"meanings":[{"definitions":[{"definition":"Resembling, having the appearance or consistence of, or relating to bone; osseous."},{"definition":"Full of bones"},{"definition":"With little flesh; skinny, thin"},{"definition":"Having prominent bones"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈbəʊni/"}]},{"word":"PLUNGER","idx":40095,"count":487501,"meanings":[{"definitions":[{"definition":"A device that is used to remove blockages from the drain of a basin or tub, by suction."},{"definition":"The internal piece of a syringe that pushes out or pulls in any contents."},{"definition":"The sliding activator of an exploder, an electrical generator used to trigger electrical detonators such as blasting caps."},{"definition":"The part of a cafetière that is pushed down to remove grounds from coffee."},{"definition":"One who plunges; a diver."},{"definition":"A horse that plunges, or throws itself suddenly forward."},{"definition":"A cavalryman."},{"definition":"A device similar to a piston but without a mechanism; a long solid cylinder used, instead of a piston or bucket, as a forcer in pumps."},{"definition":"The moving portion of a solenoid."},{"definition":"The spring-loaded assembly that propels the ball onto the table."},{"definition":"A reckless gambler."},{"definition":"A boiler in which clay is beaten by a wheel to a creamy consistency."},{"definition":"The firing pin of a breechloader."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈplʌndʒɚ/"},{"audio":"plunger-au"}]},{"word":"HALTING","idx":40096,"count":487495,"meanings":[{"definitions":[{"definition":"To limp; move with a limping gait."},{"definition":"To stand in doubt whether to proceed, or what to do; hesitate; be uncertain; linger; delay; mammer."},{"definition":"To be lame, faulty, or defective, as in connection with ideas, or in measure, or in versification."},{"definition":"To waver."},{"definition":"To falter."},{"definition":"To stop marching."},{"definition":"To stop either temporarily or permanently."},{"definition":"To bring to a stop."},{"definition":"To cause to discontinue.","example":"The contract negotiations halted operations for at least a week."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of one who halts; a stopping or hesitancy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Prone to pauses or breaks; hesitant; broken.","example":"her halting steps"}],"partOfSpeech":"j"}]},{"word":"BOOKENDS","idx":40101,"count":487398,"meanings":[{"definitions":[{"definition":"A heavy object or moveable support placed at one or both ends of a row of books for the purpose of keeping them upright."},{"definition":"Something that comes before, after, or at both sides of something else."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To come before and after, or at both sides of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bookends-au"}]},{"word":"CRANKS","idx":40104,"count":487365,"meanings":[{"definitions":[{"definition":"A bent piece of an axle or shaft, or an attached arm perpendicular, or nearly so, to the end of a shaft or wheel, used to impart a rotation to a wheel or other mechanical device; also used to change circular into reciprocating motion, or reciprocating into circular motion.","example":"I grind my coffee by hand with a coffee grinder with a crank handle."},{"definition":"The act of converting power into motion, by turning a crankshaft.","example":"Yes, a crank was all it needed to start."},{"definition":"Any bend, turn, or winding, as of a passage."},{"definition":"An ill-tempered or nasty person.","example":"Billy-Bob is a nasty old crank! He chased my cat away."},{"definition":"A twist or turn of the mind; caprice; whim;"},{"definition":"A fit of temper or passion."},{"definition":"(dated in US) A person who is considered strange or odd by others. They may behave in unconventional ways.","example":"John is a crank because he talks to himself."},{"definition":"(1800s) A baseball fan."},{"definition":"An advocate of a pseudoscience movement.","example":"That crank next door thinks he’s created cold fusion in his garage."},{"definition":"A twist or turn in speech; word play consisting in a change of the form or meaning of a word."},{"definition":"A sick person; an invalid."},{"definition":"A penis."},{"definition":"A highly addictive phenethylamine stimulant drug, similar to cocaine. Its systematic (IUPAC) name is (S)-N-methyl-1-phenylpropan-2-amine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To turn by means of a crank.","example":"Motorists had to crank their engine by hand."},{"definition":"To turn a crank.","example":"He's been cranking all day and yet it refuses to crank."},{"definition":"(of a crank or similar) To turn.","example":"He's been cranking all day and yet it refuses to crank."},{"definition":"To cause to spin via other means, as though turned by a crank.","example":"Crank it up!"},{"definition":"To act in a cranky manner; to behave unreasonably and irritably, especially through complaining.","example":"Quit cranking about your spilt milk!"},{"definition":"To be running at a high level of output or effort.","example":"By one hour into the shift, the boys were really cranking."},{"definition":"To run with a winding course; to double; to crook; to wind and turn."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cranks-au"}]},{"word":"HEADWATERS","idx":40106,"count":487237,"meanings":[{"definitions":[{"definition":"The source of a river, the set of streams that feed into the river's beginning."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɛdˌwɑtɝz/"}]},{"word":"HISTOGRAMS","idx":40107,"count":487210,"meanings":[{"definitions":[{"definition":"A graphical display of numerical data in the form of upright bars, with the area of each bar representing frequency."}],"partOfSpeech":"n"}]},{"word":"REVIVING","idx":40108,"count":487176,"meanings":[{"definitions":[{"definition":"To return to life; to become reanimated or reinvigorated."},{"definition":"To return to life; to cause to recover life or strength; to cause to live anew.","example":"Her grandmother refused to be revived if she lost consciousness."},{"definition":"To recover from a state of oblivion, obscurity, neglect, or depression.","example":"Classical learning revived in the fifteenth century."},{"definition":"To restore, or bring again to life; to reanimate.","example":"This new paint job should revive the surgery waiting room."},{"definition":"To raise from coma, languor, depression, or discouragement; to bring into action after a suspension."},{"definition":"To renew in the mind or memory; to bring to recollection; to recall attention to; to reawaken.","example":"The Harry Potter films revived the world's interest in wizardry"},{"definition":"To recover its natural or metallic state, as a metal."},{"definition":"To restore or reduce to its natural or metallic state","example":"to revive a metal after calcination"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A revival; a bringing back to life."}],"partOfSpeech":"n"}]},{"word":"MOLL","idx":40109,"count":487169,"meanings":[{"definitions":[{"definition":"A female companion of a gangster, especially a former or current prostitute."},{"definition":"A prostitute or woman with loose sexual morals."},{"definition":"Bitch, slut; an insulting epithet applied to a female."},{"definition":"A girlfriend of a bikie."},{"definition":"A girlfriend of a surfie; blends with pejorative sense."},{"definition":"A female fan of extreme metal, grunge or hardcore punk, especially the girlfriend of a musician of those aforementioned genres."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Minor; in the minor mode","example":"A moll, that is, A minor"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"moll-uk","text":"/mɒl/"},{"audio":"moll-1-au","text":"/mɒl/"}]},{"word":"FLOORPLANS","idx":40110,"count":487137,"meanings":[{"definitions":[{"definition":"A diagram, usually to scale, showing the layout of a building."},{"definition":"A layout representation of where the major functional blocks of an integrated circuit will be physically placed."}],"partOfSpeech":"n"}]},{"word":"BURROW","idx":40113,"count":487085,"meanings":[{"definitions":[{"definition":"A mountain."},{"definition":"A hill."},{"definition":"A mound of earth and stones raised over a grave or graves."},{"definition":"A heap of rubbish, attle, or other such refuse."},{"definition":"A small vehicle used to carry a load and pulled or pushed by hand."},{"definition":"(saltworks) A wicker case in which salt is put to drain."},{"definition":"A castrated boar."},{"definition":"A long sleeveless flannel garment for infants."},{"definition":"A fortified town."},{"definition":"A town or city."},{"definition":"A town having a municipal corporation and certain traditional rights."},{"definition":"An administrative district in some cities, e.g., London."},{"definition":"An administrative unit of a city which, under most circumstances according to state or national law, would be considered a larger or more powerful entity; most commonly used in American English to define the five counties that make up New York City."},{"definition":"Other similar administrative units in cities and states in various parts of the world."},{"definition":"A district in Alaska having powers similar to a county."},{"definition":"An association of men who gave pledges or sureties to the king for the good behaviour of each other."},{"definition":"The pledge or surety thus given."},{"definition":"A tunnel or hole, often as dug by a small creature."},{"definition":"A heap or heaps of rubbish or refuse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dig a tunnel or hole"},{"definition":"(with adverbial of direction) to move underneath or press up against in search of safety or comfort","example":"The young girl burrowed into the bed."},{"definition":"(with into) to investigate thoroughly","example":"The journalist burrowed into the origins of the mayor's corruption."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"burrow-us","text":"/ˈbɜɹoʊ/"}]},{"word":"UNIVERSALITY","idx":40114,"count":487084,"meanings":[{"definitions":[{"definition":"The property of being universal, common to all members of a class"}],"partOfSpeech":"n"}]},{"word":"VERANDA","idx":40117,"count":486976,"meanings":[{"definitions":[{"definition":"A gallery, platform, or balcony, usually roofed and often partly enclosed, extending along the outside of a building."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/vəˈɹæn.də/"}]},{"word":"CYTOSOL","idx":40119,"count":486945,"meanings":[{"definitions":[{"definition":"The aqueous solution of a cell's cytoplasm, consisting of water, organic molecules and inorganic ions."}],"partOfSpeech":"n"}]},{"word":"DISPOSALS","idx":40120,"count":486939,"meanings":[{"definitions":[{"definition":"An arrangement, categorization or classification of things."},{"definition":"A disposing of or getting rid of something."},{"definition":"The power to use something or someone."}],"partOfSpeech":"n"}]},{"word":"MOTU","idx":40123,"count":486895,"meanings":[{"definitions":[{"definition":"A reef islet formed by broken coral and sand, surrounding an atoll."}],"partOfSpeech":"n"}]},{"word":"UNDERRATED","idx":40125,"count":486863,"meanings":[{"definitions":[{"definition":"To underestimate; to make too low a rate or estimate"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not given enough recognition for its quality"}],"partOfSpeech":"j"}]},{"word":"HYPHEN","idx":40130,"count":486821,"meanings":[{"definitions":[{"definition":"The symbol \"‐\", typically used to join two or more words to form a compound term, or to indicate that a word has been split at the end of a line."},{"definition":"Something that links two more consequential things."},{"definition":"An enclosed walkway or passage that connects two buildings."},{"definition":"Someone who belongs to a marginalized subgroup, and can therefore described by a hyphenated term, such as \"German-American\", \"female-academic\", etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To separate or punctuate with a hyphen; to hyphenate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Used to emphasize the coordinating function usually indicated by the punctuation \"-\"."}],"partOfSpeech":"c"}],"phonetics":[{"audio":"hyphen-us","text":"/ˈhaɪ.fən/"}]},{"word":"GLYCOPROTEINS","idx":40133,"count":486771,"meanings":[{"definitions":[{"definition":"A protein with covalently bonded carbohydrates."}],"partOfSpeech":"n"}]},{"word":"INSATIABLE","idx":40135,"count":486741,"meanings":[{"definitions":[{"definition":"One who or that which cannot be satiated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not satiable; incapable of being satisfied or appeased; very greedy"}],"partOfSpeech":"j"}]},{"word":"EXQUISITELY","idx":40136,"count":486722,"meanings":[{"definitions":[{"definition":"In an exquisite manner."},{"definition":"Exceedingly; in the highest degree"}],"partOfSpeech":"v"}]},{"word":"UNSORTED","idx":40137,"count":486715,"meanings":[{"definitions":[{"definition":"Not in any particular order or sequence."},{"definition":"Mixed, jumbled, not separated by property into categories."},{"definition":"Ill-chosen, inconvenient, unsuitable"}],"partOfSpeech":"j"}]},{"word":"UNFRIENDLY","idx":40139,"count":486702,"meanings":[{"definitions":[{"definition":"An enemy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not friendly; hostile; mean."},{"definition":"Unfavourable."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In an unkind or unfriendly manner; not as a friend"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ʌnˈfɹɛn(d)li/"}]},{"word":"HATCHES","idx":40145,"count":486551,"meanings":[{"definitions":[{"definition":"A horizontal door in a floor or ceiling."},{"definition":"A trapdoor."},{"definition":"An opening in a wall at window height for the purpose of serving food or other items. A pass through.","example":"The cook passed the dishes through the serving hatch."},{"definition":"A small door in large mechanical structures and vehicles such as aircraft and spacecraft often provided for access for maintenance."},{"definition":"An opening through the deck of a ship or submarine"},{"definition":"A gullet."},{"definition":"A frame or weir in a river, for catching fish."},{"definition":"A floodgate; a sluice gate."},{"definition":"A bedstead."},{"definition":"An opening into, or in search of, a mine."},{"definition":"The act of hatching."},{"definition":"Development; disclosure; discovery."},{"definition":"(poultry) A group of birds that emerged from eggs at a specified time.","example":"These pullets are from an April hatch."},{"definition":"(often as mayfly hatch) The phenomenon, lasting 1–2 days, of large clouds of mayflies appearing in one location to mate, having reached maturity."},{"definition":"A birth, the birth records (in the newspaper) — compare the phrase \"hatched, matched, and dispatched.\""}],"partOfSpeech":"n"},{"definitions":[{"definition":"To close with a hatch or hatches."},{"definition":"(of young animals) To emerge from an egg."},{"definition":"(of eggs) To break open when a young animal emerges from it."},{"definition":"To incubate eggs; to cause to hatch."},{"definition":"To devise."},{"definition":"To shade an area of (a drawing, diagram, etc.) with fine parallel lines, or with lines which cross each other (cross-hatch)."},{"definition":"To cross; to spot; to stain; to steep."}],"partOfSpeech":"ve"}]},{"word":"CHRISTENED","idx":40147,"count":486529,"meanings":[{"definitions":[{"definition":"To perform the religious act of the baptism, to baptise.","example":"The new baby was christened at the village church."},{"definition":"To name.","example":"I christen this ship the Bonny Barnacle."},{"definition":"To Christianize."},{"definition":"To use for the first time.","example":"I christened my new boots today with a walk in the snow."},{"definition":"To douse or wet with blood, urine, tears, or other liquid."}],"partOfSpeech":"ve"}]},{"word":"ACTUALITY","idx":40151,"count":486439,"meanings":[{"definitions":[{"definition":"The state of existing; existence."},{"definition":"The quality of being actual or factual; fact."},{"definition":"Live reporting on current affairs."},{"definition":"A short early motion picture."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"actuality-uk","text":"/ˌæktjuˈælɪti/"}]},{"word":"TEASED","idx":40152,"count":486402,"meanings":[{"definitions":[{"definition":"To separate the fibres of a fibrous material."},{"definition":"To comb (originally with teasels) so that the fibres all lie in one direction."},{"definition":"To back-comb."},{"definition":"To poke fun at."},{"definition":"To provoke or disturb; to annoy."},{"definition":"To manipulate or influence the behavior of, especially by repeated acts of irritation."},{"definition":"To entice, tempt."},{"definition":"To show as forthcoming, in the manner of a teaser."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tiːzd/"}]},{"word":"DETAIN","idx":40154,"count":486373,"meanings":[{"definitions":[{"definition":"To keep someone from proceeding by holding them back or making claims on their attention."},{"definition":"To put under custody."},{"definition":"To keep back or from; to withhold."},{"definition":"To seize goods for official purposes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"detain-us"},{"text":"/dɪˈteɪn/"}]},{"word":"IMMUNISATION","idx":40160,"count":486253,"meanings":[{"definitions":[{"definition":"The process of immunising signalling and traction power supplies so they don't interfere with each other."},{"definition":"The process by which an individual is safely exposed in a controlled manner to a material that is designed to prime their immune system against that material.","example":"Immunization against influenza is important for all child-care workers."},{"definition":"One such exposure.","example":"The first immunization a baby gets is against HBV."}],"partOfSpeech":"n"}]},{"word":"EYELETS","idx":40162,"count":486219,"meanings":[{"definitions":[{"definition":"An object that consists of a rim and small hole or perforation to receive a cord or fastener, as in garments, sails, etc. An eyelet may reinforce a hole.","example":"Push the aglet of the shoelace through each of the eyelets, one at a time."},{"definition":"A shaped metal embellishment containing a hole, used in scrapbook. Eyelets are typically set by punching a hole in the page, placing the smooth side of the eyelet on a table, positioning the paper over protruding edge and curling the edge down using a hammer and eyelet setter."},{"definition":"Cotton fabric with small holes."},{"definition":"The contact tip of the base of a light bulb."},{"definition":"A peephole."},{"definition":"A little eye."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"eyelets-us"}]},{"word":"SWORDFISH","idx":40163,"count":486206,"meanings":[{"definitions":[{"definition":"A large marine fish with a long, pointed bill, Xiphias gladius."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for swordfish."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsɔː(ɹ)dfɪʃ/"}]},{"word":"FLATTEN","idx":40166,"count":486144,"meanings":[{"definitions":[{"definition":"To make something flat or flatter.","example":"As there was a lot of damage, we chose the heavy roller to flatten the pitch."},{"definition":"To press one's body tightly against a surface, such as a wall or floor, especially in order to avoid being seen or harmed."},{"definition":"To knock down or lay low.","example":"The prize fighter quickly flattened his challenger."},{"definition":"To become flat or flatter; to plateau.","example":"Prices have flattened out."},{"definition":"To be knocked down or laid low."},{"definition":"To lower by a semitone."},{"definition":"To make vapid or insipid; to render stale."},{"definition":"To reduce (a data structure) to one that has fewer dimensions, e.g. a 2×2 array into a list of four elements."},{"definition":"To combine (separate layers) into a single image."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"flatten-uk","text":"/ˈflætən/"}]},{"word":"HOMOGENEITY","idx":40167,"count":486125,"meanings":[{"definitions":[{"definition":"The condition of being homogeneous"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌhoʊ.mə.dʒəˈneɪ.ə.ti/"},{"text":"/ˌhɒ.mə(ʊ).dʒəˈneɪ.ə.ti/"}]},{"word":"SAVANT","idx":40168,"count":486069,"meanings":[{"definitions":[{"definition":"A person of learning, especially one who is versed in literature or science."},{"definition":"A person who is considered eminent because of their achievements."},{"definition":"A person with significant mental disabilities who is very gifted in one area of activity, such as playing the piano or mental arithmetic."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˈvɑnt/"},{"text":"/ˈsæv.ənt/"}]},{"word":"APPRECIATING","idx":40170,"count":486016,"meanings":[{"definitions":[{"definition":"To be grateful or thankful for.","example":"I appreciate your efforts"},{"definition":"To view as valuable.","example":"You must learn to appreciate time"},{"definition":"To be fully conscious of; understand; be aware of; detect.","example":"I appreciate that what I'm asking you to do is very difficult."},{"definition":"To increase in value.","example":"The value of his portfolio appreciated by 80% over eight years."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Appreciation"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Appreciative: having or showing appreciation."}],"partOfSpeech":"j"}]},{"word":"RECREATED","idx":40171,"count":486012,"meanings":[{"definitions":[{"definition":"To give new life, energy or encouragement (to); to refresh, enliven."},{"definition":"To enjoy or entertain oneself."},{"definition":"To take recreation."},{"definition":"To create anew."}],"partOfSpeech":"ve"}]},{"word":"LEADED","idx":40172,"count":486003,"meanings":[{"definitions":[{"definition":"To cover, fill, or affect with lead","example":"continuous firing leads the grooves of a rifle."},{"definition":"To place leads between the lines of.","example":"leaded matter"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Held in place by strips of lead."},{"definition":"Containing or treated with the element lead."},{"definition":"Containing tetraethyllead.","example":"Leaded gasoline is hard to find in some areas now."}],"partOfSpeech":"j"}]},{"word":"SUPERSONICS","idx":40174,"count":485909,"meanings":[{"definitions":[{"definition":"An aircraft that can travel at the speed of sound."},{"definition":"The study of supersonic motion"},{"definition":"Ultrasonics"}],"partOfSpeech":"n"}]},{"word":"STINGING","idx":40175,"count":485905,"meanings":[{"definitions":[{"definition":"To hurt, usually by introducing poison or a sharp point, or both.","example":"Right so came out an adder of a little heathbush, and it stung a knight in the foot."},{"definition":"(of an insect) To bite."},{"definition":"(sometimes figurative) To hurt, to be in pain.","example":"My hand stings after knocking on the door so long."},{"definition":"To cause harm or pain to.","example":"I thought I could park in front of the hotel, but they stung me for five pounds!"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which someone receives a sting.","example":"stingings of remorse"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the capacity to sting.","example":"stinging nettles"},{"definition":"Precise and hurtful"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈstɪŋɪŋ/"}]},{"word":"GULLS","idx":40178,"count":485882,"meanings":[{"definitions":[{"definition":"A seabird of the genus Larus or of the family Laridae."},{"definition":"Any of various pierid butterflies of the genus Cepora."},{"definition":"A cheating trick; a fraud."},{"definition":"One easily cheated; a dupe."},{"definition":"(Oxford University slang) A swindler or trickster."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deceive or cheat."},{"definition":"To mislead."},{"definition":"To trick and defraud."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡʌlz/"}]},{"word":"VINAIGRETTE","idx":40179,"count":485867,"meanings":[{"definitions":[{"definition":"A sauce, made of an acidic liquid such as vinegar or lemon juice; oil; and other ingredients, used as a salad dressing, or as a marinade for cold meats."},{"definition":"A small perforated box for holding aromatic vinegar contained in a sponge, or a smelling bottle for smelling salts; called also vinegarette."},{"definition":"A small, two-wheeled vehicle, like a Bath chair, to be drawn or pushed by a boy or man."},{"definition":"A sort of Russian salad, originally using French salad dressing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vinaigrette-uk","text":"/vɪnəˈɡɹɛt/"}]},{"word":"PRESCRIBES","idx":40183,"count":485710,"meanings":[{"definitions":[{"definition":"To order (a drug or medical device) for use by a particular patient (under licensed authority).","example":"The doctor prescribed aspirin."},{"definition":"To specify by writing as a required procedure or ritual; to lay down authoritatively as a guide, direction, or rule of action.","example":"The property meets the criteria prescribed by the regulations."}],"partOfSpeech":"ve"}]},{"word":"SULTRY","idx":40185,"count":485693,"meanings":[{"definitions":[{"definition":"Hot and humid."},{"definition":"Very hot and dry; torrid."},{"definition":"Sexually enthralling."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsəl-/"},{"text":"/ˈsʌltɹi/"},{"audio":"sultry-au"}]},{"word":"SINNED","idx":40186,"count":485674,"meanings":[{"definitions":[{"definition":"To commit a sin."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sinned-us"}]},{"word":"GLOBULAR","idx":40187,"count":485671,"meanings":[{"definitions":[{"definition":"A globular cluster"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Roughly spherical in shape."},{"definition":"Comprising globules."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡlɑb.jə.lɚ/"}]},{"word":"UNREADABLE","idx":40189,"count":485625,"meanings":[{"definitions":[{"definition":"That cannot be read or is not easy to read.","example":"a machine that cut up secret documents into small unreadable fragments"},{"definition":"Not sufficiently interesting to be worth reading.","example":"unreadable books"}],"partOfSpeech":"j"}]},{"word":"BALSA","idx":40192,"count":485561,"meanings":[{"definitions":[{"definition":"A large tree, Ochroma pyramidale, native to tropical America, with wood that is very light in weight."},{"definition":"The wood of this tree."},{"definition":"A raft or float, used principally on the Pacific coast of South America."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɑlsə/"},{"text":"/ˈbæl.sə/"}]},{"word":"DEPOSITING","idx":40193,"count":485544,"meanings":[{"definitions":[{"definition":"To lay down; to place; to put.","example":"A crocodile deposits her eggs in the sand."},{"definition":"To lay up or away for safekeeping; to put up; to store.","example":"to deposit goods in a warehouse"},{"definition":"To entrust one's assets to the care of another. Sometimes done as collateral."},{"definition":"To put money or funds into an account."},{"definition":"To lay aside; to rid oneself of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Deposition"}],"partOfSpeech":"n"}]},{"word":"BRASSERIE","idx":40195,"count":485518,"meanings":[{"definitions":[{"definition":"A small, informal restaurant that serves beer and wine as well as simple food"}],"partOfSpeech":"n"}]},{"word":"ENGRAVINGS","idx":40201,"count":485302,"meanings":[{"definitions":[{"definition":"The practice of incising a design onto a hard, flat surface, by cutting grooves into it."},{"definition":"The art of producing an image from an engraved printing form, typically made of copper."},{"definition":"A print produced from an engraving."},{"definition":"The art of drawing music notation at high quality, particularly on a computer."}],"partOfSpeech":"n"}]},{"word":"SHOWERING","idx":40202,"count":485253,"meanings":[{"definitions":[{"definition":"(followed by with) To spray with (a specified liquid)."},{"definition":"To bathe using a shower."},{"definition":"To bestow liberally, to give or distribute in abundance"},{"definition":"To rain in a shower; to cascade down."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something that falls in a shower."}],"partOfSpeech":"n"}]},{"word":"ENDURO","idx":40203,"count":485249,"meanings":[{"definitions":[{"definition":"A motorcycle sport run on predominantly off-road courses, with many obstacles and challenges."},{"definition":"A particular race or event in the sport of enduro."}],"partOfSpeech":"n"}]},{"word":"PEEPSHOW","idx":40204,"count":485247,"meanings":[{"definitions":[{"definition":"An exhibition of pictures or objects viewed through a small hole or magnifying glass."},{"definition":"A titillating or pornographic display through a small slot, generally equipped with a timer to automatically close the slot when payment has expired."}],"partOfSpeech":"n"}]},{"word":"FANATICAL","idx":40205,"count":485238,"meanings":[{"definitions":[{"definition":"Having an extreme, irrational zeal or enthusiasm for a specific cause."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/fəˈnætɪkəl/"}]},{"word":"CAPER","idx":40206,"count":485193,"meanings":[{"definitions":[{"definition":"A playful leap or jump."},{"definition":"A jump while dancing."},{"definition":"A prank or practical joke."},{"definition":"(usually in plural) Playful behaviour."},{"definition":"(figuratively) A crime, especially an elaborate heist, or a narrative about such a crime."},{"definition":"A vessel formerly used by the Dutch; privateer."},{"definition":"The pungent grayish green flower bud of the European and Oriental caper (Capparis spinosa), which is pickled and eaten."},{"definition":"A plant of the genus Capparis."},{"definition":"The capercaillie."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To leap or jump about in a sprightly or playful manner."},{"definition":"To jump as part of a dance."},{"definition":"To engage in playful behaviour."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"caper-us","text":"/ˈkeɪpɚ/"}]},{"word":"GIVENS","idx":40207,"count":485183,"meanings":[{"definitions":[{"definition":"A condition that is assumed to be true without further evaluation.","example":"When evaluating this math problem, don't forget to read the givens."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɪ.vənz/"}]},{"word":"PECUNIARY","idx":40209,"count":485145,"meanings":[{"definitions":[{"definition":"Of, or relating to, money; monetary, financial."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pecuniary-us","text":"/pəˈkjuniɛɹi/"}]},{"word":"VINTAGES","idx":40210,"count":485118,"meanings":[{"definitions":[{"definition":"The yield of grapes or wine from a vineyard or district during one season."},{"definition":"Wine, especially high-quality, identified as to year and vineyard or district of origin."},{"definition":"The harvesting of a grape crop and the initial pressing of juice for winemaking."},{"definition":"The year or place in which something is produced."}],"partOfSpeech":"n"}]},{"word":"PREDICATED","idx":40212,"count":485103,"meanings":[{"definitions":[{"definition":"To announce, assert, or proclaim publicly."},{"definition":"To assume or suppose; to infer."},{"definition":"(originally United States) to base (on); to assert on the grounds of."},{"definition":"(grammar) To make a term (or expression) the predicate of a statement."},{"definition":"To assert or state as an attribute or quality of something."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɹɛdɪˌkeɪtəd/"}]},{"word":"PREHISTORY","idx":40218,"count":484972,"meanings":[{"definitions":[{"definition":"(properly) History before written records, inclusive of both"},{"definition":"Any past time (even recent) treated as such a distant, unknowable era."},{"definition":"(often as pre-history) The history leading up to some event, condition, etc."}],"partOfSpeech":"n"}]},{"word":"LENTILS","idx":40219,"count":484962,"meanings":[{"definitions":[{"definition":"Any of several plants of the genus Lens, especially Lens culinaris, from southwest Asia, that have edible, lens-shaped seeds within flattened pods."},{"definition":"The seed of these plants, used as food."}],"partOfSpeech":"n"}]},{"word":"HISTIDINE","idx":40220,"count":484959,"meanings":[{"definitions":[{"definition":"An essential amino acid C6H9N3O2 found in most animal proteins; essential for tissue growth and repair."}],"partOfSpeech":"n"}]},{"word":"QUACK","idx":40222,"count":484886,"meanings":[{"definitions":[{"definition":"The sound made by a duck.","example":"Did you hear that duck make a quack?"},{"definition":"A fraudulent healer or incompetent professional; especially, a doctor of medicine who makes false diagnoses or inappropriate treatment; an impostor who claims to have qualifications to practice medicine.","example":"That doctor is nothing but a lousy quack!"},{"definition":"A charlatan."},{"definition":"A doctor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a noise like a duck.","example":"Do you hear the ducks quack?"},{"definition":"To practice or commit quackery (fraudulent medicine)."},{"definition":"To make vain and loud pretensions."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Falsely presented as having medicinal powers.","example":"Don't get your hopes up; that's quack medicine!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"quack-us","text":"/kwæk/"}]},{"word":"DRAPE","idx":40223,"count":484861,"meanings":[{"definitions":[{"definition":"A curtain; a drapery."},{"definition":"The way in which fabric falls or hangs."},{"definition":"A member of a youth subculture distinguished by its sharp dress, especially peg-leg pants (1950s: e.g. Baltimore, MD). Antonym: square"},{"definition":"A dress made from an entire piece of cloth, without having pieces cut away as in a fitted garment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or adorn with drapery or folds of cloth, or as with drapery","example":"to drape a bust, a building, etc."},{"definition":"To spread over, cover.","example":"I draped my towel over the radiator to dry."},{"definition":"To rail at; to banter."},{"definition":"To make cloth."},{"definition":"To design drapery, arrange its folds, etc., as for hangings, costumes, statues, etc."},{"definition":"To hang or rest limply"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"drape-uk","text":"/dɹeɪp/"}]},{"word":"TECTONICS","idx":40224,"count":484840,"meanings":[{"definitions":[{"definition":"The study of crustal plates and other large-scale structural features of the Earth."},{"definition":"The science and art of assembling, shaping, or ornamenting materials in construction."}],"partOfSpeech":"n"}]},{"word":"DISTRIBUTIVE","idx":40226,"count":484820,"meanings":[{"definitions":[{"definition":"(grammar) distributive case"},{"definition":"(grammar) A distributive adjective or pronoun."},{"definition":"A distributive numeral."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to distribution."},{"definition":"Tending to distribute; serving to divide and assign in portions; dealing a proper share to each.","example":"distributive justice"},{"definition":"A property of functions that have a rule describing how the function can be performed to the individual components of another operation."},{"definition":"Assigning the species of a general term."},{"definition":"(grammar) Expressing separation; denoting a taking singly, not collectively.","example":"a distributive adjective or pronoun, such as \"each\", \"either\", or \"every\""}],"partOfSpeech":"j"}]},{"word":"SHARPS","idx":40227,"count":484734,"meanings":[{"definitions":[{"definition":"The symbol ♯, placed after the name of a note in the key signature or before a note on the staff to indicate that the note is to be played a semitone higher.","example":"The pitch pipe sounded out a perfect F♯ (F sharp)."},{"definition":"A note that is played a semitone higher than usual; denoted by the name of the note that is followed by the symbol ♯."},{"definition":"A note that is sharp in a particular key.","example":"The piece was difficult to read after it had been transposed, since in the new key many notes were sharps."},{"definition":"The scale having a particular sharp note as its tonic.","example":"Beethoven's \"Moonlight Sonata\" is written in C♯ minor (C sharp minor.)"},{"definition":"(usually in the plural) Something that is sharp.","example":"Place sharps in the specially marked red container for safe disposal."},{"definition":"A dishonest person; a cheater.","example":"The casino kept in the break room a set of pictures of known sharps for the bouncers to see."},{"definition":"Part of a stream where the water runs very rapidly."},{"definition":"A sewing needle with a very slender point, more pointed than a blunt or a between."},{"definition":"(in the plural) Fine particles of husk mixed with coarse particle of flour of cereals; middlings."},{"definition":"An expert."},{"definition":"A sharpie (member of Australian gangs of the 1960s and 1970s)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To raise the pitch of a note half a step making a natural note a sharp.","example":"That new musician must be tone deaf: he sharped half the notes of the song!"},{"definition":"To play tricks in bargaining; to act the sharper."},{"definition":"To sharpen."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ʃɑɹps/"}]},{"word":"GROOMS","idx":40232,"count":484582,"meanings":[{"definitions":[{"definition":"A man who is about to marry."},{"definition":"A person who cares for horses."},{"definition":"One of several officers of the English royal household, chiefly in the lord chamberlain's department.","example":"the groom of the chamber; the groom of the stole"},{"definition":"A brushing or cleaning, as of a dog or horse.","example":"Give the mare a quick groom before you take her out."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attend to one's appearance and clothing."},{"definition":"To care for (horses or other animals) by brushing and cleaning them."},{"definition":"To prepare (someone) for election or appointment."},{"definition":"To prepare (a ski slope) for skiers by packing down the snow."},{"definition":"To attempt to gain the trust of (somebody, especially a minor) with the intention of subjecting them to abusive or exploitative behaviour such as sexual abuse or human trafficking."},{"definition":"In agile software development, to review and prioritize the items in the development backlog."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɹuːmz/"}]},{"word":"DOOMSDAY","idx":40233,"count":484561,"meanings":[{"definitions":[{"definition":"The day when God is expected to judge the world; end times."},{"definition":"Judgement day; the day of the Final Judgment; any day of decisive judgement or final dissolution."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Concerned with or predicting future universal destruction."},{"definition":"Given to or marked by forebodings or predictions of impending calamity."},{"definition":"Capable of causing widespread or total destruction."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"doomsday-us","text":"/ˈduːmz.deɪ/"}]},{"word":"OTTERS","idx":40234,"count":484545,"meanings":[{"definitions":[{"definition":"An aquatic or marine carnivorous mammal in the subfamily Lutrinae of the family Mustelidae, which also includes weasels, polecats, badgers, and others."},{"definition":"A hairy man with a slender physique, in contrast with a bear, who is more thickset."}],"partOfSpeech":"n"}]},{"word":"MEWS","idx":40236,"count":484522,"meanings":[{"definitions":[{"definition":"An alley where there are stables; a narrow passage; a confined place."},{"definition":"A place where birds of prey are housed."},{"definition":"A gull, seagull."},{"definition":"A prison, or other place of confinement."},{"definition":"A hiding place; a secret store or den."},{"definition":"A breeding-cage for birds."},{"definition":"A cage for hawks, especially while moulting."},{"definition":"(in the plural) A building or set of buildings where moulting birds are kept."},{"definition":"The crying sound of a cat; a meow, especially of a kitten."},{"definition":"The crying sound of a gull."},{"definition":"An exclamation of disapproval; a boo."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shut away, confine, lock up."},{"definition":"(of a bird) To moult.","example":"The hawk mewed his feathers."},{"definition":"(of a bird) To cause to moult."},{"definition":"(of a deer) To shed antlers."},{"definition":"(of a cat, especially of a kitten) To meow."},{"definition":"To flatten the tongue against the roof of the mouth for supposed health benefits."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/mjuːz/"}]},{"word":"OUSTED","idx":40237,"count":484515,"meanings":[{"definitions":[{"definition":"To expel; to remove.","example":"The protesters became so noisy that they were finally ousted from the meeting."}],"partOfSpeech":"ve"}]},{"word":"SCARRING","idx":40238,"count":484512,"meanings":[{"definitions":[{"definition":"To mark the skin permanently."},{"definition":"To form a scar."},{"definition":"To affect deeply in a traumatic manner.","example":"Seeing his parents die in a car crash scarred him for life."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A scar; a mark."}],"partOfSpeech":"n"}]},{"word":"DAYDREAM","idx":40239,"count":484418,"meanings":[{"definitions":[{"definition":"A spontaneous and fanciful series of thoughts while awake not connected to immediate reality."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have such a series of thoughts; to woolgather.","example":"Stop daydreaming and get back to work!"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdeɪdɹiːm/"}]},{"word":"SNICKET","idx":40241,"count":484415,"meanings":[{"definitions":[{"definition":"A narrow passage or alley."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsnɪkɪt/"}]},{"word":"BICARBONATE","idx":40242,"count":484404,"meanings":[{"definitions":[{"definition":"The univalent anion HCO3-; any salt of carbonic acid in which only one of the hydrogen atoms has been replaced."},{"definition":"Sodium bicarbonate used as a mild antacid; bicarbonate of soda"}],"partOfSpeech":"n"}]},{"word":"CASK","idx":40244,"count":484364,"meanings":[{"definitions":[{"definition":"A large barrel for the storage of liquid, especially of alcoholic drinks."},{"definition":"A casket; a small box for jewels."},{"definition":"A helmet."},{"definition":"A hard structure on the head of some birds, such as the hornbill or cassowary."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put into a cask."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cask-us","text":"/kæsk/"}]},{"word":"GROCER","idx":40246,"count":484332,"meanings":[{"definitions":[{"definition":"A person who retails groceries (foodstuffs and household items) from a grocery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sell groceries; to act as a grocer."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡɹoʊ.səɹ/"},{"text":"/ˈɡɹəʊ.sə/"}]},{"word":"DIETITIAN","idx":40247,"count":484287,"meanings":[{"definitions":[{"definition":"A person who studies or practices dietetics."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/daɪəˈtɪʃən/"}]},{"word":"SPEEDILY","idx":40248,"count":484268,"meanings":[{"definitions":[{"definition":"In a speedy or fast manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈspiːdɪli/"}]},{"word":"AUBERGE","idx":40251,"count":484164,"meanings":[{"definitions":[{"definition":"An inn or hostel."}],"partOfSpeech":"n"}]},{"word":"NEGROES","idx":40252,"count":484146,"meanings":[{"definitions":[{"definition":"A black person; a person of sub-Saharan African descent."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈniɡɹoʊz/"},{"text":"/ˈniːɡɹəʊz/"}]},{"word":"PAPRIKA","idx":40253,"count":484128,"meanings":[{"definitions":[{"definition":"Powdered spice made from dried and ground fruits of sweet pepper (bell pepper) or chili pepper (cultivars of Capsicum annuum), or mixtures of these (used especially in Hungarian cooking)."},{"definition":"A variety of the spice."},{"definition":"(rare, commonly called \"dried [bell/chilli] peppers\" or \"dried capsicums\") A dried but not yet ground fruit of sweet pepper (bell pepper) or chili pepper sold for use as a spice."},{"definition":"A bright reddish orange colour resembling that of the ground spice."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a bright reddish orange colour, like that of the dried paprika."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pæpˈɹiːkə/"},{"text":"/pəˈpɹiːkə/"}]},{"word":"CHASES","idx":40254,"count":484101,"meanings":[{"definitions":[{"definition":"The act of one who chases another; a pursuit."},{"definition":"A hunt."},{"definition":"A children's game where one player chases another."},{"definition":"A large country estate where game may be shot or hunted."},{"definition":"Anything being chased, especially a vessel in time of war."},{"definition":"A wild animal that is hunted."},{"definition":"Any of the guns that fire directly ahead or astern; either a bow chase or stern chase."},{"definition":"(real tennis) The occurrence of a second bounce by the ball in certain areas of the court, giving the server the chance, later in the game, to \"play off\" the chase from the receiving end and possibly win the point."},{"definition":"(real tennis) A division of the floor of a gallery, marked by a figure or otherwise; the spot where a ball falls, and between which and the dedans the adversary must drive the ball in order to gain a point."},{"definition":"One or more riders who are ahead of the peloton and trying to join the race or stage leaders."},{"definition":"A rectangular steel or iron frame into which pages or columns of type are locked for printing or plate-making."},{"definition":"A groove cut in an object; a slot: the chase for the quarrel on a crossbow."},{"definition":"A trench or channel or other encasement structure for encasing (archaically spelled enchasing) drainpipes or wiring; a hollow space in the wall of a building encasing ventilation ducts, chimney flues, wires, cables or plumbing."},{"definition":"The part of a gun in front of the trunnions."},{"definition":"The cavity of a mold."},{"definition":"A kind of joint by which an overlap joint is changed to a flush joint by means of a gradually deepening rabbet, as at the ends of clinker-built boats."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pursue."},{"definition":"To consume another beverage immediately after drinking hard liquor, typically something better tasting or less harsh such as soda or beer; to use a drink as a chaser","example":"I need something to chase this shot with."},{"definition":"To attempt to win by scoring the required number of runs in the final innings.","example":"Australia will be chasing 217 for victory on the final day."},{"definition":"To swing at a pitch outside of the strike zone, typically an outside pitch"},{"definition":"To produce enough offense to cause the pitcher to be removed","example":"The rally chased the starter."},{"definition":"To groove; indent."},{"definition":"To place piping or wiring in a groove encased within a wall or floor, or in a hidden space encased by a wall.","example":"chase the pipe"},{"definition":"To cut (the thread of a screw)."},{"definition":"To decorate (metal) by engraving or embossing."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtʃeɪsɪz/"}]},{"word":"INTERVENED","idx":40256,"count":484086,"meanings":[{"definitions":[{"definition":"To become involved in a situation, so as to alter or prevent an action.","example":"The police had to be called to intervene in the fight."},{"definition":"To occur, fall, or come between, points of time, or events.","example":"An instant intervened between the flash and the report."},{"definition":"To occur or act as an obstacle or delay.","example":"Nothing intervened to prevent the undertaking."},{"definition":"To say (something) in the middle of a conversation or discussion between other people, or to respond to a situation involving other people."},{"definition":"To come between, or to be between, persons or things.","example":"The Mediterranean intervenes between Europe and Africa."},{"definition":"In a suit to which one has not been made a party, to put forward a defense of one's interest in the subject matter.","example":"an application for leave (i.e. permission) to intervene"}],"partOfSpeech":"ve"}]},{"word":"DISALLOWED","idx":40261,"count":483932,"meanings":[{"definitions":[{"definition":"To refuse to allow","example":"The prisoners were disallowed to contact with a lawyer."},{"definition":"To reject as invalid, untrue, or improper","example":"The goal was disallowed because the player was offside."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Forbidden"},{"definition":"Invalid"}],"partOfSpeech":"j"}]},{"word":"RESOURCING","idx":40267,"count":483845,"meanings":[{"definitions":[{"definition":"The provision of resources."}],"partOfSpeech":"n"}]},{"word":"MEZZO","idx":40269,"count":483806,"meanings":[{"definitions":[{"definition":"Mezzo-soprano"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɛdzoʊ/"},{"text":"/ˈmɛdzəʊ/"}]},{"word":"INCARNATE","idx":40275,"count":483674,"meanings":[{"definitions":[{"definition":"Embodied in flesh; given a bodily, especially a human, form; personified."},{"definition":"Flesh-colored, crimson."},{"definition":"Not in the flesh; spiritual."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To embody in flesh, invest with a bodily, especially a human, form."},{"definition":"To incarn; to become covered with flesh, to heal over.","example":"1760: My uncle Toby’s wound was near well, and as soon as the surgeon recovered his surprize, and could get leave to say as much—he told him, 'twas just beginning to incarnate — Laurence Sterne, The Life & Opinions of Tristram Shandy, Gentleman (Penguin 2003, p. 83)"},{"definition":"To make carnal; to reduce the spiritual nature of."},{"definition":"To put into or represent in a concrete form, as an idea."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"incarnate-1-uk","text":"/ɪnˈkɑːneɪt/"}]},{"word":"CHIMNEYS","idx":40276,"count":483644,"meanings":[{"definitions":[{"definition":"A vertical tube or hollow column used to emit environmentally polluting gaseous and solid matter (including but not limited to by-products of burning carbon or hydrocarbon based fuels); a flue."},{"definition":"The glass flue surrounding the flame of an oil lamp."},{"definition":"The smokestack of a steam locomotive."},{"definition":"A narrow cleft in a rock face; a narrow vertical cave passage."}],"partOfSpeech":"n"}]},{"word":"NOVELLA","idx":40278,"count":483623,"meanings":[{"definitions":[{"definition":"A work of prose fiction, longer than a novella."},{"definition":"A fable; a short tale, especially one of many making up a larger work."},{"definition":"A novelty; something new."},{"definition":"A new legal constitution in ancient Rome."},{"definition":"A short novel or long short story."}],"partOfSpeech":"n"}]},{"word":"PREOCCUPIED","idx":40279,"count":483610,"meanings":[{"definitions":[{"definition":"Concerned with something else; distracted; giving one's attention elsewhere.","example":"I was preoccupied with a deadline at work, and I forgot his birthday."},{"definition":"Describing a scientific name that was previously used, a junior homonym."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To distract; to occupy or draw attention elsewhere.","example":"The father tried to preoccupy the child with his keys."},{"definition":"To occupy or take possession of beforehand."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"preoccupied-us"}]},{"word":"BRIE","idx":40280,"count":483604,"meanings":[{"definitions":[{"definition":"A variety of soft, mild French cheese made from cow's milk."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"brie-us","text":"/bɹiː/"}]},{"word":"HITHER","idx":40281,"count":483579,"meanings":[{"definitions":[{"definition":"On this side; the nearer.","example":"1954, The essential Not-self could be perceived very clearly in things and in living creatures on the hither side of good and evil. — Aldous Huxley, The Doors of Perception (Chatto & Windus 1954, p. 30)"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To this place, to here.","example":"He went hither and thither."},{"definition":"Over here"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"hither-us","text":"/ˈhɪðɚ/"}]},{"word":"DIGGERS","idx":40282,"count":483579,"meanings":[{"definitions":[{"definition":"A large piece of machinery that digs holes or trenches; an excavator."},{"definition":"A tool for digging."},{"definition":"A spade (playing card)."},{"definition":"One who digs."},{"definition":"A gold miner, one who digs for gold."},{"definition":"An informal nickname for a friend; used as a term of endearment."},{"definition":"An Australian soldier."}],"partOfSpeech":"n"}]},{"word":"GLANCES","idx":40283,"count":483569,"meanings":[{"definitions":[{"definition":"A brief or cursory look."},{"definition":"A deflection."},{"definition":"A stroke in which the ball is deflected to one side."},{"definition":"A sudden flash of light or splendour."},{"definition":"An incidental or passing thought or allusion."},{"definition":"Any of various sulphides, mostly dark-coloured, which have a brilliant metallic lustre.","example":"copper glance"},{"definition":"Glance coal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look briefly (at something).","example":"She glanced at her reflection as she passed the mirror."},{"definition":"To graze a surface."},{"definition":"To sparkle.","example":"The spring sunlight was glancing on the water of the pond."},{"definition":"To move quickly, appearing and disappearing rapidly; to be visible only for an instant at a time; to move interruptedly; to twinkle."},{"definition":"To strike and fly off in an oblique direction; to dart aside."},{"definition":"To hit lightly with the head, make a deft header."},{"definition":"To make an incidental or passing reflection; to allude; to hint; often with at."},{"definition":"A type of interaction between parent fish and offspring in which juveniles swim toward and rapidly touch the sides of the parent, in most cases feeding on parental mucus. Relatively few species glance, mainly some Cichlidae."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"glances-us","text":"/ˈɡlænsɪz/"}]},{"word":"SILOS","idx":40285,"count":483560,"meanings":[{"definitions":[{"definition":"A vertical building, usually cylindrical, used for the production of silage."},{"definition":"From the shape, a building used for the storage of grain."},{"definition":"An underground bunker used to hold missiles which may be launched."},{"definition":"An organizational unit that has poor interaction with other units, negatively affecting overall performance."},{"definition":"(informatics) A structure in the information system that is poorly networked with other structures, with data exchange hampered.","example":"Our networking is organized in silos, and employees lose time manually transferring data."},{"definition":"A self-enclosed group of like-minded individuals."}],"partOfSpeech":"n"}]},{"word":"TYRANTS","idx":40286,"count":483557,"meanings":[{"definitions":[{"definition":"A usurper; one who gains power and rules extralegally, distinguished from kings elevated by election or succession."},{"definition":"Any monarch or governor."},{"definition":"A despot; a ruler who governs unjustly, cruelly, or harshly."},{"definition":"(by extension) Any person who abuses the power of position or office to treat others unjustly, cruelly, or harshly."},{"definition":"(by extension) A villain; a person or thing who uses strength or violence to treat others unjustly, cruelly, or harshly."},{"definition":"The tyrant bird, members of the family Tyrannidae, which often fight or drive off other birds which approach their nests."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act like a tyrant; to be tyrannical."},{"definition":"To tyrannize."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tyrants-us"}]},{"word":"SHORTSTOP","idx":40289,"count":483444,"meanings":[{"definitions":[{"definition":"The infield defensive player that stands between the second baseman and the third baseman.","example":"The shortstop ranged deep into the hole to make the stop."},{"definition":"A nimble defender.","example":"I'll play shortstop when we make our proposal."},{"definition":"A player who is short of money."}],"partOfSpeech":"n"}]},{"word":"GIDDY","idx":40290,"count":483433,"meanings":[{"definitions":[{"definition":"To make dizzy or unsteady."},{"definition":"To reel; to whirl."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Dizzy, feeling dizzy or unsteady and as if about to fall down.","example":"The man became giddy upon standing up so fast."},{"definition":"Causing dizziness: causing dizziness or a feeling of unsteadiness.","example":"They climbed to a giddy height."},{"definition":"Lightheartedly silly, or joyfully elated.","example":"The boy was giddy when he opened his birthday presents."},{"definition":"Frivolous, impulsive, inconsistent, changeable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"giddy-us","text":"/ɡɪdi/"}]},{"word":"DENOUNCE","idx":40291,"count":483368,"meanings":[{"definitions":[{"definition":"To make known in a formal manner; to proclaim; to announce; to declare."},{"definition":"To criticize or speak out against (someone or something); to point out as deserving of reprehension, etc.; to openly accuse or condemn in a threatening manner; to invoke censure upon; to stigmatize; to blame.","example":"to denounce someone as a swindler, or as a coward"},{"definition":"To make a formal or public accusation against; to inform against; to accuse.","example":"to denounce a confederate in crime"},{"definition":"To proclaim in a threatening manner; to threaten by some outward sign or expression; make a menace of.","example":"to denounce war; to denounce punishment"},{"definition":"To announce the termination of; especially a treaty or armistice."},{"definition":"To claim the right of working a mine that is abandoned or insufficiently worked."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"denounce-us","text":"/diˈnaʊns/"},{"audio":"denounce-uk","text":"/diˈnaʊns/"},{"audio":"denounce-au","text":"/diˈnaʊns/"}]},{"word":"ENTERTAINMENTS","idx":40293,"count":483325,"meanings":[{"definitions":[{"definition":"An activity designed to give pleasure, enjoyment, diversion, amusement, or relaxation to an audience, no matter whether the audience participates passively as in watching opera or a movie, or actively as in games."},{"definition":"A show put on for the enjoyment or amusement of others."},{"definition":"Maintenance or support."},{"definition":"Admission into service; service."},{"definition":"Payment of soldiers or servants; wages."},{"definition":"Reception; (provision of) food to guests or travellers."}],"partOfSpeech":"n"}]},{"word":"PERMISSIVE","idx":40295,"count":483200,"meanings":[{"definitions":[{"definition":"Giving permission, or predisposed to give it; lenient"},{"definition":"(of a footpath) open to the public by permission of the landowner"},{"definition":"That allows the replication of viruses"}],"partOfSpeech":"j"}]},{"word":"DISPOSABLES","idx":40301,"count":483091,"meanings":[{"definitions":[{"definition":"Any object that is designed to be disposed of rather than refilled or repaired."}],"partOfSpeech":"n"}]},{"word":"OATHS","idx":40302,"count":483079,"meanings":[{"definitions":[{"definition":"A solemn pledge or promise, appealing to a deity, a ruler, or another entity (not necessarily present) to attest to the truth of a statement or sincerity of one's desire to fulfill a contract or promise."},{"definition":"A statement or promise which is strengthened (affirmed) by such a pledge.","example":"After taking the oath of office, she became the country's forty-third premier."},{"definition":"A light, irreverent or insulting appeal to a deity or other entity."},{"definition":"A curse, a curse word."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pledge."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/oʊðz/"},{"text":"/əʊðz/"}]},{"word":"ESTROGENS","idx":40303,"count":483072,"meanings":[{"definitions":[{"definition":"Any of a group of steroids that are secreted by the ovaries and function as female sex hormones."}],"partOfSpeech":"n"}]},{"word":"RIPPLES","idx":40305,"count":483042,"meanings":[{"definitions":[{"definition":"A moving disturbance, or undulation, in the surface of a fluid.","example":"I dropped a small stone into the pond and watched the ripples spread."},{"definition":"A sound similar to that of undulating water."},{"definition":"A style of ice cream in which flavors have been coarsely blended together.","example":"I enjoy fudge ripple ice cream, but I especially like to dig through the carton to get at the ripple part and eat only that."},{"definition":"A small oscillation of an otherwise steady signal."},{"definition":"An implement, with teeth like those of a comb, for removing the seeds and seed vessels from flax, broom corn, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move like the undulating surface of a body of water; to undulate."},{"definition":"To propagate like a moving wave."},{"definition":"To make a sound as of water running gently over a rough bottom, or the breaking of ripples on the shore."},{"definition":"To shape into a series of ripples."},{"definition":"To launch or unleash in rapid succession."},{"definition":"To scratch, tear, or break slightly; graze"},{"definition":"To remove the seeds from (the stalks of flax, etc.), by means of a ripple."}],"partOfSpeech":"ve"}]},{"word":"BLOODSHED","idx":40310,"count":482924,"meanings":[{"definitions":[{"definition":"The shedding or spilling of blood."},{"definition":"A slaughter; destruction of life, notably on a large scale."},{"definition":"The shedding of one's own blood; specifically, the death of Christ."},{"definition":"A bloodshot condition or appearance; an effusion of blood in the eye."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bloodshed-us","text":"/ˈblʌdˌʃɛd/"}]},{"word":"MAW","idx":40311,"count":482918,"meanings":[{"definitions":[{"definition":"The stomach, especially of an animal."},{"definition":"The upper digestive tract (where food enters the body), especially the mouth and jaws of a fearsome and ravenous creature."},{"definition":"Any large, insatiable or perilous opening."},{"definition":"Appetite; inclination."},{"definition":"Mother."},{"definition":"A gull."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"maw-uk","text":"/mɔː/"}]},{"word":"ODOMETER","idx":40314,"count":482886,"meanings":[{"definitions":[{"definition":"An instrument attached to the wheel of a vehicle, to measure the distance traveled."},{"definition":"A wheel used by surveyors, which registers distance traveled."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əʊˈdɒmətə/"},{"text":"/oʊˈdɑːmətɚ/"}]},{"word":"TOOLTIP","idx":40315,"count":482873,"meanings":[{"definitions":[{"definition":"An element of a graphical user interface in the form of a box of text that appears when a cursor is made to hover over an item; normally used to explain the function of the item."}],"partOfSpeech":"n"}]},{"word":"UPSETTING","idx":40316,"count":482854,"meanings":[{"definitions":[{"definition":"To make (a person) angry, distressed, or unhappy.","example":"I’m sure the bad news will upset him, but he needs to know."},{"definition":"To disturb, disrupt or adversely alter (something).","example":"Introducing a foreign species can upset the ecological balance."},{"definition":"To tip or overturn (something)."},{"definition":"To defeat unexpectedly.","example":"Truman upset Dewey in the 1948 US presidential election."},{"definition":"To be upset or knocked over.","example":"The carriage upset when the horse bolted."},{"definition":"To set up; to put upright."},{"definition":"To thicken and shorten, as a heated piece of iron, by hammering on the end."},{"definition":"To shorten (a tire) in the process of resetting, originally by cutting it and hammering on the ends."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb upset."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing upset; distressing.","example":"He found taking his cat to the vet to be put down very upsetting."},{"definition":"Conceited; presumptuous."}],"partOfSpeech":"j"}]},{"word":"DRUIDS","idx":40320,"count":482755,"meanings":[{"definitions":[{"definition":"One of an order of priests among certain groups of Celts before the adoption of Abrahamic religions."}],"partOfSpeech":"n"}]},{"word":"AGGREGATORS","idx":40321,"count":482746,"meanings":[{"definitions":[{"definition":"Someone or something which aggregates"},{"definition":"An online feed reader used to keep track of updates to blogs, etc."}],"partOfSpeech":"n"}]},{"word":"OXEN","idx":40327,"count":482660,"meanings":[{"definitions":[{"definition":"An adult castrated male of cattle (B. taurus)."},{"definition":"Any bovine animal (genus Bos). A neat, a beef."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or resembling an ox; oxlike"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"oxen-us","text":"/ˈɑksən/"}]},{"word":"GRIDDLE","idx":40332,"count":482453,"meanings":[{"definitions":[{"definition":"A stone or metal flat plate or surface on which food is fried or baked."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a griddle, cook on a griddle"}],"partOfSpeech":"ve"}]},{"word":"NASCENT","idx":40333,"count":482442,"meanings":[{"definitions":[{"definition":"Emerging; just coming into existence."},{"definition":"Describing a quantity of object that is starting to grow from zero or an infinitesimal beginning. Also the creation or identification of an infinitesimal delta."},{"definition":"Describing the state, aspect, or practice of an abstract concept."},{"definition":"Of the state of an element at the time it is being generated from some compound or transitioning from one state to another; Newly released from a compound (especially hydrogen and oxygen) by a chemical reaction or electrolysis and possessing heightened reactivity; Newly synthesized (especially protein or RNA) by translation or transcription."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"nascent-us","text":"/ˈneɪ.sənt/"}]},{"word":"PRICELIST","idx":40334,"count":482433,"meanings":[{"definitions":[{"definition":"A list of items for sale with their prices."}],"partOfSpeech":"n"}]},{"word":"MULTIPLIERS","idx":40338,"count":482324,"meanings":[{"definitions":[{"definition":"A number by which another (the multiplicand) is to be multiplied.","example":"In the expression 5 × 7, the \"5\" is a multiplier."},{"definition":"(grammar) An adjective indicating the number of times something is to be multiplied.","example":"English multipliers include \"double\" and \"triple\"."},{"definition":"A ratio used to estimate total economic effect for a variety of economic activities."},{"definition":"Any of several devices used to enhance a signal"},{"definition":"A multiplier onion."}],"partOfSpeech":"n"}]},{"word":"REINFORCEMENTS","idx":40339,"count":482320,"meanings":[{"definitions":[{"definition":"The act, process, or state of reinforcing or being reinforced."},{"definition":"A thing that reinforces."},{"definition":"(in the plural) Additional troops or materiel sent to support a military action."},{"definition":"The process whereby a behavior with desirable consequences comes to be repeated."}],"partOfSpeech":"n"}]},{"word":"APARTHOTEL","idx":40340,"count":482277,"meanings":[{"definitions":[{"definition":"A form of hotel having self-catering apartments instead of bedrooms or suites."}],"partOfSpeech":"n"}]},{"word":"PRECEPT","idx":40341,"count":482252,"meanings":[{"definitions":[{"definition":"A rule or principle, especially one governing personal conduct."},{"definition":"A written command, especially a demand for payment."},{"definition":"An order issued by one local authority to another specifying the rate of tax to be charged on its behalf."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To teach by precepts."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɹiːsɛpt/"}]},{"word":"KITESURFING","idx":40342,"count":482245,"meanings":[{"definitions":[{"definition":"To take part in kitesurfing."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A type of kiteboarding that happens in the water, where the rider is on a surfboard and is propelled by a power kite."}],"partOfSpeech":"n"}]},{"word":"PAVEMENTS","idx":40344,"count":482193,"meanings":[{"definitions":[{"definition":"(now chiefly in technical contexts) A paved surface; a hard covering on the ground."},{"definition":"The paved part of a road or other thoroughfare; the roadway."},{"definition":"A paved footpath, especially at the side of a road."},{"definition":"The interior flooring of a church sanctuary, between the communion rail and the altar."}],"partOfSpeech":"n"}]},{"word":"COUPLERS","idx":40345,"count":482193,"meanings":[{"definitions":[{"definition":"Someone who couples things together, especially someone whose job it is to couple railway carriages."},{"definition":"Anything that serves to couple things together; but especially a device that couples railway carriages."},{"definition":"A device that connects two keyboards of an organ together so that they play together."},{"definition":"A device used to convert electronic information into audible sound signals for transmission over telephone lines."},{"definition":"An electrical device used to transfer energy from one electric device to another, especially without a physical connection."}],"partOfSpeech":"n"}]},{"word":"AFTERSHAVES","idx":40346,"count":482193,"meanings":[{"definitions":[{"definition":"A lotion, gel, or liquid used after finishing shaving"}],"partOfSpeech":"n"}]},{"word":"MURMURED","idx":40347,"count":482182,"meanings":[{"definitions":[{"definition":"To grumble; to complain in a low, muttering voice, or express discontent at or against someone or something."},{"definition":"To speak or make low, indistinguishable noise; to mumble, mutter.","example":"I couldn't hear the words; he just murmured a lot."},{"definition":"To say (something) indistinctly, to mutter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"murmured-us","text":"/ˈmɝ.mɚd/"}]},{"word":"REHABILITATE","idx":40348,"count":482177,"meanings":[{"definitions":[{"definition":"To restore (someone) to their former state, reputation, possessions, status etc."},{"definition":"To vindicate; to restore the reputation or image of (a person, concept etc.)."},{"definition":"To return (something) to its original condition."},{"definition":"To restore or repair (a vehicle, building); to make habitable or usable again."},{"definition":"To restore to (a criminal etc.) the necessary training and education to allow for a successful reintegration into society; to retrain."},{"definition":"To return (someone) to good health after illness, addiction etc."},{"definition":"To go through such a process; to recover."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiː(h)əˈbɪlɪteɪt/"}]},{"word":"PATINA","idx":40349,"count":482158,"meanings":[{"definitions":[{"definition":"A paten, flat type of dish"},{"definition":"The colour or incrustation which age and wear give to (mainly metallic) objects; especially, the green rust which covers works of art such as ancient bronzes, coins and medals."},{"definition":"A green colour, tinted with grey, like that of bronze patina."},{"definition":"A gloss or superficial layer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a green colour, tinted with grey, like that of bronze patina."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pəˈtiː.nə/"},{"text":"/ˈpætɪnə/"}]},{"word":"PROPELLERS","idx":40350,"count":482155,"meanings":[{"definitions":[{"definition":"One who, or that which, propels."},{"definition":"A mechanical device with evenly-shaped blades that turn on a shaft to push against air or water, especially one used to propel an aircraft or boat."},{"definition":"A steamboat thus propelled; a screw steamer."},{"definition":"A spinnerbait."}],"partOfSpeech":"n"}]},{"word":"VIOLINIST","idx":40354,"count":482034,"meanings":[{"definitions":[{"definition":"A person who plays the violin"}],"partOfSpeech":"n"}]},{"word":"PHONOLOGY","idx":40355,"count":482020,"meanings":[{"definitions":[{"definition":"The study of the way sounds function in languages, including phonemes, syllable structure, stress, accent, intonation, and which sounds are distinctive units within a language."},{"definition":"The way sounds function within a given language; a phonological system."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fəˈnɑlədʒi/"},{"text":"/fəˈnɒlədʒi/"}]},{"word":"PLASMODIUM","idx":40358,"count":481965,"meanings":[{"definitions":[{"definition":"A mass of cytoplasm, containing many nuclei, created by the aggregation of amoeboid cells of slime molds during their vegetative phase. When capitalised as a proper name, Plasmodium is a genus of protozoan parasites responsible for such diseases as malaria"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/plazˈməʊdɪəm/"}]},{"word":"GIBBON","idx":40360,"count":481964,"meanings":[{"definitions":[{"definition":"A small ape of the family Hylobatidae with long limbs, which it uses to travel through rainforests by swinging from branch to branch."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɪbən/"}]},{"word":"GRATIFYING","idx":40361,"count":481958,"meanings":[{"definitions":[{"definition":"To please."},{"definition":"To make content; to satisfy."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gratifying-us","text":"/ˈɡrætɪfaɪ.ɪŋ/"}]},{"word":"BUMS","idx":40362,"count":481923,"meanings":[{"definitions":[{"definition":"The buttocks.","example":"Okay, everyone sit on your bum and try and touch your toes."},{"definition":"The anus."},{"definition":"(sometimes derogatory) A homeless person, usually a man."},{"definition":"A lazy, incompetent, or annoying person, usually a man.","example":"Fred is becoming a bum - he's not even bothering to work more than once a month."},{"definition":"A player or racer who often performs poorly.","example":"Trade him to another team, he's a bum!"},{"definition":"A drinking spree."},{"definition":"A humming noise."},{"definition":"A bumbailiff."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sodomize; to engage in anal sex."},{"definition":"To ask someone to give one (something) for free; to beg for something.","example":"Can I bum a cigarette off you?"},{"definition":"To stay idle and unproductive, like a hobo or vagabond; to loiter.","example":"I think I'll just bum around downtown for awhile until dinner."},{"definition":"To wet the end of a marijuana cigarette (spliff)."},{"definition":"To depress; to make unhappy."},{"definition":"To make a murmuring or humming sound."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bʌmz/"}]},{"word":"UNDERSEA","idx":40363,"count":481909,"meanings":[{"definitions":[{"definition":"Existing, relating to, or made for use beneath the sea."}],"partOfSpeech":"j"}]},{"word":"DELIRIOUS","idx":40370,"count":481853,"meanings":[{"definitions":[{"definition":"Being in the state of delirium."},{"definition":"Having uncontrolled excitement; ecstatic."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈlɪəɹɪəs/"}]},{"word":"EXCEPTING","idx":40371,"count":481850,"meanings":[{"definitions":[{"definition":"To exclude; to specify as being an exception."},{"definition":"To take exception, to object (to or against).","example":"to except to a witness or his testimony"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"With the exception of","example":"Nothing was to be sacrosanct or sacred, excepting reason itself."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"excepting-us","text":"/ɪkˈsɛptɪŋ/"}]},{"word":"UNLAWFULLY","idx":40372,"count":481827,"meanings":[{"definitions":[{"definition":"In a manner not conforming to the law.","example":"The deceased was unlawfully killed during a riot."}],"partOfSpeech":"v"}]},{"word":"VANADIUM","idx":40373,"count":481800,"meanings":[{"definitions":[{"definition":"A chemical element (symbol V) with atomic number 23; it is a transition metal, used in the production of special steels."},{"definition":"A single atom of this element."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vanadium-us","text":"/vəˈneɪdi.əm/"}]},{"word":"RIVERBOAT","idx":40375,"count":481694,"meanings":[{"definitions":[{"definition":"A watercraft designed for operating on rivers."}],"partOfSpeech":"n"}]},{"word":"URCHIN","idx":40379,"count":481596,"meanings":[{"definitions":[{"definition":"A mischievous child."},{"definition":"A street urchin, a child who lives, or spends most of their time, in the streets."},{"definition":"A sea urchin."},{"definition":"One of a pair in a series of small card cylinders arranged around a carding drum; so called from its fancied resemblance to the hedgehog."},{"definition":"A neutron-generating device that triggered the nuclear detonation of the earliest plutonium atomic bombs."},{"definition":"A hedgehog."},{"definition":"A mischievous elf supposed sometimes to take the form of a hedgehog."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"urchin-us","text":"/ˈɝtʃən/"}]},{"word":"POLYGAMY","idx":40384,"count":481475,"meanings":[{"definitions":[{"definition":"The condition of having more than one spouse or marriage partner at one time.","example":"Are there countries where polygamy is legal for both men and women?"},{"definition":"The state or habit of having more than one sexual mate.","example":"An insect queen actually practices polygamy only one day, while for an alpha-male defending his harem is the very essence of both his status and polygamy."},{"definition":"The condition or state of a plant which bears both perfect and unisexual flowers."},{"definition":"The state or practice of having several wives at the same time; plurality of wives; marriage to several wives."},{"definition":"The condition of an ant colony that has multiple egg-laying queens."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"polygamy-us","text":"/pəˈlɪɡəmi/"}]},{"word":"GYNECOLOGIC","idx":40386,"count":481401,"meanings":[{"definitions":[{"definition":"Gynecological"}],"partOfSpeech":"j"}]},{"word":"UNSTOPPABLE","idx":40387,"count":481395,"meanings":[{"definitions":[{"definition":"Unable to be stopped.","example":"King Hrothgar thought that Grendel was unstoppable."}],"partOfSpeech":"j"}]},{"word":"PEDOMETER","idx":40388,"count":481386,"meanings":[{"definitions":[{"definition":"A device, often electronic, that measures the number of steps taken, and thus estimates the distance walked.","example":"He thought that buying a pedometer would spur him on to exercise."},{"definition":"Device used to measure the weight and height of a child"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɪˈdɑː.mə.t̬ɚ/"}]},{"word":"UTTERANCES","idx":40389,"count":481384,"meanings":[{"definitions":[{"definition":"An act of uttering."},{"definition":"Something spoken."},{"definition":"The ability to speak."},{"definition":"A manner of speaking.","example":"He has a good utterance."},{"definition":"A sale made by offering to the public."},{"definition":"An act of putting in circulation.","example":"the utterance of false coin, or of forged notes"},{"definition":"The utmost extremity (of a fight etc.)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʌtəɹənsəz/"}]},{"word":"DEVISING","idx":40390,"count":481378,"meanings":[{"definitions":[{"definition":"To use one's intellect to plan or design (something).","example":"to devise an argument; to devise a machine, or a new system of writing"},{"definition":"To leave (property) in a will."},{"definition":"To form a scheme; to lay a plan; to contrive; to consider."},{"definition":"To plan or scheme for; to plot to obtain."},{"definition":"To imagine; to guess."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of creating a plan or some object, especially a will"}],"partOfSpeech":"n"}]},{"word":"SHORTFALLS","idx":40391,"count":481355,"meanings":[{"definitions":[{"definition":"An instance of not meeting a quota, debt, or monthly payment on a debt or other obligation, or of having an insufficient amount to cover such obligations.","example":"Due to a shortfall in revenue, we will have to make some cuts."},{"definition":"The amount by which a quota, debt, or monthly payment on a debt or other obligation is missed; the difference between the actual quota or debt and the lesser amount available to pay such obligations."}],"partOfSpeech":"n"}]},{"word":"BOOKMARKING","idx":40393,"count":481351,"meanings":[{"definitions":[{"definition":"To create a bookmark."}],"partOfSpeech":"ve"}]},{"word":"SUSTAINS","idx":40396,"count":481307,"meanings":[{"definitions":[{"definition":"A mechanism which can be used to hold a note, as the right pedal on a piano."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To maintain, or keep in existence.","example":"The city came under sustained attack by enemy forces."},{"definition":"To provide for or nourish.","example":"provisions to sustain an army"},{"definition":"To encourage or sanction (something)."},{"definition":"To experience or suffer (an injury, etc.).","example":"The building sustained major damage in the earthquake."},{"definition":"To confirm, prove, or corroborate; to uphold.","example":"to sustain a charge, an accusation, or a proposition"},{"definition":"To keep from falling; to bear; to uphold; to support.","example":"A foundation sustains the superstructure; an animal sustains a load; a rope sustains a weight."},{"definition":"To aid, comfort, or relieve; to vindicate."}],"partOfSpeech":"ve"}]},{"word":"BARBERSHOP","idx":40399,"count":481271,"meanings":[{"definitions":[{"definition":"The place of business of a barber; a store where a person (usually a man) can go to get a haircut."},{"definition":"A style of a capella vocal music, sung in four-part harmony, typically by a quartet of men."}],"partOfSpeech":"n"}]},{"word":"WOODMAN","idx":40400,"count":481163,"meanings":[{"definitions":[{"definition":"Someone who hunts animals in a wood, hunter, huntsman."},{"definition":"Someone who cuts down trees or cuts and sells wood, lumberjack, woodcutter."},{"definition":"Someone who lives in the wood and manages it; a woodsman; (by extension) someone who spends time in the woods and has a strong familiarity with that environment."},{"definition":"Someone who lives in the woods and is considered to be uncivilized or barbaric, a savage."},{"definition":"Someone who makes things from wood."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwʊdmən/"}]},{"word":"GRAVELY","idx":40401,"count":481149,"meanings":[{"definitions":[{"definition":"In a grave or serious manner."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Characterised by gravel, pebbles, or small stones."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gravely-1-us","text":"/ˈɡɹeɪvli/"}]},{"word":"IDIOSYNCRATIC","idx":40403,"count":480972,"meanings":[{"definitions":[{"definition":"Peculiar to a specific individual; eccentric."}],"partOfSpeech":"j"}]},{"word":"ERRANDS","idx":40405,"count":480940,"meanings":[{"definitions":[{"definition":"A journey undertaken to accomplish some task."},{"definition":"The purpose of such a journey."},{"definition":"An oral message trusted to a person for delivery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send someone on an errand.","example":"All the servants were on holiday or erranded out of the house."},{"definition":"To go on an errand.","example":"She spent an enjoyable afternoon erranding in the city."}],"partOfSpeech":"ve"}]},{"word":"FLOPPIES","idx":40407,"count":480859,"meanings":[{"definitions":[{"definition":"A floppy disk."},{"definition":"(Rhodesia) An insurgent in the Rhodesian Bush War, called as such for the way they \"flop\" when shot."},{"definition":"A comic book."}],"partOfSpeech":"n"}]},{"word":"CARTES","idx":40410,"count":480824,"meanings":[{"definitions":[{"definition":"A bill of fare; a menu."},{"definition":"A visiting card."},{"definition":"A carte de visite (small collectible photograph of a famous person)."},{"definition":"A playing card."},{"definition":"The fourth defensive position, with the sword hand held at chest height, and the tip of the sword at neck height, the palm of the hand facing upwards."}],"partOfSpeech":"n"}]},{"word":"KILOWATT","idx":40414,"count":480723,"meanings":[{"definitions":[{"definition":"One thousand (103) watts."}],"partOfSpeech":"n"}]},{"word":"IMPULSIVE","idx":40415,"count":480686,"meanings":[{"definitions":[{"definition":"That which impels or gives an impulse; an impelling agent."},{"definition":"One whose behaviour or personality is characterized by being impulsive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the power of driving or impelling; giving an impulse; moving; impellent."},{"definition":"Actuated by impulse or by transient feelings; inclined to make rapid decisions without due consideration."},{"definition":"Acting momentarily, or by impulse; not continuous – said of forces."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"impulsive-uk","text":"/ɪmˈpʌlsɪv/"}]},{"word":"SPASMS","idx":40420,"count":480606,"meanings":[{"definitions":[{"definition":"A sudden, involuntary contraction of a muscle, a group of muscles, or a hollow organ."},{"definition":"A violent, excruciating seizure of pain."},{"definition":"A sudden and temporary burst of energy, activity, or emotion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce and undergo a spasm."}],"partOfSpeech":"ve"}]},{"word":"MOPS","idx":40421,"count":480596,"meanings":[{"definitions":[{"definition":"An implement for washing floors, or the like, made of a piece of cloth, or a collection of thrums, or coarse yarn, fastened to a handle."},{"definition":"A wash with a mop; the act of mopping","example":"He gave the floor a quick mop to soak up the spilt juice."},{"definition":"A dense head of hair.","example":"He ran a comb through his mop and hurried out the door."},{"definition":"A fair where servants are hired."},{"definition":"The young of any animal; also, a young girl; a moppet."},{"definition":"A made-up face; a grimace."},{"definition":"A pug dog."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rub, scrub, clean or wipe with a mop, or as if with a mop.","example":"to mop (or scrub) a floor"},{"definition":"To make a wry expression with the mouth."}],"partOfSpeech":"ve"}]},{"word":"COMMUTATIVE","idx":40423,"count":480591,"meanings":[{"definitions":[{"definition":"(of a binary operation) Such that the order in which the operands are taken does not affect their image under the operation.","example":"Addition and multiplication are commutative operations but subtraction and division are not."},{"definition":"(of an algebraic structure) Having a commutative operation."},{"definition":"(of a diagram of morphisms) Such that any two sequences of morphisms with the same initial and final positions compose to the same morphism."},{"definition":"Relating to exchange; interchangeable."}],"partOfSpeech":"j"}]},{"word":"RATIONALLY","idx":40424,"count":480583,"meanings":[{"definitions":[{"definition":"In a rational manner"}],"partOfSpeech":"v"}]},{"word":"UPROAR","idx":40427,"count":480509,"meanings":[{"definitions":[{"definition":"Tumultuous, noisy excitement."},{"definition":"Loud confused noise, especially when coming from several sources."},{"definition":"A loud protest, controversy, outrage"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw into uproar or confusion."},{"definition":"To make an uproar."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"uproar-us","text":"/ˈʌpɹɔːɹ/"}]},{"word":"SYRAH","idx":40429,"count":480410,"meanings":[{"definitions":[{"definition":"A dark-skinned variety of grape, used to produce red wines."},{"definition":"A wine produced from this variety of grape."}],"partOfSpeech":"n"}]},{"word":"SAVAGES","idx":40430,"count":480392,"meanings":[{"definitions":[{"definition":"An uncivilized or feral human; a barbarian."},{"definition":"A defiant person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attack or assault someone or something ferociously or without restraint.","example":"No matter how anyone might savage me, I should stay strong."},{"definition":"To criticise vehemently.","example":"His latest film was savaged by most reviewers."},{"definition":"(of an animal) To attack with the teeth."},{"definition":"To make savage."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsævɪdʒɪz/"}]},{"word":"CRATERS","idx":40431,"count":480374,"meanings":[{"definitions":[{"definition":"A hemispherical pit created by the impact of a meteorite or other object."},{"definition":"The basin-like opening or mouth of a volcano, through which the chief eruption comes; similarly, the mouth of a geyser, about which a cone of silica is often built up."},{"definition":"The pit left by the explosion of a mine or bomb."},{"definition":"(by extension) Any large, roughly circular depression or hole."},{"definition":"A living being; an animal or (sometimes derogatory) a human.","example":"He's a creature of habit.   insects and other creatures"},{"definition":"A created thing, whether animate or inanimate; a creation."},{"definition":"A being subservient to or dependent upon another."},{"definition":"An ancient Greek vessel for mixing water and wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form craters in a surface (of a planet or moon)."},{"definition":"To collapse catastrophically; to become devastated or completely destroyed."},{"definition":"To crash or fall.","example":"He cratered into that snow bank about five seconds after his first lesson."}],"partOfSpeech":"ve"}]},{"word":"ANGIOGENESIS","idx":40433,"count":480329,"meanings":[{"definitions":[{"definition":"The formation and development of new blood vessels."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/andʒɪə(ʊ)ˈdʒɛnɪsɪs/"}]},{"word":"NEMATODE","idx":40435,"count":480276,"meanings":[{"definitions":[{"definition":"A worm of the large phylum Nematoda, such as a roundworm or threadworm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnɛm.əˌtoʊd/"},{"text":"/ˈnɛm.ət.əʊd/"}]},{"word":"ADMINISTRATIVELY","idx":40440,"count":480203,"meanings":[{"definitions":[{"definition":"In an administrative manner."}],"partOfSpeech":"v"}]},{"word":"MOCKERY","idx":40442,"count":480064,"meanings":[{"definitions":[{"definition":"The action of mocking; ridicule, derision."},{"definition":"Something so lacking in necessary qualities as to inspire ridicule; a laughing-stock."},{"definition":"Something insultingly imitative; an offensively futile action, gesture etc."},{"definition":"Mimicry, imitation, now usually in a derogatory sense; a travesty, a ridiculous simulacrum.","example":"The defendant wasn't allowed to speak at his own trial - it was a mockery of justice."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɑkəɹi/"},{"text":"/ˈmɒkəɹi/"}]},{"word":"RAILINGS","idx":40443,"count":480015,"meanings":[{"definitions":[{"definition":"A fence or barrier consisting of one or more horizontal rails and vertical supports.","example":"During the war, everyone's railings were taken away to make bombers."},{"definition":"Railing (a horizontal rail with vertical supports)"}],"partOfSpeech":"n"}]},{"word":"NORTHERLY","idx":40447,"count":479948,"meanings":[{"definitions":[{"definition":"A wind blowing from the north."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Facing the north; directed towards the north."},{"definition":"Located in a northern region"},{"definition":"Coming from the north."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In an northward direction or position; (towards the) north."},{"definition":"From the north."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈnɔɹðɚli/"},{"text":"/ˈnɔːðəli/"},{"audio":"northerly-au"}]},{"word":"LEVERAGES","idx":40448,"count":479946,"meanings":[{"definitions":[{"definition":"To use; to exploit; to manipulate in order to take full advantage (of something).","example":"They plan to leverage off the publicity to get a good distribution agreement."}],"partOfSpeech":"ve"}]},{"word":"TENTHS","idx":40450,"count":479914,"meanings":[{"definitions":[{"definition":"The person or thing coming next after the ninth in a series; that which is in the tenth position."},{"definition":"One of ten equal parts of a whole."},{"definition":"The interval between any tone and the tone represented on the tenth degree of the staff above it, as between one of the scale and three of the octave above; the octave of the third."},{"definition":"(in the plural) A temporary aid issuing out of personal property, and granted to the king by Parliament; formerly, the real tenth part of all the movables belonging to the subject."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tenths-us"}]},{"word":"CANCEROUS","idx":40451,"count":479906,"meanings":[{"definitions":[{"definition":"Relating to or affected with cancer."},{"definition":"Growing or spreading rapidly to the point of harm."},{"definition":"Extremely unpleasant; detestable."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kænsəɹəs/"}]},{"word":"QUENCH","idx":40452,"count":479869,"meanings":[{"definitions":[{"definition":"The abnormal termination of operation of a superconducting magnet, occurring when part of the superconducting coil enters the normal (resistive) state."},{"definition":"A rapid change of the parameters of a physical system."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To satisfy, especially an actual or figurative thirst.","example":"The library quenched her thirst for knowledge."},{"definition":"To extinguish or put out (as a fire or light)."},{"definition":"To cool rapidly by dipping into a bath of coolant, as a blacksmith quenching hot iron.","example":"The swordsmith quenched the sword in an oil bath so that it wouldn't shatter."},{"definition":"To terminate or greatly diminish (a chemical reaction) by destroying or deforming the remaining reagents."},{"definition":"To rapidly change the parameters of a physical system."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kwɛnt͡ʃ/"}]},{"word":"PASSER","idx":40453,"count":479850,"meanings":[{"definitions":[{"definition":"One who succeeds in passing a test, etc."},{"definition":"Someone who passes, someone who makes a pass."},{"definition":"A passed pawn."},{"definition":"One who passes; a passer-by."},{"definition":"One who is able to \"pass\", or be accepted as a member of a race, sex or other group to which society would not otherwise regard them as belonging."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpæsəɹ/"},{"text":"/ˈpɑːsə(ɹ)/"}]},{"word":"ENCOMPASSED","idx":40463,"count":479704,"meanings":[{"definitions":[{"definition":"To form a circle around; to encircle."},{"definition":"To include within its scope; to circumscribe or go round so as to surround; to enclose; to contain."},{"definition":"To include completely; to describe fully or comprehensively.","example":"This book on English grammar encompasses all irregular verbs."},{"definition":"To go around, especially, to circumnavigate.","example":"Drake encompassed the globe."}],"partOfSpeech":"ve"}]},{"word":"REASSESSMENT","idx":40464,"count":479566,"meanings":[{"definitions":[{"definition":"The act of reassessing; a second or subsequent assessment."}],"partOfSpeech":"n"}]},{"word":"BROIL","idx":40466,"count":479526,"meanings":[{"definitions":[{"definition":"Food prepared by broiling."},{"definition":"A brawl; a rowdy disturbance.","example":"come to broils"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook by direct, radiant heat."},{"definition":"To expose to great heat."},{"definition":"To be exposed to great heat."},{"definition":"To cause a rowdy disturbance; embroil."},{"definition":"To brawl."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bɹɔɪl/"}]},{"word":"HURRAH","idx":40467,"count":479525,"meanings":[{"definitions":[{"definition":"A cheer; a cry of hurrah!."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a hurrah (to somebody)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Expressing approval, appreciation, or happiness."}],"partOfSpeech":"i"}],"phonetics":[{"text":"/həˈɹɑː/"}]},{"word":"CHILLERS","idx":40468,"count":479444,"meanings":[{"definitions":[{"definition":"Something that chills"},{"definition":"A frightening dramatic work, such as a book or film"}],"partOfSpeech":"n"}]},{"word":"MODESTLY","idx":40470,"count":479398,"meanings":[{"definitions":[{"definition":"In a modest manner."}],"partOfSpeech":"v"}]},{"word":"EPITAPH","idx":40471,"count":479386,"meanings":[{"definitions":[{"definition":"An inscription on a gravestone in memory of the deceased."},{"definition":"A poem or other short text written in memory of a deceased person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write or speak after the manner of an epitaph."},{"definition":"To commemorate by an epitaph."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"epitaph-us","text":"[ˈɛpɪtæf]"}]},{"word":"INSURRECTION","idx":40474,"count":479325,"meanings":[{"definitions":[{"definition":"A violent uprising of part or all of a national population against the government or other authority."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɪnsəˈɹɛkʃən/"}]},{"word":"PERIODICITY","idx":40478,"count":479241,"meanings":[{"definitions":[{"definition":"Recurrence of a woman's periods; menstruation."},{"definition":"The quality of being periodic; tendency to recur at regular intervals."},{"definition":"The quality of a function with a repeated set of values at regular intervals."}],"partOfSpeech":"n"}]},{"word":"EMIGRATED","idx":40479,"count":479239,"meanings":[{"definitions":[{"definition":"To leave the country in which one lives, especially one's native country, in order to reside elsewhere."}],"partOfSpeech":"ve"}]},{"word":"TRYPSIN","idx":40480,"count":479224,"meanings":[{"definitions":[{"definition":"A digestive enzyme that cleaves peptide bonds (a serine protease)"}],"partOfSpeech":"n"}]},{"word":"BURSARY","idx":40481,"count":479223,"meanings":[{"definitions":[{"definition":"A monetary award to university students that allows them to continue their studies."},{"definition":"The treasury of a religious order or public institution."}],"partOfSpeech":"n"}]},{"word":"DEPENDABILITY","idx":40482,"count":479191,"meanings":[{"definitions":[{"definition":"The characteristic of being dependable; the ability to be depended upon."}],"partOfSpeech":"n"}]},{"word":"OVERDRAFT","idx":40483,"count":479151,"meanings":[{"definitions":[{"definition":"The act of overdrawing a bank account."},{"definition":"The amount overdrawn.","example":"I have an overdraft of £1234."},{"definition":"The maximum amount that may be overdrawn.","example":"The bank have given me an overdraft of $2000."},{"definition":"The extraction of groundwater from an aquifer beyond the safe yield or equilibrium yield."},{"definition":"A series of flues in a furnace; the current of air forced through them."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extract groundwater from (an aquifer) beyond the safe yield or equilibrium yield."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈoʊvɚdɹæft/"},{"text":"/ˈəʊvədɹɑːft/"}]},{"word":"MYCOPLASMA","idx":40486,"count":479123,"meanings":[{"definitions":[{"definition":"Any infectious bacterium of the genus Mycoplasma, often specifically Mycoplasma pneumoniae"}],"partOfSpeech":"n"}]},{"word":"BARGES","idx":40487,"count":479102,"meanings":[{"definitions":[{"definition":"A large flat-bottomed towed or self-propelled boat used mainly for river and canal transport of heavy goods or bulk cargo."},{"definition":"A richly decorated ceremonial state vessel propelled by rowers for river processions."},{"definition":"A large flat-bottomed coastal trading vessel having a large spritsail and jib-headed topsail, a fore staysail and a very small mizen, and having leeboards instead of a keel."},{"definition":"One of the boats of a warship having fourteen oars"},{"definition":"The wooden disk in which bread or biscuit is placed on a mess table."},{"definition":"A double-decked passenger or freight vessel, towed by a steamboat."},{"definition":"A large omnibus used for excursions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To intrude or break through, particularly in an unwelcome or clumsy manner."},{"definition":"To push someone."}],"partOfSpeech":"ve"}]},{"word":"NOTA","idx":40493,"count":479048,"meanings":[{"definitions":[{"definition":"The back; the dorsal aspect of the thorax in insects."}],"partOfSpeech":"n"}]}]