[{"word":"DREAMY","idx":17521,"count":2000147,"meanings":[{"definitions":[{"definition":"As in a dream; resembling a dream."},{"definition":"Sexy; handsome; attractive","example":"I love the doctor in that American TV show: he is so dreamy!"},{"definition":"Having a pleasant or romantic atmosphere.","example":"That place was so dreamy!"},{"definition":"Tending to dream or daydream."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɹiː.mi/"}]},{"word":"BACKSTAGE","idx":17523,"count":1999908,"meanings":[{"definitions":[{"definition":"The area behind a stage out of view of the audience where performers wait to give their show; especially that of the dressing rooms."},{"definition":"The private portion of the space used by a business or enterprise."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to, or situated in the area behind a stage."},{"definition":"Secret, concealed from the public."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Towards the area behind the stage."},{"definition":"Out of view of the public."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/bækˈsteɪdʒ/"}]},{"word":"SCROLLS","idx":17524,"count":1999835,"meanings":[{"definitions":[{"definition":"A roll of paper or parchment; a writing formed into a roll."},{"definition":"An ornament formed of undulations giving off spirals or sprays, usually suggestive of plant form. Roman architectural ornament is largely of some scroll pattern."},{"definition":"Spirals or sprays in the shape of an actual plant."},{"definition":"A mark or flourish added to a person's signature, intended to represent a seal, and in some States allowed as a substitute for a seal. [U.S.] Alexander Mansfield Burrill."},{"definition":"The carved end of a violin, viola, cello or other stringed instrument, most commonly scroll-shaped but occasionally in the form of a human or animal head."},{"definition":"A skew surface."},{"definition":"A kind of sweet roll baked in a somewhat spiral shape.","example":"I ordered a glass of lemonade and a coffee scroll."},{"definition":"The incremental movement of graphics on a screen, removing one portion to show the next."},{"definition":"(hydraulics) A spiral waterway placed round a turbine to regulate the flow."},{"definition":"A turbinate bone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To change one's view of data on a computer's display, typically using a scroll bar or a scroll wheel to move in gradual increments.","example":"She scrolled the offending image out of view."},{"definition":"To move in or out of view horizontally or vertically.","example":"The rising credits slowly scrolled off the screen."},{"definition":"To flood a chat system with numerous lines of text, causing legitimate messages to scroll out of view before they can be read.","example":"Hey, stop scrolling!"}],"partOfSpeech":"ve"}]},{"word":"AWAKENING","idx":17525,"count":1999637,"meanings":[{"definitions":[{"definition":"To cause to become awake.","example":"She awakened him by ringing the bell."},{"definition":"To stop sleeping; awake.","example":"Each morning he awakens with a smile on his face."},{"definition":"To bring into action (something previously dormant); to stimulate.","example":"Awaken your entrepreneurial spirit!"},{"definition":"To call to a sense of sin."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of awaking, or ceasing to sleep."},{"definition":"A revival of religion, or more general attention to religious matters than usual."},{"definition":"Being roused into action or activity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Rousing from sleep, in a natural or a figurative sense; rousing into activity; exciting","example":"the awakening city\n an awakening discourse\nthe awakening dawn."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈweɪ̯kənɪŋ/"}]},{"word":"FAIRIES","idx":17527,"count":1998301,"meanings":[{"definitions":[{"definition":"The realm of faerie; enchantment, illusion."},{"definition":"A mythical being with magical powers, known in many sizes and descriptions, although often depicted in modern illustrations only as a small sprite with gauze-like wings, and revered in some modern forms of paganism."},{"definition":"An enchantress, or creature of overpowering charm."},{"definition":"A male homosexual, especially one who is effeminate."},{"definition":"A member of two species of hummingbird in the genus Heliothryx."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɛɹiz/"},{"text":"/ˈfɛəɹiz/"}]},{"word":"PRESCRIBE","idx":17528,"count":1998175,"meanings":[{"definitions":[{"definition":"To order (a drug or medical device) for use by a particular patient (under licensed authority).","example":"The doctor prescribed aspirin."},{"definition":"To specify by writing as a required procedure or ritual; to lay down authoritatively as a guide, direction, or rule of action.","example":"The property meets the criteria prescribed by the regulations."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prescribe-uk","text":"/pɹɪˈskɹaɪb/"}]},{"word":"GREED","idx":17530,"count":1997460,"meanings":[{"definitions":[{"definition":"A selfish or excessive desire for more than is needed or deserved, especially of money, wealth, food, or other possessions.","example":"His greed was his undoing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To desire in a greedy manner, or to act on such a desire."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"greed-uk","text":"/ɡɹid/"}]},{"word":"NOMINATE","idx":17531,"count":1997305,"meanings":[{"definitions":[{"definition":"To name someone as a candidate for a particular role or position, including that of an office."},{"definition":"To entitle, confer a name upon.","example":"1658: the City of Norwich [...] was enlarged, builded and nominated by the Saxons. — Sir Thomas Browne, Urne-Burial (Penguin 2005, p. 12)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Nominotypical","example":"the nominate subspecies"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈnɑm.ə.neɪt/"},{"text":"/ˈnɒm.ə.neɪt/"}]},{"word":"SPARKLE","idx":17532,"count":1997295,"meanings":[{"definitions":[{"definition":"A little spark; a scintillation."},{"definition":"Brilliance; luster.","example":"the sparkle of a diamond"},{"definition":"Liveliness; vivacity.","example":"the sparkle of his conversation over dinner"},{"definition":"The quality of being sparkling or fizzy; effervescence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To emit sparks; to throw off ignited or incandescent particles","example":"The wood was sparkling in the bonfire."},{"definition":"(by extension) To shine as if throwing off sparks; to emit flashes of light; to scintillate; to twinkle","example":"The stars sparkle in the sky."},{"definition":"To manifest itself by, or as if by, emitting sparks; to glisten; to flash."},{"definition":"To emit little bubbles, as certain kinds of liquors; to effervesce","example":"sparkling water"},{"definition":"To emit in the form or likeness of sparks."},{"definition":"To disperse."},{"definition":"To scatter on or over."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sparkle-uk","text":"/ˈspɑːkəl/"}]},{"word":"AUTOGRAPH","idx":17533,"count":1997100,"meanings":[{"definitions":[{"definition":"A person’s own handwriting, especially the signature of a famous or admired person."},{"definition":"A manuscript in the author’s handwriting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sign, or write one’s name or signature on a book etc"},{"definition":"To write something in one's own handwriting"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Written in the author’s own handwriting."},{"definition":"Made by the artist himself or herself; authentic."}],"partOfSpeech":"j"}]},{"word":"MIGRATING","idx":17536,"count":1996478,"meanings":[{"definitions":[{"definition":"To relocate periodically from one region to another, usually according to the seasons.","example":"Twice a year the Minnesotans migrate from their state to the Gulf of Mexico."},{"definition":"To change one's geographic pattern of habitation.","example":"Many groups had migrated to western Europe from the plains of eastern Europe."},{"definition":"To change habitations across a border; to move from one country or political region to another.","example":"To escape persecution, they migrated to a neutral country."},{"definition":"To move slowly towards, usually in groups.","example":"Once the hosts started bickering in the kitchens, the guests began to migrate towards the living room."},{"definition":": To move computer code or files from one computer or network to another.","example":"They had finished migrating all of the affected code to the production server by 2:00am, three hours later than expected."},{"definition":"To induce customers to shift purchases from one set of a company's related products to another.","example":"We were hoping to migrate the customers of the \"C\" series to the \"E\" series and the \"E\" customers to the \"S\" series."}],"partOfSpeech":"ve"}]},{"word":"GASKET","idx":17537,"count":1996432,"meanings":[{"definitions":[{"definition":"A length of rope used for reefing a sail, or holding a stowed sail in place."},{"definition":"Any mechanical seal that serves to fill the space between two objects, generally to prevent leakage between the two objects while under compression."},{"definition":"A material which may be clamped between faces and acts as a static seal. Gaskets may be cut, formed, or molded to the desired configuration."},{"definition":"Any of a wide variety of seals or packings used between matched machine parts or around pipe joints to prevent the escape of a gas or fluid."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gasket-us","text":"/ˈɡæs.kɪt/"}]},{"word":"REFRAIN","idx":17538,"count":1996424,"meanings":[{"definitions":[{"definition":"To hold back, to restrain (someone or something)."},{"definition":"To show restraint; to hold oneself back."},{"definition":"To repress (a desire, emotion etc.); to check or curb."},{"definition":"(with preposition \"from\") To stop oneself from some action or interference; to abstain."},{"definition":"To abstain from (food or drink)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The chorus or burden of a song repeated at the end of each verse or stanza."},{"definition":"A much repeated comment, complaint, or saying."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"refrain-us","text":"/ɹɪˈfɹeɪn/"}]},{"word":"LASTLY","idx":17539,"count":1996311,"meanings":[{"definitions":[{"definition":"(sequence) Used to mark the beginning of the last in a list of items or propositions.","example":"Firstly, that's illegal; secondly, it has serious disadvantages; thirdly, it's not necessary; and lastly, did I mention that it's illegal?"},{"definition":"(discourse marker) Used to signal that the speaker is about to yield control of the conversation."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈlæstli/"},{"text":"/ˈlɑːstli/"}]},{"word":"OVERCOMING","idx":17540,"count":1996216,"meanings":[{"definitions":[{"definition":"To surmount (a physical or abstract obstacle); to prevail over, to get the better of.","example":"to overcome enemies in battle"},{"definition":"To win or prevail in some sort of battle, contest, etc.","example":"We shall overcome."},{"definition":"To come or pass over; to spread over.","example":"I was overcome with anger."},{"definition":"To overflow; to surcharge."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is overcome, or surmounted."}],"partOfSpeech":"n"}]},{"word":"WANDER","idx":17541,"count":1996154,"meanings":[{"definitions":[{"definition":"The act or instance of wandering.","example":"to go for a wander in the park"},{"definition":"The situation where a value or signal etc. deviates from the correct or normal value.","example":"baseline wander in ECG signals"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move without purpose or specified destination; often in search of livelihood.","example":"to wander over the fields"},{"definition":"To stray; stray from one's course; err.","example":"A writer wanders from his subject."},{"definition":"To commit adultery."},{"definition":"To go somewhere indirectly or at varying speeds; to move in a curved path."},{"definition":"Of the mind, to lose focus or clarity of argument or attention."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wander-us","text":"/ˈwɑndɚ/"}]},{"word":"RELIEVED","idx":17543,"count":1995685,"meanings":[{"definitions":[{"definition":"To ease (a person, person's thoughts etc.) from mental distress; to stop (someone) feeling anxious or worried, to alleviate the distress of.","example":"I was greatly relieved by the jury's verdict."},{"definition":"To ease (someone, a part of the body etc.) or give relief from physical pain or discomfort."},{"definition":"To alleviate (pain, distress, mental discomfort etc.)."},{"definition":"To provide comfort or assistance to (someone in need, especially in poverty)."},{"definition":"To lift up; to raise again."},{"definition":"To raise (someone) out of danger or from (a specified difficulty etc.)."},{"definition":"To free (someone) from debt or legal obligations; to give legal relief to.","example":"This shall not relieve either Party of any obligations."},{"definition":"To bring military help to (a besieged town); to lift the siege on."},{"definition":"To release (someone) from or of a difficulty, unwanted task, responsibility etc."},{"definition":"(job) To free (someone) from their post, task etc. by taking their place."},{"definition":"To make (something) stand out; to make prominent, bring into relief."},{"definition":"To go to the toilet; to defecate or urinate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Experiencing or exhibiting relief; freed from stress or discomfort.","example":"She was extremely relieved when the lesson finished."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"relieved-us","text":"/ɹɪˈliːvd/"}]},{"word":"FIREARM","idx":17544,"count":1995529,"meanings":[{"definitions":[{"definition":"A personal weapon that uses explosive powder to propel a projectile often made of lead."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"firearm-us"}]},{"word":"BAM","idx":17548,"count":1994832,"meanings":[{"definitions":[{"definition":"Representing a loud noise or heavy impact.","example":"The wind knocked the tree over last night. Bam! It nearly scared me to death."},{"definition":"Representing a sudden or abrupt occurrence.","example":"She said she dumped him. Now — bam! — they're back together."}],"partOfSpeech":"i"},{"definitions":[{"definition":"A ned; a bampot."},{"definition":"An imposition; a cheat; a hoax."},{"definition":"Abbreviation of bare-arse minimum."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To impose on (someone) by a falsehood; to cheat."},{"definition":"To jeer or make fun of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bam-au","text":"/bæm/"}]},{"word":"CLOSURES","idx":17549,"count":1994806,"meanings":[{"definitions":[{"definition":"An event or occurrence that signifies an ending."},{"definition":"A feeling of completeness; the experience of an emotional conclusion, usually to a difficult period."},{"definition":"A device to facilitate temporary and repeatable opening and closing."},{"definition":"An abstraction that represents a function within an environment, a context consisting of the variables that are both bound at a particular time during the execution of the program and that are within the function's scope."},{"definition":"The smallest set that both includes a given subset and possesses some given property."},{"definition":"(of a set) The smallest closed set which contains the given set."},{"definition":"The act of shutting; a closing.","example":"the closure of a door, or of a chink"},{"definition":"That which closes or shuts; that by which separate parts are fastened or closed."},{"definition":"That which encloses or confines; an enclosure."},{"definition":"A method of ending a parliamentary debate and securing an immediate vote upon a measure before a legislative body."},{"definition":"The process whereby the reader of a comic book infers the sequence of events by looking at the picture panels."}],"partOfSpeech":"n"}]},{"word":"PARTICIPATORY","idx":17550,"count":1994106,"meanings":[{"definitions":[{"definition":"Relating to participation.","example":"participatory behavior"},{"definition":"Open to participation."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɑː(ɹ)tɪsɪˈpeɪtəɹi/"}]},{"word":"INTERMITTENT","idx":17551,"count":1994067,"meanings":[{"definitions":[{"definition":"An intermittent fever or disease."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Stopping and starting, occuring, or presenting at intervals; coming after a particular time span.","example":"Intermittent bugs are most difficult to reproduce."},{"definition":"(specifically, of a body of water) Existing only for certain seasons; that is, being dry for part of the year.","example":"The area has many intermittent lakes and streams."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɪntɚˈmɪtn̩t/"},{"text":"/ˌɪntəˈmɪtn̩t/"}]},{"word":"ANTE","idx":17552,"count":1993948,"meanings":[{"definitions":[{"definition":"A price or cost, as in up the ante."},{"definition":"In poker and other games, the contribution made by all players to the pot before dealing the cards."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pay the ante in poker. Often used as ante up."},{"definition":"To make an investment in money, effort, or time before knowing one's chances."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ante-us","text":"/ˈænti/"}]},{"word":"MICRON","idx":17553,"count":1993771,"meanings":[{"definitions":[{"definition":"The thousandth part of one millimeter; the millionth part of a meter."},{"definition":"A very tiny amount."},{"definition":"A semicircular diacritical mark (˘) placed above a vowel, commonly used to mark its quantity as short."},{"definition":"A double whole note."},{"definition":"Any writ or precept under seal, issued out of any court."},{"definition":"The great ant thrush of Sumatra (Pitta gigas), which has a very short tail."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmaɪkɹɒn/"}]},{"word":"BUDGETARY","idx":17554,"count":1993701,"meanings":[{"definitions":[{"definition":"Of or pertaining to a budget."}],"partOfSpeech":"j"}]},{"word":"REVOLVING","idx":17557,"count":1993058,"meanings":[{"definitions":[{"definition":"(Physical movement.)"},{"definition":"(Mental activity.)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of something that revolves or turns."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Moving around a central point."},{"definition":"Relating to an account or line of credit where balances and credit roll over from one billing cycle to the next, such as a credit card."}],"partOfSpeech":"j"}]},{"word":"BUNDLED","idx":17559,"count":1991914,"meanings":[{"definitions":[{"definition":"To tie or wrap together into a bundle."},{"definition":"To hustle; to dispatch something or someone quickly."},{"definition":"To prepare for departure; to set off in a hurry or without ceremony; used with away, off, out."},{"definition":"To dress someone warmly."},{"definition":"To dress warmly. Usually bundle up"},{"definition":"To sell hardware and software as a single product."},{"definition":"To hurry."},{"definition":"To hastily or clumsily push, put, carry or otherwise send something into a particular place."},{"definition":"To sleep on the same bed without undressing."},{"definition":"(often with 'on') To jump into a dogpile."},{"definition":"To pile on, to overwhelm in other senses."}],"partOfSpeech":"ve"}]},{"word":"BOMBERS","idx":17561,"count":1991459,"meanings":[{"definitions":[{"definition":"A military aircraft designed to carry and drop bombs."},{"definition":"A person who sets bombs, especially as an act of terrorism."},{"definition":"A bomber jacket."},{"definition":"A 22-ounce beer bottle."},{"definition":"A graffiti bomber."},{"definition":"A large cannabis cigarette."}],"partOfSpeech":"n"}]},{"word":"COVERT","idx":17562,"count":1991310,"meanings":[{"definitions":[{"definition":"A covering."},{"definition":"A disguise."},{"definition":"A hiding place."},{"definition":"Area of thick undergrowth where animals hide."},{"definition":"A feather that covers the bases of flight feathers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Hidden, covered over; overgrown, sheltered."},{"definition":"Secret, surreptitious, concealed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"covert-uk","text":"/ˈkəʊvəːt/"}]},{"word":"CRATER","idx":17563,"count":1991071,"meanings":[{"definitions":[{"definition":"A hemispherical pit created by the impact of a meteorite or other object."},{"definition":"The basin-like opening or mouth of a volcano, through which the chief eruption comes; similarly, the mouth of a geyser, about which a cone of silica is often built up."},{"definition":"The pit left by the explosion of a mine or bomb."},{"definition":"(by extension) Any large, roughly circular depression or hole."},{"definition":"An ancient Greek vessel for mixing water and wine."},{"definition":"A living being; an animal or (sometimes derogatory) a human.","example":"He's a creature of habit.   insects and other creatures"},{"definition":"A created thing, whether animate or inanimate; a creation."},{"definition":"A being subservient to or dependent upon another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form craters in a surface (of a planet or moon)."},{"definition":"To collapse catastrophically; to become devastated or completely destroyed."},{"definition":"To crash or fall.","example":"He cratered into that snow bank about five seconds after his first lesson."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɹeɪ.tɚ/"},{"text":"/ˈkɹeɪ.tə(ɹ)/"}]},{"word":"FAVORED","idx":17565,"count":1990643,"meanings":[{"definitions":[{"definition":"To look upon fondly; to prefer."},{"definition":"To encourage, conduce to"},{"definition":"To do a favor [noun sense 1] for; to show beneficence toward.","example":"Would you favor us with a poetry reading?"},{"definition":"To treat with care.","example":"Favoring your sore leg will only injure the other one."},{"definition":"(including) To resemble, to look like (another person)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Treated or regarded with partiality."},{"definition":"(in combination) Having a certain appearance or physical features.","example":"ill-favoured; well-favoured; hard-favoured"},{"definition":"Wearing a favour.","example":"a white-favoured footman"}],"partOfSpeech":"j"}]},{"word":"BRED","idx":17566,"count":1990553,"meanings":[{"definitions":[{"definition":"To produce offspring sexually; to bear young."},{"definition":"To give birth to; to be the native place of.","example":"a pond breeds fish; a northern country breeds stout men"},{"definition":"Of animals, to mate."},{"definition":"To keep animals and have them reproduce in a way that improves the next generation’s qualities."},{"definition":"To arrange the mating of specific animals.","example":"She wanted to breed her cow to the neighbor's registered bull."},{"definition":"To propagate or grow plants trying to give them certain qualities.","example":"He tries to breed blue roses."},{"definition":"To take care of in infancy and through childhood; to bring up."},{"definition":"To yield or result in.","example":"disaster breeds famine;  familiarity breeds contempt"},{"definition":"To be formed in the parent or dam; to be generated, or to grow, like young before birth."},{"definition":"(sometimes as breed up) To educate; to instruct; to bring up"},{"definition":"To produce or obtain by any natural process."},{"definition":"To have birth; to be produced, developed or multiplied."},{"definition":"To ejaculate inside someone's ass"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bred-uk","text":"/bɹɛd/"}]},{"word":"FRACTIONAL","idx":17568,"count":1990433,"meanings":[{"definitions":[{"definition":"(grammar) An expression of a fractional number.","example":"In English, most ordinals double as fractionals — \"third\", \"fourth\", and so on — with the exception of \"second\", whose corresponding fractional is \"half\"."},{"definition":"Partial ownership of a property, such as real estate or a chartered airplane, such that each partial owner has use of the property for only a portion of the time.","example":"A fractional is much more expensive than a traditional timeshare, but to many people, it's worth it."},{"definition":"Relating to a fraction in a material distillation or separation process."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to a fraction."},{"definition":"Divided; fragmentary; incomplete."},{"definition":"Very small; minute."},{"definition":"Relating to a process or product of fractional distillation."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɹæk.ʃən.əl/"}]},{"word":"IDEOLOGICAL","idx":17570,"count":1990291,"meanings":[{"definitions":[{"definition":"Of or pertaining to an ideology."},{"definition":"Based on an ideology or misleading studies or statistics, especially based on the media or propaganda. Not based on scientific evidence or reality."}],"partOfSpeech":"j"}]},{"word":"FOSTERING","idx":17571,"count":1990009,"meanings":[{"definitions":[{"definition":"To nurture or bring up offspring, or to provide similar parental care to an unrelated child."},{"definition":"To cultivate and grow something.","example":"Our company fosters an appreciation for the arts."},{"definition":"To nurse or cherish something."},{"definition":"To be nurtured or trained up together."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Raising someone to be an accepted member of the community."},{"definition":"Encouragement; aiding the development of something"}],"partOfSpeech":"n"}]},{"word":"RHEUMATOID","idx":17573,"count":1989418,"meanings":[{"definitions":[{"definition":"Presenting analogies with rheumatism."}],"partOfSpeech":"j"}]},{"word":"THENCE","idx":17574,"count":1989263,"meanings":[{"definitions":[{"definition":"From there, from that place or from that time.","example":"Cross fix at 6000 feet, thence descend to 3000 feet and fly direct to MAP (missed approach point)."},{"definition":"Deriving from this fact or circumstance; therefore, therefrom."},{"definition":"From that time; thenceforth; thereafter"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"thence-us","text":"/ðɛns/"}]},{"word":"BIRTHPLACE","idx":17575,"count":1989123,"meanings":[{"definitions":[{"definition":"The location where a person was born.","example":"Portsmouth was Charles Dickens’ birthplace."},{"definition":"(by extension) The location where something was created or devised.","example":"Coney Island was the birthplace of the hot dog."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɝθˌpleɪs/"}]},{"word":"BLEED","idx":17576,"count":1989071,"meanings":[{"definitions":[{"definition":"An incident of bleeding, as in haemophilia."},{"definition":"A narrow edge around a page layout, to be printed but cut off afterwards (added to allow for slight misalignment, especially with pictures that should run to the edge of the finished sheet)."},{"definition":"(sound recording) The situation where sound is picked up by a microphone from a source other than that which is intended."},{"definition":"The removal of air bubbles from a pipe containing other fluids."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a person or animal) To lose blood through an injured blood vessel.","example":"If her nose bleeds, try to use ice."},{"definition":"To let or draw blood from."},{"definition":"To take large amounts of money from."},{"definition":"To steadily lose (something vital).","example":"The company was bleeding talent."},{"definition":"(of an ink or dye) To spread from the intended location and stain the surrounding cloth or paper.","example":"Ink traps counteract bleeding."},{"definition":"To remove air bubbles from a pipe containing other fluids."},{"definition":"To bleed on; to make bloody."},{"definition":"To show one's group loyalty by showing (its associated color) in one's blood.","example":"He was a devoted Vikings fan: he bled purple."},{"definition":"To lose sap, gum, or juice.","example":"A tree or a vine bleeds when tapped or wounded."},{"definition":"To issue forth, or drop, like blood from an incision."},{"definition":"(of a phonological rule) To destroy the environment where another phonological rule would have applied.","example":"Labialization bleeds palatalization."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbliːd/"}]},{"word":"REVEREND","idx":17577,"count":1988924,"meanings":[{"definitions":[{"definition":"A member of the Christian clergy; a minister."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Worthy of reverence or respect; reverent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"reverend-us","text":"/ˈɹɛvəɹənd/"}]},{"word":"TRANSMITTING","idx":17578,"count":1988592,"meanings":[{"definitions":[{"definition":"To send or convey something from one person, place or thing to another."},{"definition":"To spread or pass on something such as a disease or a signal."},{"definition":"To impart, convey or hand down something by inheritance or heredity."},{"definition":"To communicate news or information."},{"definition":"To convey energy or force through a mechanism or medium."},{"definition":"To send out a signal (as opposed to receive)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A process of transmission."}],"partOfSpeech":"n"}]},{"word":"CABERNET","idx":17580,"count":1988133,"meanings":[{"definitions":[{"definition":"Cabernet Sauvignon"}],"partOfSpeech":"n"}]},{"word":"CAUCASIAN","idx":17585,"count":1987029,"meanings":[{"definitions":[{"definition":"A native or inhabitant of the Caucasus."},{"definition":"A member of the Caucasian racial classification described above."},{"definition":"A white person."},{"definition":"A group of languages spoken in the Caucasus area."},{"definition":"(bartending) The White Russian, a cocktail consisting of coffee liqueur, vodka, and milk. Made popular by the 1998 film The Big Lebowski."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to the Caucasus region or its people, languages and culture."},{"definition":"Of a racial classification; pertaining to people having certain phenotypical features such as straight, wavy or curly hair and very light to brown pigmented skin, and originating from Europe, parts of Northern Africa and Western, Central and South Asia."},{"definition":"(of a person) White, being a white person."}],"partOfSpeech":"j"}]},{"word":"UNDERSTANDABLE","idx":17586,"count":1986952,"meanings":[{"definitions":[{"definition":"Capable of being understood; comprehensible."},{"definition":"Capable of being accepted or excused under the circumstances."}],"partOfSpeech":"j"}]},{"word":"SHEA","idx":17587,"count":1986897,"meanings":[{"definitions":[{"definition":"A tree (Vitellaria paradoxa) indigenous to Africa, occurring in Mali, Cameroon, Congo, Côte d'Ivoire, Ghana, Guinea, Togo, Nigeria, Senegal, Sudan, Burkina Faso and Uganda."},{"definition":"The fruit of this tree, having a thin, tart, nutritious pulp that surrounds a relatively large, oil-rich seed."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ʃeɪ/"}]},{"word":"GOBLET","idx":17588,"count":1986831,"meanings":[{"definitions":[{"definition":"A drinking vessel with a foot and stem."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"goblet-us","text":"/ˈɡɒblət/"}]},{"word":"DOCTORATE","idx":17589,"count":1986782,"meanings":[{"definitions":[{"definition":"The highest degree awarded by a university faculty."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make (someone) into a doctor."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"doctorate-uk","text":"/ˈdɒk.tə.ɹeɪt/"}]},{"word":"BINARIES","idx":17590,"count":1986777,"meanings":[{"definitions":[{"definition":"A thing which can have only (one or the other of) two values."},{"definition":"The bijective base-2 numeral system, which uses only the digits 0 and 1."},{"definition":"An executable computer file."},{"definition":"A satellite system consisting of two stars or other bodies orbiting each other."}],"partOfSpeech":"n"}]},{"word":"INVENTIONS","idx":17591,"count":1986727,"meanings":[{"definitions":[{"definition":"Something invented.","example":"I'm afraid there was no burglar. It was all the housekeeper's invention."},{"definition":"The act of inventing.","example":"The invention of the printing press was probably the most significant innovation of the medieval ages."},{"definition":"The capacity to invent.","example":"It took quite a bit of invention to come up with a plan, but we did it."},{"definition":"A small, self-contained composition, particularly those in J.S. Bach’s Two- and Three-part Inventions.","example":"I particularly like the inventions in C-minor."},{"definition":"The act of discovering or finding; the act of finding out; discovery.","example":"That judicial method which serveth best for the invention of truth."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"inventions-us"}]},{"word":"PRACTICABLE","idx":17594,"count":1986296,"meanings":[{"definitions":[{"definition":"Capable of being accomplished; feasible."},{"definition":"Serving a useful function; useful, functional or handy."},{"definition":"Available for use; accessible or employable."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpɹæktɪkəbəl/"}]},{"word":"SHOWDOWN","idx":17595,"count":1986109,"meanings":[{"definitions":[{"definition":"The final battle between two nemeses, in which there can be but one victor."},{"definition":"The final round in a poker match, where the all remaining players' cards have to be put down on the table and shown."}],"partOfSpeech":"n"}]},{"word":"FRONTS","idx":17597,"count":1985378,"meanings":[{"definitions":[{"definition":"The foremost side of something or the end that faces the direction it normally moves."},{"definition":"The side of a building with the main entrance."},{"definition":"A field of activity."},{"definition":"A person or institution acting as the public face of some other, covert group.","example":"Officially it's a dry-cleaning shop, but everyone knows it's a front for the mafia."},{"definition":"The interface or transition zone between two airmasses of different density, often resulting in precipitation. Since the temperature distribution is the most important regulator of atmospheric density, a front almost invariably separates airmasses of different temperature."},{"definition":"An area where armies are engaged in conflict, especially the line of contact."},{"definition":"The lateral space occupied by an element measured from the extremity of one flank to the extremity of the other flank."},{"definition":"The direction of the enemy."},{"definition":"When a combat situation does not exist or is not assumed, the direction toward which the command is faced."},{"definition":"A major military subdivision of the Soviet Army."},{"definition":"Cheek; boldness; impudence."},{"definition":"An act, show, façade, persona: an intentional and false impression of oneself.","example":"He says he likes hip-hop, but I think it's just a front."},{"definition":"That which covers the foremost part of the head: a front piece of false hair worn by women."},{"definition":"The most conspicuous part."},{"definition":"The beginning."},{"definition":"A seafront or coastal promenade."},{"definition":"The forehead or brow, the part of the face above the eyes; sometimes, also, the whole face."},{"definition":"(hotels) The bellhop whose turn it is to answer a client's call, which is often the word \"front\" used as an exclamation."},{"definition":"(in the plural) A grill (jewellery worn on front teeth)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To face (on, to); to be pointed in a given direction."},{"definition":"To face, be opposite to."},{"definition":"To face up to, to meet head-on, to confront."},{"definition":"To adorn the front of; to put on the front."},{"definition":"To pronounce with the tongue in a front position."},{"definition":"To move (a word or clause) to the start of a sentence."},{"definition":"To act as a front (for); to cover (for)."},{"definition":"To lead or be the spokesperson of (a campaign, organisation etc.)."},{"definition":"To provide money or financial assistance in advance to."},{"definition":"To assume false or disingenuous appearances."},{"definition":"To deceive or attempt to deceive someone with false or disingenuous appearances (on)."},{"definition":"To appear before.","example":"to front court"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɹʌnts/"}]},{"word":"ANCESTOR","idx":17598,"count":1985344,"meanings":[{"definitions":[{"definition":"One from whom a person is descended, whether on the father's or mother's side, at any distance of time; a progenitor; a forefather."},{"definition":"An earlier type; a progenitor","example":"This fossil animal is regarded as the ancestor of the horse."},{"definition":"One from whom an estate has descended;—the correlative of heir."},{"definition":"One who had the same role or function in former times."},{"definition":"A word or phrase which serves as the origin of a term in another language."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be an ancestor of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ancestor-us","text":"/ˈæn.sɛs.tɚ/"}]},{"word":"POTENTIALS","idx":17601,"count":1984611,"meanings":[{"definitions":[{"definition":"Currently unrealized ability (with the most common adposition being to)","example":"Even from a young age it was clear that she had the potential to become a great musician."},{"definition":"The gravitational potential: the radial (irrotational, static) component of a gravitational field, also known as the Newtonian potential or the gravitoelectric field."},{"definition":"The work (energy) required to move a reference particle from a reference location to a specified location in the presence of a force field, for example to bring a unit positive electric charge from an infinite distance to a specified point against an electric field."},{"definition":"(grammar) A verbal construction or form stating something is possible or probable."}],"partOfSpeech":"n"}]},{"word":"INCUR","idx":17602,"count":1984112,"meanings":[{"definitions":[{"definition":"To bring upon oneself or expose oneself to, especially something inconvenient, harmful, or onerous; to become liable or subject to"},{"definition":"To enter or pass into"},{"definition":"To fall within a period or scope; to occur; to run into danger"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"incur-us","text":"/ɪnˈkɝ/"}]},{"word":"CORES","idx":17605,"count":1983675,"meanings":[{"definitions":[{"definition":"Various former units of volume, particularly:"},{"definition":"The central part of fruit, containing the kernels or seeds.","example":"the core of an apple or quince"},{"definition":"The heart or inner part of a physical thing"},{"definition":"The center or inner part of a space or area","example":"the core of a square"},{"definition":"The most important part of a thing; the essence.","example":"the core of a subject"},{"definition":"The portion of a mold that creates an internal cavity within a casting or that makes a hole in or through a casting."},{"definition":"The bony process which forms the central axis of the horns in many animals."},{"definition":"Magnetic data storage."},{"definition":"An individual computer processor, in the sense when several processors (called cores or CPU cores) are plugged together in one single integrated circuit to work as one (called multi-core processor).","example":"I wanted to play a particular computer game, which required I buy a new computer, so while the game said it needed at least a dual-core processor, I wanted my computer to be a bit ahead of the curve, so I bought a quad-core."},{"definition":"The material between surface materials in a structured composite sandwich material.","example":"a floor panel with a Nomex honeycomb core"},{"definition":"The inner part of a nuclear reactor in which the nuclear reaction takes place."},{"definition":"A piece of ferromagnetic material (i.e. soft iron), inside the windings of an electromagnet, that channels the magnetic field."},{"definition":"A disorder of sheep caused by worms in the liver."},{"definition":"A cylindrical sample of rock or other materials obtained by core drilling."},{"definition":"A tiny sample of organic material obtained by means of a fine-needle biopsy."},{"definition":"The central part of a protein structure consisting in mostly hydrophobic aminoacids."},{"definition":"The set of feasible allocations that cannot be improved upon by a subset (a coalition) of the economy's agents."},{"definition":"A hollow cylindrical piece of cardboard around which a web of paper or plastic is winded."},{"definition":"An atomic nucleus plus inner electrons (i.e. except valence electrons)."},{"definition":"A body of individuals; an assemblage."},{"definition":"A miner's underground working time or shift."},{"definition":"(machinery, marine) A deposit paid by the purchaser of a rebuilt part, to be refunded on return of a used, rebuildable part, or the returned rebuildable part itself."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the core of an apple or other fruit."},{"definition":"To extract a sample with a drill."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɔːz/"},{"text":"/kɔɹz/"}]},{"word":"BORROWERS","idx":17606,"count":1983348,"meanings":[{"definitions":[{"definition":"One who borrows.","example":"a library borrower's card"}],"partOfSpeech":"n"}]},{"word":"CANONICAL","idx":17608,"count":1982599,"meanings":[{"definitions":[{"definition":"The formal robes of a priest."},{"definition":"A URL presented in canonical form."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Present in a canon, religious or otherwise."},{"definition":"According to recognised or orthodox rules.","example":"The men played golf in the most canonical way, with no local rules."},{"definition":"Stated or used in the most basic and straightforwardly applicable manner.","example":"the reduction of a linear substitution to its canonical form"},{"definition":"Prototypical."},{"definition":"In conformity with canon law."},{"definition":"In the form of a canon."},{"definition":"Of or pertaining to an ecclesiastical chapter"},{"definition":"In canonical form."},{"definition":"Distinguished among entities of its kind, so that it can be picked out in a way that does not depend on any arbitrary choices."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kə.ˈnɒn.ɪ.kl̩/"}]},{"word":"NODDED","idx":17609,"count":1982403,"meanings":[{"definitions":[{"definition":"To incline the head up and down, as to indicate agreement."},{"definition":"To briefly incline the head downwards as a cursory greeting."},{"definition":"To sway, move up and down."},{"definition":"To gradually fall asleep."},{"definition":"To signify by a nod.","example":"They nodded their assent."},{"definition":"To make a mistake by being temporarily inattentive or tired"},{"definition":"To head; to strike the ball with one's head.","example":"Jones nods the ball back to his goalkeeper."},{"definition":"To allude to something."},{"definition":"To fall asleep while under the influence of opiates."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"nodded-us","text":"/ˈnɑdɪd/"}]},{"word":"CONFRONTED","idx":17610,"count":1982279,"meanings":[{"definitions":[{"definition":"To stand or meet facing, especially in competition, hostility or defiance; to come face to face with","example":"We should confront him about the missing money."},{"definition":"To deal with."},{"definition":"To something bring face to face with."},{"definition":"To come up against; to encounter."},{"definition":"To engage in confrontation."},{"definition":"To set a thing side by side with; to compare."},{"definition":"To put a thing facing to; to set in contrast to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"confronted-us","text":"/kənˈfɹʌntɪd/"}]},{"word":"BELIEVER","idx":17611,"count":1982182,"meanings":[{"definitions":[{"definition":"A person who believes; especially regarding religion.","example":"She's a believer in life after death."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"believer-us"}]},{"word":"MULTIFUNCTION","idx":17613,"count":1982159,"meanings":[{"definitions":[{"definition":"A multivalued function."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having multiple functions."}],"partOfSpeech":"j"}]},{"word":"NIFTY","idx":17615,"count":1981740,"meanings":[{"definitions":[{"definition":"Good, smart; useful or beneficial.","example":"a nifty trick for reducing your household energy bill"},{"definition":"Stylish."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"nifty-uk","text":"/ˈnɪfti/"}]},{"word":"DECLINES","idx":17616,"count":1981620,"meanings":[{"definitions":[{"definition":"Downward movement, fall."},{"definition":"A sloping downward, e.g. of a hill or road."},{"definition":"A weakening."},{"definition":"A reduction or diminution of activity."},{"definition":"The act of declining or refusing something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move downwards, to fall, to drop.","example":"The dollar has declined rapidly since 2001."},{"definition":"To become weaker or worse.","example":"My health declined in winter."},{"definition":"To bend downward; to bring down; to depress; to cause to bend, or fall."},{"definition":"To cause to decrease or diminish."},{"definition":"To turn or bend aside; to deviate; to stray; to withdraw.","example":"a line that declines from straightness"},{"definition":"To refuse, forbear.","example":"On reflection I think I will decline your generous offer."},{"definition":"(grammar, usually of substantives, adjectives and pronouns) To inflect for case, number and sometimes gender."},{"definition":"(by extension) To run through from first to last; to repeat like a schoolboy declining a noun."},{"definition":"To reject a penalty against the opposing team, usually because the result of accepting it would benefit the non-penalized team less than the preceding play.","example":"The team chose to decline the fifteen-yard penalty because their receiver had caught the ball for a thirty-yard gain."}],"partOfSpeech":"ve"}]},{"word":"UNVEILS","idx":17617,"count":1981596,"meanings":[{"definitions":[{"definition":"To remove a veil from; to uncover; to reveal something hidden."},{"definition":"To remove a veil; to reveal oneself."}],"partOfSpeech":"ve"}]},{"word":"PEACOCK","idx":17618,"count":1981500,"meanings":[{"definitions":[{"definition":"A male peafowl, especially Pavo cristatus, notable for its brilliant iridescently ocellated tail."},{"definition":"A peafowl (of the genus Pavo or Afropavo), either male or female."},{"definition":"A vainglorious person ."},{"definition":"Any of various Asian species of papilionid butterflies of the genus Papilio."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strut about proudly."},{"definition":"To engage in peacocking, ostentatious dress or behaviour to impress women."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"peacock-us","text":"/ˈpikɑk/"}]},{"word":"UTMOST","idx":17619,"count":1981459,"meanings":[{"definitions":[{"definition":"Maximum; greatest possible amount or quantity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Situated at the most distant limit; farthest.","example":"the utmost limits of the land;  the utmost extent of human knowledge"},{"definition":"The most extreme; ultimate; greatest.","example":"the utmost assiduity;  the utmost harmony;  the utmost misery or happiness"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"utmost-us","text":"/ˈʌt.moʊ̯st/"}]},{"word":"SKELETAL","idx":17620,"count":1981391,"meanings":[{"definitions":[{"definition":"Of, or relating to the skeleton"},{"definition":"Haggard, cadaverous, emaciated or gaunt"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/skəˈliːt(ə)l/"}]},{"word":"ROLLOVER","idx":17625,"count":1980601,"meanings":[{"definitions":[{"definition":"The process of incrementing, especially back to an initial value."},{"definition":"A road traffic accident in which a vehicle overturns."},{"definition":"A graphic element that changes its appearance when the cursor moves over it."},{"definition":"A keyboard feature where each key is scanned independently, so that multiple simultaneous keypresses always register correctly."},{"definition":"The reinvestment of funds in a new issue of the same or similar investment."},{"definition":"A fee paid by a borrower in order to defer full repayment of a loan."},{"definition":"In the National or European lottery, the situation in which a jackpot that has not been won is carried over to the next week."},{"definition":"A target on the pinball table that is activated when the ball rolls over it."}],"partOfSpeech":"n"}]},{"word":"HELPERS","idx":17627,"count":1979877,"meanings":[{"definitions":[{"definition":"One who helps; an aide."},{"definition":"That which helps; anything serving to assist."},{"definition":"A person who does cleaning and cooking in a family home, or in a market; domestic employee."},{"definition":"A locomotive that assists a train, usually on steep gradients."}],"partOfSpeech":"n"}]},{"word":"ELAPSED","idx":17629,"count":1979609,"meanings":[{"definitions":[{"definition":"(of time) To pass or move by.","example":"He allowed a month to elapse before beginning the work."}],"partOfSpeech":"ve"}]},{"word":"THANX","idx":17630,"count":1979526,"meanings":[{"definitions":[{"definition":"Used to express appreciation or gratitude.","example":"Could you give me a hand, please? — Yes, sure. — Thanks."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"thanx-au"}]},{"word":"ANTHRAX","idx":17631,"count":1979121,"meanings":[{"definitions":[{"definition":"An acute infectious disease of herbivores, especially sheep and cattle, caused by Bacillus anthracis."},{"definition":"The human disease that can occur in humans through contact with infected herbivores, tissue from infected animals, or high concentrations of anthrax spores, but is not usually spread between humans, with symptoms including lesions on the skin or in the lungs, often fatal."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"anthrax-us","text":"/ˈæn.θɹæks/"}]},{"word":"ACADEMIES","idx":17632,"count":1979091,"meanings":[{"definitions":[{"definition":"(usually capitalized) The garden where Plato taught."},{"definition":"(usually capitalized) Plato's philosophical system based on skepticism; Plato's followers."},{"definition":"An institution for the study of higher learning; a college or a university; typically a private school."},{"definition":"A school or place of training in which some special art is taught.","example":"the military academy at West Point; a riding academy; the Academy of Music.; a music academy; a language academy"},{"definition":"A society of learned people united for the advancement of the arts and sciences, and literature, or some particular art or science."},{"definition":"The knowledge disseminated in an Academy."},{"definition":"(with the, without reference to any specific academy) Academia."},{"definition":"A body of established opinion in a particular field, regarded as authoritative."},{"definition":"A school directly funded by central government, independent of local control."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈkædəmiz/"}]},{"word":"TOUT","idx":17633,"count":1978808,"meanings":[{"definitions":[{"definition":"Someone advertising for customers in an aggressive way.","example":"Be careful of the ticket touts outside the arena, they are famed for selling counterfeits."},{"definition":"A person, at a racecourse, who offers supposedly inside information on which horse is likely to win."},{"definition":"A spy for a smuggler, thief, or similar."},{"definition":"An informer in the Irish Republican Army."},{"definition":"In the game of solo, a proposal to win all eight tricks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flaunt, to publicize/publicise; to boast or brag; to promote.","example":"Mary has been touted as a potential succesor to the current COE."},{"definition":"To look upon or watch."},{"definition":"To spy out information about (a horse, a racing stable, etc.)."},{"definition":"To give a tip on (a racehorse) to a person, with the expectation of sharing in any winnings."},{"definition":"To spy out the movements of racehorses at their trials, or to get by stealth or other improper means the secrets of the stable, for betting purposes."},{"definition":"To act as a tout; to give a tip on a racehorse."},{"definition":"To look for, try to obtain; used with for."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tout-1-us","text":"/taʊt/"},{"audio":"tout-1-au","text":"/taʊt/"}]},{"word":"SHOCKWAVE","idx":17634,"count":1978764,"meanings":[{"definitions":[{"definition":"A powerful compression wave produced by the movement of a body through a fluid or gas at a velocity greater than the local speed of sound."},{"definition":"Any violent disturbance."}],"partOfSpeech":"n"}]},{"word":"IMITATION","idx":17636,"count":1978554,"meanings":[{"definitions":[{"definition":"The act of imitating."},{"definition":"(attributive) A copy or simulation; something that is not the real thing.","example":"imitation leather"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪmɪˈteɪʃən/"}]},{"word":"HARVESTED","idx":17637,"count":1978518,"meanings":[{"definitions":[{"definition":"To bring in a harvest; reap; glean."},{"definition":"To be occupied bringing in a harvest","example":"Harvesting is a stressing, thirsty occupation"},{"definition":"To win, achieve a gain.","example":"The rising star harvested well-deserved acclaim, even an Oscar under 21"}],"partOfSpeech":"ve"}]},{"word":"DAB","idx":17638,"count":1978263,"meanings":[{"definitions":[{"definition":"A soft tap or blow; a blow or peck from a bird's beak; an aimed blow."},{"definition":"A soft, playful box given in greeting or approval."},{"definition":"A small amount, a blob of some soft or wet substance.","example":"a dab of glue"},{"definition":"(chiefly in the plural) Fingerprint."},{"definition":"A hip hop dance move in which the dancer simultaneously drops the head while raising an arm, briefly resting their face in the elbow, as if sneezing into their elbow."},{"definition":"One skilful or proficient; an expert; an adept."},{"definition":"A small flatfish of the family Pleuronectidae, especially Limanda limanda; a flounder."},{"definition":"A sand dab, a small flatfish of genus Citharichthys."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press lightly in a repetitive motion with a soft object without rubbing.","example":"I dabbed my face with a towel."},{"definition":"To apply a substance in this way.","example":"He dabbed moisturizing liquid on his face."},{"definition":"To strike by a thrust; to hit with a sudden blow or thrust."},{"definition":"To apply hash oil to a heated surface for the purpose of efficient combustion."},{"definition":"To perform the dab dance move, by moving both arms to one side of the body parallel with your head."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"With a dab, or sudden contact."}],"partOfSpeech":"v"},{"definitions":[{"definition":"(costers) Bad."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dab-us","text":"/dæb/"}]},{"word":"HOPEFUL","idx":17639,"count":1978152,"meanings":[{"definitions":[{"definition":"Someone who is hoping for success or victory, especially as a candidate in a political election.","example":"Several presidential hopefuls are campaigning in New Hampshire this week."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Feeling hope","example":"I am hopeful that I will recover from the disease."},{"definition":"Inspiring hope"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈhoʊpfəl/"},{"text":"/ˈhəʊpfəl/"}]},{"word":"FURNISHING","idx":17640,"count":1977961,"meanings":[{"definitions":[{"definition":"To provide a place with furniture, or other equipment."},{"definition":"To supply or give (something)."},{"definition":"To supply (somebody) with something."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(chiefly in the plural) Furniture, fittings, and other detachable accessories."},{"definition":"(of an animal, in the plural) A portion of longer hair within the coat of a dog, rabbit, etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"furnishing-us"}]},{"word":"NEGATIVELY","idx":17641,"count":1977538,"meanings":[{"definitions":[{"definition":"In a negative manner; so as to be damaging or not positive."},{"definition":"(responding to a question, proposal, vote, etc.) In the negative; with the answer “no.”"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"negatively-us"}]},{"word":"RESIDENCES","idx":17643,"count":1977445,"meanings":[{"definitions":[{"definition":"The place where one lives; one's home."},{"definition":"A building used as a home."},{"definition":"The place where a corporation is established."},{"definition":"The state of living in a particular place or environment."},{"definition":"Accommodation for students at a university or college."},{"definition":"The place where anything rests permanently."},{"definition":"Subsidence, as of a sediment"},{"definition":"That which falls to the bottom of liquors; sediment; also, refuse; residuum."},{"definition":"A base of Russian espionage operations within a foreign country."}],"partOfSpeech":"n"}]},{"word":"SPINACH","idx":17644,"count":1977356,"meanings":[{"definitions":[{"definition":"A particular edible plant, Spinacia oleracea, or its leaves."},{"definition":"Any of numerous plants, or their leaves, which are used for greens in the same way Spinacia oleraceae is."},{"definition":"Plants with spinach-like leaves that are noxious in some way"},{"definition":"Plants with spinach-like leaves that have medicinal use"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈspɪnɪd͡ʒ/"}]},{"word":"BPM","idx":17645,"count":1977162,"meanings":[{"definitions":[{"definition":"Initialism of beat per minute."}],"partOfSpeech":"n"}]},{"word":"LIQUIDATION","idx":17646,"count":1976877,"meanings":[{"definitions":[{"definition":"The act of exchange of an asset of lesser liquidity with a more liquid one, such as cash."},{"definition":"The selling of the assets of a business as part of the process of dissolving the business.","example":"The store is having a liquidation sale: everything must go as they go out of business."},{"definition":"Murder of dehumanized victims by a regime (and possibly its allies)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌlɪkwəˈdeɪʃən/"}]},{"word":"PREDECESSOR","idx":17647,"count":1976404,"meanings":[{"definitions":[{"definition":"One who precedes; one who has preceded another in any state, position, office, etc.; one whom another follows or comes after, in any office or position."},{"definition":"A model or type of machinery or device which precedes the current one. Usually used to describe an earlier, outdated model."},{"definition":"A vertex having a directed path to another vertex"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"predecessor-uk","text":"/ˈpɹiːdɪsɛsə(ɹ)/"}]},{"word":"CHEEKS","idx":17649,"count":1976189,"meanings":[{"definitions":[{"definition":"The soft skin on each side of the face, below the eyes; the outer surface of the sides of the oral cavity."},{"definition":"(usually in the plural) The lower part of the buttocks that is often exposed beneath very brief underwear, swimwear, or extremely short shorts."},{"definition":"Impudence.","example":"You’ve got some cheek, asking me for money!"},{"definition":"One of the genae, flat areas on the sides of a trilobite's cephalon."},{"definition":"One of the pieces of a machine, or of timber or stonework, that form corresponding sides or a similar pair.","example":"the cheeks of a vice; the cheeks of a gun carriage"},{"definition":"(in plural) The branches of a bridle bit."},{"definition":"Either side of an axehead."},{"definition":"The middle section of a flask, made so that it can be moved laterally, to permit the removal of the pattern from the mould."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be impudent towards.","example":"Don't cheek me, you little rascal!"},{"definition":"To pull a horse's head back toward the saddle using the cheek strap of the bridle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cheeks-us","text":"/tʃiːks/"}]},{"word":"HARE","idx":17650,"count":1976109,"meanings":[{"definitions":[{"definition":"Any of several plant-eating animals of the family Leporidae, especially of the genus Lepus, similar to a rabbit, but larger and with longer ears."},{"definition":"The player in a paperchase, or hare and hounds game, who leaves a trail of paper to be followed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move swiftly."},{"definition":"To excite; to tease, or worry; to harry."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Grey, hoary; grey-haired, venerable (of people).","example":"a hare old man"},{"definition":"Cold, frosty (of weather).","example":"a hare day"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hare-us","text":"/heə/"}]},{"word":"BEASTS","idx":17651,"count":1975860,"meanings":[{"definitions":[{"definition":"Any animal other than a human; usually only applied to land vertebrates, especially large or dangerous four-footed ones."},{"definition":"(more specific) A domestic animal, especially a bovine farm animal."},{"definition":"A person who behaves in a violent, antisocial or uncivilized manner."},{"definition":"Anything regarded as larger or more powerful than one of its normal size or strength.","example":"That is a beast of a stadium."},{"definition":"Someone who is particularly impressive, especially athletically or physically."},{"definition":"(prisons) A sex offender."},{"definition":"Something unpleasant and difficult."},{"definition":"A thing or matter, especially a difficult or unruly one."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To impose arduous exercises, either as training or as punishment."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"beasts-us","text":"/biːsts/"}]},{"word":"TOUCHDOWN","idx":17652,"count":1975719,"meanings":[{"definitions":[{"definition":"A six-point score occurring when the ball enters possession of a team's player in the opponent's end zone.","example":"Today I scored my first touchdown."},{"definition":"A defensive action of grounding the ball in the team’s own in-goal to stop the play"},{"definition":"A try (scoring play of grounding the ball in the opposing team’s in-goal)"},{"definition":"The moment when an aircraft or spacecraft makes first or final contact with the ground during a landing.","example":"The passengers audibly relaxed at touchdown."},{"definition":"The moment of contact of a tornado with the ground."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʌtʃdaʊn/"}]},{"word":"PLANAR","idx":17653,"count":1975442,"meanings":[{"definitions":[{"definition":"Of or pertaining to a plane.","example":"A planar projection of a three-dimensional object is its projection onto a plane."},{"definition":"Flat, two-dimensional."},{"definition":"(of a graph) Able to be embedded in the plane with no edges intersecting.","example":"A complete graph with more than four nodes is never planar."},{"definition":"(transistor chip, semiconductor devices) Having a flat profile, not etched into a mesa."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpleɪnɚ/"},{"text":"/ˈpleɪnə/"}]},{"word":"PHILANTHROPY","idx":17654,"count":1975441,"meanings":[{"definitions":[{"definition":"Benevolent altruism with the intention of increasing the well-being of humankind."},{"definition":"Charitable giving, charity.","example":"As public funding is reduced, we depend increasingly on private philanthropy."},{"definition":"A philanthropic act.","example":"His tombstone lists his various philanthropies."},{"definition":"A charitable foundation.","example":"the Rockefeller philanthropies"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"philanthropy-uk","text":"/fɪˈlænθɹəpiː/"}]},{"word":"ADEQUACY","idx":17655,"count":1975306,"meanings":[{"definitions":[{"definition":"The quality of being sufficient, adequate or able to meet the needs.","example":"His zeal is, of course, unquestionable; his adequacy, however, I doubt."}],"partOfSpeech":"n"}]},{"word":"PEANUTS","idx":17659,"count":1974558,"meanings":[{"definitions":[{"definition":"A legume resembling a nut, the fruit of the plant Arachis hypogaea."},{"definition":"A very small clam."},{"definition":"A very small or insufficient amount (especially of a salary).","example":"It's a fun job, but it pays peanuts."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pull on somebody's tie as a prank, causing the knot to tighten."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"peanuts-us","text":"/ˈpinəts/"}]},{"word":"DISCOVERS","idx":17660,"count":1974534,"meanings":[{"definitions":[{"definition":"To find or learn something for the first time.","example":"Turning the corner, I discovered a lovely little shop. I discovered that they sold widgets."},{"definition":"To remove the cover from; to uncover (a head, building etc.)."},{"definition":"To expose, uncover.","example":"The gust of wind discovered a bone in the sand."},{"definition":"To create by moving a piece out of another piece's line of attack.","example":"This move discovers an attack on a vital pawn."},{"definition":"To reveal (information); to divulge, make known.","example":"I discovered my plans to the rest of the team."},{"definition":"To reconnoitre, explore (an area)."},{"definition":"To manifest without design; to show; to exhibit."}],"partOfSpeech":"ve"}]},{"word":"FRANCHISING","idx":17662,"count":1974199,"meanings":[{"definitions":[{"definition":"To confer certain powers on; grant a franchise to; authorize."},{"definition":"To set free; invest with a franchise or privilege; enfranchise."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The establishment, granting, or use of a franchise."}],"partOfSpeech":"n"}]},{"word":"DISCARD","idx":17664,"count":1974132,"meanings":[{"definitions":[{"definition":"Anything discarded."},{"definition":"A discarded playing card in a card game."},{"definition":"A temporary variable used to receive a value of no importance and unable to be read later."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw away, to reject."},{"definition":"To make a discard; to throw out a card."},{"definition":"To dismiss from employment, confidence, or favour; to discharge."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"discard-uk-verb","text":"/dɪsˈkɑːd/"},{"audio":"discard-uk-noun","text":"/ˈdɪskɑːd/"}]},{"word":"CAVALRY","idx":17665,"count":1974089,"meanings":[{"definitions":[{"definition":"The military arm of service that fights while riding horses."},{"definition":"An individual unit of the cavalry arm of service."},{"definition":"The branch of the military transported by fast light vehicles, also known as mechanized cavalry."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cavalry-us","text":"/ˈkævəlɹi/"}]},{"word":"GED","idx":17666,"count":1973444,"meanings":[{"definitions":[{"definition":"The pike or luce."},{"definition":"A greedy person"}],"partOfSpeech":"n"}]},{"word":"BREAKERS","idx":17667,"count":1973331,"meanings":[{"definitions":[{"definition":"Something that breaks."},{"definition":"A machine for breaking rocks, or for breaking coal at the mines"},{"definition":"The building in which such a machine is placed."},{"definition":"A person who specializes in breaking things."},{"definition":"(chiefly in the plural) A wave breaking into foam against the shore, or against a sandbank, or a rock or reef near the surface, considered a useful warning to ships of an underwater hazard"},{"definition":"A breakdancer."},{"definition":"A user of CB radio."},{"definition":"A small cask of liquid kept permanently in a ship's boat in case of shipwreck."},{"definition":"One who works in shipbreaking."}],"partOfSpeech":"n"}]},{"word":"QUORUM","idx":17668,"count":1973172,"meanings":[{"definitions":[{"definition":"The minimum number of members required for a group to officially conduct business and to cast votes, often but not necessarily a majority or supermajority.","example":"We can discuss the issue tonight, but cannot vote until we have a quorum."},{"definition":"A selected body of persons."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"quorum-us","text":"/ˈkwɔːɹ.əm/"}]},{"word":"FORWARDS","idx":17669,"count":1973103,"meanings":[{"definitions":[{"definition":"Toward the front."},{"definition":"In a progressive direction."}],"partOfSpeech":"v"},{"definitions":[{"definition":"To advance, promote."},{"definition":"To send (a letter, email etc.) to a third party.","example":"I'll be glad to forward your mail to you while you're gone."},{"definition":"To assemble (a book) by sewing sections, attaching cover boards, and so on."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An introductory section preceding the main text of a book or other document; a preface or introduction."},{"definition":"One of the eight players (comprising two props, one hooker, two locks, two flankers and one number eight, collectively known as the pack) whose primary task is to gain and maintain possession of the ball (compare back)."},{"definition":"A player on a team in football (soccer) in the row nearest to the opposing team's goal, who are therefore principally responsible for scoring goals."},{"definition":"An umbrella term for a centre or winger in ice hockey."},{"definition":"The small forward or power forward position; two frontcourt positions that are taller than guards but shorter than centers."},{"definition":"The front part of a vessel."},{"definition":"An e-mail message that is forwarded to another recipient or recipients; an electronic chain letter."},{"definition":"A direct agreement between two parties to buy or sell an asset at a specific point in the future; distinguished from a futures contract in that the latter is standardized and traded on an exchange."},{"definition":"Agreement; covenant."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɔɹwɚdz/"},{"text":"/ˈfɔːwədz/"}]},{"word":"ECARD","idx":17670,"count":1972715,"meanings":[{"definitions":[{"definition":"A computerized greeting card, typically hosted on a Web site to which the recipient is directed by an e-mail message."}],"partOfSpeech":"n"}]},{"word":"PREVALENT","idx":17671,"count":1972549,"meanings":[{"definitions":[{"definition":"Widespread or preferred."},{"definition":"Superior in frequency or dominant."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"prevalent-us","text":"/ˈpɹɛvələnt/"}]},{"word":"PLAT","idx":17672,"count":1972329,"meanings":[{"definitions":[{"definition":"A plot of land; a lot."},{"definition":"A map showing the boundaries of real properties (delineating one or more plots of land), especially one that forms part of a legal document."},{"definition":"A plot, a scheme."},{"definition":"A braid; a plait (of hair, straw, etc.)."},{"definition":"Material produced by braiding or interweaving, especially a material of interwoven straw from which straw hats are made."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create a plat; to lay out property lots and streets; to map."},{"definition":"(obsolete except regional England) To braid, to plait."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(obsolete except Scotland) Flat; level; (by extension) frank, on the level."}],"partOfSpeech":"j"},{"definitions":[{"definition":"(obsolete except Scotland) Flatly, plainly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"plat-uk","text":"/plæt/"}]},{"word":"EXPLOITS","idx":17673,"count":1972178,"meanings":[{"definitions":[{"definition":"A heroic or extraordinary deed."},{"definition":"An achievement.","example":"The first trek to the summit of Mount Everest was a stunning exploit."},{"definition":"A program or technique that exploits a vulnerability in other software."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use for one’s own advantage."},{"definition":"To forcibly deprive someone of something to which she or he has a natural right.","example":"Materialistic monsters who exploit \"kind\" folks will not have good outcomes, no matter how much comforts were ill-gained."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"exploits-us"}]},{"word":"DUKES","idx":17676,"count":1971678,"meanings":[{"definitions":[{"definition":"The male ruler of a duchy (female equivalent: duchess)."},{"definition":"The sovereign of a small state."},{"definition":"A high title of nobility; the male holder of a dukedom."},{"definition":"A grand duke."},{"definition":"Any of various nymphalid butterflies of the Asian genera Bassarona and Dophla."},{"definition":"(usually in the plural) A fist.","example":"Put up your dukes!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit or beat with the fists."},{"definition":"To give cash to; to give a tip to.","example":"I duked him twenty dollars."}],"partOfSpeech":"ve"}]},{"word":"OFFENDED","idx":17677,"count":1971454,"meanings":[{"definitions":[{"definition":"To hurt the feelings of; to displease; to make angry; to insult.","example":"Your accusations offend me deeply."},{"definition":"To feel or become offended; to take insult.","example":"Don't worry. I don't offend easily."},{"definition":"To physically harm, pain.","example":"Strong light offends the eye."},{"definition":"To annoy, cause discomfort or resent.","example":"Physically enjoyable frivolity can still offend the conscience"},{"definition":"To sin, transgress divine law or moral rules."},{"definition":"To transgress or violate a law or moral requirement."},{"definition":"To cause to stumble; to cause to sin or to fall."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈfɛndɪd/"}]},{"word":"TRIMMED","idx":17678,"count":1971349,"meanings":[{"definitions":[{"definition":"To reduce slightly; to cut; especially, to remove excess.","example":"A ranch steak is usually trimmed of all excess fat."},{"definition":"To decorate or adorn; especially of a Christmas tree.","example":"They traditionally trim the tree on Christmas Eve."},{"definition":"(of an aircraft) To adjust pitch using trim tabs."},{"definition":"(of a vessel) To modify the angle relative to the water by shifting cargo or ballast; to adjust for sailing; to assume, or cause to assume a certain position, or trim, in the water."},{"definition":"(of a vessel's sails) To modify the angle (of the sails) relative to the wind, especially to set them at the most advantageous angle."},{"definition":"To balance; to fluctuate between parties, so as to appear to favour each."},{"definition":"To make trim; to put in due order for any purpose; to make right, neat, or pleasing; to adjust."},{"definition":"(of timber) To dress; to make smooth."},{"definition":"To rebuke; to reprove."},{"definition":"To beat or thrash."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been trimmed"},{"definition":"Furnished with trimmings"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"trimmed-us"}]},{"word":"PY","idx":17679,"count":1971270,"meanings":[{"definitions":[{"definition":"A phonetic script or romanization system for a language spoken in the People's Republic of China."},{"definition":"(smoking) A unit for measuring the number of cigarettes a person has smoked previously; it is calculated by multiplying the average number of packs of cigarettes the person smokes per day by the number of years the person has smoked."}],"partOfSpeech":"n"}]},{"word":"FERRIES","idx":17680,"count":1971054,"meanings":[{"definitions":[{"definition":"A ship used to transport people, smaller vehicles and goods from one port to another, usually on a regular schedule."},{"definition":"A place where passengers are transported across water in such a ship."},{"definition":"The legal right or franchise that entitles a corporate body or an individual to operate such a service."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To carry; transport; convey.","example":"Trucks plowed through the water to ferry flood victims to safety."},{"definition":"To move someone or something from one place to another, usually repeatedly.","example":"Being a good waiter takes more than the ability to ferry plates of food around a restaurant."},{"definition":"To carry or transport over a contracted body of water, as a river or strait, in a boat or other floating conveyance plying between opposite shores."},{"definition":"To pass over water in a boat or by ferry."}],"partOfSpeech":"ve"}]},{"word":"MULLER","idx":17684,"count":1970236,"meanings":[{"definitions":[{"definition":"One who, or that which, mulls."},{"definition":"A grinding stone, held in the hand, used especially for preparing paints and powders."},{"definition":"A vessel in which wine, etc., is mulled over a fire."},{"definition":"A machine that mixes sand and clay for use in metal castings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grind up into, or as if into, powder."},{"definition":"To beat; to thrash (a person)."},{"definition":"To defeat or destroy utterly (as in a sport or competition)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmʌlɚ/"},{"text":"/ˈmʌlə/"}]},{"word":"PROSTITUTION","idx":17685,"count":1970168,"meanings":[{"definitions":[{"definition":"Engaging in sexual activity with another person for pay.","example":"Her addiction brought her to the point that prostitution was the only means she had to survive."},{"definition":"(by extension) Debasement for profit or impure motives.","example":"The television advertising job was a prostitution of the talents of one of the great writers of the century."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"prostitution-us"}]},{"word":"MOSQUE","idx":17686,"count":1969984,"meanings":[{"definitions":[{"definition":"A place of worship for Muslims, often having at least one minaret; a masjid.","example":"There's a mosque near where I live."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mosque-us","text":"/mɑsk/"}]},{"word":"FUDGE","idx":17687,"count":1969555,"meanings":[{"definitions":[{"definition":"A type of very sweet candy or confection, usually made from sugar, butter, and milk or cream. Often used in the US synonymously with chocolate fudge.","example":"Have you tried the vanilla fudge? It's delicious!"},{"definition":"Light or frothy nonsense."},{"definition":"A deliberately misleading or vague answer."},{"definition":"A made-up story."},{"definition":"A less than perfect decision or solution; an attempt to fix an incorrect solution after the fact."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To try to avoid giving a direct answer.","example":"When I asked them if they had been at the party, they fudged."},{"definition":"To alter something from its true state, as to hide a flaw or uncertainty. Always deliberate, but not necessarily dishonest or immoral.","example":"Do you fudge your age?"},{"definition":"To botch or bungle something."},{"definition":"To cheat, especially in the game of marbles."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(minced oath) Used in place of fuck."},{"definition":"Nonsense; tommyrot."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"fudge-us","text":"/fʌdʒ/"}]},{"word":"EXTRACTOR","idx":17688,"count":1969493,"meanings":[{"definitions":[{"definition":"Any of various mechanical devices that extract a component from others."},{"definition":"An apparatus that uses a solvent to remove soluble substances from a mixture."},{"definition":"A centrifugal drying machine."},{"definition":"(in a gun) A part of the bolt that removes a cartridge from the chamber."},{"definition":"A particular kind of bipartite graph."},{"definition":"A function which, being applied to output from a weakly random entropy source, together with a short, uniformly random seed, generates a highly random output that appears independent from the source and uniformly distributed."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪkˈstɹæktɚ/"},{"text":"/ɪkˈstɹæktə/"}]},{"word":"HORSEBACK","idx":17689,"count":1969441,"meanings":[{"definitions":[{"definition":"(usually with on, upon, etc.) The back of a horse."},{"definition":"A ridge of sand, gravel, and boulders."}],"partOfSpeech":"n"},{"definitions":[{"definition":"On the back of a horse.","example":"He rode horseback into town."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"horseback-us","text":"/ˈhɔɹsˌbæk/"}]},{"word":"VESTED","idx":17690,"count":1969347,"meanings":[{"definitions":[{"definition":"To clothe with, or as with, a vestment, or garment; to dress; to robe; to cover, surround, or encompass closely."},{"definition":"To clothe with authority, power, etc.; to put in possession; to invest; to furnish; to endow; followed by with and the thing conferred.","example":"to vest a court with power to try cases of life and death"},{"definition":"To place or give into the possession or discretion of some person or authority; to commit to another; with in before the possessor.","example":"The power of life and death is vested in the king, or in the courts."},{"definition":"To invest; to put.","example":"to vest money in goods, land, or houses"},{"definition":"To clothe with possession; also, to give a person an immediate fixed right of present or future enjoyment of.","example":"an estate is vested in possession"},{"definition":"(of an inheritance or a trust fund) To devolve upon the person currently entitled when a prior interest has ended.","example":"Upon the death of the Sovereign the Crown automatically vests in the next heir without the need of coronation or other formality."},{"definition":"(financial) To become vested, to become permanent.","example":"My pension vests at the end of the month and then I can take it with me when I quit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Settled, fixed or absolute, with no contingencies."},{"definition":"Dressed or clothed, especially in vestments.","example":"The Pope, vested in mitre and cope, is greeted by a newly created Cardinal."}],"partOfSpeech":"j"}]},{"word":"TERRIBLY","idx":17691,"count":1969093,"meanings":[{"definitions":[{"definition":"So as to cause terror or awe.","example":"The lion roared terribly."},{"definition":"Very; extremely.","example":"He's terribly busy and you really shouldn't bother him."},{"definition":"Very badly.","example":"She took part in the karaoke, but sang terribly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"terribly-us","text":"/ˈtɛɹ.ɪ.bli/"}]},{"word":"EARNEST","idx":17692,"count":1968639,"meanings":[{"definitions":[{"definition":"Gravity; serious purpose; earnestness."},{"definition":"Seriousness; reality; actuality (as opposed to joking or pretence)"},{"definition":"A sum of money paid in advance as a deposit; hence, a pledge, a guarantee, an indication of something to come."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be serious with; use in earnest."},{"definition":"To gain (success, reward, recognition) through applied effort or work.","example":"You can have the s'mores: you earned them, clearing the walkway of snow so well."},{"definition":"To receive payment for work.","example":"He earns seven million dollars a year as CEO.  My bank account is only earning one percent interest."},{"definition":"To receive payment for work.","example":"Now that you are earning, you can start paying me rent."},{"definition":"To cause (someone) to receive payment or reward.","example":"My CD earns me six percent!"},{"definition":"To achieve by being worthy of.","example":"to earn a spot in the top 20"},{"definition":"To curdle, as milk."},{"definition":"To long; to yearn."},{"definition":"To grieve."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(said of an action or an utterance) Serious or honest"},{"definition":"(with a positive sense) Focused in the pursuit of an objective; eager to obtain or do.","example":"earnest prayers"},{"definition":"Intent; focused; showing a lot of concentration.","example":"earnest attention."},{"definition":"(said of a person or a person's character) Possessing or characterised by seriousness.","example":"an earnest disposition"},{"definition":"Strenuous; diligent.","example":"earnest efforts"},{"definition":"Serious; weighty; of a serious, weighty, or important nature; important."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"earnest-us","text":"/ˈɝnɪst/"}]},{"word":"MYOCARDIAL","idx":17696,"count":1967884,"meanings":[{"definitions":[{"definition":"Relating to the myocardium, the thick muscular wall of the heart."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/maɪoʊˈkɑɹdi.əl/"},{"text":"/maɪəʊˈkɑːdi.əl/"}]},{"word":"CALLBACK","idx":17700,"count":1967564,"meanings":[{"definitions":[{"definition":"The return of a situation to a previous position or state."},{"definition":"A return telephone or radio call; especially one made automatically to authenticate a logon to a computer network."},{"definition":"A product recall because of a defect or safety concern."},{"definition":"A function pointer passed as an argument to another function."},{"definition":"A follow-up audition (casting)"},{"definition":"A joke which references an earlier joke in the same routine"}],"partOfSpeech":"n"}]},{"word":"TORY","idx":17701,"count":1967098,"meanings":[{"definitions":[{"definition":"(UK politics) A member or supporter of the Conservative Party, which evolved from Royalist politicians; historically associated with upholding the rights of the monarchy and the privileges of the established Church."},{"definition":"(by extension) One who is like a British Tory; someone politically conservative."},{"definition":"(Canadian politics) A member or supporter of the Conservative Party of Canada, one of that party's predecessors, or an affiliated provincial political party."},{"definition":"A member of the political factions that sought to prevent the exclusion of James, Duke of York from the throne of England in the 17th century."},{"definition":"An Irish rebel fighting against English rule at the end of the Confederate War and Cromwellian invasion; later extended to other rebels or bandits."},{"definition":"(American Revolution) A loyal British subject."},{"definition":"(American Civil War, Confederate states) A Union sympathizer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(UK politics) Of or belonging to the Tory Party or the Conservative Party."},{"definition":"(Canadian politics) Of or belonging to the Conservative Party of Canada, one of that party's predecessors, or an affiliated provincial political party."}],"partOfSpeech":"j"}]},{"word":"ENCOMPASSES","idx":17702,"count":1967049,"meanings":[{"definitions":[{"definition":"To form a circle around; to encircle."},{"definition":"To include within its scope; to circumscribe or go round so as to surround; to enclose; to contain."},{"definition":"To include completely; to describe fully or comprehensively.","example":"This book on English grammar encompasses all irregular verbs."},{"definition":"To go around, especially, to circumnavigate.","example":"Drake encompassed the globe."}],"partOfSpeech":"ve"}]},{"word":"SANDER","idx":17704,"count":1966734,"meanings":[{"definitions":[{"definition":"A person employed to sand wood."},{"definition":"A machine to mechanize the process of sanding."},{"definition":"A device which spreads sand on the rails in wet, snowy or icy conditions to improve traction."},{"definition":"A small device resembling a salt shaker but containing sand that was shaken over a document to remove excess ink."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsændɚ/"}]},{"word":"CONDUCTIVITY","idx":17707,"count":1966252,"meanings":[{"definitions":[{"definition":"The ability of a material to conduct electricity, heat, fluid or sound"},{"definition":"The reciprocal of resistivity"}],"partOfSpeech":"n"}]},{"word":"VOR","idx":17708,"count":1966243,"meanings":[{"definitions":[{"definition":"Towards; in the direction of.","example":"He was headed for the door when he remembered."},{"definition":"Directed at; intended to belong to.","example":"I have something for you."},{"definition":"In order to help, benefit, gratify, honor etc. (someone or something).","example":"Everything I do, I do for you."},{"definition":"To be used or treated in a stated way, or with a stated purpose.","example":"The cake is for Tom and Helen's anniversary."},{"definition":"Supporting, in favour of.","example":"All those for the motion raise your hands."},{"definition":"Because of.","example":"He looks better for having lost weight."},{"definition":"Intended to cure, remove or counteract; in order to cure, remove or counteract.","example":"I need to spray my house for termites."},{"definition":"Over (a period of time).","example":"I've lived here for three years."},{"definition":"Throughout or across (a distance in space).","example":"I can see for miles."},{"definition":"Used to introduce a subject within a to-infinitive clause.","example":"All I want is for you to be happy."},{"definition":"On behalf of.","example":"I speak for the Prime Minister."},{"definition":"In the role or capacity of; instead of; in place of.","example":"He's got a turnip for a brain."},{"definition":"In exchange for; in correspondence or equivalence with.","example":"He matched me blow for blow."},{"definition":"In order to obtain or acquire.","example":"Can you go to the store for some eggs?"},{"definition":"By the standards of, usually with the implication of those standards being lower than one might otherwise expect.","example":"Fair for its day."},{"definition":"To be, or as being.","example":"Don't take me for a fool."},{"definition":"(usually in the phrase 'for all') Despite, in spite of.","example":"For all his expensive education, he didn't seem very bright."},{"definition":"Indicating something desired or anticipated.","example":"Ah! for wings to soar …"},{"definition":"(in expressions such as 'for a start') Introducing the first item(s) in a potential sequence.","example":"Go scuba diving? For one thing, I can't even swim."},{"definition":"(with names) In honor of; after.","example":"He is named for his grandfather."},{"definition":"Due or facing (a certain outcome or fate).","example":"He totally screwed up that project. Now he's surely for the sack."},{"definition":"Out of; used to indicate a fraction, a ratio","example":"In term of base hits, Jones was three for four on the day"},{"definition":"Used as part of a score to indicate the number of wickets that have fallen.","example":"At close of play, England were 305 for 3."},{"definition":"Indicating that in prevention of which, or through fear of which, anything is done."},{"definition":"Used in various more-or-less idiomatic ways to construe individual verbs, indicating various semantic relationships such as target, purpose, result, etc.; see also the entries for individual phrasal verbs, e.g. ask for, look for, stand for, etc.","example":"to account for one's whereabouts    to care for a relative    to settle for second best    to allow for mistakes"}],"partOfSpeech":"pr"}]},{"word":"CONFEDERATE","idx":17709,"count":1966184,"meanings":[{"definitions":[{"definition":"A member of a confederacy."},{"definition":"An accomplice in a plot."},{"definition":"An actor who participates in a psychological experiment pretending to be a subject but in actuality working for the researcher (also known as a \"stooge\")."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To combine in a confederacy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of, relating to, or united in a confederacy"},{"definition":"Banded together; allied."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"confederate-us"}]},{"word":"PRESUMED","idx":17710,"count":1966005,"meanings":[{"definitions":[{"definition":"With infinitive object: to be so presumptuous as (to do something) without proper authority or permission.","example":"I wouldn't presume to tell him how to do his job."},{"definition":"To perform, do (something) without authority; to lay claim to without permission.","example":"Don't make the decision yourself and presume too much."},{"definition":"To assume or suggest to be true (without proof); to take for granted, to suppose.","example":"Dr. Livingstone, I presume?"},{"definition":"To be presumptuous; with on, upon, to take advantage (of), to take liberties (with)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Appearing to be the most probable, often with some preparations starting to be made for it."}],"partOfSpeech":"j"}]},{"word":"CLIMAX","idx":17712,"count":1965596,"meanings":[{"definitions":[{"definition":"(originally rhetorical) A rhetorical device in which a series is arranged in ascending order."},{"definition":"An instance of such an ascending series."},{"definition":"The culmination of a narrative's rising action, the turning point."},{"definition":"(now commonly) A culmination or acme: the last term in an ascending series, particularly:"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reach or bring to a climax."},{"definition":"To orgasm; to reach orgasm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"climax-us","text":"/ˈklaɪmæks/"}]},{"word":"BLENDING","idx":17713,"count":1965386,"meanings":[{"definitions":[{"definition":"To mingle; to mix; to unite intimately; to pass or shade insensibly into each other.","example":"To make hummus you need to blend chickpeas, olive oil, lemon juice and garlic."},{"definition":"To be mingled or mixed."},{"definition":"To pollute by mixture or association; to spoil or corrupt; to blot; to stain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or result of something being blended.","example":"blendings of old and new"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈblɛndɪŋ/"}]},{"word":"WEAVE","idx":17715,"count":1965230,"meanings":[{"definitions":[{"definition":"A type or way of weaving.","example":"That rug has a very tight weave."},{"definition":"Human or artificial hair worn to alter one's appearance, either to supplement or to cover the natural hair."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form something by passing lengths or strands of material over and under one another.","example":"This loom weaves yarn into sweaters."},{"definition":"To spin a cocoon or a web.","example":"Spiders weave beautiful but deadly webs."},{"definition":"To unite by close connection or intermixture."},{"definition":"To compose creatively and intricately; to fabricate.","example":"to weave the plot of a story"},{"definition":"To move by turning and twisting.","example":"The drunk weaved into another bar."},{"definition":"To make (a path or way) by winding in and out or from side to side.","example":"The ambulance weaved its way through the heavy traffic."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"weave-us","text":"/wiːv/"}]},{"word":"POSTPONED","idx":17717,"count":1964751,"meanings":[{"definitions":[{"definition":"To delay or put off an event, appointment etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Done later than originally planned; delayed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"postponed-us"}]},{"word":"PHILOSOPHERS","idx":17719,"count":1964528,"meanings":[{"definitions":[{"definition":"A lover of wisdom."},{"definition":"A student of philosophy."},{"definition":"A scholar or expert engaged in or contributing to philosophical inquiry."},{"definition":"A person who applies the principles of philosophy to the conduct of their life, as by acting calmly and rationally in the face of inevitable change."},{"definition":"A student, scholar, or expert in any branch of knowledge, especially those branches studied prior to being considered part of pure science."},{"definition":"An alchemist."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fəˈlɑsəfɚz/"},{"text":"/fɪˈlɒsəfəz/"}]},{"word":"SPEEDING","idx":17720,"count":1964427,"meanings":[{"definitions":[{"definition":"To succeed; to prosper, be lucky."},{"definition":"To help someone, to give them fortune; to aid or favour.","example":"God speed, until we meet again."},{"definition":"To go fast.","example":"The Ferrari was speeding along the road."},{"definition":"To exceed the speed limit.","example":"Why do you speed when the road is so icy?"},{"definition":"To increase the rate at which something occurs."},{"definition":"To be under the influence of stimulant drugs, especially amphetamines."},{"definition":"To be expedient."},{"definition":"To hurry to destruction; to put an end to; to ruin."},{"definition":"To wish success or good fortune to, in any undertaking, especially in setting out upon a journey."},{"definition":"To cause to make haste; to dispatch with celerity; to drive at full speed; hence, to hasten; to hurry."},{"definition":"To hasten to a conclusion; to expedite."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(Instance of) acceleration."},{"definition":"Driving faster than the legal speed limit.","example":"He was fined $100 for speeding."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Travelling very fast; moving at speed."},{"definition":"Specifically, travelling at an illegal speed (of vehicles, motorists).","example":"We were overtaken on the inside by a speeding motorcyclist."},{"definition":"Under the influence of the drug speed; high on amphetamines."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈspiːdɪŋ/"}]},{"word":"CREDITOR","idx":17721,"count":1963758,"meanings":[{"definitions":[{"definition":"A person to whom a debt is owed."},{"definition":"One who gives credence to something; a believer."}],"partOfSpeech":"n"}]},{"word":"EXITS","idx":17722,"count":1963047,"meanings":[{"definitions":[{"definition":"An act of going out or going away, or leaving; a departure.","example":"He made his exit at the opportune time."},{"definition":"A way out."},{"definition":"The act of departing from life; death.","example":"the untimely exit of a respected politician"},{"definition":"Income, returns, revenue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go out or go away from a place or situation; to depart, to leave."},{"definition":"To depart from life; to die."},{"definition":"To end or terminate (a program, subroutine, etc.)"},{"definition":"(originally United States) To depart from or leave (a place or situation)."}],"partOfSpeech":"ve"}]},{"word":"PARDON","idx":17723,"count":1963040,"meanings":[{"definitions":[{"definition":"Forgiveness for an offence."},{"definition":"An order that releases a convicted criminal without further punishment, prevents future punishment, or (in some jurisdictions) removes an offence from a person's criminal record, as if it had never been committed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To forgive (a person)."},{"definition":"To refrain from exacting as a penalty."},{"definition":"To grant an official pardon for a crime."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Often used when someone does not understand what another person says."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"pardon-us","text":"/ˈpɑɹ.dn̩/"}]},{"word":"SKATEBOARDING","idx":17726,"count":1962882,"meanings":[{"definitions":[{"definition":"To use a skateboard."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of riding on a skateboard"}],"partOfSpeech":"n"}]},{"word":"DEEPTHROAT","idx":17729,"count":1962520,"meanings":[{"definitions":[{"definition":"To perform fellatio or irrumation so that the entire penis is inside the mouth."}],"partOfSpeech":"ve"}]},{"word":"OUTBACK","idx":17730,"count":1962517,"meanings":[{"definitions":[{"definition":"The most remote and desolate areas of Australia; the desert and areas too arid for growing crops."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Characteristic of the most remote and desolate areas of Australia; very remote from urban areas."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To or towards the most remote and desolate areas of Australia."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"outback-au"}]},{"word":"TELLER","idx":17731,"count":1962509,"meanings":[{"definitions":[{"definition":"A device that provides bank customers with cash withdrawal and other services without the need for a human teller."},{"definition":"A person who tells stories."},{"definition":"A bank clerk who receives and pays out money."},{"definition":"A person who counts the votes in an election."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛləɹ/"},{"text":"/ˈtɛlə/"}]},{"word":"MANDATES","idx":17732,"count":1962363,"meanings":[{"definitions":[{"definition":"An official or authoritative command; an order or injunction; a commission; a judicial precept."},{"definition":"The authority to do something, as granted to a politician by the electorate."},{"definition":"A papal rescript."},{"definition":"A period during which a government is in power."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To authorize"},{"definition":"To make mandatory"}],"partOfSpeech":"ve"}]},{"word":"REIKI","idx":17734,"count":1962162,"meanings":[{"definitions":[{"definition":"A Japanese form of pseudomedicine that involves transferring chi through one's palms."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹeɪki/"}]},{"word":"BIOPSY","idx":17735,"count":1962155,"meanings":[{"definitions":[{"definition":"The removal and examination of a sample of tissue, cells, or bodily fluid from a living body for diagnostic purposes.","example":"We will need to perform a biopsy to determine whether the tumour is malignant or benign."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take a sample (a biopsy) for pathological examination.","example":"They biopsied the lump but it turned out to be non-cancerous."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbaɪɑpsi/"}]},{"word":"PEPTIDES","idx":17736,"count":1962139,"meanings":[{"definitions":[{"definition":"Any of a class of organic compounds consisting of various numbers of amino acids in which the amine of one is reacted with the carboxylic acid of the next to form an amide bond."},{"definition":"The peptide bond itself."}],"partOfSpeech":"n"}]},{"word":"VEIL","idx":17737,"count":1962101,"meanings":[{"definitions":[{"definition":"Something hung up or spread out to hide or protect the face, or hide an object from view; usually of gauze, crepe, or similar diaphanous material."},{"definition":"A cover; disguise; a mask; a pretense."},{"definition":"The calyptra of mosses."},{"definition":"A membrane connecting the margin of the pileus of a mushroom with the stalk; a velum."},{"definition":"A covering for a person or thing; as, a caul (especially over the head)","example":"a nun's veil"},{"definition":"Velum (A circular membrane round the cap of medusa)"},{"definition":"A thin layer of tissue which is attached to or covers a mushroom."},{"definition":"An obscuration of the clearness of the tones in pronunciation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dress in, or decorate with, a veil."},{"definition":"To conceal as with a veil.","example":"The forest fire was veiled by smoke, but I could hear it clearly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"veil-us","text":"/veɪl/"}]},{"word":"PECK","idx":17738,"count":1961752,"meanings":[{"definitions":[{"definition":"An act of striking with a beak."},{"definition":"A small kiss."},{"definition":"One quarter of a bushel; a dry measure of eight quarts.","example":"They picked a peck of wheat."},{"definition":"A great deal; a large or excessive quantity.","example":"She figured most children probably ate a peck of dirt before they turned ten."},{"definition":"Discoloration caused by fungus growth or insects.","example":"an occurrence of peck in rice"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike or pierce with the beak or bill (of a bird).","example":"The birds pecked at their food."},{"definition":"To form by striking with the beak or a pointed instrument.","example":"to peck a hole in a tree"},{"definition":"To strike, pick, thrust against, or dig into, with a pointed instrument, especially with repeated quick movements."},{"definition":"To seize and pick up with the beak, or as if with the beak; to bite; to eat; often with up."},{"definition":"To do something in small, intermittent pieces.","example":"He has been pecking away at that project for some time now."},{"definition":"To type by searching for each key individually."},{"definition":"To type in general."},{"definition":"To kiss briefly."},{"definition":"To throw."},{"definition":"To lurch forward; especially, of a horse, to stumble after hitting the ground with the toe instead of the flat of the foot."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"peck-uk","text":"/pɛk/"}]},{"word":"CUSTODIAN","idx":17739,"count":1961690,"meanings":[{"definitions":[{"definition":"A person entrusted with the custody or care of something or someone; a caretaker or keeper.","example":"After their parents' death, their aunt became the children's custodian."},{"definition":"A janitor; a cleaner","example":"The custodian does such admirable work, deftly wielding a mop to keep our hallways and sidewalks free of buai pekpek left by people who chew betelnuts to be \"cool\" but don't even bother finding a rubbish bin or spit cup to dispose of the pekpek with."}],"partOfSpeech":"n"}]},{"word":"QUARRY","idx":17742,"count":1960848,"meanings":[{"definitions":[{"definition":"A site for mining stone, limestone, or slate.","example":"Michelangelo personally quarried marble from the world-famous quarry at Carrara."},{"definition":"A part of the entrails of a hunted animal, given to the hounds as a reward."},{"definition":"An animal, often a bird or mammal, which is hunted."},{"definition":"An object of search or pursuit."},{"definition":"A diamond-shaped tile or pane, often of glass or stone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To obtain (or mine) stone by extraction from a quarry."},{"definition":"To extract or slowly obtain by long, tedious searching.","example":"They quarried out new, interesting facts about ancient Egypt from old papyri."},{"definition":"To secure prey; to prey, as a vulture or harpy."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"quarry-us","text":"/ˈkwɔɹi/"}]},{"word":"OCEANIC","idx":17744,"count":1960760,"meanings":[{"definitions":[{"definition":"Of or relating to the ocean."},{"definition":"Living in, produced by, or frequenting the ocean."},{"definition":"Resembling an ocean in vastness or extent."},{"definition":"Having a climate that has a relatively small difference in temperature between the warmest and coldest times of the year, and relatively high rainfall"}],"partOfSpeech":"j"}]},{"word":"TRES","idx":17745,"count":1960559,"meanings":[{"definitions":[{"definition":"A three-course stringed instrument similar to a guitar; the Cuban variant has six strings, and the Puerto Rican has nine."}],"partOfSpeech":"n"}]},{"word":"HELM","idx":17746,"count":1960083,"meanings":[{"definitions":[{"definition":"The steering apparatus of a ship, especially the tiller or wheel."},{"definition":"(maritime) The member of the crew in charge of steering the boat."},{"definition":"A position of leadership or control.","example":"the helm of the Commonwealth"},{"definition":"One at the place of direction or control; a guide; a director."},{"definition":"A helve."},{"definition":"A helmet."},{"definition":"A helmet."},{"definition":"A heavy cloud lying on the brow of a mountain."},{"definition":"The stems of various cultivated plants, left after harvesting the crop to be used as animal litter or for thatching."},{"definition":"An individual plant stem."},{"definition":"Part of a harness; a hame."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be a helmsman or a member of the helm; to be in charge of steering the boat."},{"definition":"(by extension) To lead (a project, etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"helm-us","text":"/hɛlm/"}]},{"word":"FESTIVE","idx":17748,"count":1959678,"meanings":[{"definitions":[{"definition":"Having the atmosphere, decoration, or attitude of a festival, holiday, or celebration.","example":"The room was decked out in festive streamers, with flowers everywhere."},{"definition":"In the mood to celebrate.","example":"Please put the Christmas decorations away, I'm really not in a festive mood."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"festive-us","text":"/ˈfɛstɪv/"}]},{"word":"AWAKENINGS","idx":17750,"count":1959038,"meanings":[{"definitions":[{"definition":"The act of awaking, or ceasing to sleep."},{"definition":"A revival of religion, or more general attention to religious matters than usual."},{"definition":"Being roused into action or activity."}],"partOfSpeech":"n"}]},{"word":"PRESERVES","idx":17753,"count":1958403,"meanings":[{"definitions":[{"definition":"A sweet spread made of any of a variety of fruits."},{"definition":"A reservation, a nature preserve."},{"definition":"An activity with restricted access."},{"definition":"Spectacles to protect the eyes from strong light, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To protect; to keep from harm or injury.","example":"Every people have the right to preserve its identity and culture."},{"definition":"To save from decay by the use of some preservative substance, such as sugar or salt; to season and prepare (fruits, meat, etc.) for storage.","example":"to preserve peaches or grapes"},{"definition":"To maintain throughout; to keep intact.","example":"to preserve appearances; to preserve silence"}],"partOfSpeech":"ve"}]},{"word":"SEDIMENTS","idx":17754,"count":1957228,"meanings":[{"definitions":[{"definition":"A collection of small particles, particularly dirt, that precipitates from a river or other body of water.","example":"The Nile delta is composed of sediment that was washed down and deposited at the mouth of the river."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deposit material as a sediment."},{"definition":"To be deposited as a sediment."}],"partOfSpeech":"ve"}]},{"word":"APPRAISER","idx":17755,"count":1957049,"meanings":[{"definitions":[{"definition":"One who performs appraisals."}],"partOfSpeech":"n"}]},{"word":"GAUSSIAN","idx":17758,"count":1956833,"meanings":[{"definitions":[{"definition":"Of or pertaining to Carl Friedrich Gauss."},{"definition":"Normal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gaussian-us"}]},{"word":"HUSTLER","idx":17759,"count":1956791,"meanings":[{"definitions":[{"definition":"One who rushes or hurries; an energetic person."},{"definition":"Somebody who pretends to be an amateur at a game in order to win bets."},{"definition":"A pimp."},{"definition":"A prostitute."},{"definition":"A charlatan, huckster, grifter, a scoundrel."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhʌsləɹ/"}]},{"word":"JESS","idx":17760,"count":1956764,"meanings":[{"definitions":[{"definition":"A short strap fastened around the leg of a bird used in falconry, to which a leash may be fastened."},{"definition":"A collimated stream, spurt or flow of liquid or gas from a pressurized container, an engine, etc."},{"definition":"A spout or nozzle for creating a jet of fluid."},{"definition":"A type of airplane using jet engines rather than propellers."},{"definition":"An engine that propels a vehicle using a stream of fluid as propulsion."},{"definition":"A part of a carburetor that controls the amount of fuel mixed with the air."},{"definition":"A narrow cone of hadrons and other particles produced by the hadronization of a quark or gluon."},{"definition":"Drift; scope; range, as of an argument."},{"definition":"The sprue of a type, which is broken from it when the type is cold."},{"definition":"A hard, black form of coal, sometimes used in jewellery."},{"definition":"(color) The colour of jet coal, deep grey."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten a strap around the leg of a hawk."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Only, simply, merely.","example":"He calls it vermilion, but it's just red to me."},{"definition":"(sentence adverb) Used to reduce the force of an imperative; simply.","example":"Just follow the directions on the box."},{"definition":"Used to convey a less serious or formal tone","example":"I just called to say \"hi\"."},{"definition":"Used to show humility.","example":"Lord, we just want to thank You and praise Your Name."},{"definition":"(degree) absolutely, positively","example":"It is just splendid!"},{"definition":"Moments ago, recently.","example":"They just left, but you may leave a message at the desk."},{"definition":"By a narrow margin; closely; nearly.","example":"The fastball just missed my head!"},{"definition":"Exactly, precisely, perfectly.","example":"He wants everything just right for the big day."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/dʒɛs/"}]},{"word":"TENSIONS","idx":17761,"count":1956635,"meanings":[{"definitions":[{"definition":"The condition of being held in a state between two or more forces, which are acting in opposition to each other."},{"definition":"Psychological state of being tense."},{"definition":"A feeling of nervousness, excitement, or fear that is created in a movie, book, etc.; suspense."},{"definition":"State of an elastic object which is stretched in a way which increases its length."},{"definition":"Force transmitted through a rope, string, cable, or similar object (used with prepositions on, in, or of, e.g., \"The tension in the cable is 1000 N\", to convey that the same magnitude of force applies to objects attached to both ends)."},{"definition":"Voltage. Usually only the terms low tension, high tension, and extra-high tension, and the abbreviations LT, HT, and EHT are used. They are not precisely defined; LT is normally a few volts, HT a few hundreds of volts, and EHT thousands of volts."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place an object in tension, to pull or place strain on.","example":"We tensioned the cable until it snapped."}],"partOfSpeech":"ve"}]},{"word":"SECRETION","idx":17762,"count":1956191,"meanings":[{"definitions":[{"definition":"Any substance that is secreted by an organism"},{"definition":"The act of secreting a substance, especially from a gland"},{"definition":"The act of hiding something"}],"partOfSpeech":"n"}]},{"word":"LINKAGES","idx":17763,"count":1956143,"meanings":[{"definitions":[{"definition":"A mechanical device that connects things.","example":"A linkage in my car's transmission is broken so I can't shift out of first gear."},{"definition":"A connection or relation between things or ideas."},{"definition":"The property of genes of being inherited together."},{"definition":"A set of definitely related languages for which no proto-language can be derived, typically a group of languages within a family that have formed a sprachbund."}],"partOfSpeech":"n"}]},{"word":"SEPARATOR","idx":17764,"count":1955991,"meanings":[{"definitions":[{"definition":"An object located between two or more things and hence separating them."},{"definition":"A device for removing one substance from another, such as cream from milk."},{"definition":"One who separates; an agent performing the action of separating."}],"partOfSpeech":"n"}]},{"word":"INSULT","idx":17765,"count":1955836,"meanings":[{"definitions":[{"definition":"Action or form of speech deliberately intended to be rude; a particular act or statement having this effect."},{"definition":"Something that causes offence (for example, by being of an unacceptable quality).","example":"The way the orchestra performed tonight was an insult to my ears."},{"definition":"Something causing disease or injury to the body or bodily processes; the injury so caused."},{"definition":"An assault or attack; (specifically) an assault, attack, or onset carried out without preparation."},{"definition":"An act of leaping upon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be insensitive, insolent, or rude to (somebody); to affront or demean (someone)."},{"definition":"To assail, assault, or attack; (specifically) to carry out an assault, attack, or onset without preparation."},{"definition":"To behave in an obnoxious and superior manner (against or over someone)."},{"definition":"To leap or trample upon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"insult-us","text":"/ɪnˈsʌlt/"}]},{"word":"SCRAPS","idx":17766,"count":1955784,"meanings":[{"definitions":[{"definition":"A (small) piece; a fragment; a detached, incomplete portion.","example":"I found a scrap of cloth to patch the hole."},{"definition":"(usually in the plural) Leftover food.","example":"Give the scraps to the dogs and watch them fight."},{"definition":"The crisp substance that remains after drying out animal fat.","example":"pork scraps"},{"definition":"Discarded objects (especially metal) that may be dismantled to recover their constituent materials, junk.","example":"That car isn't good for anything but scrap."},{"definition":"(in the plural) A piece of deep-fried batter left over from frying fish, sometimes sold with chips."},{"definition":"A Hispanic criminal, especially a Mexican or one affiliated with the Norte gang."},{"definition":"A snare for catching birds."},{"definition":"A fight, tussle, skirmish.","example":"We got in a little scrap over who should pay the bill."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To discard."},{"definition":"(of a project or plan) To stop working on indefinitely."},{"definition":"To scrapbook; to create scrapbooks."},{"definition":"To dispose of at a scrapyard."},{"definition":"To make into scrap."},{"definition":"To fight"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/skɹæps/"}]},{"word":"WAIVED","idx":17767,"count":1955721,"meanings":[{"definitions":[{"definition":"To relinquish (a right etc.); to give up claim to; to forego.","example":"If you waive the right to be silent, anything you say can be used against you in a court of law."},{"definition":"To put aside, avoid."},{"definition":"To outlaw (someone)."},{"definition":"To abandon, give up (someone or something)."},{"definition":"To move from side to side; to sway."},{"definition":"To stray, wander."}],"partOfSpeech":"ve"}]},{"word":"CURED","idx":17768,"count":1955657,"meanings":[{"definitions":[{"definition":"To restore to health.","example":"Unaided nature cured him."},{"definition":"To bring (a disease or its bad effects) to an end.","example":"Unaided nature cured his ailments."},{"definition":"To cause to be rid of (a defect).","example":"Experience will cure him of his naïveté."},{"definition":"To prepare or alter especially by chemical or physical processing for keeping or use.","example":"The smoke and heat cures the meat."},{"definition":"To bring about a cure of any kind."},{"definition":"To be undergoing a chemical or physical process for preservation or use.","example":"The meat was put in the smokehouse to cure."},{"definition":"To preserve (food), typically by salting"},{"definition":"To solidify or gel.","example":"The parts were curing in the autoclave."},{"definition":"To become healed."},{"definition":"To pay heed; to care; to give attention."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cured-us","text":"/kjɝd/"}]},{"word":"BUGGY","idx":17770,"count":1955438,"meanings":[{"definitions":[{"definition":"A small horse-drawn cart."},{"definition":"A small motor vehicle, such as a dune buggy."},{"definition":"A hearse."},{"definition":"A pushchair; a stroller."},{"definition":"A shopping cart or trolley."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Infested with insects"},{"definition":"Containing programming errors","example":"This software is so buggy that I don't know how anyone can use it!"},{"definition":"Resembling an insect"},{"definition":"Crazy; bughouse"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/bʌ.ɡi/"}]},{"word":"RECON","idx":17773,"count":1955124,"meanings":[{"definitions":[{"definition":"Reconnaissance."},{"definition":"The smallest genetic unit that is capable of undergoing recombination."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Reconnoiter."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹɪˈkɑn/"},{"text":"/ɹɪˈkɒn/"}]},{"word":"KENNEL","idx":17774,"count":1954777,"meanings":[{"definitions":[{"definition":"A house or shelter for a dog."},{"definition":"A facility at which dogs are reared or boarded.","example":"She raises registered Dalmatians at her kennel."},{"definition":"(collective) The dogs kept at such a facility; a pack of hounds."},{"definition":"The hole of a fox or other animal."},{"definition":"The gutter at the edge of a street; a surface drain."},{"definition":"A puddle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To house or board a dog (or less commonly another animal).","example":"While we're away our friends will kennel our pet poodle."},{"definition":"To lie or lodge; to dwell, as a dog or a fox."},{"definition":"To drive (a fox) to covert in its hole."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"kennel-1-uk","text":"/ˈkɛnəl/"}]},{"word":"DRILLED","idx":17775,"count":1954737,"meanings":[{"definitions":[{"definition":"To create (a hole) by removing material with a drill (tool).","example":"Drill a small hole to start the screw in the right direction."},{"definition":"To practice, especially in (or as in) a military context.","example":"They drilled daily to learn the routine exactly."},{"definition":"To cause to drill (practice); to train in military arts.","example":"The sergeant was up by 6:00 every morning, drilling his troops."},{"definition":"To repeat an idea frequently in order to encourage someone to remember it.","example":"The instructor drilled into us the importance of reading the instructions."},{"definition":"To investigate or examine something in more detail or at a different level","example":"Drill deeper and you may find the underlying assumptions faulty."},{"definition":"To hit or kick with a lot of power."},{"definition":"To hit someone with a pitch, especially in an intentional context."},{"definition":"To have sexual intercourse with; to penetrate."},{"definition":"To sow (seeds) by dribbling them along a furrow or in a row."},{"definition":"To cause to flow in drills or rills or by trickling; to drain by trickling.","example":"waters drilled through a sandy stratum"},{"definition":"To entice or allure; to decoy; with on."},{"definition":"To cause to slip or waste away by degrees."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɹɪld/"}]},{"word":"SOUVENIRS","idx":17777,"count":1954524,"meanings":[{"definitions":[{"definition":"An item of sentimental value, to remember an event or location."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take (an article) as a souvenir, especially illicitly, for example during wartime."}],"partOfSpeech":"ve"}]},{"word":"ROYALS","idx":17778,"count":1954389,"meanings":[{"definitions":[{"definition":"A royal person; a member of a royal family."},{"definition":"A standard size of printing paper, measuring 25 by 20 inches."},{"definition":"A standard size of writing paper, measuring 24 by 19 inches."},{"definition":"The Australian decimal currency intended to replace the pound in 1966; was changed to \"dollar\" before it was actually circulated."},{"definition":"Any of various lycaenid butterflies."},{"definition":"The fourth tine of an antler's beam."},{"definition":"A stag with twelve points (six on each antler)."},{"definition":"In large sailing ships, square sail over the topgallant sail."},{"definition":"An old English gold coin, the rial."},{"definition":"A small mortar."},{"definition":"In auction bridge, a royal spade."},{"definition":"A tuft of beard on the lower lip."},{"definition":"(campanology) Bell changes rung on ten bells."}],"partOfSpeech":"n"}]},{"word":"PRESCRIBING","idx":17779,"count":1954318,"meanings":[{"definitions":[{"definition":"To order (a drug or medical device) for use by a particular patient (under licensed authority).","example":"The doctor prescribed aspirin."},{"definition":"To specify by writing as a required procedure or ritual; to lay down authoritatively as a guide, direction, or rule of action.","example":"The property meets the criteria prescribed by the regulations."}],"partOfSpeech":"ve"}]},{"word":"SLACK","idx":17780,"count":1954286,"meanings":[{"definitions":[{"definition":"The part of anything that hangs loose, having no strain upon it.","example":"take in the slack"},{"definition":"A tidal marsh or shallow that periodically fills and drains."},{"definition":"A temporary speed restriction where track maintenance or engineering work is being carried out at a particular place."},{"definition":"A valley, or small, shallow dell."},{"definition":"Small coal; coal dust."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(normally said of a rope) Lax; not tense; not firmly extended.","example":"a slack rope"},{"definition":"Weak; not holding fast.","example":"a slack hand"},{"definition":"Lacking diligence or care; not earnest or eager.","example":"slack in duty or service"},{"definition":"Not active,successful, or violent.","example":"Business is slack."},{"definition":"Excess; surplus to requirements.","example":"the slack capacity of an oil pipeline"},{"definition":"Vulgar; sexually explicit, especially in dancehall music."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Slackly.","example":"slack dried hops"}],"partOfSpeech":"v"},{"definitions":[{"definition":"To slacken."},{"definition":"To mitigate; to reduce the strength of."},{"definition":"To lose cohesion or solidity by a chemical combination with water; to slake.","example":"Lime slacks."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slack-au","text":"/slæk/"}]},{"word":"GLOBALISATION","idx":17781,"count":1954029,"meanings":[{"definitions":[{"definition":"The process of becoming a more interconnected world."},{"definition":"The process of the world economy becoming dominated by capitalist models, according to the World System Theory."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɡloʊbəlɪˈzeɪʃən/"}]},{"word":"PASTEL","idx":17783,"count":1953608,"meanings":[{"definitions":[{"definition":"Any of several subdued tints of colors, usually associated with pink, peach, yellow, green, blue and lavender"},{"definition":"A drawing made with any of those colors."},{"definition":"A type of dried paste used to make crayons."},{"definition":"A crayon made from such a paste."},{"definition":"Woad.","example":"Wool was dyed in the pastel vat."},{"definition":"A traditional dish in various Latin American countries, resembling a tamale, pasty, or calzone."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pæsˈtɛl/"},{"text":"/ˈpæstəl/"}]},{"word":"GIN","idx":17784,"count":1953412,"meanings":[{"definitions":[{"definition":"A colourless non-aged alcoholic liquor made by distilling fermented grains such as barley, corn, oats or rye with juniper berries; the base for many cocktails."},{"definition":"Gin rummy."},{"definition":"Drawing the best card or combination of cards.","example":"Johnny Chan held jack-nine, and hit gin when a queen-ten-eight board was dealt out."},{"definition":"A trick; a device or instrument."},{"definition":"Contrivance; artifice; a trap; a snare."},{"definition":"A snare or trap for game."},{"definition":"A machine for raising or moving heavy objects, consisting of a tripod formed of poles united at the top, with a windlass, pulleys, ropes, etc."},{"definition":"A hoisting drum, usually vertical; a whim."},{"definition":"A pile driver."},{"definition":"A windpump."},{"definition":"A cotton gin."},{"definition":"An instrument of torture worked with screws."},{"definition":"An Aboriginal woman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the seeds from cotton with a cotton gin."},{"definition":"To trap something in a gin."},{"definition":"To begin."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"If."}],"partOfSpeech":"c"}],"phonetics":[{"audio":"gin-1-us","text":"/dʒɪn/"},{"audio":"gin-1-au","text":"/dʒɪn/"}]},{"word":"DIFFERENTIATE","idx":17786,"count":1952913,"meanings":[{"definitions":[{"definition":"Something that has been differentiated or stratified."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To show, or be the distinction between two things."},{"definition":"To perceive the difference between things; to discriminate."},{"definition":"To modify, or be modified."},{"definition":"To calculate the derivative of a function."},{"definition":"To calculate the differential of a function of multiple variables."},{"definition":"To produce distinct organs or to achieve specific functions by a process of development called differentiation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"differentiate-us","text":"/ˌdɪ.fəˈɹɛnt.ʃi.eɪt/"}]},{"word":"STROLLERS","idx":17787,"count":1952626,"meanings":[{"definitions":[{"definition":"A seat or chair on wheels, pushed by somebody walking behind it, typically used for transporting babies and young children."},{"definition":"One who strolls."},{"definition":"A vagrant."},{"definition":"Men's semiformal daytime dress comprising a grey or black single- or double-breasted coat, grey striped or checked formal trousers, a grey or silver necktie, and a grey, black or buff waistcoat."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"strollers-us"}]},{"word":"JAYS","idx":17788,"count":1952519,"meanings":[{"definitions":[{"definition":"Any one of the numerous species of birds belonging to several genera within the family Corvidae, including Garrulus, Cyanocitta, Aphelocoma, Perisoreus, Cyanocorax, Gymnorhinus, Cyanolyca, Ptilostomus, and Calocitta, allied to the crows, but smaller, more graceful in form, often handsomely coloured, usually having a crest, and often noisy."},{"definition":"Other birds of similar appearance and behaviour."},{"definition":"Any of various large papilionid butterflies of the genus Graphium."},{"definition":"A dull or ignorant person. It survives today in the term jaywalking."},{"definition":"Promiscuous woman; prostitute."},{"definition":"The name of the Latin-script letter J."},{"definition":"A marijuana cigarette; a joint."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dʒeɪz/"}]},{"word":"UNINSURED","idx":17789,"count":1952489,"meanings":[{"definitions":[{"definition":"One who is not insured."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not insured; not having insurance."}],"partOfSpeech":"j"}]},{"word":"PILGRIM","idx":17791,"count":1952294,"meanings":[{"definitions":[{"definition":"One who travels, especially on a journey to visit sites of religious significance."},{"definition":"A newcomer."},{"definition":"A silk screen formerly attached to the back of a woman's bonnet to protect the neck."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To journey; to wander; to ramble."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pilgrim-au","text":"/ˈpɪlɡɹɪm/"}]},{"word":"VINES","idx":17792,"count":1952255,"meanings":[{"definitions":[{"definition":"The climbing plant that produces grapes."},{"definition":"Any plant of the genus Vitis."},{"definition":"(by extension) Any similar climbing or trailing plant."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vines-uk","text":"/vaɪnz/"}]},{"word":"SUSCEPTIBILITY","idx":17793,"count":1951706,"meanings":[{"definitions":[{"definition":"The condition of being susceptible; vulnerability"},{"definition":"Emotional sensitivity"},{"definition":"Electric susceptibility, a measure of how easily a dielectric polarizes in response to an external electric field (compare permittivity)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˌsɛptəˈbɪlɪti/"}]},{"word":"AMBIGUOUS","idx":17794,"count":1951514,"meanings":[{"definitions":[{"definition":"Open to multiple interpretations.","example":"The politician was criticized for his ambiguous statements and lack of precision."},{"definition":"Vague and unclear.","example":"He gave an ambiguous answer."},{"definition":"(of persons) Hesitant; uncertain; not taking sides."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ambiguous-us","text":"/æmˈbɪɡjuəs/"}]},{"word":"DISPUTED","idx":17796,"count":1950655,"meanings":[{"definitions":[{"definition":"To contend in argument; to argue against something maintained, upheld, or claimed, by another"},{"definition":"To make a subject of disputation; to argue pro and con; to discuss","example":"Some residents disputed the proposal, saying it was based more on emotion than fact."},{"definition":"To oppose by argument or assertion; to controvert; to express dissent or opposition to; to call in question; to deny the truth or validity of","example":"to dispute assertions or arguments"},{"definition":"To strive or contend about; to contest"},{"definition":"To struggle against; to resist"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Argued; not certain, agreed upon, or accepted.","example":"The theory, though common, was widely disputed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disputed-us","text":"/dɪsˈpjuːtɪd/"}]},{"word":"SCOUTING","idx":17797,"count":1950577,"meanings":[{"definitions":[{"definition":"The act of one who scouts."},{"definition":"The Scout Movement."},{"definition":"The activities of boy scouts and girl scouts."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈskaʊtɪŋ/"}]},{"word":"INSTINCT","idx":17799,"count":1950318,"meanings":[{"definitions":[{"definition":"A natural or inherent impulse or behaviour.","example":"Many animals fear fire by instinct."},{"definition":"An intuitive reaction not based on rational conscious thought.","example":"Debbie's instinct was to distrust John."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Imbued, charged (with something)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"instinct-us","text":"/ˈɪn.stɪŋkt/"}]},{"word":"RIGHTEOUSNESS","idx":17801,"count":1950164,"meanings":[{"definitions":[{"definition":"The quality or state of being righteous."},{"definition":"Holiness; conformity of life to the divine law."},{"definition":"A righteous act, or righteous quality."},{"definition":"The act or conduct of one who is righteous."},{"definition":"The state of being right with God; justification; the work of Christ, which is the ground justification."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"righteousness-us","text":"/ˈɹaɪt͡ʃəsnəs/"}]},{"word":"CARROT","idx":17802,"count":1949964,"meanings":[{"definitions":[{"definition":"A vegetable with a nutritious, juicy, sweet root that is often orange in colour, Daucus carota, especially the subspecies sativus in the family Apiaceae."},{"definition":"A shade of orange similar to the flesh of most carrots (also called carrot orange)."},{"definition":"Any motivational tool."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat (an animal pelt) with a solution of mercuric nitrate as part of felt manufacture."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"carrot-us","text":"/ˈkæɹ.ət/"}]},{"word":"DISCRIMINATORY","idx":17803,"count":1949265,"meanings":[{"definitions":[{"definition":"Of or pertaining to discrimination (in all senses)."},{"definition":"Showing prejudice or bias."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪsˈkɹɪmɪnəˌtɔɹi/"},{"text":"/dɪsˈkɹɪmɪnət(ə)ɹɪ/"}]},{"word":"OPAQUE","idx":17804,"count":1949046,"meanings":[{"definitions":[{"definition":"An area of darkness; a place or region with no light."},{"definition":"Something which is opaque rather than translucent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make, render (more) opaque."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Neither reflecting nor emitting light."},{"definition":"Allowing little light to pass through, not translucent or transparent."},{"definition":"Unclear, unintelligible, hard to get or explain the meaning of"},{"definition":"Obtuse, stupid."},{"definition":"Describes a type for which higher-level callers have no knowledge of data values or their representations; all operations are carried out by the type's defined abstract operators."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/oʊˈpeɪk/"},{"text":"/əʊˈpeɪk/"}]},{"word":"HEADQUARTERED","idx":17805,"count":1948865,"meanings":[{"definitions":[{"definition":"To provide (an organization) with headquarters."},{"definition":"To establish headquarters."}],"partOfSpeech":"ve"}]},{"word":"BULLYING","idx":17806,"count":1948806,"meanings":[{"definitions":[{"definition":"An act of intimidating a person to do something, especially such repeated coercion."},{"definition":"Persistent acts intended to make life unpleasant for another person.","example":"Bullying is a punishable offense in schools."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To intimidate (someone) as a bully.","example":"You shouldn't bully people for being gay."},{"definition":"To act aggressively towards."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbʊl.i.ɪŋ/"}]},{"word":"FLAMING","idx":17808,"count":1948600,"meanings":[{"definitions":[{"definition":"To produce flames; to burn with a flame or blaze."},{"definition":"To burst forth like flame; to break out in violence of passion; to be kindled with zeal or ardour."},{"definition":"To post a destructively critical or abusive message (to somebody).","example":"I flamed him for spamming in my favourite newsgroup."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An emission or application of fire; act of burning with flames."},{"definition":"Sterilization by holding an object in a hot flame."},{"definition":"Vitriolic criticism.","example":"You can expect a flaming if you post irrelevant spam to a newsgroup."}],"partOfSpeech":"n"},{"definitions":[{"definition":"On fire with visible flames.","example":"The flaming debris kept the firefighter well back, and the sparks threatened the neighborhood."},{"definition":"Very bright and the color of flame."},{"definition":"Extremely obvious; visibly evident. Typically of a homosexual male.","example":"To call him a flaming homosexual would be an understatement, but I think he acts that way just to see people react."},{"definition":"Damned, bloody.","example":"I wasted three hours in that flaming traffic jam!"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfleɪmɪŋ/"}]},{"word":"EMPOWER","idx":17810,"count":1948139,"meanings":[{"definitions":[{"definition":"To give permission, power, or the legal right to do something."},{"definition":"To give someone more confidence and/or strength to do something, often by enabling them to increase their control over their own life or situation.","example":"John found that starting up his own business empowered him greatly in social situations."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"empower-us"}]},{"word":"LIENS","idx":17813,"count":1947603,"meanings":[{"definitions":[{"definition":"A tendon."},{"definition":"A right to take possession of a debtor’s property as security until a debt or duty is discharged."}],"partOfSpeech":"n"}]},{"word":"CATERPILLAR","idx":17814,"count":1947305,"meanings":[{"definitions":[{"definition":"The larva of a butterfly or moth; leafworm.","example":"The bird just ate that green caterpillar."},{"definition":"A vehicle with a caterpillar track; a crawler."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"caterpillar-us","text":"/ˈkætɚˌpɪlɚ/"}]},{"word":"HURLEY","idx":17815,"count":1947191,"meanings":[{"definitions":[{"definition":"A stick used in the game of hurling."},{"definition":"The game of hurling."}],"partOfSpeech":"n"}]},{"word":"PEDALS","idx":17817,"count":1946063,"meanings":[{"definitions":[{"definition":"A lever operated by one's foot that is used to control or power a machine or mechanism, such as a bicycle or piano","example":"A piano usually has two or three pedals."},{"definition":"A foot or footlike part."},{"definition":"An effects unit, especially one designed to be activated by being stepped on."},{"definition":"(equestrian) A stirrup."},{"definition":"The ranks of pipes played from the pedal-board of an organ.","example":"A small organ commonly has only one or two ranks on the pedal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To operate a pedal attached to a wheel in a continuous circular motion.","example":"to pedal one's loom"},{"definition":"To operate a bicycle.","example":"He was out of breath from pedalling up the steep hill."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɛdəlz/"}]},{"word":"CHEW","idx":17818,"count":1946052,"meanings":[{"definitions":[{"definition":"The act of chewing; mastication with the mouth.","example":"I popped the gum into my mouth and gave it a chew."},{"definition":"Level of chewiness."},{"definition":"A small sweet, such as a taffy, that is eaten by chewing.","example":"Phillip purchased a bag of licorice chews at the drugstore."},{"definition":"Chewing tobacco.","example":"The school had banned chew and smokes from the school grounds, even for adults."},{"definition":"A plug or wad of chewing tobacco; chaw or a chaw.","example":"The ballplayers sat on the bench watching the rain, glumly working their chews."},{"definition":"The condition of something being torn or ground up mechanically."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To crush with the teeth by repeated closing and opening of the jaws; done to food to soften it and break it down by the action of saliva before it is swallowed.","example":"Make sure to chew thoroughly, and don't talk with your mouth full!"},{"definition":"To grind, tear, or otherwise degrade or demolish something with teeth or as with teeth.","example":"He keeps his feed in steel drums to prevent the mice from chewing holes in the feed-sacks."},{"definition":"To think about something; to ponder; to chew over.","example":"The professor stood at the blackboard, chalk in hand, and chewed the question the student had asked."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chew-us","text":"/tʃu/"}]},{"word":"TEAK","idx":17819,"count":1946014,"meanings":[{"definitions":[{"definition":"An extremely durable timber highly valued for shipbuilding and other purposes, yielded by Tectona grandis (and Tectona spp.)."},{"definition":"A tree of the species in the genus Tectona"},{"definition":"A yellowish brown colour, like that of teak wood."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a yellowish brown colour, like that of teak wood."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/tiːk/"}]},{"word":"BENEFITED","idx":17820,"count":1945952,"meanings":[{"definitions":[{"definition":"To be or to provide a benefit to."},{"definition":"To receive a benefit (from); to be a beneficiary."}],"partOfSpeech":"ve"}]},{"word":"PREVAIL","idx":17821,"count":1945922,"meanings":[{"definitions":[{"definition":"To be superior in strength, dominance, influence or frequency; to have or gain the advantage over others; to have the upper hand; to outnumber others.","example":"Red colour prevails in the Canadian flag."},{"definition":"To be current, widespread or predominant; to have currency or prevalence.","example":"In his day and age, such practices prevailed all over Europe."},{"definition":"To succeed in persuading or inducing.","example":"I prevailed on him to wait."},{"definition":"To avail."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prevail-us","text":"/pɹɪˈveɪl/"}]},{"word":"BITMAP","idx":17822,"count":1945892,"meanings":[{"definitions":[{"definition":"A series of bits that represents a rasterized graphic image, each pixel being represented as a group of bits."}],"partOfSpeech":"n"}]},{"word":"MIGRAINE","idx":17823,"count":1945823,"meanings":[{"definitions":[{"definition":"A severe, disabling headache, usually affecting only one side of the head, and often accompanied by nausea, vomiting, photophobia and visual disturbances.","example":"After consuming too much coffee every day for six weeks, she got severe migraines that would last up until 47 minutes after her first cup of coffee."},{"definition":"A neurological condition characterised by such headaches."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmaɪɡɹeɪn/"}]},{"word":"UNDERMINE","idx":17826,"count":1945083,"meanings":[{"definitions":[{"definition":"To dig underneath (something), to make a passage for destructive or military purposes; to sap."},{"definition":"To weaken or work against; to hinder, sabotage.","example":"The war efforts were undermined by the constant bickering between the allies."},{"definition":"To erode the base or foundation of something, e.g. by the action of water."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"undermine-us"},{"text":"/ʌndəˈmaɪn/"}]},{"word":"OMISSION","idx":17828,"count":1944930,"meanings":[{"definitions":[{"definition":"The act of omitting."},{"definition":"The act of neglecting to perform an action one has an obligation to do."},{"definition":"Something deleted or left out.","example":"The suspicious omissions in the new edition of the book attracted claims of censorship."},{"definition":"Something not done or neglected."},{"definition":"(grammar) The shortening of a word or phrase, using an apostrophe ( ' ) to replace the missing letters, often used to approximate the sound of speech or a specific dialect."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"omission-ca","text":"/oʊˈmɪʃən/"}]},{"word":"DIMINISHED","idx":17832,"count":1943681,"meanings":[{"definitions":[{"definition":"To make smaller."},{"definition":"To become smaller."},{"definition":"To lessen the authority or dignity of; to put down; to degrade; to abase; to weaken; to nerf (in gaming)."},{"definition":"To taper."},{"definition":"To disappear gradually."},{"definition":"To take away; to subtract."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lessened, reduced","example":"The diminished Roman Empire never recovered from the sack of Rome."},{"definition":"Made to seem less important, impressive, or valuable","example":"She felt diminished by the report card."},{"definition":"Reduced by a semitone"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈmɪnɪʃt/"}]},{"word":"AES","idx":17834,"count":1943495,"meanings":[{"definitions":[{"definition":"The name of the Latin script letter A/a."}],"partOfSpeech":"n"}]},{"word":"CAGES","idx":17836,"count":1943021,"meanings":[{"definitions":[{"definition":"An enclosure made of bars, normally to hold animals.","example":"The most dangerous prisoners are locked away in a cage."},{"definition":"The passenger compartment of a lift."},{"definition":"(water polo) The goal."},{"definition":"An automobile."},{"definition":"Something that hinders freedom."},{"definition":"The area from which competitors throw a discus or hammer."},{"definition":"An outer framework of timber, enclosing something within it."},{"definition":"A skeleton frame to limit the motion of a loose piece, such as a ball valve."},{"definition":"A wirework strainer, used in connection with pumps and pipes."},{"definition":"The drum on which the rope is wound in a hoisting whim."},{"definition":"The catcher's wire mask."},{"definition":"A regular graph that has as few vertices as possible for its girth."}],"partOfSpeech":"n"}]},{"word":"METHANE","idx":17837,"count":1942898,"meanings":[{"definitions":[{"definition":"The simplest aliphatic hydrocarbon, CH₄, being a constituent of natural gas, and one of the most abundant greenhouse gases.","example":"Cattle emit a large amount of methane."},{"definition":"Any of very many derivatives of methane."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"methane-us","text":"/ˈmɛθeɪn/"},{"audio":"methane-uk","text":"/ˈmiːθeɪn/"}]},{"word":"PAGER","idx":17838,"count":1942889,"meanings":[{"definitions":[{"definition":"A wireless telecommunications device that receives text or voice messages."},{"definition":"A computer program running in a text terminal, used to view (but not modify) the contents of a text file moving down the file one line or one screen at a time."},{"definition":"(in combination) Something (a document, book etc.) that has a specified number of pages."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pager-us","text":"/peɪdʒə(ɹ)/"},{"audio":"pager-uk","text":"/peɪdʒə(ɹ)/"}]},{"word":"CAPITALS","idx":17842,"count":1941886,"meanings":[{"definitions":[{"definition":"Already-produced durable goods available for use as a factor of production, such as steam shovels (equipment) and office buildings (structures)."},{"definition":"Money and wealth. The means to acquire goods and services, especially in a non-barter system.","example":"He does not have enough capital to start a business."},{"definition":"A city designated as a legislative seat by the government or some other authority, often the city in which the government is located; otherwise the most important city within a country or a subdivision of it.","example":"The Welsh government claims that Cardiff is Europe’s youngest capital."},{"definition":"The most important city in the field specified."},{"definition":"An uppercase letter."},{"definition":"The uppermost part of a column."},{"definition":"Knowledge; awareness; proficiency.","example":"Interpreters need a good amount of cultural capital in order to function efficiently in the profession."},{"definition":"(by extension) The chief or most important thing."}],"partOfSpeech":"n"}]},{"word":"CORRECTNESS","idx":17843,"count":1941862,"meanings":[{"definitions":[{"definition":"Freedom from error"},{"definition":"Conformity to the truth or to fact"},{"definition":"Conformity to recognized standards"},{"definition":"The state of an algorithm that correctly mirrors its specification."}],"partOfSpeech":"n"}]},{"word":"IMPLICATION","idx":17845,"count":1940990,"meanings":[{"definitions":[{"definition":"The act of implicating."},{"definition":"The state of being implicated."},{"definition":"(usually in the plural) A possible effect or result of a decision or action.","example":"There are serious implications for the environment of such reforms."},{"definition":"An implying, or that which is implied, but not expressed; an inference, or something which may fairly be understood, though not expressed in words."},{"definition":"The connective in propositional calculus that, when joining two predicates A and B in that order, has the meaning \"if A is true, then B is true\"."},{"definition":"Logical consequence."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɪmpləˈkeɪʃən/"}]},{"word":"PAP","idx":17846,"count":1940941,"meanings":[{"definitions":[{"definition":"Food in the form of a soft paste, often a porridge, especially as given to very young children.","example":"Pap can be made from bread boiled in milk or water."},{"definition":"Nonsense."},{"definition":"Porridge."},{"definition":"Support from official patronage.","example":"Treasury pap"},{"definition":"The pulp of fruit."},{"definition":"A female breast or nipple."},{"definition":"A man's breast."},{"definition":"A rounded, nipple-like hill or peak."},{"definition":"Pap smear"},{"definition":"A paparazzo."},{"definition":"Pa; father"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feed with pap."},{"definition":"(usually in the passive) Of a paparazzo, to take a surreptitious photograph of (someone, especially a celebrity) without their consent.","example":"Look, that pop star’s been papped in her bikini again!"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Spineless, wet, without character.","example":"He is so pap and boring."},{"definition":"(South African slang) Flat.","example":"I got a puncture and the wheel went pap."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pap-au","text":"/pæp/"}]},{"word":"BANJO","idx":17847,"count":1940675,"meanings":[{"definitions":[{"definition":"A stringed musical instrument (chordophone), usually with a round body, a membrane-like soundboard and a fretted neck, played by plucking or strumming the strings.","example":"I come from Alabama with my banjo on my knee..."},{"definition":"Any of various similar musical instruments, such as the Tuvan doshpuluur, with a membrane-like soundboard."},{"definition":"An object shaped like a banjo, especially a frying pan or a shovel."},{"definition":"(Dagenham) A cul-de-sac with a round end."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play a banjo."},{"definition":"To beat, to knock down."},{"definition":"To shell or attack (a target)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"banjo-us","text":"/ˈbæn.dʒoʊ/"}]},{"word":"SHAKER","idx":17848,"count":1940611,"meanings":[{"definitions":[{"definition":"A person or thing that shakes, or by means of which something is shaken."},{"definition":"A variety of pigeon."},{"definition":"One who holds railroad spikes while they are hammered."},{"definition":"A musical percussion instrument filled with granular solids which produce a rhythmic sound when shaken."},{"definition":"A kind of straight-sided, stackable glass for beer, soda, etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʃeɪkɚ/"}]},{"word":"NATIVES","idx":17849,"count":1940192,"meanings":[{"definitions":[{"definition":"An aboriginal inhabitant of a region colonized by English-speaking people; in particular:"},{"definition":"A person who is native to a place; a person who was born in a place."},{"definition":"A native speaker."},{"definition":"Ostrea edulis, a kind of oyster."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"natives-us","text":"/ˈneɪtɪvz/"}]},{"word":"QUILTING","idx":17852,"count":1939935,"meanings":[{"definitions":[{"definition":"To construct a quilt."},{"definition":"To construct something, such as clothing, using the same technique."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A layer or layers of quilted padding."},{"definition":"A coating of strands of rope for a water vessel."},{"definition":"The practice of creating quilts"}],"partOfSpeech":"n"}]},{"word":"CAMPGROUNDS","idx":17853,"count":1939929,"meanings":[{"definitions":[{"definition":"An area where tents are pitched."},{"definition":"An area where a camp meeting (a retreat) (trail ride and party) is held."}],"partOfSpeech":"n"}]},{"word":"STOUT","idx":17855,"count":1939514,"meanings":[{"definitions":[{"definition":"A dark and strong malt brew made with toasted grain.","example":"Stout is darker, stronger and sweeter than porter beer."},{"definition":"An obese person."},{"definition":"A large clothing size."},{"definition":"Gnat."},{"definition":"Gadfly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Large; bulky."},{"definition":"Bold, strong-minded."},{"definition":"Proud; haughty."},{"definition":"Firm; resolute; dauntless."},{"definition":"Materially strong, enduring.","example":"Campers prefer stout vessels, sticks and cloth."},{"definition":"Obstinate."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stout-us","text":"/staʊt/"}]},{"word":"REWARDED","idx":17856,"count":1939508,"meanings":[{"definitions":[{"definition":"To give a reward to or for.","example":"Why are you rewarding that bad behaviour?"},{"definition":"To recompense.","example":"Decorations are meant to reward the most meritous acts and services."},{"definition":"To give (something) as a reward."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rewarded-us","text":"/ɹɪˈwɔɹdɪd/"}]},{"word":"DENSITIES","idx":17857,"count":1939493,"meanings":[{"definitions":[{"definition":"A measure of the mass of matter contained by a unit volume."},{"definition":"The ratio of one quantity, representing something of interest, to another quantity representing space, area, or extent in which the thing of interest is distributed.","example":"The number of particles per unit volume of a specified volume can be considered to be the particle density for the specified volume."},{"definition":"The probability that an outcome will fall into a given range, per unit of that range; the relative likelihood of possible values of a continuous random variable."},{"definition":"Stupidity; denseness."}],"partOfSpeech":"n"}]},{"word":"DEEPEST","idx":17860,"count":1939355,"meanings":[{"definitions":[{"definition":"(of a physical distance) Extending far away from a point of reference, especially downwards."},{"definition":"(intellectual, social) Complex, involved."},{"definition":"(sound, voice) Low in pitch.","example":"She has a very deep contralto voice."},{"definition":"(of a color) Highly saturated.","example":"That's a very deep shade of blue."},{"definition":"(sleep) Sound, heavy (describing a state of sleep from which one is not easily awoken).","example":"He was in a deep sleep."},{"definition":"Immersed, submerged (in).","example":"deep in debt"},{"definition":"Muddy; boggy; sandy; said of roads."},{"definition":"(of time) Distant in the past, ancient.","example":"deep time"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdiːpɪst/"}]},{"word":"SANE","idx":17864,"count":1938953,"meanings":[{"definitions":[{"definition":"Being in a healthy condition; not deranged; thinking rationally.","example":"a sane mind"},{"definition":"Mentally sound; possessing a rational mind; having the mental faculties in such condition as to be able to anticipate and judge the effect of one's actions in an ordinary manner.","example":"a sane person"},{"definition":"Rational; reasonable; sensible.","example":"Try to go to bed at a sane time before your exams."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/seɪn/"}]},{"word":"TURNAROUND","idx":17865,"count":1938787,"meanings":[{"definitions":[{"definition":"(sometimes derogatory) An emigrant heading west on the Oregon Trail who gave up and turned back to the east."},{"definition":"A section of honeycomb that is unfinished and returned to the hive."},{"definition":"The act of turning to face in the other direction.","example":"The basketball player made a turnaround jump shot"},{"definition":"A reversal of policy."},{"definition":"The time required to carry out a task.","example":"They tried to reduce their turnaround on incoming paperwork."},{"definition":"A turnabout; a reversal of circumstances."},{"definition":"A series of sketches of a character as seen from different angles."},{"definition":"A cadence linking the end of a verse to the beginning of the next."},{"definition":"The notation for the addition of a grace note above then below a given note."},{"definition":"The scheduled shutdown of an industrial plant, such as an oil rig, for maintenance and testing."},{"definition":"A contractual provision by which, if the studio elects to abandon a film project, the producer has a limited period in which to sell it elsewhere."},{"definition":"Preparations for takeoff, such as loading and servicing."}],"partOfSpeech":"n"}]},{"word":"CLIMBED","idx":17866,"count":1938305,"meanings":[{"definitions":[{"definition":"To ascend; rise; to go up.","example":"Prices climbed steeply."},{"definition":"To mount; to move upwards on.","example":"Climbing a tree"},{"definition":"To scale; to get to the top of something."},{"definition":"To move (especially up and down something) by gripping with the hands and using the feet."},{"definition":"To practise the sport of climbing"},{"definition":"To jump high"},{"definition":"To move to a higher position on the social ladder."},{"definition":"Of plants, to grow upwards by clinging to something."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"climbed-us","text":"/klaɪmd/"}]},{"word":"CORRUPTED","idx":17867,"count":1938248,"meanings":[{"definitions":[{"definition":"To make corrupt; to change from good to bad; to draw away from the right path; to deprave; to pervert."},{"definition":"To become putrid, tainted, or otherwise impure; to putrefy; to rot."},{"definition":"To debase or make impure by alterations or additions; to falsify.","example":"to corrupt a book"},{"definition":"To waste, spoil, or consume; to make worthless."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Marked by immorality and perversion; depraved."},{"definition":"Dishonest."},{"definition":"Containing errors.","example":"It proved impossible to recover any data from the corrupted disk."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kəˈɹʌptɪd/"}]},{"word":"RELAYS","idx":17868,"count":1938030,"meanings":[{"definitions":[{"definition":"To lay (for example, flooring or railroad track) again.","example":"He had to re-lay the tiles because the cement was too dry."},{"definition":"To release a new set of hounds."},{"definition":"To place (people or horses) in relays, such that one can take over from another."},{"definition":"To take on a new relay of horses; to change horses."},{"definition":"To pass on or transfer (information).","example":"Can you relay this message to John?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A new set of hounds."},{"definition":"A new set of horses kept along a specific route so that they can replace animals that are tired."},{"definition":"(by extension) A new set of anything."},{"definition":"A series of vehicles travelling in sequence."},{"definition":"A track and field discipline where runners take turns in carrying a baton from start to finish. Most common events are 4x100 meter and 4x400 meter competitions."},{"definition":"An electrical actuator that allows a relatively small electrical voltage or current to control a larger voltage or current."}],"partOfSpeech":"n"}]},{"word":"NAVIGATIONAL","idx":17869,"count":1937987,"meanings":[{"definitions":[{"definition":"Pertaining to navigation."}],"partOfSpeech":"j"}]},{"word":"HUSBANDS","idx":17872,"count":1937668,"meanings":[{"definitions":[{"definition":"The master of a house; the head of a family; a householder."},{"definition":"A tiller of the ground; a husbandman."},{"definition":"A prudent or frugal manager."},{"definition":"A man in a marriage or marital relationship, especially in relation to his spouse.","example":"You should start dating so you can find a suitable husband."},{"definition":"The male of a pair of animals."},{"definition":"A manager of property; one who has the care of another's belongings, owndom, or interests; a steward; an economist."},{"definition":"A large cushion with arms meant to support a person in the sitting position.","example":"While reading her book, Sally leaned back against her husband, wishing it were the human kind."},{"definition":"A polled tree; a pollard."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To manage or administer carefully and frugally; use to the best advantage; economise.","example":"For my means, I'll husband them so well, / They shall go far. — Shakespeare."},{"definition":"To conserve."},{"definition":"To till; cultivate; farm; nurture."},{"definition":"To provide with a husband."},{"definition":"To engage or act as a husband to; assume the care of or responsibility for; accept as one's own."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhʌzbəndz/"}]},{"word":"FADING","idx":17875,"count":1936749,"meanings":[{"definitions":[{"definition":"To grow weak; to lose strength; to decay; to perish gradually; to wither, as a plant."},{"definition":"To lose freshness, color, or brightness; to become faint in hue or tint; hence, to be wanting in color."},{"definition":"To sink away; to disappear gradually; to grow dim; to vanish.","example":"The milkman's whistling faded into the distance."},{"definition":"To cause to fade."},{"definition":"To bet against."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something fades; gradual diminishment."},{"definition":"An Irish dance."},{"definition":"The burden of a song."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fading-us","text":"/ˈfeɪdɪŋ/"}]},{"word":"FINGERTIPS","idx":17878,"count":1935481,"meanings":[{"definitions":[{"definition":"The tip of the human finger."}],"partOfSpeech":"n"}]},{"word":"PERSUADE","idx":17881,"count":1934952,"meanings":[{"definitions":[{"definition":"To successfully convince (someone) to agree to, accept, or do something, usually through reasoning and verbal influence.","example":"That salesman was able to persuade me into buying this bottle of lotion."},{"definition":"To convince of by argument, or by reasons offered or suggested from reflection, etc.; to cause to believe (something)."},{"definition":"To urge, plead; to try to convince (someone to do something)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"persuade-us","text":"/pɚˈsweɪd/"}]},{"word":"ROAMING","idx":17885,"count":1933359,"meanings":[{"definitions":[{"definition":"To wander or travel freely and with no specific destination."},{"definition":"To use a network or service from different locations or devices."},{"definition":"To transmit (resources) between different locations or devices, to allow comparable usage from any of them."},{"definition":"To range or wander over.","example":"Gangs of thugs roamed the streets."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An instance of wandering."},{"definition":"The ability to use a cell phone outside of its original registering zone."},{"definition":"The use of a network or service from different locations or devices."},{"definition":"(operating system) Using the OS service of manipulating folders and documents from different PC devices by a registered user."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹoʊmɪŋ/"},{"text":"/ˈɹəʊmɪŋ/"}]},{"word":"OVERSIZED","idx":17886,"count":1933333,"meanings":[{"definitions":[{"definition":"Very large; especially of something larger than normal for its type."}],"partOfSpeech":"j"}]},{"word":"SIBLING","idx":17888,"count":1932847,"meanings":[{"definitions":[{"definition":"A person who shares a parent; one's brother or sister who one shares a parent with.","example":"None of my siblings are married yet."},{"definition":"A node in a data structure that shares its parent with another node."},{"definition":"The most closely related species, or one of several most closely species when none can be determined to be more closely related."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɪblɪŋ/"}]},{"word":"DETERMINATIONS","idx":17890,"count":1932467,"meanings":[{"definitions":[{"definition":"The act of determining, or the state of being determined.","example":"Through sheer determination, we managed to escape from the tornado."},{"definition":"Bringing to an end; termination; limit."},{"definition":"Direction or tendency to a certain end; impulsion."},{"definition":"The quality of mind which reaches definite conclusions; decision of character; resoluteness."},{"definition":"The state of decision; a judicial decision, or ending of controversy."},{"definition":"That which is determined upon; result of deliberation; purpose; conclusion formed; fixed resolution."},{"definition":"A flow, rush, or tendency to a particular part","example":"a determination of blood to the head"},{"definition":"The act, process, or result of any accurate measurement, as of length, volume, weight, intensity, etc.","example":"the determination of the level of salt in sea water"},{"definition":"The act of defining a concept or notion by giving its essential constituents."},{"definition":"The addition of a distinguishing feature to a concept or notion, thus limiting its extent; -- the opposite of generalization."},{"definition":"The act of determining the relations of an object, such as genus and species; the referring of minerals, plants, or animals, to the species to which they belong; classification","example":"I am indebted to a friend for the determination of most of these shells."}],"partOfSpeech":"n"}]},{"word":"WEIGHED","idx":17892,"count":1932161,"meanings":[{"definitions":[{"definition":"To determine the weight of an object."},{"definition":"Often with \"out\", to measure a certain amount of something by its weight, e.g. for sale.","example":"He weighed out two kilos of oranges for a client."},{"definition":"To determine the intrinsic value or merit of an object, to evaluate.","example":"You have been weighed in the balance and found wanting."},{"definition":"To judge; to estimate."},{"definition":"To consider a subject."},{"definition":"To have a certain weight.","example":"I weigh ten and a half stone."},{"definition":"To have weight; to be heavy; to press down."},{"definition":"To be considered as important; to have weight in the intellectual balance."},{"definition":"To raise an anchor free of the seabed."},{"definition":"To weigh anchor."},{"definition":"To bear up; to raise; to lift into the air; to swing up."},{"definition":"To consider as worthy of notice; to regard."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"weighed-uk","text":"/weɪd/"}]},{"word":"ASHAMED","idx":17893,"count":1932143,"meanings":[{"definitions":[{"definition":"To feel shame; to be ashamed."},{"definition":"To make ashamed; to shame."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Feeling shame or guilt."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ashamed-us","text":"/əˈʃeɪmd/"}]},{"word":"CONCIERGE","idx":17894,"count":1932138,"meanings":[{"definitions":[{"definition":"One who attends to the wishes of hotel guests."},{"definition":"One who attends to the maintenance of a building and provides services to its tenants and visitors."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌkɑn.siˈɛɹʒ/"},{"text":"/ˌkɒn.siˈɛə̯ʒ/"}]},{"word":"GORILLA","idx":17896,"count":1931906,"meanings":[{"definitions":[{"definition":"The largest of the apes, native to the forests of central Africa, and known for their trait of knuckle-walking."},{"definition":"A big and brutish man or a thug; a goon or ruffian."},{"definition":"A powerful person or organization; a heavyweight or behemoth."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gorilla-us","text":"/ɡəˈɹɪl.ə/"}]},{"word":"GATHERINGS","idx":17897,"count":1931581,"meanings":[{"definitions":[{"definition":"A meeting or get-together; a party or social function.","example":"I met her at a gathering of engineers and scientists."},{"definition":"A group of people or things.","example":"A gathering of fruit."},{"definition":"A section, a group of bifolios, or sheets of paper, stacked together and folded in half.","example":"This gathering machine forms the backbone of a bookbinding operation."},{"definition":"A charitable contribution; a collection."},{"definition":"A tumor or boil suppurated or maturated; an abscess."}],"partOfSpeech":"n"}]},{"word":"ENDURE","idx":17898,"count":1931473,"meanings":[{"definitions":[{"definition":"To continue or carry on, despite obstacles or hardships; to persist.","example":"The singer's popularity endured for decades."},{"definition":"To tolerate or put up with something unpleasant."},{"definition":"To last.","example":"Our love will endure forever."},{"definition":"To remain firm, as under trial or suffering; to suffer patiently or without yielding; to bear up under adversity; to hold out."},{"definition":"To suffer patiently.","example":"He endured years of pain."},{"definition":"To indurate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"endure-us.ogg","text":"/ɪnˈd(j)ʊɹ/"}]},{"word":"INHIBIT","idx":17900,"count":1931066,"meanings":[{"definitions":[{"definition":"To hold in or hold back; to keep in check; restrain."},{"definition":"To recuse."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪnˈhɪbɪt/"}]},{"word":"NOM","idx":17901,"count":1931008,"meanings":[{"definitions":[{"definition":"To name someone as a candidate for a particular role or position, including that of an office."},{"definition":"To entitle, confer a name upon.","example":"1658: the City of Norwich [...] was enlarged, builded and nominated by the Saxons. — Sir Thomas Browne, Urne-Burial (Penguin 2005, p. 12)"},{"definition":"To eat with noisy enjoyment."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act or instance of nominating."},{"definition":"A device or means by which a person or thing is nominated."},{"definition":"One who nominates, the enactor of a nomination."},{"definition":"A person named, or designated, by another, to any office, duty, or position; one nominated, or proposed, by others for office or for election to office."},{"definition":"A person or organisation in whose name a security is registered though true ownership is held by another party, called nominator, especially for the purpose of concealing the identity of the nominator."},{"definition":"A person to whom the holder of a copyhold estate surrenders their interest."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Used to denote eating, or enjoyment of eating. Commonly used as \"nom nom nom\".","example":"You are so cute, I could just eat you right up! Nom nom nom."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"nom-us","text":"/nɑm/"}]},{"word":"PPS","idx":17902,"count":1930870,"meanings":[{"definitions":[{"definition":"One hundredth of a given value, used to measure the difference of two percentages.","example":"The difference between 20 percent and 30 percent is 10 percentage points, not 10 percent. In fact, an increase from 20 to 30 percent is an increase of 50 percent. Only if, for example, 20 percent of buyers choose a certain company's products in one year and 22 percent do so the next year, can one speak of an increase of 10 percent."},{"definition":"Proton and proton (used attributively to describe a collision or other interaction of these two particles)"}],"partOfSpeech":"n"}]},{"word":"SCREENPLAY","idx":17904,"count":1930533,"meanings":[{"definitions":[{"definition":"(authorship) A script for a movie or a television show."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈskɹiːnˌpleɪ/"}]},{"word":"UNABRIDGED","idx":17905,"count":1930281,"meanings":[{"definitions":[{"definition":"An unabridged publication, especially a reference work"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a book or document) Not abridged, shortened, expurgated or condensed; complete."}],"partOfSpeech":"j"}]},{"word":"DICKENS","idx":17906,"count":1930015,"meanings":[{"definitions":[{"definition":"The devil.","example":"She can go to the dickens for what she said."},{"definition":"In the phrase the dickens (Used as an intensifier).","example":"We had the dickens of a row."},{"definition":"A disturbance or row."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dickens-uk","text":"/ˈdɪkənz/"}]},{"word":"ENDPOINT","idx":17908,"count":1929656,"meanings":[{"definitions":[{"definition":"Either of the two points at the ends of a line segment."},{"definition":"A defined occurrence during the observation period of an experiment or study."},{"definition":"The stage in a titration at which a change in the colour of an indicator indicates that no more titrant should be added."},{"definition":"The entity at one end of a connection."},{"definition":"Either of the two nodes of a graph of degree 1."}],"partOfSpeech":"n"}]},{"word":"JUNIPER","idx":17909,"count":1929545,"meanings":[{"definitions":[{"definition":"Any shrub or tree of the genus Juniperus of the cypress family, which is characterized by pointed, needle-like leaves and aromatic berry-like cones."},{"definition":"One of a number of coniferous trees which resemble junipers."},{"definition":"Gin."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʒunɪpɚ/"},{"text":"/ˈdʒunɪpə/"}]},{"word":"REPETITION","idx":17910,"count":1929109,"meanings":[{"definitions":[{"definition":"The act or an instance of repeating or being repeated."},{"definition":": The act of performing a single, controlled exercise motion. A group of repetitions is a set."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To petition again."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"repetition-1-us","text":"/ɹɛpəˈtɪʃən/"}]},{"word":"LABELLING","idx":17911,"count":1928800,"meanings":[{"definitions":[{"definition":"To put a label (a ticket or sign) on (something).","example":"The shop assistant labeled all the products in the shop."},{"definition":"(ditransitive) To give a label to (someone or something) in order to categorise that person or thing.","example":"He's been unfairly labeled as a cheat, although he's only ever cheated once."},{"definition":"To replace specific atoms by their isotope in order to track the presence or movement of this isotope through a reaction, metabolic pathway or cell."},{"definition":"To add a detectable substance, either transiently or permanently, to a biological substance in order to track the presence of the label-substance combination either in situ or in vitro"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A set of labels applied to the various objects in a system."},{"definition":"The introduction of a traceable chemical group (e.g., containing an isotope or a fluorescent dye) into a protein or other biomolecule of interest so it can be tracked or quantified during experimental analysis."}],"partOfSpeech":"n"}]},{"word":"SYNCHRONOUS","idx":17913,"count":1928462,"meanings":[{"definitions":[{"definition":"At the same time, at the same frequency."},{"definition":"(of communication) Single-threaded; blocking; occurring in the same thread as other computations, thereby preventing those computations from resuming until the communication is complete."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"synchronous-us","text":"/ˈsɪŋkɹənəs/"}]},{"word":"HEARTLAND","idx":17914,"count":1928263,"meanings":[{"definitions":[{"definition":"The central part of a region defined by geographical or non-geographical criteria, such as support for a political party, faith or similar.","example":"The home counties are the Conservative heartland."},{"definition":"The part of a region considered essential to the viability and survival of the whole."}],"partOfSpeech":"n"}]},{"word":"PREPARATORY","idx":17915,"count":1927941,"meanings":[{"definitions":[{"definition":"Of or pertaining to preparation, having the purpose of making something or someone ready, preparative.","example":"I will conduct some preparatory research before choosing the new restaurant's location."}],"partOfSpeech":"j"}]},{"word":"CAFETERIA","idx":17916,"count":1927924,"meanings":[{"definitions":[{"definition":"A restaurant in which customers select their food at a counter then carry it on a tray to a table to eat"},{"definition":"A dining area in an institution where meals may be purchased (as above), provided, or brought in from elsewhere"}],"partOfSpeech":"n"}]},{"word":"OUTFITTERS","idx":17917,"count":1927586,"meanings":[{"definitions":[{"definition":"A person or shop that sells specialized clothes and equipment.","example":"Before his first walking holiday, he went to a specialist outfitter to buy some boots."},{"definition":"A business that provides services for outdoor activities including accommodations."}],"partOfSpeech":"n"}]},{"word":"FIELDING","idx":17918,"count":1927279,"meanings":[{"definitions":[{"definition":"To intercept or catch (a ball) and play it."},{"definition":"(and other batting sports) To be the team catching and throwing the ball, as opposed to hitting it.","example":"The blue team are fielding first, while the reds are batting."},{"definition":"To place (a team, its players, etc.) in a game.","example":"The away team fielded two new players and the second-choice goalkeeper."},{"definition":"To answer; to address.","example":"She will field questions immediately after her presentation."},{"definition":"To defeat.","example":"They fielded a fearsome army."},{"definition":"To execute research (in the field).","example":"He fielded the marketing survey about the upcoming product."},{"definition":"To deploy in the field.","example":"to field a new land-mine detector"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who fields.","example":"the fielding of questions from an audience"},{"definition":"The role of a fielder."}],"partOfSpeech":"n"}]},{"word":"DUNE","idx":17919,"count":1927085,"meanings":[{"definitions":[{"definition":"A ridge or hill of sand piled up by the wind."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dune-uk","text":"/djuːn/"}]},{"word":"OPP","idx":17922,"count":1926557,"meanings":[{"definitions":[{"definition":"(among criminal gangs) An opponent; an enemy."},{"definition":"A chance for advancement, progress or profit.","example":"The world is full of opportunities and it's up to me to see them and pursue them."},{"definition":"A favorable circumstance or occasion.","example":"Having a holiday is a great opportunity to relax."},{"definition":"(Euro-English) opportuneness","example":"The Court questioned the opportunity of introducing these measures in such an uncertain economic climate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Facing, or across from.","example":"He lives opposite the pub."},{"definition":"In a complementary role to.","example":"He played opposite Marilyn Monroe."},{"definition":"On another channel at the same time.","example":"The game show Just Men! aired opposite The Young and the Restless on CBS."}],"partOfSpeech":"pr"}]},{"word":"HOMELESSNESS","idx":17923,"count":1926523,"meanings":[{"definitions":[{"definition":"The state of being homeless."}],"partOfSpeech":"n"}]},{"word":"CURSED","idx":17925,"count":1926459,"meanings":[{"definitions":[{"definition":"To place a curse upon (a person or object)."},{"definition":"To call upon divine or supernatural power to send injury upon; to imprecate evil upon; to execrate."},{"definition":"To speak or shout a vulgar curse or epithet."},{"definition":"To use offensive or morally inappropriate language."},{"definition":"To bring great evil upon; to be the cause of serious harm or unhappiness to; to furnish with that which will be a cause of deep trouble; to afflict or injure grievously; to harass or torment."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Under some divine harm, malady, or other curse."},{"definition":"Shrewish, ill-tempered (often applied to women)."},{"definition":"Hateful; damnable; accursed","example":"That cursed bird keeps stealing my milk!"},{"definition":"Frightening or unsettling."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cursed-us","text":"/kɝst/"}]},{"word":"EFFICIENCIES","idx":17927,"count":1926128,"meanings":[{"definitions":[{"definition":"The extent to which time is well used for the intended task.","example":"The efficiency of the planning department is deplorable."},{"definition":"The quality of producing an effect or effects."},{"definition":"The extent to which a resource, such as electricity, is used for the intended purpose; the ratio of useful work to energy expended.","example":"The efficiency of this loudspeaker is 40%."},{"definition":"A one-room apartment.","example":"I have an efficiency available June through July."}],"partOfSpeech":"n"}]},{"word":"BLOWOUT","idx":17928,"count":1926124,"meanings":[{"definitions":[{"definition":"A sudden puncturing of a pneumatic tyre/tire."},{"definition":"A sudden release of oil and gas from a well."},{"definition":"A social function, especially one with large quantities of food."},{"definition":"A large or extravagant meal."},{"definition":"A sporting contest that is decidedly one-sided and whose outcome is no longer in doubt.","example":"The game between the two teams was nothing but a blowout."},{"definition":"An argument; an altercation."},{"definition":"A sandy depression in a sand dune ecosystem caused by the removal of sediments by wind."},{"definition":"An extreme and unexpected increase in costs, such as in government estimates for a project."},{"definition":"The cleaning of the flues of a boiler from scale, etc., by a blast of steam."},{"definition":"An unsightly flap of skin caused by an ear piercing that is too large."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbloʊaʊt/"},{"audio":"blowout-au"}]},{"word":"YOUTHS","idx":17929,"count":1926116,"meanings":[{"definitions":[{"definition":"The quality or state of being young.","example":"Her youth and beauty attracted him to her."},{"definition":"The part of life following childhood; the period of existence preceding maturity or age; the whole early part of life, from childhood, or, sometimes, from infancy, to adulthood.","example":"I made many mistakes in my youth, but learned from them all."},{"definition":"A young person.","example":"There was a group of youths hanging around the parking lot, reading fashion magazines and listening to music."},{"definition":"A young man; a male adolescent or young adult."},{"definition":"(used with a plural or singular verb) Young persons, collectively."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/juːðz/"}]},{"word":"TICKBOXES","idx":17930,"count":1925998,"meanings":[{"definitions":[{"definition":"A small space on a form in which a tick or cross may be placed as a response."}],"partOfSpeech":"n"}]},{"word":"MIGRANTS","idx":17931,"count":1925933,"meanings":[{"definitions":[{"definition":"A migratory bird or other animal."},{"definition":"Traveller or worker who moves from one region or country to another."},{"definition":"An immigrant or refugee."},{"definition":"Any of various pierid butterflies of the genus Catopsilia. Also called an emigrant."}],"partOfSpeech":"n"}]},{"word":"TUMBLE","idx":17933,"count":1925795,"meanings":[{"definitions":[{"definition":"A fall, especially end over end.","example":"I took a tumble down the stairs and broke my tooth."},{"definition":"A disorderly heap."},{"definition":"An act of sexual intercourse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fall end over end; to roll over and over."},{"definition":"To perform gymnastics such as somersaults, rolls, and handsprings."},{"definition":"To drop rapidly.","example":"Share prices tumbled after the revelation about the company's impending failure."},{"definition":"To smoothe and polish, e.g., gemstones or pebbles, by means of a rotating tumbler."},{"definition":"To have sexual intercourse."},{"definition":"To move or rush in a headlong or uncontrolled way."},{"definition":"To muss, to make disorderly; to tousle or rumple.","example":"to tumble a bed"},{"definition":"(cryptocurrency) To obscure the audit trail of funds by means of a tumbler."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tumble-us","text":"/ˈtʌmbl̩/"}]},{"word":"OVERSEE","idx":17934,"count":1925750,"meanings":[{"definitions":[{"definition":"To survey, look at something in a wide angle."},{"definition":"To supervise, guide, review or direct the actions of a person or group.","example":"It is congress's duty to oversee the spending of federal funds."},{"definition":"To inspect, examine","example":"Gamekeepers oversee a hunting ground to see to the wildlife's welfare and look for poachers."},{"definition":"To fail to see; to overlook, ignore."},{"definition":"To observe secretly or unintentionally."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"oversee-uk","text":"/əʊvə(ɹ)siː/"}]},{"word":"THRESHOLDS","idx":17935,"count":1925637,"meanings":[{"definitions":[{"definition":"The bottom-most part of a doorway that one crosses to enter; a sill."},{"definition":"(by extension) An entrance; the door or gate of a house."},{"definition":"(by extension) Any end or boundary."},{"definition":"The outset of something; the point of entry, or the beginning of an action."},{"definition":"The start of the landing area of a runway."},{"definition":"The quantitative point at which an action is triggered, especially a lower limit."},{"definition":"The wage or salary at which income tax becomes due."},{"definition":"The point where one mentally or physically is vulnerable in response to provocation or to particular things in general. As in emotions, stress, or pain."}],"partOfSpeech":"n"}]},{"word":"STARE","idx":17936,"count":1925618,"meanings":[{"definitions":[{"definition":"A persistent gaze.","example":"the stares of astonished passers-by"},{"definition":"A starling."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(construed with at) To look fixedly (at something)."},{"definition":"To influence in some way by looking fixedly.","example":"to stare a timid person into submission"},{"definition":"To be very conspicuous on account of size, prominence, colour, or brilliancy.","example":"staring windows or colours"},{"definition":"To stand out; to project; to bristle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stare-uk","text":"/stɛə(ɹ)/"}]},{"word":"UNLOCKING","idx":17937,"count":1925518,"meanings":[{"definitions":[{"definition":"To undo or open a lock or something locked by, for example, turning a key, or selecting a combination.","example":"I unlocked the door and walked in."},{"definition":"To obtain access to something.","example":"I unlocked the dictionary article so I could edit it."},{"definition":"To disclose or reveal previously unknown knowledge.","example":"The discovery of a clue unlocked the mystery."},{"definition":"To be or become unfastened or unrestrained."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is unlocked."}],"partOfSpeech":"n"}]},{"word":"MISSY","idx":17938,"count":1925451,"meanings":[{"definitions":[{"definition":"A young female, or miss; as a term of mild disparagement, typically used jokingly or rebukingly.","example":"That's enough out of you, missy!"},{"definition":"An impure yellow sulphate of iron; yellow copperas or copiapite."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Girlish; effeminate; sentimental."},{"definition":"Of, or pertaining to, female clothing or clothing sizes."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmɪs.i/"}]},{"word":"WAVEFORM","idx":17940,"count":1924833,"meanings":[{"definitions":[{"definition":"The shape of a wave function represented by a graph showing some dependent variable as function of an independent variable."},{"definition":"The shape of a physical wave, such as sound, electric current or electromagnetic radiation, or its representation obtained by plotting a characteristic of the phenomenon (such as voltage) versus another variable, often time."}],"partOfSpeech":"n"}]},{"word":"DEFICITS","idx":17941,"count":1924803,"meanings":[{"definitions":[{"definition":"Deficiency in amount or quality; a falling short; lack."},{"definition":"A situation wherein, or amount whereby, spending exceeds government revenue."}],"partOfSpeech":"n"}]},{"word":"CONTRADICTION","idx":17943,"count":1924222,"meanings":[{"definitions":[{"definition":"The act of contradicting.","example":"His contradiction of the proposal was very interesting."},{"definition":"A statement that contradicts itself, i.e., a statement that makes a claim that the same thing is true and that it is false at the same time and in the same senses of the terms.","example":"There is a contradiction in Clarence Page's statement that a woman should have the right to choose and decide for herself whether to have an abortion, and at the same time she should not have that right."},{"definition":"A logical inconsistency among two or more elements or propositions.","example":"Marx believed that the contradictions of capitalism would lead to socialism."},{"definition":"A proposition that is false for all values of its variables."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌkɑːntɹəˈdɪkʃən/"},{"text":"/ˌkɒntɹəˈdɪkʃən/"}]},{"word":"FLAIR","idx":17944,"count":1924190,"meanings":[{"definitions":[{"definition":"A natural or innate talent or aptitude.","example":"to have a flair for art"},{"definition":"Distinctive style or elegance.","example":"to dress with flair"},{"definition":"Smell; odor."},{"definition":"Olfaction; sense of smell."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add flair."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"flair-us","text":"/flɛɚ̯/"}]},{"word":"HELIUM","idx":17945,"count":1924142,"meanings":[{"definitions":[{"definition":"The second lightest chemical element (symbol He) with an atomic number of 2 and atomic weight of 4.002602, a colorless, odorless and inert noble gas."},{"definition":"A form or sample of the element."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"helium-us","text":"/ˈhiːli.əm/"}]},{"word":"WONDERFULLY","idx":17947,"count":1923818,"meanings":[{"definitions":[{"definition":"In a wonderful manner.","example":"He entertained us wonderfully."},{"definition":"To an extent inspiring wonder.","example":"His costume was wonderfully intricate."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"wonderfully-us","text":"/wʌn.də(ɹ).fli/"}]},{"word":"WHITEWATER","idx":17948,"count":1923559,"meanings":[{"definitions":[{"definition":"Any turbulent or frothy water as found in river rapids or surf.","example":"The boat's wake left two strands of white water that glistened in the moonlight."},{"definition":"Turbulent conditions."}],"partOfSpeech":"n"}]},{"word":"TABLEWARE","idx":17949,"count":1923538,"meanings":[{"definitions":[{"definition":"The cutlery, crockery and glassware used in setting a table for a meal."}],"partOfSpeech":"n"}]},{"word":"DUG","idx":17951,"count":1923261,"meanings":[{"definitions":[{"definition":"To move hard-packed earth out of the way, especially downward to make a hole with a shovel. Or to drill, or the like, through rocks, roads, or the like. More generally, to make any similar hole by moving material out of the way.","example":"If the plane can't pull out of the dive it is in, it'll dig a hole in the ground."},{"definition":"To get by digging; to take from the ground; often with up.","example":"to dig potatoes"},{"definition":"To take ore from its bed, in distinction from making excavations in search of ore."},{"definition":"To work like a digger; to study ploddingly and laboriously."},{"definition":"To investigate, to research, often followed by out or up.","example":"to dig out the facts"},{"definition":"To thrust; to poke.","example":"He dug an elbow into my ribs and guffawed at his own joke."},{"definition":"To defend against an attack hit by the opposing team by successfully passing the ball"},{"definition":"To understand or show interest in.","example":"You dig?"},{"definition":"To appreciate, or like.","example":"Baby, I dig you."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(chiefly in the plural) A mammary gland on a domestic mammal with more than two breasts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dug-uk","text":"/dʌɡ/"}]},{"word":"WORKGROUP","idx":17952,"count":1923165,"meanings":[{"definitions":[{"definition":"A group of workers engaged in a series of collaborative tasks who usually work together."},{"definition":"A computer network created for use by such groups."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwəːkɡɹuːp/"}]},{"word":"CONGENITAL","idx":17953,"count":1923163,"meanings":[{"definitions":[{"definition":"(of a trait or a disease) Present since birth."}],"partOfSpeech":"j"}]},{"word":"TROJANS","idx":17954,"count":1922895,"meanings":[{"definitions":[{"definition":"Malware that appears to perform or actually performs a desired task for a user while performing a harmful task without the user's knowledge or consent."}],"partOfSpeech":"n"}]},{"word":"INSANITY","idx":17955,"count":1922869,"meanings":[{"definitions":[{"definition":"The state of being insane; madness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"insanity-us","text":"/ɪnˈsænɪti/"}]},{"word":"CLEMENT","idx":17956,"count":1922807,"meanings":[{"definitions":[{"definition":"Lenient or merciful; charitable."},{"definition":"Mild (said of weather and similar circumstances)."}],"partOfSpeech":"j"}]},{"word":"EMBRACED","idx":17957,"count":1922457,"meanings":[{"definitions":[{"definition":"To clasp (someone or each other) in the arms with affection; to take in the arms; to hug."},{"definition":"To seize (something) eagerly or with alacrity; to accept or take up with cordiality; to welcome.","example":"I wholeheartedly embrace the new legislation."},{"definition":"To submit to; to undergo."},{"definition":"To encircle; to enclose, to encompass."},{"definition":"To enfold, to include (ideas, principles, etc.); to encompass.","example":"Natural philosophy embraces many sciences."},{"definition":"To fasten on, as armour."},{"definition":"To accept (someone) as a friend; to accept (someone's) help gladly."},{"definition":"To attempt to influence (a court, jury, etc.) corruptly; to practise embracery."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"embraced-us","text":"/ɛmˈbɹeɪst/"}]},{"word":"FINELY","idx":17959,"count":1922347,"meanings":[{"definitions":[{"definition":"So as to produce a fine texture.","example":"Grind the meat finely."},{"definition":"In a fine, handsome or attractive way; very well."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"finely-us","text":"/ˈfaɪnli/"}]},{"word":"AUTHENTICATED","idx":17960,"count":1922327,"meanings":[{"definitions":[{"definition":"To render authentic; to give authority to, by the proof, attestation, or formalities required by law, or sufficient to entitle to credit."},{"definition":"To prove authentic; to determine as real and true.","example":"He didn't manage to authenticate the portrait: it's probably a fake."}],"partOfSpeech":"ve"}]},{"word":"REFORMED","idx":17961,"count":1921880,"meanings":[{"definitions":[{"definition":"To put into a new and improved form or condition; to restore to a former good state, or bring from bad to good; to change from worse to better","example":"1909, H. G. Wells, The History of Mr. Polly Chapter 9"},{"definition":"To return to a good state; to amend or correct one's own character or habits","example":"It is hoped that many criminals, upon being freed, will eventually reform."},{"definition":"To form again or in a new configuration.","example":"The regiment reformed after surviving the first attack."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Corrected; amended; restored to purity or excellence; said, specifically, of the whole body of Protestant churches originating in the Reformation, or, in a more restricted sense, of those who separated from Martin Luther on the doctrine of consubstantiation, etc., and carried the Reformation, as they claimed, to a higher point."},{"definition":"Amended in character and life.","example":"a reformed gambler or drunkard"},{"definition":"(of an officer) Retained in service on half or full pay after the disbandment of the company or troop."}],"partOfSpeech":"j"}]},{"word":"TOLERATE","idx":17962,"count":1921707,"meanings":[{"definitions":[{"definition":"To accept hardship without objection.","example":"I can tolerate working on Saturdays, but not on Sundays."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tolerate-us","text":"/ˈtɑl.ə.ɹeɪt/"}]},{"word":"ROBOTIC","idx":17963,"count":1921045,"meanings":[{"definitions":[{"definition":"Of, relating to, or resembling a robot; mechanical, lacking emotion or personality, etc."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹoʊˈbɑt.ɪk/"},{"text":"/ɹəʊˈbɒt.ɪk/"}]},{"word":"MANA","idx":17964,"count":1920430,"meanings":[{"definitions":[{"definition":"Power, prestige; specifically, a form of supernatural energy in Polynesian religion that inheres in things or people."},{"definition":"Magical power."},{"definition":"A monetary unit of ancient Greece and the Middle East, originally equivalent to the weight of a mina of silver."},{"definition":"A unit of weight of varying value used in the ancient Middle East, especially Babylonia, Mesopotamia and Egypt; also an ancient Greek measure of weight equivalent to 1/60th of a talent."},{"definition":"One of the South and East Asian birds of the starling family Sturnidae."},{"definition":"Food miraculously produced for the Israelites in the desert in the book of Exodus."},{"definition":"(by extension) Any boon which comes into one's hands by good luck."},{"definition":"The sugary sap of the manna gum tree which oozes out from holes drilled by insects and falls to the ground around the tree.http//www.museum.vic.gov.au/forest/plants/gum.html"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mana-us","text":"/ˈmæ-/"}]},{"word":"LEST","idx":17965,"count":1920286,"meanings":[{"definitions":[{"definition":"For fear that; that not; in order to prevent something from happening; in case.","example":"He won’t go outside, lest he be eaten by those ravenous eagles."},{"definition":"(after certain expressions denoting fear or apprehension) that (without the negative particle; introduces the reason for an emotion.)","example":"I am afraid lest I revealed too much."}],"partOfSpeech":"c"}],"phonetics":[{"audio":"lest-us","text":"/lɛst/"}]},{"word":"ADHESION","idx":17966,"count":1920249,"meanings":[{"definitions":[{"definition":"The ability of a substance to stick to an unlike substance."},{"definition":"Persistent attachment or loyalty."},{"definition":"An agreement to adhere."},{"definition":"An abnormal union of surface by the formation of new tissue resulting from an inflammatory process."},{"definition":"The binding of a cell to a surface or substrate."}],"partOfSpeech":"n"}]},{"word":"TIC","idx":17967,"count":1920206,"meanings":[{"definitions":[{"definition":"A sudden, nonrhythmic motor movement or vocalization."},{"definition":"(by extension) Something that is done or produced habitually or characteristically."},{"definition":"(abbreviation) ticket"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To exhibit a tic; to undergo a sudden, semi-voluntary muscle movement."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɪk/"}]},{"word":"DIALYSIS","idx":17969,"count":1919732,"meanings":[{"definitions":[{"definition":"A method of separating molecules or particles of different sizes by differential diffusion through a semipermeable membrane."},{"definition":"Utilization of this method for removal of waste products from the blood in the case of kidney failure: hemodialysis or peritoneal dialysis."},{"definition":"The spelling out of alternatives, or presenting of either-or arguments that lead to a conclusion."},{"definition":"Asyndeton."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/daɪˈælɪsɪs/"}]}]