[{"word":"POLYMER","idx":9870,"count":5151969,"meanings":[{"definitions":[{"definition":"A long or larger molecule consisting of a chain or network of many repeating units, formed by chemically bonding together many identical or similar small molecules called monomers. A polymer is formed by polymerization, the joining of many monomer molecules."},{"definition":"A material consisting of such polymer molecules."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"polymer-us","text":"/ˈpɑ.lɪ.mɚ/"}]},{"word":"HYGIENE","idx":9871,"count":5151461,"meanings":[{"definitions":[{"definition":"The science of health, its promotion and preservation."},{"definition":"Those conditions and practices that promote and preserve health.","example":"Hygiene is an important consideration in places where food is prepared."},{"definition":"Cleanliness.","example":"They have poor personal hygiene."},{"definition":"(of a macro) The property of having an expansion that is guaranteed not to cause the accidental capture of identifiers."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hygiene-us","text":"/ˈhaɪˌdʒiːn/"}]},{"word":"WIT","idx":9872,"count":5149169,"meanings":[{"definitions":[{"definition":"(now usually in the plural) Sanity.","example":"He's gone completely out of his wits."},{"definition":"(obsolete usually in the plural) The senses."},{"definition":"Intellectual ability; faculty of thinking, reasoning.","example":"Where she has gone to is beyond the wit of man to say."},{"definition":"The ability to think quickly; mental cleverness, especially under short time constraints.","example":"My father had a quick wit and a steady hand."},{"definition":"Intelligence; common sense.","example":"The opportunity was right in front of you, and you didn't even have the wit to take it!"},{"definition":"Humour, especially when clever or quick.","example":"The best man's speech was hilarious, full of wit and charm."},{"definition":"A person who tells funny anecdotes or jokes; someone witty.","example":"Your friend is quite a wit, isn't he?"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Know, be aware of (constructed with of when used intransitively).","example":"They are meddling in matters that men should not wit of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Against.","example":"He picked a fight with the class bully."},{"definition":"In the company of; alongside, close to; near to.","example":"He went with his friends."},{"definition":"In addition to; as an accessory to.","example":"She owns a motorcycle with a sidecar."},{"definition":"Used to indicate simultaneous happening, or immediate succession or consequence.","example":"Jim was listening to Bach with his eyes closed."},{"definition":"In support of.","example":"We are with you all the way."},{"definition":"In regard to.","example":"He was pleased with the outcome."},{"definition":"To denote the accomplishment of cause, means, instrument, etc; – sometimes equivalent to by.","example":"slain with robbers"},{"definition":"Using as an instrument; by means of.","example":"Find what you want instantly with our search engine."},{"definition":"Using as nourishment; more recently replaced by on."},{"definition":"Having, owning.","example":"It was small and bumpy, with a tinge of orange."},{"definition":"Affected by (a certain emotion or condition).","example":"He spoke with sadness in his voice."},{"definition":"Prompted by (a certain emotion).","example":"green with envy; flushed with success"}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"wit-us","text":"/wɪt/"}]},{"word":"POULTRY","idx":9873,"count":5148028,"meanings":[{"definitions":[{"definition":"Domestic fowl (e.g. chickens, ducks, turkeys, and geese) raised for food (either meat or eggs)."},{"definition":"The meat from a domestic fowl."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"poultry-us","text":"/ˈpoʊltɹi/"}]},{"word":"VIRTUE","idx":9874,"count":5147800,"meanings":[{"definitions":[{"definition":"Accordance with moral principles; conformity of behaviour or thought with the strictures of morality; good moral conduct.","example":"Without virtue, there is no freedom."},{"definition":"A particular manifestation of moral excellence in a person; an admirable quality."},{"definition":"Specifically, each of several qualities held to be particularly important, including the four cardinal virtues, the three theological virtues, or the seven virtues opposed to the seven deadly sins."},{"definition":"An inherently advantageous or excellent quality of something or someone; a favourable point, an advantage."},{"definition":"A creature embodying divine power, specifically one of the orders of heavenly beings, traditionally ranked above angels and below archangels."},{"definition":"Specifically, moral conduct in sexual behaviour, especially of women; chastity."},{"definition":"The inherent power of a god, or other supernatural being."},{"definition":"The inherent power or efficacy of something (now only in phrases)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"virtue-us","text":"/ˈvɝtʃu/"}]},{"word":"BURST","idx":9875,"count":5147573,"meanings":[{"definitions":[{"definition":"An act or instance of bursting.","example":"The bursts of the bombs could be heard miles away."},{"definition":"A sudden, often intense, expression, manifestation or display."},{"definition":"A series of shots fired from an automatic firearm."},{"definition":"A drinking spree."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To break from internal pressure.","example":"I blew the balloon up too much, and it burst."},{"definition":"To cause to break from internal pressure.","example":"I burst the balloon when I blew it up too much."},{"definition":"To cause to break by any means."},{"definition":"To separate (printer paper) at perforation lines.","example":"I printed the report on form-feed paper, then burst the sheets."},{"definition":"To enter or exit hurriedly and unexpectedly."},{"definition":"To erupt; to change state suddenly as if bursting.","example":"The flowers burst into bloom on the first day of spring."},{"definition":"To produce as an effect of bursting.","example":"to burst a hole through the wall"},{"definition":"To interrupt suddenly in a violent or explosive manner; to shatter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"burst-us","text":"/bɝst/"}]},{"word":"EXAMINATIONS","idx":9876,"count":5146222,"meanings":[{"definitions":[{"definition":"The act of examining."},{"definition":"Particularly, an inspection by a medical professional to establish the extent and nature of any sickness or injury."},{"definition":"A formal test involving answering written or oral questions under a time constraint and usually without access to textbooks."},{"definition":"Interrogation."}],"partOfSpeech":"n"}]},{"word":"SURGEONS","idx":9877,"count":5145893,"meanings":[{"definitions":[{"definition":"One who performs surgery; a doctor who performs operations on people or animals.","example":"The surgeon refused to operate because the patient was her son."},{"definition":"A surgeonfish."}],"partOfSpeech":"n"}]},{"word":"BOUQUET","idx":9878,"count":5143984,"meanings":[{"definitions":[{"definition":"A bunch of cut flowers.","example":"For my birthday I received two bouquets."},{"definition":"The scent of a particular wine.","example":"This Bordeaux has an interesting bouquet."},{"definition":"The heart note of a perfume.","example":"The remarkable flower bouquet lasts for hours until it dissolves into a sweet vanilla smell."},{"definition":"A compliment or expression of praise."},{"definition":"A bouquet of circles."},{"definition":"The reserve of cards in the game of Flower Garden and variations."},{"definition":"The ninth Lenormand card, sometimes called Flowers instead."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bouquet-us","text":"/boʊˈkeɪ/"}]},{"word":"IMMUNOLOGY","idx":9879,"count":5143456,"meanings":[{"definitions":[{"definition":"The branch of medicine that concerns the body's immune system."}],"partOfSpeech":"n"}]},{"word":"PROMOTES","idx":9880,"count":5142806,"meanings":[{"definitions":[{"definition":"To raise (someone) to a more important, responsible, or remunerative job or rank.","example":"He promoted his clerk to office manager."},{"definition":"To advocate or urge on behalf of (something or someone); to attempt to popularize or sell by means of advertising or publicity.","example":"They promoted the abolition of daylight saving time."},{"definition":"To encourage, urge or incite."},{"definition":"(usually in passive form) To elevate to a higher league.","example":"At the end of the season, three teams are promoted to the Premier League."},{"definition":"To increase the activity of (a catalyst) by changing its surface structure."},{"definition":"To exchange (a pawn) for a queen or other piece when it reaches the eighth rank.","example":"Having crossed the chessboard, his pawn was promoted to a queen."},{"definition":"To move on to a subsequent stage of education.","example":"At the end of Primary 6 students can promote directly to the secondary section of SIS."}],"partOfSpeech":"ve"}]},{"word":"MANDATE","idx":9881,"count":5142448,"meanings":[{"definitions":[{"definition":"An official or authoritative command; an order or injunction; a commission; a judicial precept."},{"definition":"The authority to do something, as granted to a politician by the electorate."},{"definition":"A papal rescript."},{"definition":"A period during which a government is in power."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To authorize"},{"definition":"To make mandatory"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mandate-us","text":"/ˈmæn.deɪt/"}]},{"word":"DEPARTMENTAL","idx":9883,"count":5141504,"meanings":[{"definitions":[{"definition":"Of or pertaining to a department."}],"partOfSpeech":"j"}]},{"word":"BBS","idx":9884,"count":5141277,"meanings":[{"definitions":[{"definition":"A type of pellet that can be shot from a BB gun."},{"definition":"A walk; the statistic reporting the number of \"bases on balls\"."},{"definition":"Battleship, a type of warship"},{"definition":"A wireless handheld device, a cross between a cellphone and a mobile email appliance and Internet-capable PDA, marketed by BlackBerry Limited."},{"definition":"A very young human, particularly from birth to a couple of years old or until walking is fully mastered."},{"definition":"Any very young animal, especially a vertebrate; many species have specific names for their babies, such as kittens for the babies of cats, puppies for the babies of dogs, and chickens for the babies of birds. See for more."},{"definition":"Unborn young; a fetus.","example":"When is your baby due?"},{"definition":"A person who is immature, infantile or feeble.","example":"Stand up for yourself – don't be such a baby!"},{"definition":"A person who is new to or inexperienced in something.","example":"I only qualified as an architect this summer, so I'm still a baby."},{"definition":"The lastborn of a family; the youngest sibling, irrespective of age.","example":"Adam is the baby of the family."},{"definition":"A term of endearment used to refer to or address one's girlfriend, boyfriend or spouse.","example":"Baby, don't cry."},{"definition":"A form of address to a man or a woman considered to be attractive.","example":"Hey baby, what are you doing later?"},{"definition":"A pet project or responsibility.","example":"You need to talk to John about that – it's his baby."},{"definition":"An affectionate term for anything.","example":"See my new car here? I can't wait to take this baby for a drive."},{"definition":"A small image of an infant; a doll."},{"definition":"A sport common in North America, the Caribbean, and Japan, in which the object is to strike a ball so that one of a nine-person team can run counter-clockwise among four bases, resulting in the scoring of a run. The team with the most runs after termination of play, usually nine innings, wins."},{"definition":"The ball used to play the sport of baseball."},{"definition":"A variant of poker in which cards with baseball-related values have special significance."},{"definition":"The frequency range occupied by a message signal prior to modulation."},{"definition":"(noun adjunct) A method of transmission in which only one frequency channel is used at a time."},{"definition":"A device using baseband transmission."},{"definition":"A sport in which two opposing teams of five players strive to put a ball through a hoop."},{"definition":"The particular kind of ball used in the sport of basketball."},{"definition":"A board on which messages may be posted, especially one in a public space."},{"definition":"A system in which users may send, read and reply to public messages; an electronic message board or forum."}],"partOfSpeech":"n"}]},{"word":"SPAS","idx":9885,"count":5141268,"meanings":[{"definitions":[{"definition":"A health resort near a mineral spring or hot spring."},{"definition":"A trendy or fashionable resort."},{"definition":"A health club."},{"definition":"A hot tub"},{"definition":"A clumsy person (see spastic)"},{"definition":"An idiot"},{"definition":"A gobshite"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/spɑːz/"}]},{"word":"CORPUS","idx":9887,"count":5137372,"meanings":[{"definitions":[{"definition":"A collection of writings, often on a specific topic, of a specific genre, from a specific demographic or a particular author, etc."},{"definition":"(specifically) Such a collection in form of an electronic database used for linguistic analyses."},{"definition":"A body, a collection."},{"definition":"Synonym of long primer"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɔɹpəs/"},{"text":"/ˈkɔːpəs/"},{"audio":"corpus-au"}]},{"word":"TERMINOLOGY","idx":9889,"count":5134603,"meanings":[{"definitions":[{"definition":"The doctrine of terms; a theory of terms or appellations; a treatise on terms, a system of specialized terms."},{"definition":"The set of terms actually used in any business, art, science, or the like; nomenclature; technical terms."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌtɚməˈnɑləd͡ʒi/"},{"text":"/ˌtɜːməˈnɒləd͡ʒi/"}]},{"word":"GENTLEMAN","idx":9890,"count":5134582,"meanings":[{"definitions":[{"definition":"A man of gentle but not noble birth, particularly a man of means (originally ownership of property) who does not work for a living but has no official status in a peerage; an armiferous man ranking below a knight.","example":"Being a gentleman, Robert was entitled to shove other commoners into the gongpit but he still had to jump out of the way of the knights to avoid the same fate himself."},{"definition":"Any well-bred, well-mannered, or charming man."},{"definition":"An effeminate or oversophisticated man.","example":"Well, la-di-da, aren't you just a proper gentleman?"},{"definition":"(polite term of address) Any man.","example":"Please escort this gentleman to the gentlemen's room."},{"definition":"(usually historical, sometimes derogatory) An amateur or dabbler in any field, particularly those of independent means."},{"definition":"An amateur player, particularly one whose wealth permits him to forego payment."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gentleman-us","text":"[ˈdʒɛɾ̃.ɫ̩.mən]"},{"audio":"gentleman-au","text":"/ˈdʒɛn.təl.mən/"}]},{"word":"FIBRE","idx":9891,"count":5134463,"meanings":[{"definitions":[{"definition":"A single piece of a given material, elongated and roughly round in cross-section, often twisted with other fibres to form thread.","example":"The microscope showed several different fibres stuck to the sole of the shoe."},{"definition":"Material in the form of fibres.","example":"The cloth was made from strange, somewhat rough fibre."},{"definition":"Dietary fibre.","example":"Fresh vegetables are a good source of fibre."},{"definition":"Moral strength and resolve.","example":"The ordeal was a test of everyone’s fibre."},{"definition":"The preimage of a given point in the range of a map.","example":"Under this map, any two values in the fibre of a given point on the circle differ by 2π"},{"definition":"Said to be of a morphism over a global element: The pullback of the said morphism along the said global element."},{"definition":"A kind of lightweight thread of execution."},{"definition":"A long tubular cell found in muscle tissue; myocyte."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfaɪ.bə(ɹ)/"},{"audio":"fibre-au"}]},{"word":"REPRODUCE","idx":9892,"count":5134246,"meanings":[{"definitions":[{"definition":"To produce an image or copy of."},{"definition":"To generate offspring (sexually or asexually), or organisms."},{"definition":"To produce again; to recreate."},{"definition":"To bring something to mind; to recall."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"reproduce-us","text":"/ˌɹi.pɹoʊˈdus/"},{"audio":"reproduce-uk","text":"/ˌɹi.pɹoʊˈdjus/"}]},{"word":"CONVICTED","idx":9893,"count":5133903,"meanings":[{"definitions":[{"definition":"To find guilty","example":"His remarks convicted him of a lack of sensitivity."},{"definition":"(esp. religious) to convince, persuade; to cause (someone) to believe in (something)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"convicted","text":"/kənˈvɪktɪd/"}]},{"word":"SHADES","idx":9894,"count":5133522,"meanings":[{"definitions":[{"definition":"Darkness where light, particularly sunlight, is blocked.","example":"The old oak tree gave shade in the heat of the day."},{"definition":"Something that blocks light, particularly in a window.","example":"Close the shade, please: it's too bright in here."},{"definition":"A variety of a colour/color, in particular one obtained by adding black (compare tint).","example":"I've painted my room in five lovely shades of pink and chartreuse."},{"definition":"A subtle variation in a concept.","example":"shades of meaning"},{"definition":"An aspect that is reminiscent of something.","example":"shades of Groucho"},{"definition":"A very small degree of a quantity, or variety of meaning"},{"definition":"A ghost or specter; a spirit.","example":"The adventurer was attacked by a shade."},{"definition":"A postage stamp showing an obvious difference in colour/color to the original printing and needing a separate catalogue/catalog entry."},{"definition":"(originally gay slang) Subtle insults.","example":"Why did you paint your room chartreuse? No shade; I'm genuinely curious."},{"definition":"Sunglasses.","example":"His shades are by some famous designer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shield from light.","example":"The old oak tree shaded the lawn in the heat of the day."},{"definition":"To alter slightly.","example":"Most politicians will shade the truth if it helps them."},{"definition":"To vary or approach something slightly, particularly in color.","example":"The hillside was bright green, shading towards gold in the drier areas."},{"definition":"(of a defensive player) To move slightly from one's normal fielding position.","example":"Jones will shade a little to the right on this pitch count."},{"definition":"To darken, particularly in drawing.","example":"I draw contours first, gradually shading in midtones and shadows."},{"definition":"To surpass by a narrow margin.","example":"Both parties claimed afterwards that their man did best in the debate, but an early opinion poll suggested Mr Cameron shaded it."},{"definition":"To reduce (a window) so that only its title bar is visible."},{"definition":"To shelter; to cover from injury; to protect; to screen."},{"definition":"To present a shadow or image of; to shadow forth; to represent."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shades-au","text":"/ʃeɪdz/"}]},{"word":"JETS","idx":9895,"count":5131839,"meanings":[{"definitions":[{"definition":"A collimated stream, spurt or flow of liquid or gas from a pressurized container, an engine, etc."},{"definition":"A spout or nozzle for creating a jet of fluid."},{"definition":"A type of airplane using jet engines rather than propellers."},{"definition":"An engine that propels a vehicle using a stream of fluid as propulsion."},{"definition":"A part of a carburetor that controls the amount of fuel mixed with the air."},{"definition":"A narrow cone of hadrons and other particles produced by the hadronization of a quark or gluon."},{"definition":"Drift; scope; range, as of an argument."},{"definition":"The sprue of a type, which is broken from it when the type is cold."},{"definition":"A hard, black form of coal, sometimes used in jewellery."},{"definition":"(color) The colour of jet coal, deep grey."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To spray out of a container."},{"definition":"To spray with liquid from a container.","example":"Farmers may either dip or jet sheep with chemicals."},{"definition":"To travel on a jet aircraft or otherwise by jet propulsion"},{"definition":"To move (running, walking etc.) rapidly around"},{"definition":"To shoot forward or out; to project; to jut out."},{"definition":"To strut; to walk with a lofty or haughty gait; to be insolent; to obtrude."},{"definition":"To jerk; to jolt; to be shaken."},{"definition":"To adjust the fuel to air ratio of a carburetor; to install or adjust a carburetor jet"},{"definition":"To leave."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dʒɛts/"}]},{"word":"INDICES","idx":9896,"count":5131700,"meanings":[{"definitions":[{"definition":"An alphabetical listing of items and their location.","example":"The index of a book lists words or expressions and the pages of the book upon which they are to be found."},{"definition":"The index finger; the forefinger."},{"definition":"A movable finger on a gauge, scale, etc."},{"definition":"A symbol resembling a pointing hand, used to direct particular attention to a note or paragraph."},{"definition":"That which points out; that which shows, indicates, manifests, or discloses."},{"definition":"A sign; an indication; a token."},{"definition":"A type of noun where the meaning of the form changes with respect to the context. E.g., 'Today's newspaper' is an indexical form since its referent will differ depending on the context. See also icon and symbol."},{"definition":"A single number calculated from an array of prices or of quantities."},{"definition":"A number representing a property or ratio, a coefficient."},{"definition":"A raised suffix indicating a power."},{"definition":"An integer or other key indicating the location of data e.g. within an array, vector, database table, associative array, or hash table."},{"definition":"A data structure that improves the performance of operations on a table."},{"definition":"A prologue indicating what follows."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"indices-us","text":"/ˈɪndɪsiːz/"}]},{"word":"ROOMMATES","idx":9897,"count":5131231,"meanings":[{"definitions":[{"definition":"A person with whom one shares a room, as at university etc."},{"definition":"A person (UK: flatmate, housemate, AU: sharemate) sharing the same home (sharehome)."}],"partOfSpeech":"n"}]},{"word":"ADWARE","idx":9898,"count":5130713,"meanings":[{"definitions":[{"definition":"A software application that includes advertisements, which are displayed while the software is running. Developers use adware as a source of income and to keep the costs of the software down (usually making it free). Some adware programs can include spyware."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"adware-uk"}]},{"word":"THREATENING","idx":9901,"count":5126983,"meanings":[{"definitions":[{"definition":"To make a threat against someone; to use threats.","example":"He threatened me with a knife."},{"definition":"To menace, or be dangerous.","example":"The rocks threatened the ship's survival."},{"definition":"To portend, or give a warning of.","example":"The black clouds threatened heavy rain."},{"definition":"To be close to equaling or surpassing (a record, etc.)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of threatening; a threat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Presenting a threat; menacing; frightening.","example":"Never turn your back to someone who is displaying threatening behavior."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"threatening-us","text":"/ˈθɹɛt.n̩.ɪŋ/"}]},{"word":"SPOKESMAN","idx":9902,"count":5126711,"meanings":[{"definitions":[{"definition":"One who speaks as the voice of a group of people."}],"partOfSpeech":"n"}]},{"word":"ACTIVISTS","idx":9904,"count":5125937,"meanings":[{"definitions":[{"definition":"One who is politically active in the role of a citizen; especially, one who campaigns for change."},{"definition":"One who is conspicuously active in carrying out any occupational or professional functions."}],"partOfSpeech":"n"}]},{"word":"PRISONER","idx":9906,"count":5124810,"meanings":[{"definitions":[{"definition":"A person incarcerated in a prison, while on trial or serving a sentence."},{"definition":"Any person held against their will."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"prisoner-us","text":"/ˈpɹɪzənəɹ/"}]},{"word":"DAISY","idx":9907,"count":5124326,"meanings":[{"definitions":[{"definition":"A wild flowering plant Bellis perennis of the Asteraceae family, with a yellow head and white petals"},{"definition":"Many other flowering plants of various species."},{"definition":"A boot or other footwear."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"daisy-us"},{"text":"/ˈdeɪ.zi/"}]},{"word":"ENCOURAGES","idx":9909,"count":5122734,"meanings":[{"definitions":[{"definition":"To mentally support; to motivate, give courage, hope or spirit.","example":"I encouraged him during his race."},{"definition":"To spur on, strongly recommend.","example":"We encourage the use of bicycles in the town centre."},{"definition":"To foster, give help or patronage","example":"The royal family has always encouraged the arts in word and deed"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"encourages-uk"}]},{"word":"CURSOR","idx":9911,"count":5122085,"meanings":[{"definitions":[{"definition":"A part of any of several scientific instruments that moves back and forth to indicate a position"},{"definition":"A moving icon or other representation of the position of the pointing device"},{"definition":"An indicator, often a blinking line or bar, indicating where the next insertion or other edit will take place"},{"definition":"A reference to a row of data in a table, which moves from row to row as data is retrieved by way of it"},{"definition":"A design pattern in object oriented methodology in which a collection is iterated uniformly"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To navigate by means of the cursor keys."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɜɹsəɹ/"}]},{"word":"ASSEMBLED","idx":9912,"count":5120841,"meanings":[{"definitions":[{"definition":"To put together.","example":"He assembled the model ship."},{"definition":"To gather as a group.","example":"The parents assembled in the school hall."},{"definition":"To translate from assembly language to machine code"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"assembled-us","text":"/əˈsɛmbl̩d/"}]},{"word":"EARLIEST","idx":9913,"count":5120593,"meanings":[{"definitions":[{"definition":"At a time in advance of the usual or expected event.","example":"at eleven, we went for an early lunch;  she began reading at an early age;  his mother suffered an early death"},{"definition":"Arriving a time before expected; sooner than on time.","example":"The early guests sipped their punch and avoided each other's eyes."},{"definition":"Near the start or beginning.","example":"Early results showed their winning 245 out of 300 seats in parliament. The main opponent locked up only 31 seats."},{"definition":"Having begun to occur; in its early stages.","example":"early cancer"},{"definition":"Of a star or class of stars, hotter than the sun."}],"partOfSpeech":"j"},{"definitions":[{"definition":"At a time before expected; sooner than usual.","example":"We finished the project an hour sooner than scheduled, so we left early."},{"definition":"Soon; in good time; seasonably."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"earliest-us","text":"/ˈɝ.li.ɪst/"}]},{"word":"DONATED","idx":9914,"count":5120422,"meanings":[{"definitions":[{"definition":"To make a donation; to give away something of value to support or contribute towards a cause or for the benefit of another.","example":"He donated an etching from his own collection to the new art gallery."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been given freely rather than purchased."}],"partOfSpeech":"j"}]},{"word":"STUFFED","idx":9915,"count":5120285,"meanings":[{"definitions":[{"definition":"To fill by packing or crowding something into; to cram with something; to load to excess.","example":"I'm going to stuff this pillow with feathers."},{"definition":"To fill a space with (something) in a compressed manner.","example":"He stuffed his clothes into the closet and shut the door."},{"definition":"To fill with seasoning.","example":"She stuffed the turkey for Thanksgiving using her secret recipe."},{"definition":"To load goods into (a container) for transport."},{"definition":"(used in the passive) To sate.","example":"I’m stuffed after having eaten all that turkey, mashed potatoes and delicious stuffing."},{"definition":"(pronominal) To eat, especially in a hearty or greedy manner.","example":"She sits on the sofa all day, watching TV and stuffing herself with cream buns."},{"definition":"To break; to destroy.","example":"He skidded off the road and totally stuffed his brand new car."},{"definition":"To sexually penetrate.","example":"His wife came home early and found him on the couch stuffing the maid."},{"definition":"(mildly vulgar, often imperative) Used to contemptuously dismiss or reject something. See also stuff it.","example":"Stuff your stupid rules, I'll do what I like."},{"definition":"To heavily defeat or get the better of.","example":"Mudchester Rovers were stuffed 7-0 in the semi-final."},{"definition":"To cut off another competitor in a race by disturbing his projected and committed racing line (trajectory) by an abrupt manoeuvre.","example":"I got stuffed by that guy on the supermoto going into that turn, almost causing us to crash."},{"definition":"To preserve a dead bird or other animal by filling its skin."},{"definition":"To obstruct, as any of the organs; to affect with some obstruction in the organs of sense or respiration."},{"definition":"To form or fashion by packing with the necessary material."},{"definition":"To crowd with facts; to cram the mind of; sometimes, to crowd or fill with false or idle tales or fancies."},{"definition":"To compress (a file or files) in the StuffIt format, to be unstuffed later."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Full or packed (with some material or substance).","example":"Customs officers look closely through a stuffed suitcase."},{"definition":"Filled with seasoning","example":"We're having stuffed turkey for dinner."},{"definition":"Full after eating.","example":"Stuffed children sleep poorly."},{"definition":"Very tired."},{"definition":"Broken, not functional; in trouble, in a situation from which one is unlikely to recover."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stuffed-au","text":"/stʌft/"}]},{"word":"RESTRUCTURING","idx":9916,"count":5119935,"meanings":[{"definitions":[{"definition":"To change the organization of."},{"definition":"To modify the terms of a loan, providing relief to a debtor who would otherwise be forced to default."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A reorganization; an alteration of structure."}],"partOfSpeech":"n"}]},{"word":"INSECTS","idx":9917,"count":5119814,"meanings":[{"definitions":[{"definition":"An arthropod in the class Insecta, characterized by six legs, up to four wings, and a chitinous exoskeleton.","example":"Our shed has several insect infestions, including ants, yellowjackets, and wasps."},{"definition":"Any small arthropod similar to an insect including spiders, centipedes, millipedes, etc","example":"The swamp is swarming with every sort of insect."},{"definition":"A contemptible or powerless person.","example":"The manager’s assistant was the worst sort of insect."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"insects-us","text":"/ˈɪnsɛkts/"}]},{"word":"TERMINALS","idx":9918,"count":5119178,"meanings":[{"definitions":[{"definition":"A building in an airport where passengers transfer from ground transportation to the facilities that allow them to board airplanes."},{"definition":"A harbour facility where ferries embark and disembark passengers and load and unload vehicles."},{"definition":"A rail station where service begins and ends; the end of the line. For example: Grand Central Terminal in New York City."},{"definition":"A rate charged on all freight, regardless of distance, and supposed to cover the expenses of station service, as distinct from mileage rate, generally proportionate to the distance and intended to cover movement expenses."},{"definition":"A town lying at the end of a railroad, in which the terminal is located; more properly called a terminus."},{"definition":"A storage tank for bulk liquids (such as oil or chemicals) prior to further distribution."},{"definition":"The end of a line where signals are either transmitted or received, or a point along the length of a line where the signals are made available to apparatus."},{"definition":"An electric contact on a battery."},{"definition":"The apparatus to send and/or receive signals on a line, such as a telephone or network device."},{"definition":"A device for entering data into a computer or a communications system and/or displaying data received, especially a device equipped with a keyboard and some sort of textual display."},{"definition":"A computer program that emulates a physical terminal."},{"definition":"A terminal symbol in a formal grammar."},{"definition":"The end ramification (of an axon, etc.) or one of the extremities of a polypeptid."}],"partOfSpeech":"n"}]},{"word":"CRUDE","idx":9919,"count":5119129,"meanings":[{"definitions":[{"definition":"Any substance in its natural state."},{"definition":"Crude oil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"In a natural, untreated state.","example":"crude oil"},{"definition":"Characterized by simplicity, especially something not carefully or expertly made.","example":"a crude shelter"},{"definition":"Lacking concealing elements.","example":"a crude truth"},{"definition":"Lacking tact or taste.","example":"a crude remark"},{"definition":"Immature or unripe."},{"definition":"(grammar) Pertaining to the uninflected stem of a word."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"crude-us","text":"/kɹuːd/"}]},{"word":"MAIDEN","idx":9921,"count":5118578,"meanings":[{"definitions":[{"definition":"One of the triune goddesses of the Lady in Wicca alongside the Crone and Mother representing a girl or a young woman"},{"definition":"A girl or an unmarried young woman."},{"definition":"A female virgin.","example":"She's unmarried and still a maiden."},{"definition":"A man with no experience of sex, especially because of deliberate abstention."},{"definition":"A maidservant."},{"definition":"A clothes maiden."},{"definition":"An unmarried woman, especially an older woman."},{"definition":"A racehorse without any victory, i.e. one having a \"virgin record\"."},{"definition":"A horse race in which all starters are maidens."},{"definition":"A Scottish counterpart of the guillotine."},{"definition":"A maiden over."},{"definition":"A machine for washing linen."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Virgin."},{"definition":"(of a female, human or animal) Without offspring."},{"definition":"Like or befitting a (young, unmarried) maiden."},{"definition":"Being a first occurrence or event.","example":"After Edmund Burke's maiden speech, William Pitt the Elder said Burke had \"spoken in such a manner as to stop the mouths of all Europe\" and that the Commons should congratulate itself on acquiring such a member."},{"definition":"Being an over in which no runs are scored."},{"definition":"Fresh; innocent; unpolluted; pure; hitherto unused."},{"definition":"(of a fortress) Never having been captured or violated."},{"definition":"(of a tree) Grown from seed and never pruned"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"maiden-us","text":"/ˈmeɪdən/"},{"audio":"maiden-au","text":"/ˈmeɪdən/"}]},{"word":"SIMULATIONS","idx":9922,"count":5118428,"meanings":[{"definitions":[{"definition":"Something that simulates a system or environment in order to predict actual behaviour.","example":"The most reliable simulation predicts that the hurricane will turn north."},{"definition":"The process of simulating.","example":"Despite extensive simulation in the design phase, the aircraft failed to behave as expected."},{"definition":"A video game designed to convey a more or less realistic experience, as of a sport or warfare.","example":"Some kids in the classroom will be playing simulations after school."},{"definition":"Assuming an appearance which is feigned, or not true."},{"definition":"The act of falling over in order to be awarded a foul, when no foul has been committed."}],"partOfSpeech":"n"}]},{"word":"SUFFICIENTLY","idx":9924,"count":5116122,"meanings":[{"definitions":[{"definition":"(manner) In a sufficient manner; enough.","example":"Once we had eaten and drunk sufficiently, we padded off to sleep."},{"definition":"(degree) To a sufficient extent.","example":"We wanted to build a tepee, but we couldn't find sufficiently long sticks."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"sufficiently-us","text":"/səˈfɪʃəntli/"}]},{"word":"EXAMINES","idx":9925,"count":5115817,"meanings":[{"definitions":[{"definition":"To observe or inspect carefully or critically","example":"He examined the crime scene for clues."},{"definition":"To check the health or condition of something or someone","example":"The doctor examined the patient."},{"definition":"To determine the aptitude, skills or qualifications of someone by subjecting them to an examination"},{"definition":"To interrogate","example":"The witness was examined under oath."}],"partOfSpeech":"ve"}]},{"word":"VIKING","idx":9926,"count":5115013,"meanings":[{"definitions":[{"definition":"One of the Scandinavian or other Northern European seafaring warriors that raided (and then settled) the British Isles and other parts of Europe in the 8th to the 11th centuries and, according to many historians, were the first Europeans to reach North America."},{"definition":"(by extension) A stock character common in the fantasy genre, namely a barbarian, generally equipped with an axe or sword and a helmet adorned with horns."},{"definition":"A Norseman (mediaeval Scandinavian)."},{"definition":"(mildly) An ethnic Swede, Norwegian, Dane, Icelander or Faroe Islander."},{"definition":"A player on the Minnesota Vikings NFL team."}],"partOfSpeech":"n"}]},{"word":"MYRTLE","idx":9927,"count":5114989,"meanings":[{"definitions":[{"definition":"An evergreen shrub or small tree of the genus Myrtus, native to southern Europe and north Africa."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɝtəl/"},{"text":"/ˈmɜːtəl/"}]},{"word":"BORED","idx":9928,"count":5114852,"meanings":[{"definitions":[{"definition":"To inspire boredom in somebody."},{"definition":"To make a hole through something."},{"definition":"To make a hole with, or as if with, a boring instrument; to cut a circular hole by the rotary motion of a tool.","example":"An insect bores into a tree."},{"definition":"To form or enlarge (something) by means of a boring instrument or apparatus.","example":"to bore a steam cylinder or a gun barrel; to bore a hole"},{"definition":"To make (a passage) by laborious effort, as in boring; to force a narrow and difficult passage through.","example":"to bore one's way through a crowd"},{"definition":"To be pierced or penetrated by an instrument that cuts as it turns.","example":"This timber does not bore well."},{"definition":"To push forward in a certain direction with laborious effort."},{"definition":"(of a horse) To shoot out the nose or toss it in the air."},{"definition":"To fool; to trick."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Suffering from boredom; mildly annoyed and restless through having nothing to do"},{"definition":"Uninterested, without attention","example":"The piano teacher's bored look indicated he wasn't paying much attention to his pupil's lackluster rendition of Mozart's Requiem"},{"definition":"Perforated by a hole or holes (through bioerosion or other)"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/bɔːɹd/"},{"text":"/bɔːd/"}]},{"word":"CLEANUP","idx":9929,"count":5113575,"meanings":[{"definitions":[{"definition":"The act of cleaning or tidying something."},{"definition":"Fourth in the batting order; a cleanup hitter.","example":"Jones will be batting cleanup in tonight's game."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[ˈkliːˌnʌp]"}]},{"word":"YARN","idx":9930,"count":5113505,"meanings":[{"definitions":[{"definition":"A twisted strand of fiber used for knitting or weaving."},{"definition":"Bundles of fibers twisted together, and which in turn are twisted in bundles to form strands, which in their turn are twisted or plaited to form rope."},{"definition":"A story, a tale, especially one that is incredible."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tell a story or stories."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"yarn-us","text":"/jɑɹn/"}]},{"word":"KNIT","idx":9931,"count":5113070,"meanings":[{"definitions":[{"definition":"A knitted garment."},{"definition":"A session of knitting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To turn thread or yarn into a piece of fabric by forming loops that are pulled through each other. This can be done by hand with needles or by machine.","example":"The first generation knitted to order; the second still knits for its own use; the next leaves knitting to industrial manufacturers."},{"definition":"To join closely and firmly together.","example":"The fight for survival knitted the men closely together."},{"definition":"To become closely and firmly joined; become compacted."},{"definition":"To grow together.","example":"All those seedlings knitted into a kaleidoscopic border."},{"definition":"To combine from various elements.","example":"The witness knitted together his testimony from contradictory pieces of hearsay."},{"definition":"Of bones: to heal following a fracture.","example":"I’ll go skiing again after my bones knit."},{"definition":"To form into a knot, or into knots; to tie together, as cord; to fasten by tying."},{"definition":"To draw together; to contract into wrinkles."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"knit-uk","text":"/ˈnɪt/"}]},{"word":"CONDITIONAL","idx":9932,"count":5112750,"meanings":[{"definitions":[{"definition":"(grammar) A conditional sentence; a statement that depends on a condition being true or false."},{"definition":"(grammar) The conditional mood."},{"definition":"A statement that one sentence is true if another is.","example":"\"A implies B\" is a conditional."},{"definition":"An instruction that branches depending on the truth of a condition at that point.","example":"if and while are conditionals in some programming languages."},{"definition":"A limitation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Limited by a condition.","example":"I made my son a conditional promise: I would buy him a bike if he kept his room tidy."},{"definition":"Stating that one sentence is true if another is.","example":"\"A implies B\" is a conditional statement."},{"definition":"(grammar) Expressing a condition or supposition.","example":"a conditional word, mode, or tense"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"conditional-uk","text":"/kənˈdɪʃənəl/"}]},{"word":"MUG","idx":9933,"count":5112219,"meanings":[{"definitions":[{"definition":"A large cup for hot liquids, usually having a handle and used without a saucer."},{"definition":"The face, often used deprecatingly.","example":"What an ugly mug."},{"definition":"A gullible or easily-cheated person.","example":"He's a gullible mug – he believed her again."},{"definition":"A stupid or contemptible person."},{"definition":"Motherfucker (usually in similes, e.g. \"like a mug\" or \"as a mug\")"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike in the face."},{"definition":"To assault for the purpose of robbery."},{"definition":"To exaggerate a facial expression for communicative emphasis; to make a face, to pose, as for photographs or in a performance, in an exaggerated or affected manner.","example":"The children weren't interested in sitting still for a serious photo; they mugged for the camera."},{"definition":"To photograph for identification; to take a mug shot."},{"definition":"To learn or review a subject as much as possible in a short time; cram."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Easily fooled, gullible."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mug-us","text":"/mʌɡ/"},{"audio":"mug-au","text":"/mʌɡ/"}]},{"word":"CROSSWORD","idx":9934,"count":5111954,"meanings":[{"definitions":[{"definition":"(games, puzzles) A word puzzle in which interlocking words are entered usually horizontally and vertically into a grid based on clues given for each word."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"crossword-us"}]},{"word":"BOTHER","idx":9935,"count":5111764,"meanings":[{"definitions":[{"definition":"Fuss, ado.","example":"There was a bit of bother at the hairdresser's when they couldn't find my appointment in the book."},{"definition":"Trouble, inconvenience.","example":"Yes, I can do that for you - it's no bother."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To annoy, to disturb, to irritate.","example":"Would it bother you if I smoked?"},{"definition":"To feel care or anxiety; to make or take trouble; to be troublesome.","example":"Why do I even bother to try?"},{"definition":"To do something which is of negligible inconvenience.","example":"You didn't even bother to close the door."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A mild expression of annoyance."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"bother-uk","text":"[ˈbɒðə(ɹ)]"}]},{"word":"CONCEPTUAL","idx":9937,"count":5110735,"meanings":[{"definitions":[{"definition":"Of, or relating to concepts or mental conception; existing in the imagination.","example":"We defined a conceptual model before designing the real thing."},{"definition":"Of or relating to conceptualism."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kənˈsɛptʃuəl/"},{"text":"/kənˈsɛptjʊəl/"}]},{"word":"KNITTING","idx":9938,"count":5107350,"meanings":[{"definitions":[{"definition":"To turn thread or yarn into a piece of fabric by forming loops that are pulled through each other. This can be done by hand with needles or by machine.","example":"The first generation knitted to order; the second still knits for its own use; the next leaves knitting to industrial manufacturers."},{"definition":"To join closely and firmly together.","example":"The fight for survival knitted the men closely together."},{"definition":"To become closely and firmly joined; become compacted."},{"definition":"To grow together.","example":"All those seedlings knitted into a kaleidoscopic border."},{"definition":"To combine from various elements.","example":"The witness knitted together his testimony from contradictory pieces of hearsay."},{"definition":"Of bones: to heal following a fracture.","example":"I’ll go skiing again after my bones knit."},{"definition":"To form into a knot, or into knots; to tie together, as cord; to fasten by tying."},{"definition":"To draw together; to contract into wrinkles."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to knit; the process of producing knitted material.","example":"I find knitting very relaxing."},{"definition":"Material that has been, or is being knitted.","example":"She put down her knitting and went to answer the phone."},{"definition":"Overhead electrification wires, OHLE"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"knitting-uk","text":"/ˈnɪtɪŋ/"}]},{"word":"ATTACKED","idx":9939,"count":5106909,"meanings":[{"definitions":[{"definition":"To apply violent force to someone or something.","example":"This species of snake will only attack humans if it feels threatened."},{"definition":"To aggressively challenge a person, idea, etc., with words (particularly in newspaper headlines, because it typesets into less space than \"criticize\" or similar).","example":"She published an article attacking the recent pay cuts."},{"definition":"To begin to affect; to act upon injuriously or destructively; to begin to decompose or waste."},{"definition":"To deal with something in a direct way; to set to work upon.","example":"I attacked the meal with a hearty appetite."},{"definition":"To aim balls at the batsman’s wicket."},{"definition":"To set a field, or bowl in a manner designed to get wickets."},{"definition":"To bat aggressively, so as to score runs quickly."},{"definition":"To move forward in an active attempt to score a point, as opposed to trying not to concede."},{"definition":"To accelerate quickly in an attempt to get ahead of the other riders."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"attacked-us","text":"/əˈtækt/"}]},{"word":"MATING","idx":9943,"count":5102029,"meanings":[{"definitions":[{"definition":"To put the king of an opponent into checkmate.","example":"That jerk checkmated me in four moves!"},{"definition":"(by extension) To place in a losing situation that has no escape."},{"definition":"To match, fit together without space between.","example":"The pieces of the puzzle mate perfectly."},{"definition":"To copulate."},{"definition":"To pair in order to raise offspring"},{"definition":"To arrange in matched pairs."},{"definition":"To introduce (animals) together for the purpose of breeding."},{"definition":"(of an animal) To copulate with."},{"definition":"To marry; to match (a person)."},{"definition":"To match oneself against; to oppose as equal; to compete with."},{"definition":"To fit (objects) together without space between."},{"definition":"To move (a space shuttle orbiter) onto the back of an aircraft that can carry it."},{"definition":"To confuse; to confound."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pairing of organisms for copulation."},{"definition":"Sexual union; copulation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Fitting into or onto a corresponding part, as a matched plug and socket."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmeɪtɪŋ/"}]},{"word":"COMPUTE","idx":9944,"count":5101135,"meanings":[{"definitions":[{"definition":"Computational power"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reckon or calculate.","example":"Can anyone here compute the square root of 10201?"},{"definition":"To make sense.","example":"Does that compute, or do I need to explain further?"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəmˈpjuːt/"}]},{"word":"REDHEAD","idx":9945,"count":5100843,"meanings":[{"definitions":[{"definition":"A person with red hair."},{"definition":"A North American duck (Aythya americana) highly esteemed as a game bird."},{"definition":"A kind of milkweed (Asclepia curassavica), with red flowers, formerly used in medicine."},{"definition":"Chinese red-headed centipede"},{"definition":"Red-headed bunting (Emberiza bruniceps)"},{"definition":"Red-headed titi (Callicebus regulus)"},{"definition":"Red-headed vulture (Sarcogyps calvus)"},{"definition":"Red-headed woodpecker (Melanerpes erythrocephalus)"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹɛdˌhɛd/"}]},{"word":"ARRIVES","idx":9946,"count":5100329,"meanings":[{"definitions":[{"definition":"To reach; to get to a certain place.","example":"He arrived home for two days."},{"definition":"To obtain a level of success or fame; to succeed.","example":"He had finally arrived on Broadway."},{"definition":"To come; said of time.","example":"The time has arrived for us to depart."},{"definition":"To happen or occur."},{"definition":"To reach; to come to."},{"definition":"To bring to shore."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈɹaɪvz/"}]},{"word":"TRANSLATOR","idx":9947,"count":5099564,"meanings":[{"definitions":[{"definition":"A person who translates text, film or other material into a different natural language."},{"definition":"(by extension) One that makes a new version of a source material in a different language or format."},{"definition":"A language interpreter."},{"definition":"A computer program that translates something from one language to another using machine translation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"translator-uk","text":"/ˈtɹanzleɪtə/"}]},{"word":"AUTOMOBILES","idx":9948,"count":5099074,"meanings":[{"definitions":[{"definition":"A type of vehicle designed to move on the ground under its own stored power and intended to carry a driver, a small number of additional passengers, and a very limited amount of other load. A car or motorcar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel by automobile."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"automobiles-us"}]},{"word":"TRACTOR","idx":9949,"count":5098075,"meanings":[{"definitions":[{"definition":"A vehicle used in farms e.g. for pulling farm equipment and preparing the fields."},{"definition":"A truck (or lorry) for pulling a semi-trailer or trailer."},{"definition":"Any piece of machinery that pulls something."},{"definition":"An airplane where the propeller is located in front of the fuselage"},{"definition":"(rail transportation) A British Rail Class 37 locomotive."},{"definition":"A metal rod used in tractoration, or Perkinism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prepare (land) with a tractor."},{"definition":"To move with a tractor beam."},{"definition":"To treat by means of tractoration, or Perkinism."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tractor-us","text":"/ˈtɹæktɚ/"}]},{"word":"CONTINENT","idx":9951,"count":5095575,"meanings":[{"definitions":[{"definition":"Each of the main continuous land-masses on the earth's surface, now generally regarded as seven in number, including their related islands, continental shelves etc."},{"definition":"A large contiguous landmass considered independent of its islands, peninsulas etc. Specifically, the Old World continent of Europe–Asia–Africa. See the Continent."},{"definition":"Land (as opposed to the water)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Exercising self-restraint; controlled, temperate with respect to one's bodily needs or passions, especially sex, urination and/or defecation."},{"definition":"Not interrupted; connected; continuous.","example":"a continent fever"},{"definition":"Serving to restrain or limit; restraining; opposing."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"continent-us","text":"/ˈkɑntɪnənt/"}]},{"word":"OB","idx":9952,"count":5095292,"meanings":[{"definitions":[{"definition":"A halfpenny"},{"definition":"An objection"},{"definition":"The obese gene"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɒb/"}]},{"word":"UNWRAP","idx":9953,"count":5094329,"meanings":[{"definitions":[{"definition":"To open or undo, as what is wrapped or folded."},{"definition":"To become unwrapped."},{"definition":"To remove word wrap from."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ʌnˈɹæp/"}]},{"word":"FARES","idx":9954,"count":5093799,"meanings":[{"definitions":[{"definition":"A going; journey; travel; voyage; course; passage."},{"definition":"Money paid for a transport ticket."},{"definition":"A paying passenger, especially in a taxi."},{"definition":"Food and drink."},{"definition":"Supplies for consumption or pleasure."},{"definition":"A prostitute's client."}],"partOfSpeech":"n"}]},{"word":"LONGITUDE","idx":9955,"count":5091778,"meanings":[{"definitions":[{"definition":"Angular distance measured west or east of the prime meridian."},{"definition":"Any imaginary line perpendicular to the equator and part of a great circle passing through the North Pole and South Pole."},{"definition":"Length."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"longitude-us","text":"/ˈlɑndʒəˌtud/"}]},{"word":"RESIST","idx":9956,"count":5090633,"meanings":[{"definitions":[{"definition":"A protective coating or covering."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attempt to counter the actions or effects of."},{"definition":"To withstand the actions of."},{"definition":"To oppose."},{"definition":"To be distasteful to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"resist-us","text":"/ɹəˈzɪst/"}]},{"word":"CHALLENGED","idx":9957,"count":5087540,"meanings":[{"definitions":[{"definition":"To invite (someone) to take part in a competition.","example":"We challenged the boys next door to a game of football."},{"definition":"To dare (someone)."},{"definition":"To dispute (something).","example":"to challenge the accuracy of a statement or of a quotation"},{"definition":"To make a formal objection to a juror."},{"definition":"To claim as due; to demand as a right."},{"definition":"To censure; to blame."},{"definition":"To question or demand the countersign from (one who attempts to pass the lines).","example":"The sentinel challenged us with \"Who goes there?\""},{"definition":"To object to the reception of the vote of, e.g. on the ground that the person is not qualified as a voter."},{"definition":"To take (a final exam) in order to get credit for a course without taking it."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lacking some physical or mental attribute or skill ; used after adverbs to make politically correct adjectives.","example":"mentally challenged"},{"definition":"Used following adverbs to make adjectives in imitation of and mocking adjectives of this kind.","example":"vertically challenged"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"challenged-us","text":"/ˈtʃæl.əndʒd/"}]},{"word":"HOPED","idx":9959,"count":5086531,"meanings":[{"definitions":[{"definition":"To want something to happen, with a sense of expectation that it might.","example":"I am still hoping that all will turn out well."},{"definition":"To be optimistic; be full of hope; have hopes."},{"definition":"To place confidence; to trust with confident expectation of good; usually followed by in."},{"definition":"To wish.","example":"I hope you all the best."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hoped-us","text":"/hoʊpt/"}]},{"word":"PIKE","idx":9960,"count":5085622,"meanings":[{"definitions":[{"definition":"A very long spear used two-handed by infantry soldiers for thrusting (not throwing), both for attacks on enemy foot soldiers and as a countermeasure against cavalry assaults."},{"definition":"A sharp point, such as that of the weapon."},{"definition":"A large haycock."},{"definition":"Any carnivorous freshwater fish of the genus Esox, especially the northern pike, Esox lucius."},{"definition":"A position with the knees straight and a tight bend at the hips with the torso folded over the legs, usually part of a jack-knife."},{"definition":"A pointy extrusion at the toe of a shoe."},{"definition":"Especially in place names: a hill or mountain, particularly one with a sharp peak or summit.","example":"Scafell Pike is the highest mountain in England."},{"definition":"A pick, a pickaxe."},{"definition":"A hayfork."},{"definition":"A penis."},{"definition":"Short for turnpike.","example":"There is heavy traffic on the Mass Pike"},{"definition":"A gypsy, itinerant tramp, or traveller from any ethnic background; a pikey."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prod, attack, or injure someone with a pike."},{"definition":"To assume a pike position."},{"definition":"To bet or gamble with only small amounts of money."},{"definition":"Often followed by on or out: to quit or back out of a promise.","example":"Don’t pike on me like you did last time!"},{"definition":"To equip with a turnpike."},{"definition":"(thieves' cant) To depart or travel (as if by a turnpike), especially to flee, to run away."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pike-us","text":"/paɪk/"}]},{"word":"SAFER","idx":9961,"count":5085040,"meanings":[{"definitions":[{"definition":"Not in danger; out of harm's reach.","example":"You’ll be safe here."},{"definition":"Free from risk.","example":"It’s safe to eat this."},{"definition":"Providing protection from danger; providing shelter.","example":"We have to find a safe spot, where we can hide out until this is over."},{"definition":"When a batter successfully reaches first base, or when a baserunner successfully advances to the next base or returns to the base he last occupied; not out.","example":"The pitcher attempted to pick off the runner at first, but he was safe."},{"definition":"Properly secured.","example":"The documents are safe."},{"definition":"(used after a noun, often forming a compound) Not susceptible to a specified source of harm.","example":"dishwasher-safe"},{"definition":"Great, cool, awesome, respectable; a term of approbation, often as interjection."},{"definition":"Lenient, usually describing a teacher that is easy-going."},{"definition":"Reliable; trusty."},{"definition":"Cautious."},{"definition":"Of a programming language, type-safe or more generally offering well-defined behavior despite programming errors."}],"partOfSpeech":"j"}]},{"word":"INSERTION","idx":9962,"count":5084850,"meanings":[{"definitions":[{"definition":"The act of inserting, or something inserted."},{"definition":"The distal end of attachment of a muscle to a bone that will be moved by the muscle."},{"definition":"The addition of a nucleotide to a chromosome by mutation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈsɝʃən/"}]},{"word":"INSTRUMENTATION","idx":9963,"count":5083861,"meanings":[{"definitions":[{"definition":"The act of using or adapting as an instrument; a series or combination of instruments"},{"definition":"The arrangement of a musical composition for performance by a number of different instruments; orchestration; instrumental composition; composition for an orchestra or military band.","example":"They changed the woodwind instrumentation to piccollos and saxophones, and as a result it sounded much more clumsy."},{"definition":"The act or manner of playing upon musical instruments; performance","example":"He had a wonderful instrumentation."},{"definition":"On a vehicle, dashboard gauges monitoring engine functions and performance, along with other essential functions.","example":"The car’s instrumentation included fuel, temperature, voltimeter and oil pressure gauges, along with a speedometer and tachometer."}],"partOfSpeech":"n"}]},{"word":"IDS","idx":9964,"count":5082346,"meanings":[{"definitions":[{"definition":"The unconscious impulsive component of the personality in the Freudian psychoanalytic model."},{"definition":"Identifier."},{"definition":"A freshwater fish of the family Cyprinidae, found across northern Europe and Asia, especially Leuciscus idus."}],"partOfSpeech":"n"}]},{"word":"CONSTRAINT","idx":9967,"count":5080605,"meanings":[{"definitions":[{"definition":"Something that constrains; a restriction."},{"definition":"An irresistible force or compulsion."},{"definition":"The repression of one's feelings."},{"definition":"A condition that a solution to an optimization problem must satisfy."},{"definition":"A linkage or other restriction that maintains database integrity."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"constraint-au","text":"/kənˈstɹeɪnt/"}]},{"word":"GROUNDWATER","idx":9968,"count":5080425,"meanings":[{"definitions":[{"definition":"Water that exists beneath the earth's surface in underground streams and aquifers."}],"partOfSpeech":"n"}]},{"word":"TOUCHED","idx":9969,"count":5080398,"meanings":[{"definitions":[{"definition":"Emotionally moved (by), made to feel emotion (by).","example":"I was touched that he should remember my birthday."},{"definition":"Slightly mentally deficient; touched in the head."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"touched-us","text":"/tʌt͡ʃt/"}]},{"word":"STRENGTHENING","idx":9970,"count":5079049,"meanings":[{"definitions":[{"definition":"To make strong or stronger; to add strength to; to increase the strength of; to fortify.","example":"strengthen a muscle"},{"definition":"To empower; to give moral strength to; to encourage; to enhearten."},{"definition":"To augment; to improve; to intensify."},{"definition":"To grow strong or stronger."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is strengthened."}],"partOfSpeech":"n"}]},{"word":"COLOGNE","idx":9971,"count":5078538,"meanings":[{"definitions":[{"definition":"A type of perfume consisting of 2-5% essential oils, 70-90 % alcohol and water.","example":"You stink of too much cologne."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kəˈloʊn/"},{"text":"/kəˈləʊn/"}]},{"word":"WISHING","idx":9973,"count":5077786,"meanings":[{"definitions":[{"definition":"To desire; to want.","example":"I'll come tomorrow, if you wish it."},{"definition":"To hope (+ object clause with may or in present subjunctive)."},{"definition":"(followed by for) To hope (for a particular outcome)."},{"definition":"(ditransitive) To bestow (a thought or gesture) towards (someone or something).","example":"We wish you a Merry Christmas."},{"definition":"(followed by to and an infinitive) To request or desire to do an activity."},{"definition":"To recommend; to seek confidence or favour on behalf of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of making a wish."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wishing-us","text":"/ˈwɪʃɪŋ/"}]},{"word":"RANGER","idx":9974,"count":5076621,"meanings":[{"definitions":[{"definition":"One who ranges; a rover."},{"definition":"A keeper, guardian, or soldier who ranges over a region (generally of wilderness) to protect the area or enforce the law."},{"definition":"That which separates or arranges; a sieve."},{"definition":"A dog that beats the ground in search of game."},{"definition":"In some modern armies, an elite soldier, similar to special forces but often operating in larger units."},{"definition":"A warrior character, often with wilderness and stealth skill, who typically travels the countryside."},{"definition":"A character skilled in the use of ranged weapons."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To work as a ranger."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ranger-uk","text":"/ˈɹeɪndʒə(ɹ)/"}]},{"word":"SMALLEST","idx":9975,"count":5075157,"meanings":[{"definitions":[{"definition":"Not large or big; insignificant; few in number.","example":"A small group."},{"definition":"Young, as a child.","example":"Remember when the children were small?"},{"definition":"(writing, incomparable) Minuscule or lowercase, referring to written or printed letters."},{"definition":"Envincing little worth or ability; not large-minded; paltry; mean."},{"definition":"Not prolonged in duration; not extended in time; short.","example":"a small space of time"},{"definition":"Slender, gracefully slim."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a small fashion."},{"definition":"In or into small pieces."},{"definition":"To a small extent."},{"definition":"In a low tone; softly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"smallest-us","text":"/ˈsmɔːlɪst/"}]},{"word":"INSULATION","idx":9976,"count":5074667,"meanings":[{"definitions":[{"definition":"The act of insulating; detachment from other objects; isolation."},{"definition":"The state of being insulated; detachment from other objects; isolation."},{"definition":"Any of a variety of materials designed to reduce the flow of heat, either from or into a building."},{"definition":"The act of separating a body from others by nonconductors, so as to prevent the transfer of electricity, heat, or sound"},{"definition":"The state of a body so separated."},{"definition":"A medium in which it is possible to maintain an electrical field with little supply of energy from additional sources."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"insulation-us","text":"/ˌɪnsəˈleɪʃən/"},{"audio":"insulation-uk","text":"/ˌɪnsjʊˈleɪʃən/"}]},{"word":"MARSH","idx":9978,"count":5073104,"meanings":[{"definitions":[{"definition":"An area of low, wet land, often with tall grass."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"marsh-us","text":"/mɑɹʃ/"}]},{"word":"SCARED","idx":9981,"count":5071401,"meanings":[{"definitions":[{"definition":"To frighten, terrify, startle, especially in a minor way.","example":"Did it scare you when I said \"Boo!\"?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Feeling fear; afraid, frightened."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"scared-us","text":"/skɛəɹd/"},{"audio":"scared-uk","text":"/skɛəd/"}]},{"word":"THETA","idx":9982,"count":5070673,"meanings":[{"definitions":[{"definition":"The eighth letter of the Modern Greek alphabet, ninth in Old Greek: Θ, θ."},{"definition":"The measure of an angle."},{"definition":"The sensitivity of the value of a derivative with respect to time; the \"time decay\"."},{"definition":"Designating a level of brain activity as measured by electroencephalography having a frequency of between four and seven cycles per second (associated with drowsiness in adults)."},{"definition":"The voiceless dental fricative represented by θ."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"theta-us","text":"/ˈθeɪtə/"}]},{"word":"INFRINGEMENT","idx":9983,"count":5070438,"meanings":[{"definitions":[{"definition":"A violation or breach, as of a law."},{"definition":"An encroachment on a right, a person, a territory, or a property."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"infringement-us","text":"/ɪnˈfɹɪndʒmənt/"}]},{"word":"BENT","idx":9984,"count":5070333,"meanings":[{"definitions":[{"definition":"To cause (something) to change its shape into a curve, by physical force, chemical action, or any other means.","example":"Don’t bend your knees."},{"definition":"To become curved.","example":"Look at the trees bending in the wind."},{"definition":"To cause to change direction."},{"definition":"To change direction.","example":"The road bends to the right"},{"definition":"To be inclined; to direct itself."},{"definition":"(usually with \"down\") To stoop.","example":"He bent down to pick up the pieces."},{"definition":"To bow in prayer, or in token of submission."},{"definition":"To force to submit.","example":"They bent me to their will."},{"definition":"To submit.","example":"I am bending to my desire to eat junk food."},{"definition":"To apply to a task or purpose.","example":"He bent the company's resources to gaining market share."},{"definition":"To apply oneself to a task or purpose.","example":"He bent to the goal of gaining market share."},{"definition":"To adapt or interpret to for a purpose or beneficiary."},{"definition":"To tie, as in securing a line to a cleat; to shackle a chain to an anchor; make fast.","example":"Bend the sail to the yard."},{"definition":"To smoothly change the pitch of a note.","example":"You should bend the G slightly sharp in the next measure."},{"definition":"To swing the body when rowing."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An inclination or talent.","example":"He had a natural bent for painting."},{"definition":"A predisposition to act or react in a particular way.","example":"His mind was of a technical bent."},{"definition":"The state of being curved, crooked, or inclined from a straight line; flexure; curvity.","example":"the bent of a bow"},{"definition":"A declivity or slope, as of a hill."},{"definition":"Particular direction or tendency; flexion; course."},{"definition":"A transverse frame of a framed structure; a subunit of framing."},{"definition":"Tension; force of acting; energy; impetus."},{"definition":"Any of various stiff or reedy grasses."},{"definition":"A grassy area, grassland."},{"definition":"The old dried stalks of grasses."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(Of something that is usually straight) folded, dented"},{"definition":"Corrupt, dishonest"},{"definition":"Homosexual."},{"definition":"Determined or insistent.","example":"He was bent on going to Texas, but not even he could say why."},{"definition":"(Of a person) leading a life of crime."},{"definition":"Inaccurately aimed","example":"That shot was so bent it left the pitch."},{"definition":"Suffering from the bends"},{"definition":"High from both marijuana and alcohol.","example":"Man, I am so bent right now!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bent-us","text":"/bɛnt/"}]},{"word":"SUBJECTIVE","idx":9986,"count":5068230,"meanings":[{"definitions":[{"definition":"Formed, as in opinions, based upon a person's feelings or intuition, not upon observation or reasoning; coming more from within the observer than from observations of the external environment."},{"definition":"Pertaining to subjects as opposed to objects (A subject is one who perceives or is aware; an object is the thing perceived or the thing that the subject is aware of.)"},{"definition":"Resulting from or pertaining to personal mindsets or experience, arising from perceptive mental conditions within the brain and not necessarily or directly from external stimuli."},{"definition":"Lacking in reality or substance."},{"definition":"As used by Carl Jung, the innate worldview orientation of the introverted personality types."},{"definition":"Experienced by a person mentally and not directly verifiable by others."},{"definition":"(grammar) Describing conjugation of a verb that indicates only the subject (agent), not indicating the object (patient) of the action. (In linguistic descriptions of Tundra Nenets, among others.)"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/səbˈdʒɛktɪv/"}]},{"word":"MONSTERS","idx":9987,"count":5066315,"meanings":[{"definitions":[{"definition":"A terrifying and dangerous creature."},{"definition":"A bizarre or whimsical creature.","example":"The children decided Grover was a cuddly monster."},{"definition":"A cruel or antisocial person, especially a criminal.","example":"Get away from those children, you meatheaded monster!"},{"definition":"A horribly deformed person."},{"definition":"A badly behaved child, a brat.","example":"Sit still, you little monster!"},{"definition":"Something unusually large.","example":"Have you seen those powerlifters on TV? They're monsters."},{"definition":"A prodigy; someone very talented in a specific domain.","example":"That dude playing guitar is a monster."},{"definition":"A non-player character that player(s) fight against in role-playing games."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make into a monster; to categorise as a monster; to demonise."},{"definition":"To behave as a monster to; to terrorise."},{"definition":"To harass."}],"partOfSpeech":"ve"}]},{"word":"ASYLUM","idx":9988,"count":5065723,"meanings":[{"definitions":[{"definition":"A place of safety."},{"definition":"The protection, physical and legal, afforded by such a place."},{"definition":"A place of protection or restraint for one or more classes of the disadvantaged, especially the mentally ill."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"asylum-us","text":"/əˈsaɪləm/"}]},{"word":"LIGHTBOX","idx":9989,"count":5063966,"meanings":[{"definitions":[{"definition":"A box containing a source of light and a white, translucent cover, used to view photographic transparencies."},{"definition":"A box containing fluorescent tubes or LED technology, used to treat people with seasonal affective disorder (SAD) and circadian rhythm disorders."},{"definition":"A kind of pop-up that is overlaid across a web page while the rest of the content is dimmed."},{"definition":"A backbox."},{"definition":"A device used in phreaking that indicates when a telephone line is in use by means of a light."}],"partOfSpeech":"n"}]},{"word":"STAKE","idx":9991,"count":5061965,"meanings":[{"definitions":[{"definition":"A piece of wood or other material, usually long and slender, pointed at one end so as to be easily driven into the ground as a marker or a support or stay.","example":"We have surveyor's stakes at all four corners of this field, to mark exactly its borders."},{"definition":"A piece of wood driven in the ground, placed in the middle of the court, that is used as the finishing point after scoring 12 hoops in croquet."},{"definition":"A stick inserted upright in a lop, eye, or mortise, at the side or end of a cart, flat car, flatbed trailer, or the like, to prevent goods from falling off."},{"definition":"(with definite article) The piece of timber to which a person condemned to death was affixed to be burned.","example":"Thomas Cranmer was burnt at the stake."},{"definition":"A share or interest in a business or a given situation.","example":"The owners let the managers eventually earn a stake in the business."},{"definition":"That which is laid down as a wager; that which is staked or hazarded; a pledge."},{"definition":"A small anvil usually furnished with a tang to enter a hole in a bench top, as used by tinsmiths, blacksmiths, etc., for light work, punching hole in or cutting a work piece, or for specific forming techniques etc."},{"definition":"A territorial division comprising all the Mormons (typically several thousand) in a geographical area."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten, support, defend, or delineate with stakes.","example":"to stake vines or plants"},{"definition":"To pierce or wound with a stake."},{"definition":"To put at risk upon success in competition, or upon a future contingency."},{"definition":"To provide another with money in order to engage in an activity as betting or a business venture.","example":"His family staked him $10,000 to get his business started."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stake-us","text":"/steɪk/"}]},{"word":"COCKTAIL","idx":9992,"count":5061626,"meanings":[{"definitions":[{"definition":"A mixed alcoholic beverage."},{"definition":"A mixture of other substances or things.","example":"Scientists found a cocktail of pollutants in the river downstream from the chemical factory."},{"definition":"A horse, not of pure breed, but having only one eighth or one sixteenth impure blood in its veins."},{"definition":"A mean, half-hearted fellow; a coward."},{"definition":"A species of rove beetle, so called from its habit of elevating the tail."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To adulterate (fuel, etc.) by mixing in other substances."},{"definition":"To treat (a person) to cocktails.","example":"He dined and cocktailed her at the most exclusive bars and restaurants."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Ostentatiously lacking in manners."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cocktail-au","text":"/ˈkɒkteɪl/"}]},{"word":"OUTLETS","idx":9993,"count":5061151,"meanings":[{"definitions":[{"definition":"A vent or similar passage to allow the escape of something."},{"definition":"Something which allows for the release of one's desires."},{"definition":"A river that runs out of a lake."},{"definition":"A shop that sells the products of a particular manufacturer or supplier."},{"definition":"A wall-mounted device such as a socket or receptacle connected to an electrical system at which current is taken to supply utilization equipment or appliances."}],"partOfSpeech":"n"}]},{"word":"VARIETIES","idx":9995,"count":5057493,"meanings":[{"definitions":[{"definition":"The quality of being varied; diversity.","example":"Variety is the spice of life."},{"definition":"A specific variation of something."},{"definition":"A number of different things."},{"definition":"A state of constant change."},{"definition":"A rank in a taxonomic classification, below species and subspecies."},{"definition":"The total number of distinct states of a system."},{"definition":"Logarithm of the base 2 of the total number of distinct states of a system."},{"definition":"A term used for a specific form of a language, neutral to whether that form is a dialect, accent, register, etc. and to its prestige level."},{"definition":"(universal algebra) An equational class; the class of all algebraic structures of a given signature, satisfying a given set of identities."},{"definition":"An algebraic variety."},{"definition":"The kind of theatrical entertainment given in variety shows."},{"definition":"The production of, or performance in, variety shows."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/vəˈɹaɪ.ɪ.tiz/"}]},{"word":"ARBOR","idx":9996,"count":5057261,"meanings":[{"definitions":[{"definition":"A shady sitting place or pergola usually in a park or garden, surrounded by climbing shrubs, vines or other vegetation."},{"definition":"A grove of trees."},{"definition":"An axis or shaft supporting a rotating part on a lathe."},{"definition":"A bar for supporting cutting tools."},{"definition":"A spindle of a wheel."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"arbor-us"}]},{"word":"CONFIGURATIONS","idx":9998,"count":5056310,"meanings":[{"definitions":[{"definition":"Form, as depending on the relative disposition of the parts of a thing's shape; figure; form factor."},{"definition":"Relative position or aspect of the planets; the face of the horoscope, according to the relative positions of the planets at any time."},{"definition":"The way things are arranged or put together in order to achieve a result."},{"definition":"The arrangement of electrons in an atom, molecule, or other physical structure like a crystal."},{"definition":"A finite set of points and lines (and sometimes planes), generally with equal numbers of points per line and equal numbers of lines per point."}],"partOfSpeech":"n"}]},{"word":"POISON","idx":9999,"count":5056083,"meanings":[{"definitions":[{"definition":"A substance that is harmful or lethal to a living organism.","example":"We used a poison to kill the weeds."},{"definition":"Something that harms a person or thing.","example":"Gossip is a malicious poison."},{"definition":"A drink; liquor.","example":"— I'll have a glass of whisky."},{"definition":"Any substance that inhibits catalytic activity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use poison to kill or paralyse (somebody).","example":"The assassin poisoned the king."},{"definition":"To pollute; to cause to become poisonous.","example":"That factory is poisoning the river."},{"definition":"To cause to become much worse.","example":"He poisoned the mood in the room with his non-stop criticism."},{"definition":"To cause (someone) to hate or to have unfair negative opinions.","example":"She's poisoned him against all his old friends."},{"definition":"To inhibit the catalytic activity of."},{"definition":"To place false information into (a cache) as part of an exploit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"poison-us","text":"/ˈpɔɪz(ə)n/"}]},{"word":"ETHNICITY","idx":10000,"count":5055334,"meanings":[{"definitions":[{"definition":"The common characteristics of a group of people, especially regarding ancestry, culture, language or national experiences."},{"definition":"An ethnic group."},{"definition":"(casual) Race; common ancestry."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ethnicity-us","text":"/ɛθˈnɪsɪti/"}]},{"word":"DOMINATED","idx":10001,"count":5055248,"meanings":[{"definitions":[{"definition":"To govern, rule or control by superior authority or power"},{"definition":"To exert an overwhelming guiding influence over something or someone"},{"definition":"To enjoy a commanding position in some field"},{"definition":"To overlook from a height."}],"partOfSpeech":"ve"}]},{"word":"COSTLY","idx":10002,"count":5054951,"meanings":[{"definitions":[{"definition":"Of high cost; expensive.","example":"a costly activity"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"costly-us"},{"text":"/ˈkɒst.li/"}]},{"word":"DERIVATIVES","idx":10003,"count":5051332,"meanings":[{"definitions":[{"definition":"Something derived."},{"definition":"A word that derives from another one."},{"definition":"A financial instrument whose value depends on the valuation of an underlying asset; such as a warrant, an option etc."},{"definition":"A chemical derived from another."},{"definition":"The derived function of a function (the slope at a certain point on some curve f(x))"},{"definition":"The value of this function for a given value of its independent variable."}],"partOfSpeech":"n"}]},{"word":"PREVENTS","idx":10004,"count":5051148,"meanings":[{"definitions":[{"definition":"To stop (an outcome); to keep from (doing something).","example":"I brush my teeth regularly to prevent them from turning yellow."},{"definition":"To take preventative measures."},{"definition":"To come before; to precede."},{"definition":"To outdo, surpass."},{"definition":"To be beforehand with; to anticipate."}],"partOfSpeech":"ve"}]},{"word":"STITCH","idx":10005,"count":5049524,"meanings":[{"definitions":[{"definition":"A single pass of a needle in sewing; the loop or turn of the thread thus made."},{"definition":"An arrangement of stitches in sewing, or method of stitching in some particular way or style.","example":"cross stitch"},{"definition":"An intense stabbing pain under the lower edge of the ribcage, brought on by exercise."},{"definition":"A single turn of the thread round a needle in knitting; a link, or loop, of yarn","example":"drop a stitch"},{"definition":"An arrangement of stitches in knitting, or method of knitting in some particular way or style."},{"definition":"A space of work taken up, or gone over, in a single pass of the needle."},{"definition":"A fastening, as of thread or wire, through the back of a book to connect the pages."},{"definition":"(by extension) Any space passed over; distance."},{"definition":"A local sharp pain; an acute pain, like the piercing of a needle.","example":"a stitch in the side"},{"definition":"A contortion, or twist."},{"definition":"Any least part of a fabric or dress.","example":"She didn't have a stitch on."},{"definition":"A furrow."},{"definition":"The space between two double furrows."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form stitches in; especially, to sew in such a manner as to show on the surface a continuous line of stitches.","example":"to stitch a shirt bosom."},{"definition":"To sew, or unite or attach by stitches.","example":"to stitch printed sheets in making a book or a pamphlet."},{"definition":"To practice/practise stitching or needlework."},{"definition":"To form land into ridges."},{"definition":"To weld together through a series of connecting or overlapping spot welds."},{"definition":"(graphics) To combine two or more photographs of the same scene into a single image.","example":"I can use this software to stitch together a panorama."},{"definition":"(more generally) To include, combine, or unite into a single whole."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stitch-us","text":"/stɪt͡ʃ/"}]},{"word":"RIFLE","idx":10007,"count":5047417,"meanings":[{"definitions":[{"definition":"A shouldered firearm with a long, rifled barrel to improve range and accuracy."},{"definition":"(usually plural) A rifleman."},{"definition":"An artillery piece with a rifled barrel."},{"definition":"A strip of wood covered with emery or a similar material, used for sharpening scythes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To quickly search through many items (such as papers, the contents of a drawer, a pile of clothing). (See also rifflehttp//verbmall.blogspot.com/2008/05/riffle-or-rifle.html)","example":"She made a mess when she rifled through the stack of papers, looking for the title document."},{"definition":"To commit robbery or theft."},{"definition":"To search with intent to steal; to ransack, pillage or plunder."},{"definition":"To strip of goods; to rob; to pillage."},{"definition":"To seize and bear away by force; to snatch away; to carry off."},{"definition":"To add a spiral groove to a gun bore to make a fired bullet spin in flight in order to improve range and accuracy."},{"definition":"To cause (a projectile, as a rifle bullet) to travel in a flat ballistic trajectory."},{"definition":"To move in a flat ballistic trajectory (as a rifle bullet)."},{"definition":"To dispose of in a raffle."},{"definition":"To engage in a raffle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rifle-us","text":"/ˈɹaɪfəl/"}]},{"word":"SEVERITY","idx":10008,"count":5047284,"meanings":[{"definitions":[{"definition":"The state of being severe."},{"definition":"The degree of something undesirable; badness or seriousness.","example":"The severity of the offence merits a long prison sentence."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"severity-us","text":"/səˈvɛɹɨti/"}]},{"word":"NOTABLE","idx":10010,"count":5044802,"meanings":[{"definitions":[{"definition":"A person or thing of distinction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Worthy of note; remarkable; memorable; noted or distinguished."},{"definition":"Easily noted (without connotations of value); clearly noticeable, conspicuous."},{"definition":"That can be observed; perceptible."},{"definition":"Industrious, energetic; (specifically) (usually of a woman) capable, efficient in household management."},{"definition":"Useful; profitable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"notable-us","text":"/ˈnoʊdəbəl/"}]},{"word":"WARFARE","idx":10011,"count":5044170,"meanings":[{"definitions":[{"definition":"The waging of war or armed conflict against an enemy."},{"definition":"Military operations of some particular kind e.g. guerrilla warfare."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lead a military life; to carry on continual wars."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"warfare-us","text":"/ˈwɔɹfɛɹ/"}]},{"word":"RETAILING","idx":10012,"count":5043730,"meanings":[{"definitions":[{"definition":"To sell at retail, or in small quantities directly to customers."},{"definition":"To sell secondhand, or in broken parts."},{"definition":"To repeat or circulate (news or rumours) to others."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The business of selling directly to the consumer; retail."}],"partOfSpeech":"n"}]},{"word":"JUDICIARY","idx":10013,"count":5043671,"meanings":[{"definitions":[{"definition":"The collective body of judges, justices, etc."},{"definition":"The court system, inclusive of clerical staff, etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdʒuːˈdɪʃɪəɹi/"},{"text":"/ˌdʒuːˈdɪʃəɹi/"}]},{"word":"EMBROIDERY","idx":10014,"count":5042831,"meanings":[{"definitions":[{"definition":"The ornamentation of fabric using needlework."},{"definition":"A piece of embroidered fabric."},{"definition":"The elaboration of an account etc. with details, especially when fictitious."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪmˈbɹɔɪdəɹi/"}]},{"word":"MAMA","idx":10015,"count":5042818,"meanings":[{"definitions":[{"definition":"(hypocoristic, usually childish) Mother, female parent."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɑmə/"},{"text":"/məˈmɑː/"}]},{"word":"INLAND","idx":10016,"count":5042715,"meanings":[{"definitions":[{"definition":"The interior part of a country."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Within the land; relatively remote from the ocean or from open water; interior","example":"an inland town"},{"definition":"Limited to the land, or to inland routes; within the seashore boundary; not passing on, or over, the sea","example":"inland commerce"},{"definition":"Confined to a country or state; domestic; not foreign."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Into, or towards, the interior of the land, away from the coast."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"inland-us","text":"/ˈɪnlənd/"}]},{"word":"NONFICTION","idx":10018,"count":5039708,"meanings":[{"definitions":[{"definition":"Written works intended to give facts, or true accounts of real things and events. Often used attributively.","example":"Encyclopedias, how-to manuals and biographies are all considered nonfiction and so are kept in the nonfiction section."}],"partOfSpeech":"n"}]},{"word":"HOMEOWNERS","idx":10019,"count":5038014,"meanings":[{"definitions":[{"definition":"Someone who owns a house"},{"definition":"Someone who does not have title to a house, but has possession and is paying for it by instalments"}],"partOfSpeech":"n"}]},{"word":"RACISM","idx":10020,"count":5035527,"meanings":[{"definitions":[{"definition":"Belief that there are distinct human races with inherent differences which determine their abilities, and generally that some are superior and others inferior."},{"definition":"The policies, practices, or systems (e.g. government or political) promoting this belief or promoting the dominance of one or more races over others.","example":"Martin Luther King spoke out against racism."},{"definition":"Prejudice or discrimination based upon race or ethnicity; an action of such discrimination."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"racism-us","text":"/ˈɹeɪsɪzm̩/"}]},{"word":"INTERPRET","idx":10022,"count":5034981,"meanings":[{"definitions":[{"definition":"To explain or tell the meaning of; to translate orally into intelligible or familiar language or terms. applied especially to language, but also to dreams, signs, conduct, mysteries, etc.","example":"to interpret an Indian speech"},{"definition":"To apprehend and represent by means of art; to show by illustrative representation","example":"The actor interpreted the character of Hamlet with great skill."},{"definition":"To act as an interpreter.","example":"He interpreted at the meeting between the Chinese and French associates."},{"definition":"To analyse or execute (a program) by reading the instructions as they are encountered, rather than compiling in advance."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"interpret-us","text":"/ɪnˈtɝ.pɹɪt/"}]},{"word":"ACCORD","idx":10023,"count":5034197,"meanings":[{"definitions":[{"definition":"Agreement or concurrence of opinion, will, or action."},{"definition":"A harmony in sound, pitch and tone; concord."},{"definition":"Agreement or harmony of things in general.","example":"the accord of light and shade in painting"},{"definition":"An agreement between parties in controversy, by which satisfaction for an injury is stipulated, and which, when executed, prevents a lawsuit."},{"definition":"An international agreement.","example":"The Geneva Accord of 1954 ended the French-Indochinese War."},{"definition":"Assent"},{"definition":"Voluntary or spontaneous impulse to act.","example":"Nobody told me to do it. I did it of my own accord."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make to agree or correspond; to suit one thing to another; to adjust."},{"definition":"To bring (people) to an agreement; to reconcile, settle, adjust or harmonize."},{"definition":"To agree or correspond; to be in harmony; to be concordant."},{"definition":"To agree in pitch and tone."},{"definition":"To grant as suitable or proper; to concede or award."},{"definition":"To give consent."},{"definition":"To arrive at an agreement."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"accord-us","text":"/ə.ˈkɔɹd/"}]},{"word":"MODEST","idx":10025,"count":5033760,"meanings":[{"definitions":[{"definition":"Not bragging or boasting about oneself or one's achievements; unpretentious, humble."},{"definition":"Small, moderate in size.","example":"He earns a modest amount of money."},{"definition":"Pure and delicate from a sense of propriety.","example":"modest thoughts or language"},{"definition":"(especially of behaviour or clothing) Intending to avoid the encouraging of sexual attraction in others."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"modest-us","text":"/ˈmɑdəst/"}]},{"word":"GAMERS","idx":10026,"count":5033404,"meanings":[{"definitions":[{"definition":"A person who plays any kind of game."},{"definition":"A person whose hobby is video games."},{"definition":"A person who games the system."},{"definition":"(obsolete) A gambler"}],"partOfSpeech":"n"}]},{"word":"LICENSEE","idx":10028,"count":5032531,"meanings":[{"definitions":[{"definition":"A person to whom a license is granted"},{"definition":"A publican"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌlaɪsənˈsiː/"}]},{"word":"COUNTRYSIDE","idx":10029,"count":5032517,"meanings":[{"definitions":[{"definition":"A rural area, or the rural part of a larger area.","example":"We live in the Swedish countryside."},{"definition":"A rural landscape."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"countryside-uk","text":"/ˈkʌn.tɹiˌsaɪd/"}]},{"word":"SORTING","idx":10030,"count":5032442,"meanings":[{"definitions":[{"definition":"To separate items into different categories according to certain criteria that determine their sorts.","example":"Sort the letters in those bags into a separate pile for each language."},{"definition":"To arrange into some sequence, usually numerically, alphabetically or chronologically.","example":"Sort those bells into a row in ascending sequence of pitch."},{"definition":"To conjoin; to put together in distribution; to class."},{"definition":"To conform; to adapt; to accommodate."},{"definition":"To choose from a number; to select; to cull."},{"definition":"To join or associate with others, especially with others of the same kind or species; to agree."},{"definition":"To suit; to fit; to be in accord; to harmonize."},{"definition":"To fix (a problem) or handle (a task)."},{"definition":"To attack physically.","example":"If he comes nosing around here again I'll sort him!"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Ordering."},{"definition":"Categorizing."}],"partOfSpeech":"n"}]},{"word":"LIAISON","idx":10031,"count":5032366,"meanings":[{"definitions":[{"definition":"Communication between two parties or groups."},{"definition":"Co-operation, working together."},{"definition":"A relayer of information between two forces in an army or during war."},{"definition":"A tryst, romantic meeting."},{"definition":"An illicit sexual relationship or affair."},{"definition":"The phonological fusion of two consecutive words and the manner in which this occurs, for example intrusion, consonant-vowel linking, etc. In the context of some languages, such as French, liaison can refer specifically to a normally silent final consonant, being pronounced when the next word begins with a vowel, and can often also include the intrusion of a \"t\" in certain fixed chunks of language such as the question form \"pense-t-il\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To liaise."}],"partOfSpeech":"ve"}]},{"word":"BISEXUAL","idx":10032,"count":5030369,"meanings":[{"definitions":[{"definition":"A person who is bisexual."},{"definition":"A plant or fungus, or part thereof, which is bisexual."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of humans or other animals) Sexually attracted to both men and women (by a narrow definition) or to people of multiple or any genders (by a broad definition; compare pansexual)."},{"definition":"Having both male and female parts or functions."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/baɪˈsɛk.ʃu.əl/"}]},{"word":"REL","idx":10033,"count":5029379,"meanings":[{"definitions":[{"definition":"Abbreviation of relative to."}],"partOfSpeech":"pr"}]},{"word":"UNUSED","idx":10034,"count":5028967,"meanings":[{"definitions":[{"definition":"Not used.","example":"I have two unused vouchers for a free meal."},{"definition":"Not accustomed (to), unfamiliar with.","example":"I am unused to the dark nights of the countryside."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unused-uk","text":"/ʌnˈjuːst/"}]},{"word":"BULBS","idx":10035,"count":5028440,"meanings":[{"definitions":[{"definition":"Any solid object rounded at one end and tapering on the other, possibly attached to a larger object at the tapered end.","example":"the bulb of the aorta"},{"definition":"A light bulb."},{"definition":"The bulb-shaped root portion of a plant such as a tulip, from which the rest of the plant may be regrown."},{"definition":"A bulbous protuberance at the forefoot of certain vessels to reduce turbulence."},{"definition":"The medulla oblongata."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take the shape of a bulb; to swell."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bʌlbz/"}]},{"word":"CONSUMING","idx":10037,"count":5023310,"meanings":[{"definitions":[{"definition":"To use up.","example":"The power plant consumes 30 tons of coal per hour."},{"definition":"To eat.","example":"Baby birds consume their own weight in food each day."},{"definition":"To completely occupy the thoughts or attention of.","example":"Desire consumed him."},{"definition":"To destroy completely.","example":"The building was consumed by fire."},{"definition":"To waste away slowly."},{"definition":"To trade money for good or services as an individual.","example":"If you consume this product while in Japan, you may be subject to consumption tax."},{"definition":"To absorb information, especially through the mass media.","example":"The Internet has changed the way we consume news."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Consumption; the process by which something is consumed"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Holding one's attention or interest.","example":"a consuming passion"}],"partOfSpeech":"j"}]},{"word":"INSTALLER","idx":10038,"count":5023150,"meanings":[{"definitions":[{"definition":"One who installs."},{"definition":"A program that installs software and prepares it for use."}],"partOfSpeech":"n"}]},{"word":"TOURISTS","idx":10039,"count":5022897,"meanings":[{"definitions":[{"definition":"Someone who travels for pleasure rather than for business."},{"definition":"One who visits a place or attends a social event out of curiosity, wanting to watch without commitment or involvement."},{"definition":"A member of the visiting team in a match."}],"partOfSpeech":"n"}]},{"word":"SANDALS","idx":10040,"count":5021707,"meanings":[{"definitions":[{"definition":"A type of open shoe made up of straps or bands holding a sole to the foot"},{"definition":"A long narrow boat used on the Barbary coast."}],"partOfSpeech":"n"}]},{"word":"BESTSELLING","idx":10042,"count":5019783,"meanings":[{"definitions":[{"definition":"Highly popular with consumers purchasing goods within a specific class."}],"partOfSpeech":"j"}]},{"word":"INSURE","idx":10043,"count":5018519,"meanings":[{"definitions":[{"definition":"To make a pledge to (someone); to promise, guarantee (someone of something); to assure."},{"definition":"To make sure or certain of something (usually some future event or condition).","example":"I use an alarm clock to ensure that I get up on time."},{"definition":"To provide for compensation if some specified risk occurs. Often agreed by policy (contract) to offer financial compensation in case of an accident, theft or other undesirable event.","example":"I'm not insured against burglary."},{"definition":"To deal in such contracts; subscribe to a policy of insurance"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"insure-us","text":"/ɪnˈʃʊɚ/"}]},{"word":"PACKAGED","idx":10044,"count":5018380,"meanings":[{"definitions":[{"definition":"To pack or bundle something."},{"definition":"To travel on a package holiday."},{"definition":"To prepare (a book, a television series, etc.), including all stages from research to production, in order to sell the result to a publisher or broadcaster."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been placed in a package."}],"partOfSpeech":"j"}]},{"word":"BEHAVIORS","idx":10045,"count":5017604,"meanings":[{"definitions":[{"definition":"Human conduct relative to social norms."},{"definition":"The way a living creature behaves or acts generally."},{"definition":"A state of probation about one's conduct.","example":"He was on his best behavior when her family visited."},{"definition":"An instance of the way a living creature behaves."},{"definition":"Observable response produced by an organism."},{"definition":"The way a device or system operates."}],"partOfSpeech":"n"}]},{"word":"CLARIFY","idx":10046,"count":5016927,"meanings":[{"definitions":[{"definition":"(of liquids, such as wine or syrup) To make clear or bright by freeing from feculent matter"},{"definition":"To make clear or easily understood; to explain in order to remove doubt or obscurity"},{"definition":"To grow or become clear or transparent; to become free from feculent impurities, as wine or other liquid under clarification.","example":"Leave the wine for 24 hours and it will clarify."},{"definition":"To grow clear or bright; to clear up."},{"definition":"To glorify."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"clarify-uk","text":"/ˈklæɹɪfaɪ/"}]},{"word":"SECONDED","idx":10047,"count":5015377,"meanings":[{"definitions":[{"definition":"To agree as a second person to (a proposal), usually to reach a necessary quorum of two. (See under #Etymology 3 for translations.)","example":"I second the motion."},{"definition":"To follow in the next place; to succeed."},{"definition":"To climb after a lead climber."},{"definition":"To transfer temporarily to alternative employment.","example":"The army officer was seconded while he held civil office."},{"definition":"To assist or support; to back."},{"definition":"To agree as a second person to (a proposal), usually to reach a necessary quorum of two. (This may come from the English adjective above.)","example":"I second the motion."},{"definition":"To accompany by singing as the second performer."}],"partOfSpeech":"ve"}]},{"word":"ACTIVATE","idx":10048,"count":5014202,"meanings":[{"definitions":[{"definition":"To encourage development or induce increased activity; to stimulate."},{"definition":"To put a device, mechanism (alarm etc.) or system into action or motion; to trigger, to actuate, to set off, to enable."},{"definition":"To render more reactive; excite."},{"definition":"To render a molecule reactive, active, or effective in performing its function."},{"definition":"To render a substance radioactive."},{"definition":"To hasten a chemical reaction, especially by heating."},{"definition":"To remove the limitations of demoware by providing a license; to unlock."},{"definition":"To aerate in order to aid decomposition of organic matter."},{"definition":"To organize or create a military unit or station."},{"definition":"To bring a player back after an injury."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"activate-us","text":"/ˈæktɪˌveɪt/"}]},{"word":"WAIST","idx":10049,"count":5013500,"meanings":[{"definitions":[{"definition":"The part of the body between the pelvis and the stomach."},{"definition":"A part of a piece of clothing that covers the waist."},{"definition":"The narrow connection between the thorax and abdomen in certain insects (e.g., bees, ants and wasps)."},{"definition":"The middle portion of the hull of a ship or the fuselage of an aircraft."},{"definition":"That part of the upper deck of a ship between the quarterdeck and the forecastle."},{"definition":"The middle part of anything."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/weɪst/"}]},{"word":"ATTRIBUTED","idx":10050,"count":5013200,"meanings":[{"definitions":[{"definition":"To ascribe (something) to a given cause, reason etc."},{"definition":"To associate ownership or authorship of (something) to someone.","example":"This poem is attributed to Browning."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Decorated with an attribute"}],"partOfSpeech":"j"}]},{"word":"FATIGUE","idx":10054,"count":5010911,"meanings":[{"definitions":[{"definition":"A weariness caused by exertion; exhaustion."},{"definition":"(often in the plural) A menial task or tasks, especially in the military."},{"definition":"Material failure, such as cracking or separation, caused by stress on the material."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tire or make weary by physical or mental exertion"},{"definition":"To wilt a salad by dressing or tossing it"},{"definition":"To lose so much strength or energy that one becomes tired, weary, feeble or exhausted"},{"definition":"(of a material specimen) to undergo the process of fatigue; to fail as a result of fatigue."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fatigue-us"},{"text":"/fəˈtiːɡ/"}]},{"word":"OWL","idx":10055,"count":5010726,"meanings":[{"definitions":[{"definition":"Any of various birds of prey of the order Strigiformes that are primarily nocturnal and have forward-looking, binocular vision, limited eye movement, and good hearing."},{"definition":"(by extension) A person seen as having owl-like characteristics, especially appearing wise or serious, or being nocturnally active."},{"definition":"The owl pigeon."},{"definition":"A politician with moderate views that are neither hawkish nor dovish."},{"definition":"Any of various nymphalid butterflies having large eyespots on the wings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To smuggle contraband goods."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"owl-us","text":"/aʊl/"}]},{"word":"PATRIOT","idx":10056,"count":5010718,"meanings":[{"definitions":[{"definition":"A person who loves and zealously supports and defends their country."},{"definition":"A fellow countryman, a compatriot."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpeɪ.t(ʃ)ɹi.ət/"},{"text":"/ˈpeɪ.tɹi.ət/"}]},{"word":"SEWER","idx":10057,"count":5008805,"meanings":[{"definitions":[{"definition":"A pipe or system of pipes used to remove human waste and to provide drainage."},{"definition":"A servant attending at a meal who is responsible for seating arrangements, serving dishes, etc."},{"definition":"One who sews."},{"definition":"A small tortricid moth, the larva of which sews together the edges of a leaf using silk.","example":"the apple-leaf sewer, Ancylis nubeculana"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide (a place) with a system of sewers."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sewer-1-us","text":"/ˈsuɚ/"},{"audio":"sewer-1-uk","text":"/ˈs(j)uːə/"}]},{"word":"CRYSTALS","idx":10058,"count":5008586,"meanings":[{"definitions":[{"definition":"A solid composed of an array of atoms or molecules possessing long-range order and arranged in a pattern which is periodic in three dimensions."},{"definition":"A piece of glimmering, shining mineral resembling ice or glass."},{"definition":"A fine type of glassware, or the material used to make it."},{"definition":"Crystal meth: methamphetamine hydrochloride."},{"definition":"The glass over the dial of a watch case."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹɪstəlz/"}]},{"word":"FORTHCOMING","idx":10061,"count":5007069,"meanings":[{"definitions":[{"definition":"An act of coming forth."},{"definition":"Something that is yet to come."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Approaching or about to take place.","example":"I shall vote in the forthcoming election."},{"definition":"Available when needed; in place, ready.","example":"The money was not forthcoming."},{"definition":"Willing to co-operate or provide information; candid, frank, responsive.","example":"Once I explained why I needed to know, she was really forthcoming."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To come forth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"forthcoming-us","text":"/fɔɹθˈkʌmɪŋ/"}]},{"word":"NUM","idx":10063,"count":5005434,"meanings":[{"definitions":[{"definition":"An abstract entity used to describe quantity.","example":"Zero, one, −1, 2.5, and pi are all numbers."},{"definition":"A numeral: a symbol for a non-negative integer.","example":"The number 8 is usually made with a single stroke."},{"definition":"An element of one of several sets: natural numbers, integers, rational numbers, real numbers, complex numbers, and sometimes extensions such as hypercomplex numbers, etc.","example":"The equation e^{i\\pi}+1=0 includes the most important numbers: 1, 0, \\pi, i, and e."},{"definition":"(Followed by a numeral; used attributively) Indicating the position of something in a list or sequence. Abbreviations: No or No., no or no. (in each case, sometimes written with a superscript \"o\", like Nº or №). The symbol \"#\" is also used in this manner.","example":"Horse number 5 won the race."},{"definition":"Quantity.","example":"Any number of people can be reading from a given repository at a time."},{"definition":"A sequence of digits and letters used to register people, automobiles, and various other items.","example":"Her passport number is C01X864TN."},{"definition":"A telephone number."},{"definition":"(grammar) Of a word or phrase, the state of being singular, dual or plural, shown by inflection.","example":"Adjectives and nouns should agree in gender, number, and case."},{"definition":"(in the plural) Poetic metres; verses, rhymes."},{"definition":"A performance; especially, a single song or song and dance routine within a larger show.","example":"For his second number, he sang \"The Moon Shines Bright\"."},{"definition":"A person."},{"definition":"An item of clothing, particularly a stylish one."},{"definition":"A marijuana cigarette, or joint; also, a quantity of marijuana bought form a dealer."},{"definition":"An issue of a periodical publication.","example":"the latest number of a magazine"},{"definition":"A large amount, in contrast to a smaller amount; numerical preponderance."},{"definition":"A symbol that is not a word and represents a number, such as the Arabic numerals 1, 2, 3 and the Roman numerals I, V, X, L."},{"definition":"A word representing a number."},{"definition":"A card whose rank is a number (usually including the ace as 1).","example":"Jacks, queens, and kings are not numerals."}],"partOfSpeech":"n"}]},{"word":"TREATS","idx":10064,"count":5005269,"meanings":[{"definitions":[{"definition":"An entertainment, outing, food, drink, or other indulgence provided by someone for the enjoyment of others.","example":"Here are some healthy Halloween treats for ghouls and witches of all ages."},{"definition":"An unexpected gift, event etc., which provides great pleasure.","example":"It was such a treat to see her back in action on the London stage."},{"definition":"A snack food item designed to be given to pets.","example":"I lured the cat into her carrier by throwing a couple of treats in there."},{"definition":"A parley or discussion of terms; a negotiation."},{"definition":"An entreaty."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To negotiate, discuss terms, bargain (for or with)."},{"definition":"To discourse; to handle a subject in writing or speaking; to conduct a discussion.","example":"Cicero's writing treats mainly of old age and personal duty."},{"definition":"To discourse on; to represent or deal with in a particular way, in writing or speaking.","example":"The article treated feminism as a quintessentially modern movement."},{"definition":"To entreat or beseech (someone).","example":"Only let my family live, I treat thee."},{"definition":"To handle, deal with or behave towards in a specific way.","example":"She was tempted to treat the whole affair as a joke."},{"definition":"To entertain with food or drink, especially at one's own expense; to show hospitality to; to pay for as celebration or reward.","example":"I treated my son to some popcorn in the interval."},{"definition":"To commit the offence of providing food, drink, entertainment or provision to corruptly influence a voter."},{"definition":"To care for medicinally or surgically; to apply medical care to.","example":"They treated me for malaria."},{"definition":"To subject to a chemical or other action; to act upon with a specific scientific result in mind.","example":"He treated the substance with sulphuric acid."},{"definition":"To provide something special and pleasant."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"treats-us"}]},{"word":"DETENTION","idx":10066,"count":5003311,"meanings":[{"definitions":[{"definition":"The act of detaining or the state of being detained."},{"definition":"A temporary state of custody or confinement, especially of a prisoner awaiting trial, or of a student being punished."},{"definition":"The bare physical control without the mental element of intention required for possession."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈtɛnʃən/"}]},{"word":"EXCEEDS","idx":10069,"count":4999388,"meanings":[{"definitions":[{"definition":"To be larger, greater than (something).","example":"The company's 2005 revenue exceeds that of 2004."},{"definition":"To be better than (something).","example":"The quality of her essay has exceeded my expectations."},{"definition":"To go beyond (some limit); to surpass; to be longer than.","example":"Your password cannot exceed eight characters."},{"definition":"To predominate."},{"definition":"To go too far; to be excessive."}],"partOfSpeech":"ve"}]},{"word":"COMPLEMENTARY","idx":10070,"count":4998758,"meanings":[{"definitions":[{"definition":"A complementary colour."},{"definition":"One skilled in compliments."},{"definition":"An angle which adds with another to equal 90 degrees."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Acting as a complement; making up a whole with something else."},{"definition":"Of the specific pairings of the bases in DNA and RNA."},{"definition":"Pertaining to pairs of properties in quantum mechanics that are inversely related to each other, such as speed and position, or energy and time. (See also Heisenberg uncertainty principle.)"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌkɑmplɪ̈ˈmɛnt(ə)ɹi/"},{"text":"/ˌkɒmplɪ̈ˈmɛnt(ə)ɹi/"}]},{"word":"GALLON","idx":10072,"count":4998083,"meanings":[{"definitions":[{"definition":"A unit of volume, equivalent to eight pints"},{"definition":"Exactly 4.54609 liters; an imperial gallon"},{"definition":"231 cubic inches or approximately 3.785 liters for liquids (a \"U.S. liquid gallon\")"},{"definition":"One-eighth of a U.S. bushel or approximately 4.405 liters for dry goods (a \"U.S. dry gallon\")."},{"definition":"(in the plural) A large quantity (of any liquid).","example":"The pipe burst and gallons of water flooded into the kitchen."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gallon-us","text":"/ˈɡælən/"}]},{"word":"COIL","idx":10073,"count":4997563,"meanings":[{"definitions":[{"definition":"Something wound in the form of a helix or spiral.","example":"the sinuous coils of a snake"},{"definition":"Any intrauterine device (Abbreviation: IUD)—the first IUDs were coil-shaped."},{"definition":"A coil of electrically conductive wire through which electricity can flow."},{"definition":"Entanglement; perplexity."},{"definition":"A noise, tumult, bustle, or turmoil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wind or reel e.g. a wire or rope into regular rings, often around a centerpiece.","example":"A simple transformer can be made by coiling two pieces of insulated copper wire around an iron heart."},{"definition":"To wind into loops (roughly) around a common center.","example":"The sailor coiled the free end of the hawser on the pier."},{"definition":"To wind cylindrically or spirally.","example":"The snake coiled itself before springing."},{"definition":"To encircle and hold with, or as if with, coils."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"coil-us","text":"/kɔɪl/"}]},{"word":"BATTLES","idx":10074,"count":4997226,"meanings":[{"definitions":[{"definition":"A contest, a struggle.","example":"the battle of life"},{"definition":"A general action, fight, or encounter, in which all the divisions of an army are or may be engaged; a combat, an engagement."},{"definition":"A division of an army; a battalion."},{"definition":"The main body of an army, as distinct from the vanguard and rear; the battalia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To join in battle; to contend in fight","example":"Scientists always battle over theories."},{"definition":"To fight or struggle; to enter into a battle with.","example":"She has been battling cancer for years."},{"definition":"To nourish; feed."},{"definition":"To render (for example soil) fertile or fruitful"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbætl̩z/"}]},{"word":"TRADERS","idx":10076,"count":4995823,"meanings":[{"definitions":[{"definition":"One who earns a living by trading goods or securities."}],"partOfSpeech":"n"}]},{"word":"BITTER","idx":10078,"count":4995265,"meanings":[{"definitions":[{"definition":"(usually in the plural bitters) A liquid or powder, made from bitter herbs, used in mixed drinks or as a tonic."},{"definition":"A type of beer heavily flavored with hops."},{"definition":"A turn of a cable about the bitts."},{"definition":"(in combination) A hardware system whose architecture is based around units of the specified number of bits (binary digits)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make bitter."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having an acrid taste (usually from a basic substance).","example":"The coffee tasted bitter."},{"definition":"Harsh, piercing or stinging."},{"definition":"Hateful or hostile.","example":"They're bitter enemies."},{"definition":"Cynical and resentful.","example":"I've been bitter ever since that defeat."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bitter-us","text":"/ˈbɪtəɹ/"}]},{"word":"MEMORANDUM","idx":10079,"count":4994542,"meanings":[{"definitions":[{"definition":"A short note serving as a reminder."},{"definition":"A written business communication."},{"definition":"A brief diplomatic communication."},{"definition":"A page in an annual publication honoring the memory of a person who died during the past year."}],"partOfSpeech":"n"}]},{"word":"BURNED","idx":10080,"count":4993504,"meanings":[{"definitions":[{"definition":"To cause to be consumed by fire.","example":"He burned his manuscript in the fireplace."},{"definition":"To be consumed by fire, or in flames.","example":"He watched the house burn."},{"definition":"To overheat so as to make unusable.","example":"He burned the toast. The blacksmith burned the steel."},{"definition":"To become overheated to the point of being unusable.","example":"The grill was too hot and the steak burned."},{"definition":"To make or produce by the application of fire or burning heat.","example":"to burn a hole;  to burn letters into a block"},{"definition":"To injure (a person or animal) with heat or chemicals that produce similar damage.","example":"She burned the child with an iron, and was jailed for ten years."},{"definition":"To cauterize."},{"definition":"To sunburn.","example":"She forgot to put on sunscreen and burned."},{"definition":"To consume, injure, or change the condition of, as if by action of fire or heat; to affect as fire or heat does.","example":"to burn the mouth with pepper"},{"definition":"To be hot, e.g. due to embarrassment.","example":"The child's forehead was burning with fever.  Her cheeks burned with shame."},{"definition":"To cause to combine with oxygen or other active agent, with evolution of heat; to consume; to oxidize.","example":"A human being burns a certain amount of carbon at each respiration.  to burn iron in oxygen"},{"definition":"To combine energetically, with evolution of heat.","example":"Copper burns in chlorine."},{"definition":"To write data to a permanent storage medium like a compact disc or a ROM chip.","example":"We’ll burn this program onto an EEPROM one hour before the demo begins."},{"definition":"To betray.","example":"The informant burned him."},{"definition":"To insult or defeat.","example":"I just burned you again."},{"definition":"To waste (time); to waste money or other resources.","example":"The company has burned more than a million dollars a month this year."},{"definition":"In certain games, to approach near to a concealed object which is sought.","example":"You're cold... warm... hot... you're burning!"},{"definition":"To accidentally touch a moving stone."},{"definition":"In pontoon, to swap a pair of cards for another pair, or to deal a dead card."},{"definition":"To increase the exposure for certain areas of a print in order to make them lighter (compare dodge)."},{"definition":"(of an element) To be converted to another element in a nuclear fusion reaction, especially in a star"},{"definition":"To discard."},{"definition":"To shoot someone with a firearm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"burned-us","text":"/ˈbɜː(ɹ)nd/"}]},{"word":"CARDINAL","idx":10081,"count":4993081,"meanings":[{"definitions":[{"definition":"One of the officials appointed by the pope in the Roman Catholic Church, ranking only below the pope and the patriarchs, constituting the special college which elects the pope. (See Wikipedia article on Catholic cardinals.)"},{"definition":"Any of a genus of songbirds of the finch family, Cardinalis."},{"definition":"Any of various related passerine birds of the family Cardinalidae (See Wikipedia article on cardinals) and other similar birds that were once considered to be related."},{"definition":"(color) A deep red color, somewhat less vivid than scarlet, the traditional colour of a Catholic cardinal's cassock. (same as cardinal red)"},{"definition":"Short for cardinal number, a number indicating quantity, or the size of a set (e.g., zero, one, two, three). (See Wikipedia article on Cardinal number.)"},{"definition":"(grammar) Short for cardinal numeral, a word used to represent a cardinal number."},{"definition":"Short for cardinal flower (Lobelia cardinalis), a flowering plant."},{"definition":"Short for cardinal tetra (Paracheirodon axelrodi), a freshwater fish."},{"definition":"(bow) A woman's short cloak with a hood, originally made of scarlet cloth."},{"definition":"Mulled red wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of fundamental importance; crucial, pivotal.","example":"a cardinal rule"},{"definition":"Of or relating to the cardinal directions (north, south, east and west).","example":"a cardinal mark"},{"definition":"Describing a \"natural\" number used to indicate quantity (e.g., zero, one, two, three), as opposed to an ordinal number indicating relative position."},{"definition":"Having a bright red color (from the color of a Catholic cardinal's cassock)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cardinal-us","text":"/ˈkɑɹdnəl/"}]},{"word":"DRAGONS","idx":10082,"count":4992842,"meanings":[{"definitions":[{"definition":"A legendary serpentine or reptilian creature."},{"definition":"An animal of various species that resemble a dragon in appearance:"},{"definition":"(with definite article, often capitalized) The constellation Draco."},{"definition":"A fierce and unpleasant woman; a harridan.","example":"She’s a bit of a dragon."},{"definition":"(with definite article, often capitalized) The (historical) Chinese empire or the People's Republic of China.","example":"Napoleon already warned of the awakening of the Dragon."},{"definition":"Something very formidable or dangerous."},{"definition":"A type of playing-tile (red dragon, green dragon, white dragon) in the game of mahjong."},{"definition":"A luminous exhalation from marshy ground, seeming to move through the air like a winged serpent."},{"definition":"A short musket hooked to a swivel attached to a soldier's belt; so called from a representation of a dragon's head at the muzzle."},{"definition":"A background process similar to a daemon."},{"definition":"A variety of carrier pigeon."},{"definition":"A transvestite man, or more broadly a male-to-female transgender person."}],"partOfSpeech":"n"}]},{"word":"CONVERTING","idx":10083,"count":4991724,"meanings":[{"definitions":[{"definition":"To transform or change (something) into another form, substance, state, or product.","example":"A kettle converts water into steam."},{"definition":"To change (something) from one use, function, or purpose to another.","example":"He converted his garden into a tennis court."},{"definition":"To induce (someone) to adopt a particular religion, faith, ideology or belief (see also sense 11).","example":"They converted her to Roman Catholicism on her deathbed."},{"definition":"To exchange for something of equal value.","example":"We converted our pounds into euros."},{"definition":"To express (a quantity) in alternative units."},{"definition":"To express (a unit of measurement) in terms of another; to furnish a mathematical formula by which a quantity, expressed in the former unit, may be given in the latter.","example":"How do you convert feet into metres?"},{"definition":"To appropriate wrongfully or unlawfully; to commit the common law tort of conversion."},{"definition":"(rugby football) To score extra points after (a try) by completing a conversion."},{"definition":"To score (especially a penalty kick)."},{"definition":"(ten-pin bowling) To score a spare."},{"definition":"To undergo a conversion of religion, faith or belief (see also sense 3).","example":"We’ve converted to Methodism."},{"definition":"To become converted.","example":"The chair converts into a bed."},{"definition":"To cause to turn; to turn."},{"definition":"To change (one proposition) into another, so that what was the subject of the first becomes the predicate of the second."},{"definition":"To turn into another language; to translate."},{"definition":"To increase one's individual score, especially from 50 runs (a fifty) to 100 runs (a century), or from a century to a double or triple century."},{"definition":"To perform the action that an online advertisement is intended to induce; to reach the point of conversion.","example":"Each time a user clicks on one of your adverts, you will be charged the bid amount whether the user converts or not."}],"partOfSpeech":"ve"}]},{"word":"DIN","idx":10085,"count":4990283,"meanings":[{"definitions":[{"definition":"A loud noise; a cacophony or loud commotion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a din, to resound."},{"definition":"(of a place) To be filled with sound, to resound."},{"definition":"To assail (a person, the ears) with loud noise."},{"definition":"To repeat continuously, as though to the point of deafening or exhausting somebody."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"din-us","text":"/dɪn/"}]},{"word":"INCREDIBLY","idx":10087,"count":4987059,"meanings":[{"definitions":[{"definition":"(manner) In an incredible manner; not to be believed."},{"definition":"(degree) To a great extent; extremely.","example":"He was incredibly wealthy."},{"definition":"Used to note the surprising or hard-to-believe nature of what is being said and suggest that it is nevertheless true.","example":"Incredibly, when he died they found he had left a million dollars to the Poetry Foundation."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɪŋˈkɹɛdɪbli/"}]},{"word":"DELEGATES","idx":10088,"count":4986976,"meanings":[{"definitions":[{"definition":"A person authorized to act as representative for another; a deputy"},{"definition":"A representative at a conference, etc."},{"definition":"An appointed representative in some legislative bodies"},{"definition":"A type of variable storing a reference to a method with a particular signature, analogous to a function pointer"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To authorize someone to be a delegate"},{"definition":"To commit a task to someone, especially a subordinate"},{"definition":"(of a subdomain) to give away authority over a subdomain; to allow someone else to create sub-subdomains of a subdomain of one's own"}],"partOfSpeech":"ve"}]},{"word":"ROMA","idx":10090,"count":4984846,"meanings":[{"definitions":[{"definition":"A Romani; a member of the Roma/Romani people."},{"definition":"A variety of tomato."}],"partOfSpeech":"n"}]},{"word":"DEMOS","idx":10091,"count":4984806,"meanings":[{"definitions":[{"definition":"A demonstration or visual explanation.","example":"The professor prepared a demo to help her class understand the topic."},{"definition":"A recording of a song meant to demonstrate its overall sound for the purpose of getting it published or recorded more fully.","example":"After hearing the demo the record label approved funding to record the song with a full band."},{"definition":"An example of a product used for demonstration and then sold at a discount."},{"definition":"A march or gathering to make a political protest."},{"definition":"An edition of limited functionality to give the user an example of how the program works.","example":"The game's developers released a demo version to the public 3 months before the full release."},{"definition":"A non-interactive audiovisual computer program developed by enthusiasts to demonstrate the capabilities of the machine. See demoscene."},{"definition":"A democrat."},{"definition":"(collective) A demographic group.","example":"The target demo of the new show will be children between 6 and 8 years old."},{"definition":"Demolition."}],"partOfSpeech":"n"}]},{"word":"BALANCING","idx":10092,"count":4984107,"meanings":[{"definitions":[{"definition":"To bring (items) to an equipoise, as the scales of a balance by adjusting the weights."},{"definition":"To make (concepts) agree."},{"definition":"To hold (an object or objects) precariously; to support on a narrow base, so as to keep from falling.","example":"I balanced my mug of coffee on my knee."},{"definition":"To compare in relative force, importance, value, etc.; to estimate."},{"definition":"(dancing) To move toward, and then back from, reciprocally.","example":"to balance partners"},{"definition":"To contract, as a sail, into a narrower compass.","example":"to balance the boom mainsail"},{"definition":"To make the credits and debits of (an account) correspond.","example":"This final payment, or credit, balances the account."},{"definition":"To be in equilibrium."},{"definition":"To have matching credits and debits."},{"definition":"To weigh in a balance."},{"definition":"To hesitate or fluctuate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An action wherein someone balances or something is balanced"}],"partOfSpeech":"n"}]},{"word":"VET","idx":10095,"count":4982559,"meanings":[{"definitions":[{"definition":"A veterinarian or veterinary surgeon."},{"definition":"A veteran (a former soldier or other member of an armed forces)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To thoroughly check or investigate particularly with regard to providing formal approval.","example":"The FBI vets all nominees to the Federal bench."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/vɛt/"}]},{"word":"SIDED","idx":10096,"count":4982500,"meanings":[{"definitions":[{"definition":"To ally oneself, be in an alliance, usually with \"with\" or rarely \"in with\"","example":"Which will you side with, good or evil?"},{"definition":"To lean on one side."},{"definition":"To be or stand at the side of; to be on the side toward."},{"definition":"To suit; to pair; to match."},{"definition":"To work (a timber or rib) to a certain thickness by trimming the sides."},{"definition":"To furnish with a siding.","example":"to side a house"},{"definition":"To provide with, as a side or accompaniment."},{"definition":"To clear, tidy or sort."}],"partOfSpeech":"ve"}]},{"word":"CLAIMING","idx":10097,"count":4982024,"meanings":[{"definitions":[{"definition":"To demand ownership of."},{"definition":"To state a new fact, typically without providing evidence to prove it is true."},{"definition":"To demand ownership or right to use for land."},{"definition":"To demand compensation or damages through the courts."},{"definition":"To be entitled to anything; to deduce a right or title; to have a claim."},{"definition":"To cause the loss of, usually by violent means.","example":"A fire claimed two homes."},{"definition":"To proclaim."},{"definition":"To call or name."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"claiming-us","text":"/ˈkleɪmɪŋ/"}]},{"word":"PSYCHIATRIC","idx":10098,"count":4981598,"meanings":[{"definitions":[{"definition":"Of, or relating to, psychiatry."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌsaɪ.ki.ˈæt.ɹɪk/"}]},{"word":"TEENAGERS","idx":10100,"count":4979216,"meanings":[{"definitions":[{"definition":"A person between 13 and 19 years of age; an adolescent."}],"partOfSpeech":"n"}]},{"word":"COURTYARD","idx":10101,"count":4979027,"meanings":[{"definitions":[{"definition":"An area, open to the sky, partially or wholly surrounded by walls or buildings.","example":"She sat in the courtyard, enjoying the garden."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"courtyard-us","text":"/ˈkɔɹt.jɑɹd/"}]},{"word":"PRESIDENTS","idx":10102,"count":4978963,"meanings":[{"definitions":[{"definition":"An act in the past which may be used as an example to help decide the outcome of similar instances in the future."},{"definition":"A decided case which is cited or used as an example to justify a judgment in a subsequent case."},{"definition":"An established habit or custom."},{"definition":"(with definite article) The aforementioned (thing)."},{"definition":"The previous version."},{"definition":"A rough draught of a writing which precedes a finished copy."},{"definition":"The head of state of a republic.","example":"The vast majority of presidents have been male."},{"definition":"In presidential republics, the head of government and head of state."},{"definition":"Primary leader of a corporation. Not to be confused with CEO, which is a related but separate position that is sometimes held by a different person."},{"definition":"A person presiding over a meeting, chair, presiding officer, presider."}],"partOfSpeech":"n"}]},{"word":"OFFENDERS","idx":10103,"count":4976449,"meanings":[{"definitions":[{"definition":"One who gives or causes offense, or does something wrong."},{"definition":"A person who commits an offense against the law, a lawbreaker."}],"partOfSpeech":"n"}]},{"word":"DEPART","idx":10104,"count":4975122,"meanings":[{"definitions":[{"definition":"Division; separation, as of compound substances."},{"definition":"A going away; departure."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To leave."},{"definition":"To set out on a journey."},{"definition":"To die."},{"definition":"To disappear, vanish; to cease to exist."},{"definition":"To deviate (from), be different (from), fail to conform.","example":"His latest statements seemed to depart from party policy somewhat."},{"definition":"To go away from; to leave."},{"definition":"To divide up; to distribute, share."},{"definition":"To separate, part."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"depart-us","text":"/dɪˈpɑɹt/"}]},{"word":"GRADING","idx":10105,"count":4974318,"meanings":[{"definitions":[{"definition":"To assign scores to the components of an academic test."},{"definition":"To assign a score to overall academic performance."},{"definition":"To organize in grades.","example":"a graded reader"},{"definition":"To flatten, level, or smooth a large surface."},{"definition":"To remove or trim part of a seam allowance from a finished seam so as to reduce bulk and make the finished piece more even when turned right side out."},{"definition":"To pass imperceptibly from one grade into another."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A rank or grade."},{"definition":"Gradation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹeɪdɪŋ/"}]},{"word":"TENANTS","idx":10107,"count":4973987,"meanings":[{"definitions":[{"definition":"One who pays a fee (rent) in return for the use of land, buildings, or other property owned by others."},{"definition":"One who has possession of any place."},{"definition":"One who holds a property by any kind of right, including ownership."},{"definition":"Any of a number of customers serviced through the same instance of an application."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hold as, or be, a tenant."},{"definition":"To inhabit."}],"partOfSpeech":"ve"}]},{"word":"EXPRESSLY","idx":10108,"count":4973927,"meanings":[{"definitions":[{"definition":"In an express or explicit manner.","example":"We were expressly permitted to use the building."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"expressly-us","text":"/ɪkˈspɹɛsli/"}]},{"word":"DISTINCTIVE","idx":10109,"count":4972660,"meanings":[{"definitions":[{"definition":"A distinctive thing: a quality or property permitting distinguishing; a characteristic."},{"definition":"(Hebrew grammar) A distinctive accent."},{"definition":"A distinctive belief, tenet, or dogma of a denomination or sect."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Distinguishing, used to or enabling the distinguishing of some thing.","example":"a product in distinctive packaging"},{"definition":"Discriminating, discerning, having the ability to distinguish between things."},{"definition":"Characteristic, typical.","example":"his distinctive bass voice"},{"definition":"Distinguished, being distinct in character or position."},{"definition":"(Hebrew grammar, of accents) Used to separate clauses in place of stops."},{"definition":"(of sounds) Distinguishing a particular sense of word."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"distinctive-us","text":"/dɪˈstɪŋktɪv/"}]},{"word":"LILY","idx":10110,"count":4972288,"meanings":[{"definitions":[{"definition":"Any of several flowers in the genus Lilium of the family Liliaceae, which includes a great many ornamental species."},{"definition":"Any of several species of herbaceous flower which may or may not resemble the genus Lilium in some way, and which are not closely related to it or each other."},{"definition":"The flower used as a heraldic charge; also commonly used to describe the fleur-de-lis."},{"definition":"The end of a compass needle that should point north, traditionally often ornamented with the figure of a lily or fleur-de-lis."},{"definition":"(usually in the plural) A royal spade in auction bridge."},{"definition":"The thirtieth Lenormand card, representing calmness and maturity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"White (as a racial epithet)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lily-us","text":"/ˈlɪli/"}]},{"word":"BRACKETS","idx":10111,"count":4970994,"meanings":[{"definitions":[{"definition":"A fixture attached to a wall to hold up a shelf."},{"definition":"Any intermediate object that connects a smaller part to a larger part, the smaller part typically projecting sideways from the larger part."},{"definition":"A short crooked timber, resembling a knee, used as a support."},{"definition":"The cheek or side of an ordnance carriage, supporting the trunnions."},{"definition":"Any of the characters \"(\", \")\", \"[\", \"]\", \"{\", \"}\", \"<\" and \">\", used in pairs to enclose parenthetic remarks, sections of mathematical expressions, etc."},{"definition":"A printed diagram of games in a tournament."},{"definition":"A prediction of the outcome of games in a tournament, used for betting purposes."},{"definition":"One of several ranges of numbers.","example":"tax bracket, age bracket"},{"definition":"A pair of values that represent the smallest and largest elements of a range."},{"definition":"In artillery, the endangered region between two shell impacts (one long and one short). The next shell fired is likely to hit accurately."},{"definition":"The small curved or angular corner formed by a serif and a stroke in a letter."},{"definition":"(land surveying, 19th century) a mark cut into a stone by land surveyors to secure a bench."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To support by means of mechanical brackets."},{"definition":"To enclose in typographical brackets."},{"definition":"To bound on both sides, to surround, as enclosing with brackets.","example":"I tried to hit the bullseye by first bracketing it with two shots and then splitting the difference with my third, but I missed."},{"definition":"To place in the same category.","example":"Because the didn't have enough young boys for two full teams, they bracketed the seven-year olds with the eight-year olds."},{"definition":"To mark distinctly for special treatment."},{"definition":"To set aside, discount, ignore."},{"definition":"To take multiple images of the same subject, using a range of exposure settings, in order to help ensure that a satisfactory image is obtained."},{"definition":"(phenomenology) In the philosophical system of Edmund Husserl and his followers, to set aside metaphysical theories and existential questions concerning what is real in order to focus philosophical attention simply on the actual content of experience."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɹækɪts/"}]},{"word":"UNOFFICIAL","idx":10112,"count":4970936,"meanings":[{"definitions":[{"definition":"Not officially established.","example":"the unofficial results of the ballot"},{"definition":"Not acting with official authority.","example":"an unofficial adviser"},{"definition":"Not listed in a national pharmacopeia etc."}],"partOfSpeech":"j"}]},{"word":"OVERSIGHT","idx":10113,"count":4970482,"meanings":[{"definitions":[{"definition":"An omission; something that is left out, missed or forgotten.","example":"A small oversight at this stage can lead to big problems later."},{"definition":"Supervision or management.","example":"The bureaucracy was subject to government oversight."},{"definition":"Overview"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To oversee; to supervise."},{"definition":"(Wiktionary and WMF jargon) To suppress content in a way that removes or minimizes its visibility or viewability."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"oversight-uk","text":"/ˈoʊvə(ɹ)ˌsaɪt/"}]},{"word":"VALENTINES","idx":10114,"count":4969959,"meanings":[{"definitions":[{"definition":"An expression of affection, especially romantic affection, usually in the form of greeting card, gift, or message given the object of one's affection, especially on February 14th.","example":"Such an extravagant valentine was unexpected."},{"definition":"A person to whom a valentine is given or from whom it is received, especially on February 14th.","example":"Won't you be my valentine?"}],"partOfSpeech":"n"}]},{"word":"PRIVATELY","idx":10116,"count":4969339,"meanings":[{"definitions":[{"definition":"In a private manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈpɹaɪvətli/"}]},{"word":"WETLANDS","idx":10117,"count":4968952,"meanings":[{"definitions":[{"definition":"(usually in the plural) Land that is covered mostly with water, with occasional marshy and soggy areas."}],"partOfSpeech":"n"}]},{"word":"MINDED","idx":10118,"count":4968607,"meanings":[{"definitions":[{"definition":"(originally and chiefly in negative or interrogative constructions) To dislike, to object to; to be bothered by.","example":"Do you mind if I smoke?"},{"definition":"To look after, to take care of, especially for a short period of time.","example":"Would you mind my bag for me?"},{"definition":"(chiefly in the imperative) To make sure, to take care (that).","example":"Mind you don't knock that glass over."},{"definition":"To be careful about."},{"definition":"Take note; used to point out an exception or caveat.","example":"I'm not very healthy. I do eat fruit sometimes, mind."},{"definition":"To attend to, concern oneself with, heed, be mindful of.","example":"You should mind your own business."},{"definition":"To remember."},{"definition":"To have in mind; to intend."},{"definition":"To put in mind; to remind."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a mind (inclination) for something or a certain way of thinking about things.","example":"literary-minded"},{"definition":"Having a preference for doing something; having a likelihood, or disposition to carry out an act.","example":"I am minded to refuse the request."}],"partOfSpeech":"j"}]},{"word":"RESIN","idx":10119,"count":4966700,"meanings":[{"definitions":[{"definition":"A viscous hydrocarbon secretion of many plants, particularly coniferous trees."},{"definition":"Any of various yellowish viscous liquids or soft solids of plant origin; used in lacquers, varnishes and many other applications; chemically they are mostly hydrocarbons, often polycyclic."},{"definition":"Any synthetic compound of similar properties."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply resin to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"resin-us","text":"/ˈɹɛzɪn/"}]},{"word":"ALLIES","idx":10120,"count":4965121,"meanings":[{"definitions":[{"definition":"A narrow street or passageway, especially one through the middle of a block giving access to the rear of lots or buildings.","example":"The parking lot to my friend's apartment building is in the alley."},{"definition":"The area between the outfielders.","example":"He hit one deep into the alley."},{"definition":"An establishment where bowling is played."},{"definition":"An elongated wooden strip of floor along which a bowling ball is rolled."},{"definition":"The extra area between the sidelines or tramlines on a tennis court that is used for doubles matches."},{"definition":"A walk or passage in a garden or park, bordered by rows of trees or bushes."},{"definition":"A passageway between rows of pews in a church."},{"definition":"(perspective drawing) Any passage having the entrance represented as wider than the exit, so as to give the appearance of length."},{"definition":"The space between two rows of compositors' stands in a printing office."},{"definition":"A glass marble or taw."},{"definition":"A person, group, or state (etc) which is associated with another for a common cause; one united to another by treaty or common purpose; a confederate.","example":"the two countries were allies in WWI"},{"definition":"A person, group, concept (etc) which is associated with another as a helper; a supporter; an auxiliary."},{"definition":"Anything akin to something else by structure, etc."},{"definition":"A closely related species, usually within the same family.","example":"Gruiformes — cranes and allies"},{"definition":"A relative; a kinsman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To unite, or form a connection between, as between families by marriage, or between princes and states by treaty, league, or confederacy."},{"definition":"To connect or form a relation between by similitude, resemblance, friendship, or love."}],"partOfSpeech":"ve"}]},{"word":"TWILIGHT","idx":10121,"count":4964914,"meanings":[{"definitions":[{"definition":"The soft light in the sky seen before the rising and (especially) after the setting of the sun, occasioned by the illumination of the earth’s atmosphere by the direct rays of the sun and their reflection on the earth.","example":"I could just make out her face in the twilight."},{"definition":"The time when this light is visible; the period between daylight and darkness.","example":"It was twilight by the time I got back home."},{"definition":"The time when the sun is less than 18° below the horizon."},{"definition":"Any faint light through which something is seen; an in-between or fading condition.","example":"The twilight of one's life"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To illuminate faintly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pertaining to or resembling twilight; faintly illuminated; obscure."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"twilight-us","text":"/ˈtwaɪlaɪt/"}]},{"word":"PRESERVED","idx":10122,"count":4963027,"meanings":[{"definitions":[{"definition":"To protect; to keep from harm or injury.","example":"Every people have the right to preserve its identity and culture."},{"definition":"To save from decay by the use of some preservative substance, such as sugar or salt; to season and prepare (fruits, meat, etc.) for storage.","example":"to preserve peaches or grapes"},{"definition":"To maintain throughout; to keep intact.","example":"to preserve appearances; to preserve silence"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"preserved-us","text":"/pɹəˈzɝvd/"}]},{"word":"CROSSED","idx":10123,"count":4962660,"meanings":[{"definitions":[{"definition":"To make or form a cross."},{"definition":"To move relatively."},{"definition":"(social) To oppose."},{"definition":"To cross-fertilize or crossbreed.","example":"They managed to cross a sheep with a goat."},{"definition":"To stamp or mark (a cheque) in such a way as to prevent it being cashed, thus requiring it to be deposited into a bank account."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Marked by a line drawn crosswise, often denoting cancellation."},{"definition":"Folded.","example":"crossed legs"},{"definition":"Cruciate."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"crossed-us","text":"/kɹɔst/"}]},{"word":"LINEN","idx":10126,"count":4960413,"meanings":[{"definitions":[{"definition":"Thread or cloth made from flax fiber."},{"definition":"Domestic textiles, such as tablecloths, bedding, towels, underclothes, etc., that are made of linen or linen-like fabrics of cotton or other fibers; linens.","example":"She put the freshly cleaned linens into the linen closet."},{"definition":"A light beige colour, like that of linen cloth undyed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Made from linen cloth or thread."},{"definition":"Having the colour linen, light beige."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"linen-us","text":"/ˈlɪnɪn/"}]},{"word":"ASCENDING","idx":10129,"count":4958122,"meanings":[{"definitions":[{"definition":"To move upward, to fly, to soar.","example":"He ascended to heaven upon a cloud."},{"definition":"To slope in an upward direction."},{"definition":"To go up.","example":"You ascend the stairs and take a right."},{"definition":"To succeed.","example":"She ascended the throne when her mother abdicated."},{"definition":"To rise; to become higher, more noble, etc."},{"definition":"To trace, search or go backwards temporally (e.g., through records, genealogies, routes, etc.).","example":"Our inquiries ascend to the remotest antiquity."},{"definition":"To become higher in pitch."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An ascent.","example":"continual ascendings and descendings"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a sequence) Ordered such that each element is greater than or equal to the previous element.","example":"Please arrange these numbers in an ascending order."},{"definition":"That causes a sequence to follow an ascending order.","example":"We used an ascending sort."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈsɛndɪŋ/"}]},{"word":"SEALS","idx":10130,"count":4958012,"meanings":[{"definitions":[{"definition":"A pinniped (Pinnipedia), particularly an earless seal (true seal) or eared seal.","example":"The seals in the harbor looked better than they smelled."},{"definition":"A bearing representing a creature something like a walrus."},{"definition":"A stamp used to impress a design on a soft substance such as wax."},{"definition":"An impression of such stamp on wax, paper or other material used for sealing."},{"definition":"A design or insignia usually associated with an organization or an official role.","example":"The front of the podium bore the presidential seal."},{"definition":"Anything that secures or authenticates."},{"definition":"Something which will be visibly damaged if a covering or container is opened, and which may or may not bear an official design.","example":"The result was declared invalid, as the seal on the meter had been broken."},{"definition":"Confirmation or approval, or an indication of this.","example":"Her clothes always had her mom's seal of approval."},{"definition":"Something designed to prevent liquids or gases from leaking through a joint.","example":"The canister is leaking. I think the main seal needs to be replaced."},{"definition":"A tight closure, secure against leakage.","example":"Close the lid tightly to get a good seal."},{"definition":"A chakra."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hunt seals.","example":"They're organizing a protest against sealing."},{"definition":"To place a seal on (a document)."},{"definition":"To mark with a stamp, as an evidence of standard exactness, legal size, or merchantable quality.","example":"to seal silverware"},{"definition":"To fasten (something) so that it cannot be opened without visible damage.","example":"The cover is sealed. If anyone tries to open it, we'll know about it."},{"definition":"To prevent people or vehicles from crossing (something).","example":"The border has been sealed until the fugitives are found."},{"definition":"To close securely to prevent leakage.","example":"I've sealed the bottle to keep the contents fresh."},{"definition":"To place in a sealed container.","example":"I've sealed the documents in this envelope."},{"definition":"To place a notation of one's next move in a sealed envelope to be opened after an adjournment.","example":"After thinking for half an hour, the champion sealed his move."},{"definition":"To guarantee.","example":"The last-minute goal sealed United’s win."},{"definition":"To fix, as a piece of iron in a wall, with cement or plaster, etc."},{"definition":"To close by means of a seal.","example":"to seal a drainpipe with water"},{"definition":"To confirm or set apart as a second or additional wife."},{"definition":"To tie up animals (especially cattle) in their stalls."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"seals-us","text":"/siːlz/"}]},{"word":"NOMINAL","idx":10131,"count":4957994,"meanings":[{"definitions":[{"definition":"(grammar) A noun or word group that functions as part of a noun phrase.","example":"This sentence contains two nominals."},{"definition":"(grammar) A part of speech that shares features with nouns and adjectives. (Depending on the language, it may comprise nouns, adjectives, possibly numerals, pronouns, and participles.)"},{"definition":"A number (usually natural) used like a name; a numeric code or identifier. (See nominal number on Wikipedia.)","example":"Numeric codes of characters used in programming are nominals."},{"definition":"(police jargon) A person listed in the Police National Computer database as having been convicted, cautioned or recently arrested."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, resembling, relating to, or consisting of a name or names."},{"definition":"Assigned to or bearing a person's name."},{"definition":"Existing in name only.","example":"a nominal difference"},{"definition":"Of or relating to nominalism."},{"definition":"Insignificantly small.","example":"He gave me only a nominal sum for my services."},{"definition":"Of or relating to the presumed or approximate value, rather than the actual value.","example":"The nominal voltage is 1.5 V, but the actual figure is usually higher."},{"definition":"Of, relating to, or being the amount or face value of a sum of money or a stock certificate, for example, and not the purchasing power or market value."},{"definition":"Of, relating to, or being the rate of interest or return without adjustment for compounding or inflation."},{"definition":"(grammar) Of or relating to a noun or word group that functions as a noun.","example":"This sentence contains a nominal phrase."},{"definition":"According to plan or design.","example":"Apart from the slightly high temperature, all the readings from the spacecraft are nominal."},{"definition":"Without adjustment to remove the effects of inflation.","example":"My employer does not understand how low my nominal wage is."},{"definition":"(of a variable) Having values whose order is insignificant."},{"definition":"Of a species, the species name without consideration of whether it is a junior synonym or in reality consists of more than one biological species."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈnɒm.ɪnl̩/"},{"text":"/ˈnɑm.ɪnl̩/"}]},{"word":"DECAY","idx":10133,"count":4956622,"meanings":[{"definitions":[{"definition":"The process or result of being gradually decomposed."},{"definition":"A deterioration of condition; loss of status or fortune."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deteriorate, to get worse, to lose strength or health, to decline in quality.","example":"The pair loved to take pictures in the decaying hospital on forty-third street."},{"definition":"(of organic material) To rot, to go bad.","example":"The cat's body decayed rapidly."},{"definition":"(of an unstable atom) To change by undergoing fission, by emitting radiation, or by capturing or losing one or more electrons."},{"definition":"(of a quantum system) To undergo optical decay, that is, to relax to a less excited state, usually by emitting a photon or phonon."},{"definition":"Loss of airspeed due to drag."},{"definition":"To cause to rot or deteriorate.","example":"The extreme humidity decayed the wooden sculptures in the museum's collection in a matter of years."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"decay-uk","text":"/dɪˈkeɪ/"}]},{"word":"WEAKNESSES","idx":10134,"count":4956354,"meanings":[{"definitions":[{"definition":"The condition of being weak.","example":"In a small number of horses, muscle weakness may progress to paralysis."},{"definition":"An inadequate quality; fault","example":"His inability to speak in front of an audience was his weakness."},{"definition":"A special fondness or desire.","example":"She is an athlete who has a weakness for chocolate."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwiːk.nə.sɪz/"}]},{"word":"UNDERWATER","idx":10135,"count":4954318,"meanings":[{"definitions":[{"definition":"Underlying water or body of water, for example in an aquifer or the deep ocean"},{"definition":"A type of lure which lies beneath the water surface."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To water or irrigate insufficiently","example":"Care must be taken not to underwater houseplants in the summer."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Beneath the surface of the water, or of or pertaining to the region beneath the water surface"},{"definition":"Beneath the water line of a vessel"},{"definition":"Under water."},{"definition":"Having negative equity; owing more on an asset than its market value","example":"We've been underwater on our mortgage ever since the housing crash."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Going beneath the surface of the water"}],"partOfSpeech":"v"}]},{"word":"QUARTZ","idx":10136,"count":4953889,"meanings":[{"definitions":[{"definition":"The most abundant mineral on the earth's surface, of chemical composition silicon dioxide, SiO2. It occurs in a variety of forms, both crystalline and amorphous. Found in every environment."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"quartz-us","text":"/kwɔɹts/"}]},{"word":"REGISTERS","idx":10137,"count":4950162,"meanings":[{"definitions":[{"definition":"A machine that tabulates the amount of sales transactions, makes a permanent and cumulative record of them, and has a drawer in which cash can be kept."},{"definition":"A point of sale."},{"definition":"A formal recording of names, events, transactions etc.","example":"The teacher took the register by calling out each child's name."},{"definition":"A book of such entries."},{"definition":"An entry in such a book."},{"definition":"The act of registering."},{"definition":"A certificate issued by the collector of customs of a port or district to the owner of a vessel, containing the description of a vessel, its name, ownership, and other material facts. It is kept on board the vessel, to be used as evidence of nationality or as a muniment of title."},{"definition":"One who registers or records; a registrar; especially, a public officer charged with the duty of recording certain transactions or events.","example":"a register of deeds"},{"definition":"A distinct horizontal (or, more rarely, vertical) section of a work of art or inscription that is divided into several such sections"},{"definition":"A device that automatically records a quantity."},{"definition":"The part of a telegraphic apparatus that automatically records the message received."},{"definition":"A list of received calls in a phone set."},{"definition":"A small unit of very fast memory that is directly accessible to the central processing unit, and is mostly used to store inputs, outputs or intermediate results of computations."},{"definition":"The exact alignment of lines, margins and colors."},{"definition":"The inner part of the mould in which types are cast."},{"definition":"The range of a voice or instrument."},{"definition":"An organ stop."},{"definition":"A style of a language used in a particular context.","example":"My ex-boss used \"let go\", in the euphemistic register, when he sacked me."},{"definition":"A grille at the outflow of a ventilation duct, capable of being opened and closed to direct the air flow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enter in a register."},{"definition":"To enroll, especially to vote."},{"definition":"To record, especially in writing."},{"definition":"To buy the full version of trial software by providing one's details and payment.","example":"This is a trial version, and will expire in 30 days. Please register!"},{"definition":"To express outward signs."},{"definition":"(mail) To record officially and handle specially."},{"definition":"To make or adjust so as to be properly or precisely aligned."},{"definition":"To place one's name, or have one's name placed in a register.","example":"They registered for school."},{"definition":"To make an impression."},{"definition":"To be in proper alignment; to align or correspond exactly."},{"definition":"To voluntarily sign over for safe keeping, abandoning complete ownership for partial."}],"partOfSpeech":"ve"}]},{"word":"EIGHTH","idx":10138,"count":4949260,"meanings":[{"definitions":[{"definition":"The person or thing in the eighth position."},{"definition":"One of eight equal parts of a whole."},{"definition":"An eighth of an ounce, or approximately 3.5 grams, of marijuana or other drugs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide by eight"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The ordinal form of the number eight."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"eighth-us","text":"/eɪtθ/"}]},{"word":"USHER","idx":10140,"count":4948609,"meanings":[{"definitions":[{"definition":"A person, in a church, cinema etc., who escorts people to their seats."},{"definition":"A male escort at a wedding."},{"definition":"A doorkeeper in a courtroom."},{"definition":"An assistant to a head teacher or schoolteacher; an assistant teacher."},{"definition":"Any schoolteacher."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To guide people to their seats."},{"definition":"To accompany or escort (someone)."},{"definition":"To precede; to act as a forerunner or herald."},{"definition":"To lead or guide somewhere"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"usher-us","text":"[ˈʌʃ.ɚ]"},{"audio":"usher-au","text":"[ˈaʃ.ə(ɹ)]"}]},{"word":"HERBERT","idx":10141,"count":4946603,"meanings":[{"definitions":[{"definition":"(punk subculture) A working-class youth."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɝbɚt/"},{"text":"/ˈhɜːbət/"},{"audio":"herbert-au"}]},{"word":"AUTHORISED","idx":10142,"count":4945027,"meanings":[{"definitions":[{"definition":"To grant (someone) the permission or power necessary to do (something).","example":"The General Assembly authorized the Council to take up the matter."},{"definition":"To permit (something), to sanction or consent to (something).","example":"The judge authorized the wiretapping."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Explicitly allowed."}],"partOfSpeech":"j"}]},{"word":"IMPROVES","idx":10143,"count":4943184,"meanings":[{"definitions":[{"definition":"To make (something) better; to increase the value or productivity (of something).","example":"Buying more servers would improve performance."},{"definition":"To become better.","example":"I have improved since taking the tablets."},{"definition":"To disprove or make void; to refute."},{"definition":"To disapprove of; to find fault with; to reprove; to censure.","example":"to improve negligence"},{"definition":"To use or employ to good purpose; to turn to profitable account.","example":"to improve one's time;  to improve his means"}],"partOfSpeech":"ve"}]},{"word":"ADVOCATES","idx":10144,"count":4940587,"meanings":[{"definitions":[{"definition":"Someone whose job is to speak for someone's case in a court of law; a counsel."},{"definition":"Anyone who argues the case of another; an intercessor."},{"definition":"A person who speaks in support of something."},{"definition":"A person who supports others to make their voices heard, or ideally for them to speak up for themselves.","example":"Since she started working with her advocate, she has become much more confident."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To plead in favour of; to defend by argument, before a tribunal or the public; to support, vindicate, or recommend publicly."},{"definition":"To encourage support for something.","example":"I like trees, but I do not advocate living in them."},{"definition":"(with for) To engage in advocacy.","example":"We have been advocating for changes in immigration law."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈæd.və.keɪts/"}]},{"word":"PHENOMENA","idx":10145,"count":4936094,"meanings":[{"definitions":[{"definition":"A thing or being, event or process, perceptible through senses; or a fact or occurrence thereof."},{"definition":"(by extension) A knowable thing or event (eg by inference, especially in science)","example":"An electromagnetic phenomenon."},{"definition":"A kind or type of phenomenon (sense 1 or 2)","example":"A volcanic eruption is an impressive phenomenon."},{"definition":"Appearance; a perceptible aspect of something that is mutable."},{"definition":"A fact or event considered very unusual, curious, or astonishing by those who witness it."},{"definition":"A wonderful or very remarkable person or thing."},{"definition":"(chiefly Kantian idealism) An experienced object whose constitution reflects the order and conceptual structure imposed upon it by the human mind (especially by the powers of perception and understanding)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"phenomena-us","text":"/fɪˈnɑmənə/"}]},{"word":"BUFFET","idx":10146,"count":4934144,"meanings":[{"definitions":[{"definition":"A counter or sideboard from which food and drinks are served or may be bought."},{"definition":"Food laid out in this way, to which diners serve themselves."},{"definition":"A small stool; a stool for a buffet or counter."},{"definition":"A blow or cuff with or as if with the hand, or by any other solid object or the wind."},{"definition":"A low stool; a hassock."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike with a buffet; to cuff; to slap."},{"definition":"To aggressively challenge, denounce, or criticise."},{"definition":"To affect as with blows; to strike repeatedly; to strive with or contend against.","example":"to buffet the billows"},{"definition":"To deaden the sound of (bells) by muffling the clapper."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"buffet-1-us","text":"/bəˈfeɪ/"}]},{"word":"DECIDING","idx":10147,"count":4933367,"meanings":[{"definitions":[{"definition":"To resolve (a contest, problem, dispute, etc.); to choose, determine, or settle","example":"Her last-minute goal decided the game."},{"definition":"To make a judgment, especially after deliberation","example":"I have decided that it is healthier to walk to work."},{"definition":"To cause someone to come to a decision"},{"definition":"To cut off; to separate"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"deciding-us","text":"/dɪˈsaɪdɪŋ/"}]},{"word":"SKATE","idx":10148,"count":4932092,"meanings":[{"definitions":[{"definition":"A light boot, fitted with a blade, used for ice skating."},{"definition":"A boot having small wheels or casters attached to its sole; used for roller skating"},{"definition":"A runner or blade, usually of steel, with a frame shaped to fit the sole of a shoe, made to be fastened under the foot, and used for gliding on ice."},{"definition":"The act of skateboarding","example":"There's time for a quick skate before dinner."},{"definition":"The act of roller skating or ice skating","example":"The boys had a skate every morning when the lake was frozen."},{"definition":"A fish of the family Rajidae in the superorder Batoidea (rays) which inhabit most seas. Skates generally have small heads with protruding muzzles, and wide fins attached to a flat body."},{"definition":"A worn-out horse."},{"definition":"A mean or contemptible person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move along a surface (ice or ground) using skates."},{"definition":"To skateboard"},{"definition":"To use the skating technique."},{"definition":"To get away with something; to be acquitted of a crime for which one is manifestly guilty."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pertaining to the technique of skating."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"skate-us","text":"/skeɪt/"}]},{"word":"JOEY","idx":10150,"count":4925455,"meanings":[{"definitions":[{"definition":"The immature young of a marsupial, notably a junior kangaroo, but also a young wallaby, koala, etc."},{"definition":"The shorter word whose letters can be found within a kangaroo word."},{"definition":"A parcel smuggled in to an inmate."},{"definition":"(circus) A kind of clown."},{"definition":"A member of the Royal Marines."},{"definition":"A person with cerebal palsy."},{"definition":"A stupid person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"joey-us","text":"/ˈd͡ʒoʊ.i/"}]},{"word":"HACKERS","idx":10152,"count":4923452,"meanings":[{"definitions":[{"definition":"One who is expert at programming and solving problems with a computer."},{"definition":"One who uses a computer to gain unauthorized access to data, or to carry out malicious attacks."},{"definition":"A computer security professional."},{"definition":"Something that hacks; a tool or device for hacking."},{"definition":"A fork-shaped tool used to harvest root vegetables."},{"definition":"Someone who hacks."},{"definition":"One who is inexperienced or unskilled at a particular activity, especially a sport such as golf or tennis.","example":"a tennis hacker"},{"definition":"One who operates a taxicab"}],"partOfSpeech":"n"}]},{"word":"TILT","idx":10153,"count":4923123,"meanings":[{"definitions":[{"definition":"A slope or inclination."},{"definition":"The inclination of part of the body, such as backbone, pelvis, head, etc."},{"definition":"The controlled vertical movement of a camera, or a device to achieve this."},{"definition":"A jousting contest."},{"definition":"An attempt at something, such as a tilt at public office."},{"definition":"A thrust, as with a lance."},{"definition":"A tilt hammer."},{"definition":"A canvas covering for carts, boats, etc."},{"definition":"Any covering overhead; especially, a tent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To slope or incline (something); to slant.","example":"Tilt the barrel to pour out its contents."},{"definition":"(jousting) To charge (at someone) with a lance."},{"definition":"To be at an angle."},{"definition":"To point or thrust a weapon at."},{"definition":"To point or thrust (a weapon)."},{"definition":"To forge (something) with a tilt hammer.","example":"to tilt steel in order to render it more ductile"},{"definition":"To play worse than usual (often as a result of previous bad luck or losses)."},{"definition":"(of a machine) To intentionally let the ball fall down to the drain by disabling flippers and most targets, done as a punishment to the player when the machine is nudged too violently or frequently."},{"definition":"To cover with a tilt, or awning."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tilt-uk","text":"/tɪlt/"}]},{"word":"SUPPORTIVE","idx":10154,"count":4922700,"meanings":[{"definitions":[{"definition":"Providing support.","example":"I had a very supportive coach who helped me."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/səˈpɔɹtɪv/"},{"text":"/səˈpɔːtɪv/"}]},{"word":"GRANITE","idx":10156,"count":4921138,"meanings":[{"definitions":[{"definition":"A group of igneous and plutonic rocks composed primarily of feldspar and quartz. Usually contains one or more dark minerals, which may be mica, pyroxene, or amphibole. Granite is quarried for building stone, road gravel, decorative stone, and tombstones. Common colors are gray, white, pink, and yellow-brown."},{"definition":"Toughness; the quality of having a thick skin or being rough."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"granite-us","text":"/ˈɡɹæ.nɪt/"}]},{"word":"REPEATEDLY","idx":10157,"count":4920604,"meanings":[{"definitions":[{"definition":"Done several times or in repetition.","example":"He repeatedly violated the court order, and shall now be punished."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"repeatedly-us","text":"/ɹɪˈpiːtɪdli/"}]},{"word":"LYNCH","idx":10158,"count":4920597,"meanings":[{"definitions":[{"definition":"To execute (somebody) without a proper legal trial or procedure, especially by hanging and backed by a mob."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A ledge, a terrace; a right-angled projection; a lynchet."},{"definition":"An acclivity; a small hill or hillock."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/lɪntʃ/"}]},{"word":"MASSES","idx":10159,"count":4919548,"meanings":[{"definitions":[{"definition":"(physical) Matter, material."},{"definition":"A large quantity; a sum."},{"definition":"The Eucharist, now especially in Roman Catholicism."},{"definition":"Celebration of the Eucharist."},{"definition":"(usually as the Mass) The sacrament of the Eucharist."},{"definition":"A musical setting of parts of the mass."},{"definition":"(generically) People, especially a large number of people"},{"definition":"The total population.","example":"The masses will be voting this Tuesday."},{"definition":"The lower classes or all but the elite.","example":"[...]  the ignorant masses  [...]"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form or collect into a mass; to form into a collective body; to bring together into masses; to assemble."},{"definition":"To have a certain mass.","example":"I mass 70 kilograms."},{"definition":"To celebrate mass."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"masses-us","text":"/ˈmæs.ɪz/"}]},{"word":"TRANSFORMED","idx":10160,"count":4918409,"meanings":[{"definitions":[{"definition":"To change greatly the appearance or form of.","example":"The alchemists sought to transform lead into gold."},{"definition":"To change the nature, condition or function of; to change in nature, disposition, heart, character, etc.; to convert."},{"definition":"To subject to a transformation; to change into another form without altering the value."},{"definition":"To subject to the action of a transformer."},{"definition":"To subject (a cell) to transformation."},{"definition":"To undergo a transformation; to change in appearance or character."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Given a completely different form or appearance."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"transformed-us"}]},{"word":"ATHLETE","idx":10161,"count":4918312,"meanings":[{"definitions":[{"definition":"A participant in a group of sporting activities which includes track and field, road running, cross country running and racewalking.","example":"She's the first athlete in her sport to obtain a corporate sponsor."},{"definition":"A person who actively participates in physical sports, especially with great skill; a sportsperson."},{"definition":"An exceptionally physically fit person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"athlete-us","text":"/ˈæθ.lit/"}]},{"word":"TARGETING","idx":10162,"count":4917220,"meanings":[{"definitions":[{"definition":"To aim something, especially a weapon, at (a target)."},{"definition":"To aim for as an audience or demographic.","example":"The advertising campaign targeted older women."},{"definition":"To produce code suitable for.","example":"This cross-platform compiler can target any of several processors."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An instance of targeting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Involved in the transportation or correct positioning of a protein inside or outside a specific region of the cell."}],"partOfSpeech":"j"}]},{"word":"FRANC","idx":10163,"count":4916960,"meanings":[{"definitions":[{"definition":"A former unit of currency of France, Belgium and Luxembourg, replaced by the euro."},{"definition":"Any of several units of currency, some of which are multi-national (West African CFA Franc (XOF), Central African CFA Franc (XAF), the Swiss franc (CHF)) while others are national currencies."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"franc-uk","text":"/fɹæŋk/"}]},{"word":"BEAD","idx":10164,"count":4916807,"meanings":[{"definitions":[{"definition":"Prayer, later especially with a rosary."},{"definition":"Each in a string of small balls making up the rosary or paternoster."},{"definition":"A small, round object."},{"definition":"(heading) A ridge, band, or molding."},{"definition":"Knowledge sufficient to direct one's activities to a purpose.","example":"We now have a bead on the main technical issues for the project"},{"definition":"A glassy drop of molten flux, as borax or microcosmic salt, used as a solvent and color test for several mineral earths and oxides, as of iron, manganese, etc., before the blowpipe.","example":"the borax bead;  the iron bead, etc."},{"definition":"Front sight of a gun."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into a bead.","example":"The raindrops beaded on the car's waxed finish."},{"definition":"To apply beads to.","example":"She spent the morning beading the gown."},{"definition":"To form into a bead.","example":"He beaded some solder for the ends of the wire."},{"definition":"To cause beads to form on (something)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bead-us","text":"/biːd/"}]},{"word":"ENFORCE","idx":10165,"count":4916571,"meanings":[{"definitions":[{"definition":"To keep up, impose or bring into effect something, not necessarily by force.","example":"The police are there to enforce the law."},{"definition":"To give strength or force to; to affirm, to emphasize.","example":"The victim was able to enforce his evidence against the alleged perpetrator."},{"definition":"To strengthen (a castle, town etc.) with extra troops, fortifications etc."},{"definition":"To intensify, make stronger, add force to."},{"definition":"To exert oneself, to try hard."},{"definition":"To compel, oblige (someone or something); to force."},{"definition":"To make or gain by force; to force.","example":"to enforce a passage"},{"definition":"To put in motion or action by violence; to drive."},{"definition":"To give force to; to strengthen; to invigorate; to urge with energy.","example":"to enforce arguments or requests"},{"definition":"To urge; to ply hard; to lay much stress upon."},{"definition":"To prove; to evince."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪnˈfɔɹs/"},{"text":"/ɪnˈfɔːs/"}]},{"word":"PRESCHOOL","idx":10166,"count":4916187,"meanings":[{"definitions":[{"definition":"A nursery school."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide nursery school education for."},{"definition":"To undergo nursery school education."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to the years of early childhood before attendance at primary school."}],"partOfSpeech":"j"}]},{"word":"SIMILARITY","idx":10167,"count":4916061,"meanings":[{"definitions":[{"definition":"Closeness of appearance to something else."},{"definition":"The relation of sharing properties.","example":"Hardly is there a similarity detected between two or three facts, than men hasten to extend it to all. — Sir W. Hamilton."},{"definition":"A transformation that preserves angles and the ratios of distances"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɪmɪˈlæɹɪti/"}]},{"word":"LANDLORD","idx":10168,"count":4915638,"meanings":[{"definitions":[{"definition":"A person who owns and rents land such as a house, apartment, or condo."},{"definition":"The owner or manager of a public house."},{"definition":"(with \"the\") A shark, imagined as the owner of the surf to be avoided."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlænd.lɔɹd/"},{"text":"/ˈlænd.lɔːd/"},{"audio":"landlord-au"}]},{"word":"LEAK","idx":10169,"count":4914623,"meanings":[{"definitions":[{"definition":"A crack, crevice, fissure, or hole which admits water or other fluid, or lets it escape.","example":"a leak in a boat"},{"definition":"The entrance or escape of a fluid through a crack, fissure, or other aperture.","example":"The babies' diapers had big leaks."},{"definition":"A divulgation, or disclosure, of information previously held secret.","example":"The leaks by Chelsea Manning showed the secrets of the US military."},{"definition":"The person through whom such divulgation, or disclosure, occurs.","example":"The press must have learned about the plan through a leak."},{"definition":"A loss of electricity through imperfect insulation, or the point where it occurs."},{"definition":"The gradual loss of a system resource caused by failure to deallocate previously reserved portions.","example":"memory leak"},{"definition":"(especially with the verb \"take\") An act of urination.","example":"I have to take a leak."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To allow fluid or gas to pass through an opening that should be sealed.","example":"The faucet has been leaking since last month."},{"definition":"(of a fluid or gas) To pass through an opening that should be sealed.","example":"No one realized that propane gas was leaking from a rusty tank in the concession area, slowly filling the unventilated room."},{"definition":"To disclose secret information surreptitiously or anonymously.","example":"Someone must have leaked it to our competitors that the new product will be out soon."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Leaky."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"leak-us","text":"/liːk/"}]},{"word":"ASSORTED","idx":10172,"count":4912605,"meanings":[{"definitions":[{"definition":"To sort or arrange according to characteristic or class."},{"definition":"To be of a kind with."},{"definition":"To be associated with; to consort with."},{"definition":"To furnish with, or make up of, various sorts or a variety of goods.","example":"to assort a cargo"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Composed of a number of different kinds or types; mixed; miscellaneous."}],"partOfSpeech":"j"}]},{"word":"HM","idx":10173,"count":4912277,"meanings":[{"definitions":[{"definition":"A shorter variant of hmm."}],"partOfSpeech":"i"}]},{"word":"IMPLEMENTS","idx":10174,"count":4912193,"meanings":[{"definitions":[{"definition":"A tool or instrument for working with.","example":"They carried an assortment of gardening implements in the truck."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bring about; to put into practice","example":"It’s a good thought, but it will be a difficult thing to implement."},{"definition":"To carry out; to do"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"implements-us","text":"/ˈɪmpləmənts/"}]},{"word":"ADVISER","idx":10176,"count":4911485,"meanings":[{"definitions":[{"definition":"One who advises"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"adviser-us","text":"/ædˈvaɪz.ɚ/"}]},{"word":"FLATS","idx":10178,"count":4911343,"meanings":[{"definitions":[{"definition":"An area of level ground."},{"definition":"A note played a semitone lower than a natural, denoted by the symbol ♭ placed after the letter representing the note (e.g., B♭) or in front of the note symbol (e.g. ♭♪)."},{"definition":"A flat tyre/tire."},{"definition":"(in the plural) A type of ladies' shoes with very low heels.","example":"She liked to walk in her flats more than in her high heels."},{"definition":"(in the plural) A type of flat-soled running shoe without spikes."},{"definition":"A thin, broad brush used in oil and watercolor/watercolour painting."},{"definition":"The flat part of something:"},{"definition":"A wide, shallow container or pallet.","example":"a flat of strawberries"},{"definition":"(mail) A large mail piece measuring at least 8 1/2 by 11 inches, such as catalogs, magazines, and unfolded paper enclosed in large envelopes."},{"definition":"A railroad car without a roof, and whose body is a platform without sides; a platform car or flatcar."},{"definition":"A flat-bottomed boat, without keel, and of small draught."},{"definition":"A subset of n-dimensional space that is congruent to a Euclidean space of lower dimension."},{"definition":"A straw hat, broad-brimmed and low-crowned."},{"definition":"A flat sheet for use on a bed."},{"definition":"A platform on a wheel, upon which emblematic designs etc. are carried in processions."},{"definition":"A horizontal vein or ore deposit auxiliary to a main vein; also, any horizontal portion of a vein not elsewhere horizontal."},{"definition":"A dull fellow; a simpleton."},{"definition":"(technical, theatre) A rectangular wooden structure covered with masonite, lauan, or muslin that depicts a building or other part of a scene, also called backcloth and backdrop."},{"definition":"Any of various hesperiid butterflies that spread their wings open when they land."},{"definition":"An early kind of toy soldier having a flat design."},{"definition":"An apartment, usually on one level and usually consisting of more than one room."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a flat call; to call without raising."},{"definition":"To become flat or flattened; to sink or fall to an even surface."},{"definition":"To fall from the pitch."},{"definition":"To depress in tone, as a musical note; especially, to lower in pitch by half a tone."},{"definition":"To make flat; to flatten; to level."},{"definition":"To render dull, insipid, or spiritless; to depress."},{"definition":"To beat or strike; pound"},{"definition":"To dash or throw"},{"definition":"To dash, rush"}],"partOfSpeech":"ve"}]},{"word":"COMPELLING","idx":10179,"count":4911176,"meanings":[{"definitions":[{"definition":"To drive together, round up"},{"definition":"To overpower; to subdue."},{"definition":"To force, constrain or coerce.","example":"Logic compels the wise, while fools feel compelled by emotions."},{"definition":"To exact, extort, (make) produce by force."},{"definition":"To force to yield; to overpower; to subjugate."},{"definition":"To gather or unite in a crowd or company."},{"definition":"To call forth; to summon."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of compulsion; an obliging somebody to do something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Strongly or irresistibly evoking interest or attention.","example":"There are compelling reasons why a manager should have previous experience."},{"definition":"Forceful.","example":"The politician had compelling ambition."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"compelling-us","text":"/kəmˈpɛlɪŋ/"}]},{"word":"VOUCHERS","idx":10180,"count":4910741,"meanings":[{"definitions":[{"definition":"A piece of paper that entitles the holder to a discount, or that can be exchanged for goods and services."},{"definition":"A receipt."},{"definition":"One who or that which vouches."},{"definition":"A copy of a published advertisement sent by the agency to the client as proof of publication."},{"definition":"A mechanical device used in shops for automatically registering the amount of money drawn."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To establish the authenticity of; to vouch for."},{"definition":"To provide a vouch for (an expenditure)."},{"definition":"To provide (a beneficiary) with a voucher."}],"partOfSpeech":"ve"}]},{"word":"MEGAPIXEL","idx":10181,"count":4910318,"meanings":[{"definitions":[{"definition":"One million pixels, used as a unit of resolution of digital cameras.","example":"This camera has a resolution of three megapixels."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(preceded by a cardinal number) Having a resolution of the specified number of megapixels.","example":"This is a three-megapixel camera."}],"partOfSpeech":"j"}]},{"word":"BOOKLET","idx":10182,"count":4909462,"meanings":[{"definitions":[{"definition":"A small or thin book."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbʊk.lət/"}]},{"word":"EXPECTING","idx":10183,"count":4908583,"meanings":[{"definitions":[{"definition":"To predict or believe that something will happen","example":"He never expected to be discovered."},{"definition":"To consider obligatory or required."},{"definition":"To consider reasonably due.","example":"You are expected to get the task done by the end of next week."},{"definition":"(continuous aspect only, of a woman or couple) To be pregnant, to consider a baby due."},{"definition":"To wait for; to await."},{"definition":"To wait; to stay."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which somebody expects something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a woman or female animal, in expectation of giving birth; pregnant.","example":"The expecting mother is enthusiastic about learning childcare."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɛkˈspɛktɪŋ/"}]},{"word":"HEELS","idx":10185,"count":4907543,"meanings":[{"definitions":[{"definition":"The rear part of the foot, where it joins the leg."},{"definition":"The part of a shoe's sole which supports the foot's heel."},{"definition":"The rear part of a sock or similar covering for the foot."},{"definition":"The part of the palm of a hand closest to the wrist.","example":"He drove the heel of his hand into the man's nose."},{"definition":"(usually in the plural) A woman's high-heeled shoe."},{"definition":"The back, upper part of the stock."},{"definition":"The last or lowest part of anything.","example":"the heel of a mast"},{"definition":"A crust end-piece of a loaf of bread."},{"definition":"The base of a bun sliced in half lengthwise."},{"definition":"A contemptible, inconsiderate or thoughtless person."},{"definition":"A headlining wrestler regarded as a \"bad guy,\" whose ring persona embodies villainous or reprehensible traits and demonstrates characteristics of a braggart and a bully."},{"definition":"The cards set aside for later use in a patience or solitaire game."},{"definition":"Anything resembling a human heel in shape; a protuberance; a knob."},{"definition":"The lower end of a timber in a frame, as a post or rafter."},{"definition":"(specifically) The obtuse angle of the lower end of a rafter set sloping."},{"definition":"(workman slang) A cyma reversa."},{"definition":"The short side of an angled cut."},{"definition":"The part of a club head's face nearest the shaft."},{"definition":"The lower end of the bit (cutting edge) of an axehead; as opposed to the toe (upper end)."},{"definition":"In a carding machine, the part of a flat nearest the cylinder."},{"definition":"The act of inclining or canting from a vertical position; a cant."},{"definition":"High-heeled shoes.","example":"She wore a short skirt and heels."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"heels-us","text":"/hiːlz/"}]},{"word":"VOTER","idx":10186,"count":4905374,"meanings":[{"definitions":[{"definition":"Someone who votes.","example":"In your opinion, should we allow 16 and 17 year olds to become voters?"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈvoʊtɚ/"},{"text":"/ˈvəʊtə(ɹ)/"}]},{"word":"REIMBURSEMENT","idx":10187,"count":4904547,"meanings":[{"definitions":[{"definition":"The act of compensating someone for an expense."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɹiː.ɪmˈbɜːs.mənt/"}]},{"word":"TURNOVER","idx":10188,"count":4904068,"meanings":[{"definitions":[{"definition":"The amount of money taken as sales transacted in a given period.","example":"The company had an annual turnover of $500,000."},{"definition":"The frequency with which stock is replaced after being used or sold, workers leave and are replaced, a property changes hands, etc.","example":"High staff-turnover can lead to low morale amongst employees"},{"definition":"A semicircular pastry made by turning one half of a circular crust over the other, enclosing the filling (usually fruit).","example":"They only served me one apple turnover for breakfast."},{"definition":"A loss of possession of the ball without scoring.","example":"The Nimrods committed another dismaying turnover en route to another humiliating loss."},{"definition":"A measure of leg speed: the frequency with which one takes strides when running, typically given in strides per minute."},{"definition":"The act or result of overturning something; an upset.","example":"a bad turnover in a carriage"},{"definition":"An apprentice, in any trade, who is handed over from one master to another to complete his time."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Capable of being turned over; designed to be turned over.","example":"a turnover collar"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"turnover-us"}]},{"word":"URINE","idx":10189,"count":4903932,"meanings":[{"definitions":[{"definition":"Liquid waste consisting of water, salts and urea, which is made in the kidneys, stored in the bladder, then released through the urethra."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To urinate."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈjɝɪn/"},{"text":"/ˈjʊəɹaɪn/"},{"text":"/ˈjʉːəɹɪn/"}]},{"word":"TOWEL","idx":10193,"count":4901668,"meanings":[{"definitions":[{"definition":"A cloth used for wiping, especially one used for drying anything wet, as a person after a bath."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit with a towel."},{"definition":"To dry by using a towel.","example":"He got out of the shower and toweled himself dry."},{"definition":"To block up (a door, etc.) with a towel, to conceal the fumes of a recreational drug."},{"definition":"To beat with a stick."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"towel-us","text":"/taʊl/"},{"audio":"towel-uk","text":"/taʊl/"}]},{"word":"GINGER","idx":10194,"count":4901078,"meanings":[{"definitions":[{"definition":"The pungent aromatic rhizome of a tropical Asian herb, Zingiber officinale, used as a spice and as a stimulant and acarminative."},{"definition":"The plant that produces this rhizome."},{"definition":"Other species belonging to the same family, Zingiberaceae, especially those of the genus Zingiber"},{"definition":"A reddish-brown color."},{"definition":"A person with reddish-brown hair; a redhead."},{"definition":"Vitality, vigour, liveliness (of character)."},{"definition":"A homosexual."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add ginger to."},{"definition":"To enliven, to spice (up)."},{"definition":"To apply ginger to the anus of a horse to encourage it to carry its tail high and move in a lively fashion."},{"definition":"To inspire (someone); to give a little boost to."},{"definition":"To move gingerly, very careful and cautious."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of hair) Of a reddish-brown colour."},{"definition":"Sensitive, delicate."},{"definition":"Homosexual."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ginger-uk","text":"/ˈdʒɪndʒə/"}]},{"word":"ITALICIZED","idx":10195,"count":4900898,"meanings":[{"definitions":[{"definition":"To put into italics."},{"definition":"To emphasize."}],"partOfSpeech":"ve"}]},{"word":"SUBURBS","idx":10196,"count":4899548,"meanings":[{"definitions":[{"definition":"A residential area located on the outskirts of a city or large town that usually includes businesses that cater to its residents; such as schools, grocery stores, shopping centers, restaurants, convenience stores, etc."},{"definition":"(by extension) The outer part; the environment."},{"definition":"Any subdivision of a conurbation, not necessarily on the periphery."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsʌbɝbz/"},{"text":"/ˈsʌbɜːbz/"}]},{"word":"IMAGERY","idx":10197,"count":4898768,"meanings":[{"definitions":[{"definition":"The work of one who makes images or visible representation of objects."},{"definition":"Imitation work."},{"definition":"Images in general, or en masse."},{"definition":"Unreal show; imitation; appearance."},{"definition":"The work of the imagination or fancy; false ideas; imaginary phantasms."},{"definition":"Rhetorical decoration in writing or speaking; vivid descriptions presenting or suggesting images of sensible objects; figures in discourse."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"imagery-us","text":"/-ədʒɹi/"}]},{"word":"CHROMOSOME","idx":10198,"count":4898576,"meanings":[{"definitions":[{"definition":"A linear arrangement of condensed DNA and associated proteins (such as chaperone proteins) which contains the genetic material (genome) of an organism.","example":"Chromosomes store genetic information."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"chromosome-us","text":"/ˈkɹoʊməˌsoʊm/"},{"audio":"chromosome-uk","text":"/ˈkɹəʊ.məˌsəʊm/"}]},{"word":"OPTIMIZED","idx":10199,"count":4898373,"meanings":[{"definitions":[{"definition":"(originally intransitive) To act optimistically or as an optimist."},{"definition":"To make (something) optimal."},{"definition":"To make (something) more efficient, such as a computer program."},{"definition":"To become optimal."}],"partOfSpeech":"ve"}]},{"word":"SEARS","idx":10200,"count":4897480,"meanings":[{"definitions":[{"definition":"To char, scorch, or burn the surface of (something) with a hot instrument."},{"definition":"To wither; to dry up."},{"definition":"To make callous or insensible."},{"definition":"To mark permanently, as if by burning.","example":"The events of that day were seared into her memory."}],"partOfSpeech":"ve"}]},{"word":"ALS","idx":10201,"count":4895759,"meanings":[{"definitions":[{"definition":"The Indian mulberry, Morinda citrifolia, especially as used to make dye."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(focus) In addition; besides; as well; further; too.","example":"They had porridge for breakfast, and also toast."},{"definition":"To the same degree or extent; so, as."}],"partOfSpeech":"v"}]},{"word":"FLIES","idx":10203,"count":4894680,"meanings":[{"definitions":[{"definition":"The open area above a stage where scenery and equipment may be hung."},{"definition":"Any insect of the order Diptera; characterized by having two wings (except for some wingless species), also called true flies."},{"definition":"(non-technical) Especially, any of the insects of the family Muscidae, such as the common housefly (other families of Diptera include mosquitoes and midges)."},{"definition":"Any similar, but unrelated insect such as dragonfly or butterfly."},{"definition":"A lightweight fishing lure resembling an insect."},{"definition":"A chest exercise performed by moving extended arms from the sides to in front of the chest. (also flye)"},{"definition":"A witch's familiar."},{"definition":"A parasite."},{"definition":"The butterfly stroke (plural is normally flys)"},{"definition":"(preceded by definite article) A simple dance in which the hands are shaken in the air, popular in the 1960s."},{"definition":"The action of flying; flight."},{"definition":"An act of flying.","example":"There was a good wind, so I decided to give the kite a fly."},{"definition":"A fly ball."},{"definition":"A type of small, fast carriage (sometimes pluralised flys)."},{"definition":"A piece of canvas that covers the opening at the front of a tent."},{"definition":"(often plural) A strip of material (sometimes hiding zippers or buttons) at the front of a pair of trousers, pants, underpants, bootees, etc.","example":"Ha-ha! Your flies are undone!"},{"definition":"The free edge of a flag."},{"definition":"The horizontal length of a flag."},{"definition":"An exercise that involves wide opening and closing of the arms perpendicular to the shoulders."},{"definition":"The part of a vane pointing the direction from which the wind blows."},{"definition":"That part of a compass on which the points are marked; the compass card."},{"definition":"Two or more vanes set on a revolving axis, to act as a fanner, or to equalize or impede the motion of machinery by the resistance of the air, as in the striking part of a clock."},{"definition":"A heavy wheel, or cross arms with weights at the ends on a revolving axis, to regulate or equalize the motion of machinery by means of its inertia, where the power communicated, or the resistance to be overcome, is variable, as in the steam engine or the coining press. See flywheel."},{"definition":"A light horse-drawn carriage that can be hired for transportation."},{"definition":"In a knitting machine, the piece hinged to the needle, which holds the engaged loop in position while the needle is penetrating another loop; a latch."},{"definition":"The pair of arms revolving around the bobbin, in a spinning wheel or spinning frame, to twist the yarn."},{"definition":"A shuttle driven through the shed by a blow or jerk."},{"definition":"The person who took the printed sheets from the press."},{"definition":"A vibrating frame with fingers, attached to a power printing press for doing the same work."},{"definition":"One of the upper screens of a stage in a theatre."},{"definition":"(cotton manufacture) waste cotton"},{"definition":"(rural) A wing.","example":"The bullet barely grazed the wild fowl's fly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit a fly ball; to hit a fly ball that is caught for an out. Compare ground (verb) and line (verb).","example":"Jones flied to right in his last at-bat."},{"definition":"To travel through the air, another gas or a vacuum, without being in contact with a grounded surface.","example":"Birds of passage fly to warmer regions as it gets colder in winter."},{"definition":"To flee, to escape (from).","example":"Fly, my lord! The enemy are upon us!"},{"definition":"To cause to fly (travel or float in the air): to transport via air or the like.","example":"Birds fly their prey to their nest to feed it to their young."},{"definition":"(of a proposal, project or idea) To be accepted, come about or work out.","example":"Let's see if that idea flies."},{"definition":"To travel very fast, hasten."},{"definition":"To move suddenly, or with violence; to do an act suddenly or swiftly.","example":"a door flies open;  a bomb flies apart"},{"definition":"To display (a flag) on a flagpole."},{"definition":"To hunt with a hawk."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/flaɪz/"}]},{"word":"UPGRADED","idx":10204,"count":4893959,"meanings":[{"definitions":[{"definition":"To improve, usually applied to technology, generally by complete replacement of one or more components","example":"When you upgrade your standard of living, you become addicted to that standard of living."},{"definition":"To replace with something better.","example":"I had to upgrade my anti-virus software to protect my computer from the newer threats."},{"definition":"To improve the equipment or furnishings of or services rendered to","example":"They upgraded him to the latest model."},{"definition":"To improve in condition or status.","example":"She upgraded to a more successful husband."},{"definition":"To replace a program with a later version of itself, a version having a higher version number or marketed under a more recent product name."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having had an upgrade; having been improved or enhanced."}],"partOfSpeech":"j"}]},{"word":"COMPETENCE","idx":10205,"count":4893571,"meanings":[{"definitions":[{"definition":"The quality or state of being competent, i.e. able or suitable for a general role."},{"definition":"The quality or state of being able or suitable for a particular task; the quality or state of being competent for a particular task."},{"definition":"The system of linguistic knowledge possessed by native speakers of a language, as opposed to its actual use in concrete situations (performance), cf. :w:linguistic competence."},{"definition":"A sustainable income."},{"definition":"The legal authority to deal with a matter.","example":"That question is out with the competence of this court and must be taken to a higher court."},{"definition":"The degree to which a rock is resistant to deformation or flow."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɒmpətəns/"}]},{"word":"COLORFUL","idx":10206,"count":4893237,"meanings":[{"definitions":[{"definition":"Possessing prominent and varied colors."},{"definition":"Interesting, multifaceted, energetic, distinctive."},{"definition":"Profane, obscene, offensive (usually in the phrase colourful language)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkʌlɚfəl/"},{"text":"/ˈkʌləfəl/"}]},{"word":"INADEQUATE","idx":10207,"count":4892298,"meanings":[{"definitions":[{"definition":"An individual who is inadequate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not adequate; not fit for the purpose","example":"inadequate representation"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈædəkwɪt/"}]},{"word":"CRYING","idx":10208,"count":4891725,"meanings":[{"definitions":[{"definition":"To shed tears; to weep.","example":"That sad movie always makes me cry."},{"definition":"To utter loudly; to call out; to declare publicly."},{"definition":"To shout, scream, yell."},{"definition":"To utter inarticulate sounds, as animals do."},{"definition":"To cause to do something, or bring to some state, by crying or weeping.","example":"Tonight I'll cry myself to sleep."},{"definition":"To make oral and public proclamation of; to notify or advertise by outcry, especially things lost or found, goods to be sold, etc.","example":"to cry goods"},{"definition":"Hence, to publish the banns of, as for marriage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who cries; a weeping or shouting.","example":"Their constant cryings kept us awake!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"That cries.","example":"The crying child on the street was evidently lost."},{"definition":"That demands action or attention.","example":"There is a crying need for more manual workers in this country."},{"definition":"That deserves rebuke or censure.","example":"It is a crying shame that he managed to get away with that!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"crying-us","text":"/kɹaɪ̯.ɪŋ/"}]},{"word":"AMATEURS","idx":10210,"count":4890277,"meanings":[{"definitions":[{"definition":"A lover of something."},{"definition":"A person attached to a particular pursuit, study, or science as to music or painting; especially one who cultivates any study or art, from taste or attachment, without pursuing it professionally.","example":"The contest is only open to amateurs."},{"definition":"Someone who is unqualified or insufficiently skillful.","example":"The entire thing was built by some amateurs with screwdrivers and plywood."}],"partOfSpeech":"n"}]},{"word":"CRANE","idx":10211,"count":4888961,"meanings":[{"definitions":[{"definition":"Any bird of the family Gruidae, large birds with long legs and a long neck which is extended during flight."},{"definition":"Ardea herodias, the great blue heron."},{"definition":"A mechanical lifting machine or device, often used for lifting heavy loads for industrial or construction purposes."},{"definition":"An iron arm with horizontal motion, attached to the side or back of a fireplace for supporting kettles etc. over the fire."},{"definition":"A siphon, or bent pipe, for drawing liquors out of a cask."},{"definition":"A forked post or projecting bracket to support spars, etc.; generally used in pairs."},{"definition":"The cranium."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extend (one's neck)."},{"definition":"To raise or lower with, or as if with, a crane."},{"definition":"To pull up before a jump."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crane-us","text":"/kɹeɪn/"}]},{"word":"DEFENDANTS","idx":10212,"count":4888581,"meanings":[{"definitions":[{"definition":"In civil proceedings, the party responding to the complaint; one who is sued and called upon to make satisfaction for a wrong complained of by another."},{"definition":"In criminal proceedings, the accused."}],"partOfSpeech":"n"}]},{"word":"DEPLOYED","idx":10213,"count":4887317,"meanings":[{"definitions":[{"definition":"To prepare and arrange (usually military unit or units) for use.","example":"\"Deploy two units of infantry along the enemy's flank,\" the general ordered."},{"definition":"To unfold, open, or otherwise become ready for use.","example":"He waited tensely for his parachute to deploy."},{"definition":"To install, test and implement a computer system or application.","example":"The process for the deployment scenario includes: building a master installation of the operating system, creating its image and deploying the image onto a destination computer."}],"partOfSpeech":"ve"}]},{"word":"GOVERNED","idx":10214,"count":4887138,"meanings":[{"definitions":[{"definition":"To make and administer the public policy and affairs of; to exercise sovereign authority in.","example":"The old king governed the land wisely."},{"definition":"To control the actions or behavior of; to keep under control; to restrain.","example":"Govern yourselves like civilized people."},{"definition":"To exercise a deciding or determining influence on.","example":"Chance governs the outcome of many card games."},{"definition":"To control the speed, flow etc. of; to regulate.","example":"a valve that governs fuel intake"},{"definition":"To exercise political authority; to run a government."},{"definition":"To have or exercise a determining influence."},{"definition":"(grammar) To require that a certain preposition, grammatical case, etc. be used with a word; sometimes used synonymously with collocate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"governed-us","text":"/ˈɡəvɚnd/"}]},{"word":"CONSIDERABLY","idx":10215,"count":4887058,"meanings":[{"definitions":[{"definition":"Significantly; to a degree worth considering.","example":"The situation has improved considerably."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"considerably","text":"/kənˈsɪdəɹəbli/"}]},{"word":"INVESTIGATING","idx":10216,"count":4884687,"meanings":[{"definitions":[{"definition":"To inquire into or study in order to ascertain facts or information.","example":"to investigate the causes of natural phenomena"},{"definition":"To examine, look into, or scrutinize in order to discover something hidden or secret.","example":"to investigate an unsolved murder"},{"definition":"To conduct an inquiry or examination."}],"partOfSpeech":"ve"}]},{"word":"ROTTEN","idx":10217,"count":4883839,"meanings":[{"definitions":[{"definition":"Of perishable items, overridden with bacteria and other infectious agents.","example":"If you leave a bin unattended for a few weeks, the rubbish inside will turn rotten."},{"definition":"In a state of decay.","example":"His mouth stank and his teeth were rotten."},{"definition":"Cruel, mean or immoral.","example":"That man is a rotten father."},{"definition":"Bad or terrible.","example":"It was a rotten idea to take the boat out today."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To an extreme degree.","example":"That kid is spoilt rotten."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈɹɑtn̩/"},{"text":"/ˈɹɒtn̩/"}]},{"word":"POPUP","idx":10218,"count":4882686,"meanings":[{"definitions":[{"definition":"Anything that pops up, particularly"}],"partOfSpeech":"n"}]},{"word":"MK","idx":10219,"count":4881231,"meanings":[{"definitions":[{"definition":"Used to indicate acknowledgement or acceptance.","example":"I promise to give it back. – OK."},{"definition":"Used to introduce a sentence in order to draw attention to the importance of what is being said.","example":"OK, I'm thinking of a number…"},{"definition":"Used in turn-taking, serving as a request to the speaker to grant the turn to the interrupter.","example":"You always do this to me! When we were at your mother’s, you said that…  – OK, OK, …"}],"partOfSpeech":"i"}]},{"word":"GARNET","idx":10220,"count":4880977,"meanings":[{"definitions":[{"definition":"A hard transparent mineral that is often used as gemstones and abrasives."},{"definition":"A dark red color, like that of the gemstone."},{"definition":"A tackle for hoisting cargo in or out."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a dark red colour."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To shred (twisted wool fiber, rags, etc.) so that it can be reused."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡɑː(ɹ).nət/"}]},{"word":"HABIT","idx":10221,"count":4880657,"meanings":[{"definitions":[{"definition":"An action performed on a regular basis.","example":"It’s become a habit of mine to have a cup of coffee after dinner."},{"definition":"An action performed repeatedly and automatically, usually without awareness.","example":"By force of habit, he dressed for work even though it was holiday."},{"definition":"A long piece of clothing worn by monks and nuns.","example":"It’s interesting how Catholic and Buddhist monks both wear habits."},{"definition":"A piece of clothing worn uniformly for a specific activity.","example":"The new riding habits of the team looked smashing!"},{"definition":"Outward appearance; attire; dress."},{"definition":"Form of growth or general appearance of a variety or species of plant or crystal."},{"definition":"An addiction.","example":"He has a 10-cigar habit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clothe."},{"definition":"To inhabit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"habit-us","text":"/ˈhæbət/"}]},{"word":"BULB","idx":10222,"count":4879829,"meanings":[{"definitions":[{"definition":"Any solid object rounded at one end and tapering on the other, possibly attached to a larger object at the tapered end.","example":"the bulb of the aorta"},{"definition":"A light bulb."},{"definition":"The bulb-shaped root portion of a plant such as a tulip, from which the rest of the plant may be regrown."},{"definition":"A bulbous protuberance at the forefoot of certain vessels to reduce turbulence."},{"definition":"The medulla oblongata."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take the shape of a bulb; to swell."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bulb-us","text":"/bʌlb/"}]},{"word":"SCATTERED","idx":10223,"count":4879386,"meanings":[{"definitions":[{"definition":"To (cause to) separate and go in different directions; to disperse.","example":"The crowd scattered in terror."},{"definition":"To distribute loosely as by sprinkling.","example":"Her ashes were scattered at the top of a waterfall."},{"definition":"To deflect (radiation or particles)."},{"definition":"To occur or fall at widely spaced intervals."},{"definition":"To frustrate, disappoint, and overthrow.","example":"to scatter hopes or plans"},{"definition":"To be dispersed upon.","example":"Desiccated stalks scattered the fields."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Seemingly randomly distributed."},{"definition":"(of clouds) covering three eighths to four eighths of the sky."},{"definition":"(of precipitation) affecting 30 percent to 50 percent of a forecast zone."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"scattered-us","text":"/ˈskætɚd/"}]},{"word":"HONOUR","idx":10224,"count":4879119,"meanings":[{"definitions":[{"definition":"Recognition of importance or value; respect; veneration (of someone, usually for being morally upright or successful)","example":"The crowds gave the returning general much honor and praise."},{"definition":"The state of being morally upright, honest, noble, virtuous, and magnanimous; excellence of character; the perception of such a state; favourable reputation; dignity","example":"He was a most perfect knight, for he had great honor and chivalry."},{"definition":"A token of praise or respect; something that represents praiseworthiness or respect, such as a prize or award given by the state to a citizen","example":"Audie Murphy received many honors, such as the Distinguished Service Cross."},{"definition":"A privilege","example":"I had the honour of dining with the ambassador."},{"definition":"(in the plural) the privilege of going first","example":"I'll let you have the honours, Bob—go ahead."},{"definition":"A cause of respect and fame; a glory; an excellency; an ornament.","example":"He is an honour to his nation."},{"definition":"(feudal law) a seigniory or lordship held of the king, on which other lordships and manors depended"},{"definition":"The center point of the upper half of an armorial escutcheon (compare honour point)"},{"definition":"In bridge, an ace, king, queen, jack, or ten especially of the trump suit. In some other games, an ace, king, queen or jack."},{"definition":"(in the plural) (courses for) an honours degree: a university qualification of the highest rank","example":"At university I took honours in modern history."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To think of highly, to respect highly; to show respect for; to recognise the importance or spiritual value of","example":"The freedom fighters will be forever remembered and honored by the people."},{"definition":"To conform to, abide by, act in accordance with (an agreement, treaty, promise, request, or the like)","example":"I trusted you, but you have not honored your promise."},{"definition":"To confer (bestow) an honour or privilege upon (someone)","example":"Ten members of the profession were honored at the ceremony."},{"definition":"To make payment in respect of (a cheque, banker's draft, etc.)","example":"I'm sorry Sir, but the bank did not honour your cheque."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"honour-uk","text":"/ˈɒnə(ɹ)/"}]},{"word":"USELESS","idx":10225,"count":4876437,"meanings":[{"definitions":[{"definition":"Without use or possibility to be used.","example":"This fork has prongs that are bent. It's useless now."},{"definition":"Unhelpful, not useful; pointless (of an action).","example":"I think it's useless to keep this discussion going. It's like talking to a wall."},{"definition":"(of a person) Good-for-nothing; not dependable.","example":"Bill never mows the lawn, takes out the trash or anything. He's useless, but I love him anyways."},{"definition":"(of a person) Unable to do well at a particular task or thing. Useless is mildly insulting.","example":"My brother is useless at most computer games, but he is an awesome PS2 player."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"useless-us","text":"/ˈjuːs.ləs/"}]},{"word":"PROTECTS","idx":10226,"count":4876017,"meanings":[{"definitions":[{"definition":"To keep safe; to defend; to guard; to prevent harm coming to.","example":"Condoms are designed to protect against sexually-transmitted diseases."},{"definition":"(travel) To book a passenger on a later flight if there is a chance they will not be able to board their earlier reserved flight."}],"partOfSpeech":"ve"}]},{"word":"NORTHWESTERN","idx":10227,"count":4875705,"meanings":[{"definitions":[{"definition":"Of or pertaining to the northwest; from or to in such a direction."},{"definition":"(of wind) blowing from that direction"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/nɔːθˈwɛst.ə(ɹ)n/"}]},{"word":"AUDIENCES","idx":10228,"count":4875027,"meanings":[{"definitions":[{"definition":"A group of people within hearing; specifically, a large gathering of people listening to or watching a performance, speech, etc.","example":"We joined the audience just as the lights went down."},{"definition":"Hearing; the condition or state of hearing or listening."},{"definition":"A widespread or nationwide viewing or listening public, as of a TV or radio network or program."},{"definition":"A formal meeting with a state or religious dignitary.","example":"She managed to get an audience with the Pope."},{"definition":"The readership of a book or other written publication.","example":"\"Private Eye\" has a small but faithful audience."},{"definition":"A following.","example":"The opera singer expanded his audience by singing songs from the shows."},{"definition":"An audiencia (judicial court of the Spanish empire), or the territory administered by it."}],"partOfSpeech":"n"}]},{"word":"IRIS","idx":10229,"count":4874649,"meanings":[{"definitions":[{"definition":"A plant of the genus Iris, common in the northern hemisphere, and generally having attractive blooms (See Iris (plant))."},{"definition":"The contractile membrane perforated by the pupil, which adjusts to control the amount of light reaching the retina, and which forms the colored portion of the eye (See Iris (anatomy))."},{"definition":"A diaphragm used to regulate the size of a hole, especially as a way of controlling the amount of light reaching a lens."},{"definition":"A rainbow, or other colourful refraction of light."},{"definition":"A constricted opening in the path inside a waveguide, used to form a resonator."},{"definition":"The inner circle of an oscillated color spot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of an aperture, lens or door) To open or close in the manner of an iris."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"iris-us","text":"/ˈaɪɹɪs/"}]},{"word":"COUPE","idx":10230,"count":4874541,"meanings":[{"definitions":[{"definition":"An ice cream dessert; the glass it is served in."},{"definition":"A car with two doors (variant of coupé)."},{"definition":"An area of forest where harvesting of wood is planned or has taken place."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"coupe-uk","text":"/kuːp/"}]},{"word":"BACH","idx":10234,"count":4872909,"meanings":[{"definitions":[{"definition":"(northern) A holiday home, usually small and near the beach, often with only one or two rooms and of simple construction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To live apart from women, as during the period when a divorce is in progress. (Compare bachelor pad.)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bach-uk","text":"/batʃ/"}]},{"word":"MANAGES","idx":10235,"count":4872225,"meanings":[{"definitions":[{"definition":"To direct or be in charge of."},{"definition":"To handle or control (a situation, job)."},{"definition":"To handle with skill, wield (a tool, weapon etc.)."},{"definition":"To succeed at an attempt.","example":"He managed to climb the tower."},{"definition":"To achieve (something) without fuss, or without outside help.","example":"It's a tough job, but I'll manage."},{"definition":"To train (a horse) in the manège; to exercise in graceful or artful action."},{"definition":"To treat with care; to husband."},{"definition":"To bring about; to contrive."}],"partOfSpeech":"ve"}]},{"word":"EROSION","idx":10236,"count":4871884,"meanings":[{"definitions":[{"definition":"The result of having been worn away or eroded, as by a glacier on rock or the sea on a cliff face."},{"definition":"The changing of a surface by mechanical action, friction, thermal expansion contraction, or impact."},{"definition":"The gradual loss of something as a result of an ongoing process.","example":"the erosion of a person's trust"},{"definition":"Destruction by abrasive action of fluids."},{"definition":"(image processing) One of two fundamental operations in morphological image processing from which all other morphological operations are derived."},{"definition":"Loss of tooth enamel due to non-bacteriogenic chemical processes."},{"definition":"A shallow ulceration or lesion, usually involving skin or epithelial tissue."},{"definition":"In morphology, a basic operation (denoted ⊖); see Erosion (morphology)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈɹoʊʒən/"},{"text":"/əˈɹəʊʒən/"}]},{"word":"ABUNDANCE","idx":10238,"count":4870991,"meanings":[{"definitions":[{"definition":"A large quantity; many."},{"definition":"An overflowing fullness or ample sufficiency; profusion; copious supply; superfluity; plentifulness."},{"definition":"Wealth; affluence; plentiful amount of resources."},{"definition":"Frequency, amount, ratio of something within a given environment or sample."},{"definition":"A bid to take nine or more tricks in solo whist."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"abundance-us","text":"/əˈbn̩.dn̩s/"}]},{"word":"CARPENTER","idx":10239,"count":4870735,"meanings":[{"definitions":[{"definition":"A person skilled at carpentry, the trade of cutting and joining timber in order to construct buildings or other structures."},{"definition":"A senior rating in ships responsible for all the woodwork onboard; in the days of sail, a warrant officer responsible for the hull, masts, spars and boats of a ship, and whose responsibility was to sound the well to see if the ship was making water."},{"definition":"A two-wheeled carriage."},{"definition":"A carpenter bee."},{"definition":"A woodlouse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To work as a carpenter, cutting and joining timber."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"carpenter-uk","text":"/ˈkɑː.pən.tə/"}]},{"word":"KHAN","idx":10240,"count":4870468,"meanings":[{"definitions":[{"definition":"A ruler over various Turkish, Tatar and Mongol peoples in the Middle Ages."},{"definition":"An Ottoman sultan."},{"definition":"A noble or man of rank in various Muslim countries of Central Asia, including Afghanistan."},{"definition":"A caravanserai; a resting-place for a travelling caravan."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"khan-us","text":"/kɑːn/"}]},{"word":"INSUFFICIENT","idx":10241,"count":4869704,"meanings":[{"definitions":[{"definition":"Not sufficient.","example":"Insufficient time is available to reflect on the problem"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnsəˈfɪʃənt/"}]},{"word":"HIGHLANDS","idx":10242,"count":4867795,"meanings":[{"definitions":[{"definition":"An area of high land."}],"partOfSpeech":"n"}]},{"word":"PETERS","idx":10243,"count":4867213,"meanings":[{"definitions":[{"definition":"In whist, to play a blue peter."},{"definition":"(most often used in the phrase peter out) To dwindle; to trail off; to diminish to nothing."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The penis."},{"definition":"A safe."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"peters-au"}]},{"word":"FERTILITY","idx":10244,"count":4867141,"meanings":[{"definitions":[{"definition":"The condition, or the degree, of being fertile.","example":"Muckspreading increases the fertility of the soil."},{"definition":"The birthrate of a population; the number of live births per 1000 people per year."},{"definition":"The average number of births per woman within a population."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fɚːˈtɪləti/"}]},{"word":"FORMULATION","idx":10245,"count":4865813,"meanings":[{"definitions":[{"definition":"The act, process, or result of formulating or reducing to a formula."},{"definition":"A medicinal preparation.","example":"If you liked our old shampoo, you'll love the new kinder, gentler formulation."}],"partOfSpeech":"n"}]},{"word":"CLEVER","idx":10246,"count":4865097,"meanings":[{"definitions":[{"definition":"Nimble with hands or body; skillful; adept."},{"definition":"Resourceful, sometimes to the point of cunning.","example":"clever like a fox"},{"definition":"Smart, intelligent, or witty; mentally quick or sharp."},{"definition":"Showing inventiveness or originality; witty."},{"definition":"(of an Aboriginal Australian) Possessing magical abilities."},{"definition":"Fit; suitable; having propriety."},{"definition":"Well-shaped; handsome."},{"definition":"Good-natured; obliging."},{"definition":"Fit and healthy; free from fatigue or illness."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"clever-us","text":"/ˈklɛvɚ/"}]},{"word":"PRIMER","idx":10247,"count":4864138,"meanings":[{"definitions":[{"definition":"A prayer or devotional book intended for laity, initially an abridgment of the breviary and manual including the hours of the Virgin Mary, 15 gradual and 7 penitential psalms, the litany, the placebo and dirige forming the office of the dead, and the commendations."},{"definition":"Similar works issued in England for private prayer in accordance with the Book of Common Prayer."},{"definition":"A children's book intended to teach literacy: how to read, write, and spell.","example":"1545, The A.B.C. Primers"},{"definition":"An introductory text on any subject, particularly basic concepts."},{"definition":"An elementary school class; an elementary school student."},{"definition":"Any substance or device, such as priming wire or blasting cap, used to ignite gunpowder or other explosive."},{"definition":"A person who primes explosives."},{"definition":"A substance used to prime wood, metal, etc. in preparation for painting."},{"definition":"A layer of such a substance."},{"definition":"A layer of makeup that goes beneath the foundation; undermakeup."},{"definition":"A person who primes wood, metal, etc."},{"definition":"A molecule which initiates the synthesis of an enzyme, a single-stranded nucleic acid molecule which initiates DNA replication."},{"definition":"A pheromone which interacts first with the endocrine system."},{"definition":"A device used to prime an internal combustion engine with gasoline, in airplanes."},{"definition":"A person who prunes trees."}],"partOfSpeech":"n"},{"definitions":[{"definition":"First in time, initial, early."},{"definition":"First in importance, premier."},{"definition":"First in position, foremost."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"primer-1-us","text":"/ˈpɹaɪmɚ/"},{"audio":"primer-1-uk","text":"/ˈpɹaɪ.mə(ɹ)/"}]},{"word":"LORDS","idx":10249,"count":4862111,"meanings":[{"definitions":[{"definition":"The master of the servants of a household; the master of a feudal manor"},{"definition":"One possessing similar mastery over others; any feudal superior generally; any nobleman or aristocrat; any chief, prince, or sovereign ruler; in Scotland, a male member of the lowest rank of nobility (the equivalent rank in England is baron)"},{"definition":"One possessing similar mastery in figurative senses (esp. as lord of ~)"},{"definition":"The heavenly body considered to possess a dominant influence over an event, time, etc."},{"definition":"A hunchback."},{"definition":"(via Cockney rhyming slang) Sixpence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Domineer or act like a lord."},{"definition":"To invest with the dignity, power, and privileges of a lord; to grant the title of lord."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lords-us","text":"/lɔɹdz/"}]},{"word":"BU","idx":10250,"count":4862013,"meanings":[{"definitions":[{"definition":"A dry measure, containing four pecks, eight gallons, or thirty-two quarts."},{"definition":"A vessel of the capacity of a bushel, used in measuring; a bushel measure."},{"definition":"A quantity that fills a bushel measure.","example":"a heap containing ten bushels of apples"},{"definition":"A large indefinite quantity."},{"definition":"The iron lining in the nave of a wheel."}],"partOfSpeech":"n"}]},{"word":"TENDS","idx":10251,"count":4861901,"meanings":[{"definitions":[{"definition":"(Old English law) To make a tender of; to offer or tender."},{"definition":"(followed by a to-infinitive) To be likely, or probable to do something, or to have a certain habit or leaning.","example":"It tends to snow here in winter."},{"definition":"To contribute to or toward some outcome."},{"definition":"(with to) To look after (e.g. an ill person.)","example":"We need to tend to the garden, which has become a mess."},{"definition":"To accompany as an assistant or protector; to care for the wants of; to look after; to watch; to guard.","example":"Shepherds tend their flocks."},{"definition":"To wait (upon), as attendants or servants; to serve; to attend."},{"definition":"To await; to expect."},{"definition":"To be attentive to; to note carefully; to attend to."},{"definition":"To manage (an anchored vessel) when the tide turns, to prevent it from entangling the cable when swinging."},{"definition":"To kindle; ignite; set on fire; light; inflame; burn."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tends-us","text":"/tɛndz/"}]},{"word":"ENJOYABLE","idx":10253,"count":4859999,"meanings":[{"definitions":[{"definition":"Pleasant, capable of giving pleasure.","example":"That was an enjoyable day; I had a lot of fun."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɛnˈdʒɔɪ.jə.bəl/"}]},{"word":"HANDBAG","idx":10254,"count":4858848,"meanings":[{"definitions":[{"definition":"(mainly Commonwealth) A small bag used by women (or sometimes by men) for carrying various small personal items."},{"definition":"An subgenre of house music of the late 1980s, often with booming vocals."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Figuratively, to hit with a handbag; to attack verbally or subject to criticism (used of Margaret Thatcher)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhæm.bəɡ/"}]},{"word":"CRESCENT","idx":10255,"count":4857264,"meanings":[{"definitions":[{"definition":"The figure of the moon as it appears in its first or last quarter, with concave and convex edges terminating in points."},{"definition":"Something shaped like a crescent, especially:"},{"definition":"A representation of the symbol used by Islamic caliphates"},{"definition":"A crescent spanner."},{"definition":"Any of three orders of knighthood conferred upon foreigners to whom Turkey might be indebted for valuable services."},{"definition":"The emblem of the waxing Moon with horns directed upward, when used in a coat of arms; often used as a mark of cadency to distinguish a second son and his descendants."},{"definition":"A crescentspot butterfly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into a crescent, or something resembling a crescent."},{"definition":"To adorn with crescents."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Marked by an increase; waxing, like the Moon."},{"definition":"Shaped like a crescent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"crescent-uk","text":"/ˈkɹɛ.sənt/"}]},{"word":"BYPASS","idx":10256,"count":4856691,"meanings":[{"definitions":[{"definition":"A road that passes around something, such as a residential area"},{"definition":"A circumvention"},{"definition":"A section of pipe that conducts a fluid around some other fixture"},{"definition":"An electrical shunt"},{"definition":"An alternative passage created to divert a bodily fluid around a damaged organ; the surgical procedure to construct such a bypass"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To avoid an obstacle etc, by constructing or using a bypass"},{"definition":"To ignore the usual channels or procedures"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbaɪpæs/"},{"text":"/ˈbaɪpɑːs/"}]},{"word":"FRESHMAN","idx":10257,"count":4856078,"meanings":[{"definitions":[{"definition":"A novice; one in the rudiments of knowledge."},{"definition":"A person of either sex entering the first year of an institution, especially a high school (ninth grade), a university, or legislative body.","example":"At the time I was a wide-eyed freshman, but I was soon to grow jaded and cynical."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɹɛʃmən/"}]},{"word":"PLAYGROUND","idx":10259,"count":4853485,"meanings":[{"definitions":[{"definition":"(outdoors) A large open space for children to play on, usually having dedicated play equipment (such as swings and slides)."},{"definition":"Any physical or metaphysical space in which a person or organization has free rein to do as they please.","example":"The exclusive tropical island was a millionaire's playground."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"playground-us"},{"text":"/ˈpleɪɡɹaʊnd/"}]},{"word":"NEGOTIATE","idx":10260,"count":4853126,"meanings":[{"definitions":[{"definition":"To confer with others in order to come to terms or reach an agreement."},{"definition":"To arrange or settle something by mutual agreement.","example":"The client and server computers must first negotiate a network protocol to be used."},{"definition":"To succeed in coping with, or getting over something.","example":"Although the car was quite rickety, he could negotiate the curves very well."},{"definition":"To transfer to another person with all the rights of the original holder; to pass, as a bill."},{"definition":"To transact business; to carry on trade."},{"definition":"To intrigue; to scheme."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"negotiate-us","text":"/nəˈɡoʊ.ʃi.eɪt/"}]},{"word":"LOGOUT","idx":10261,"count":4852863,"meanings":[{"definitions":[{"definition":"The act or process of logging out."}],"partOfSpeech":"n"}]},{"word":"SIXTY","idx":10262,"count":4851534,"meanings":[{"definitions":[{"definition":"The cardinal number occurring after fifty-nine and before sixty-one, represented in Roman numerals as LX and in Arabic numerals as 60."}],"partOfSpeech":"nu"}],"phonetics":[{"audio":"sixty-us","text":"/ˈsɪksti/"},{"audio":"sixty-uk","text":"/ˈsɪkstɪ/"}]},{"word":"EXPLOIT","idx":10263,"count":4851510,"meanings":[{"definitions":[{"definition":"A heroic or extraordinary deed."},{"definition":"An achievement.","example":"The first trek to the summit of Mount Everest was a stunning exploit."},{"definition":"A program or technique that exploits a vulnerability in other software."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use for one’s own advantage."},{"definition":"To forcibly deprive someone of something to which she or he has a natural right.","example":"Materialistic monsters who exploit \"kind\" folks will not have good outcomes, no matter how much comforts were ill-gained."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"exploit-us"},{"audio":"exploit-uk"}]},{"word":"ORGIES","idx":10264,"count":4849647,"meanings":[{"definitions":[{"definition":"Originally, secret rites or ceremonies, typically involving riotous and dissolute behaviour, including dancing, drunkenness and indiscriminate sexual activity, undertaken in honour of various pagan gods or goddesses (such as Attis, Bacchus, Ceres, Dionysus, Osiris, etc)."},{"definition":"A gathering of people to engage in group sex."},{"definition":"Excessive indulgence in a specified activity."}],"partOfSpeech":"n"}]},{"word":"BOYFRIEND","idx":10265,"count":4849182,"meanings":[{"definitions":[{"definition":"A male partner in an unmarried romantic relationship."},{"definition":"A male friend."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"boyfriend-us","text":"/ˈbɔɪfɹənd/"}]},{"word":"PERMANENTLY","idx":10266,"count":4849017,"meanings":[{"definitions":[{"definition":"In a permanent manner; lastingly."},{"definition":"Forever."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈpɝmənəntli/"},{"text":"/ˈpɜːmənəntli/"}]},{"word":"CONCENTRATED","idx":10267,"count":4848674,"meanings":[{"definitions":[{"definition":"To bring to, or direct toward, a common center; to unite more closely; to gather into one body, mass, or force.","example":"to concentrate rays of light into a focus"},{"definition":"To increase the strength and diminish the bulk of, as of a liquid or an ore; to intensify, by getting rid of useless material; to condense.","example":"to concentrate acid by evaporation"},{"definition":"To approach or meet in a common center; to consolidate.","example":"Population tends to concentrate in cities."},{"definition":"To focus one's thought or attention (on).","example":"Let me concentrate!"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not dilute; having a high concentration.","example":"We made a drink from concentrated orange juice."},{"definition":"Intense; directed towards a specific location.","example":"The concentrated fire from the enemy destroyed our fortifications."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"concentrated-us","text":"/ˈkɑnsəntɹeɪtɪd/"}]},{"word":"DISTINGUISH","idx":10268,"count":4846365,"meanings":[{"definitions":[{"definition":"To recognize someone or something as different from others based on its characteristics."},{"definition":"To see someone or something clearly or distinctly."},{"definition":"To make oneself noticeably different or better from others through accomplishments.","example":"The soldier distinguished himself in combat and received a medal."},{"definition":"To make to differ."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"distinguish-us","text":"/dɪsˈtɪŋɡwɪʃ/"}]},{"word":"HOGTIED","idx":10270,"count":4843474,"meanings":[{"definitions":[{"definition":"To tie an animal's or someone's feet together; originally all four legs of a quadruped."},{"definition":"To render helpless."}],"partOfSpeech":"ve"}]},{"word":"PROJECTIONS","idx":10271,"count":4842834,"meanings":[{"definitions":[{"definition":"Something which projects, protrudes, juts out, sticks out, or stands out.","example":"The face of the cliff had many projections that were big enough for birds to nest on."},{"definition":"The action of projecting or throwing or propelling something."},{"definition":"The crisis or decisive point of any process, especially a culinary process."},{"definition":"The display of an image by devices such as movie projector, video projector, overhead projector or slide projector."},{"definition":"A forecast or prognosis obtained by extrapolation"},{"definition":"A belief or assumption that others have similar thoughts and experiences as oneself"},{"definition":"The image that a translucent object casts onto another object."},{"definition":"Any of several systems of intersecting lines that allow the curved surface of the earth to be represented on a flat surface. The set of mathematics used to calculate coordinate positions."},{"definition":"An image of an object on a surface of fewer dimensions."},{"definition":"An idempotent linear transformation which maps vectors from a vector space onto a subspace."},{"definition":"A transformation which extracts a fragment of a mathematical object."},{"definition":"A morphism from a categorical product to one of its (two) components."}],"partOfSpeech":"n"}]},{"word":"SPARK","idx":10273,"count":4842423,"meanings":[{"definitions":[{"definition":"A small particle of glowing matter, either molten or on fire."},{"definition":"A short or small burst of electrical discharge."},{"definition":"A small, shining body, or transient light; a sparkle."},{"definition":"A small amount of something, such as an idea or romantic affection, that has the potential to become something greater, just as a spark can start a fire."},{"definition":"Any of various lycaenid butterflies of the Indomalayan genus Sinthusa."},{"definition":"(in plural sparks but treated as a singular) A ship's radio operator."},{"definition":"An electrician."},{"definition":"A gallant; a foppish young man."},{"definition":"A beau, lover."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To trigger, kindle into activity (an argument, etc)."},{"definition":"To light; to kindle."},{"definition":"To give off a spark or sparks."},{"definition":"Appalachian To court."},{"definition":"To woo, court; to act the gallant or beau."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spark-us","text":"/spɑɹk/"}]},{"word":"ILLUSTRATE","idx":10274,"count":4841953,"meanings":[{"definitions":[{"definition":"To shed light upon."},{"definition":"To clarify something by giving, or serving as, an example or a comparison.","example":"We illustrate our definitions by including quotations or simple examples."},{"definition":"To provide a book or other publication with pictures, diagrams or other explanatory or decorative features.","example":"The economics textbook was illustrated with many graphs."},{"definition":"To give renown or honour to; to make illustrious."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"illustrate-uk","text":"/ɪ.ˈlʌs.tɹeɪt/"}]},{"word":"CLIPART","idx":10276,"count":4839466,"meanings":[{"definitions":[{"definition":"A set of images, distributed as files with other software, that may be copied and pasted into documents or other files."}],"partOfSpeech":"n"}]},{"word":"PATIENCE","idx":10277,"count":4839393,"meanings":[{"definitions":[{"definition":"The quality of being patient."},{"definition":"Any of various card games that can be played by one person. Called solitaire in the US. (card game)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"patience","text":"/ˈpeɪʃəns/"}]},{"word":"SECURING","idx":10278,"count":4838996,"meanings":[{"definitions":[{"definition":"To make safe; to relieve from apprehensions of, or exposure to, danger; to guard; to protect."},{"definition":"To put beyond hazard of losing or of not receiving; to make certain; to assure; frequently with against or from, or formerly with of.","example":"to secure a creditor against loss; to secure a debt by a mortgage"},{"definition":"To make fast; to close or confine effectually; to render incapable of getting loose or escaping.","example":"to secure a prisoner; to secure a door, or the hatches of a ship"},{"definition":"To get possession of; to make oneself secure of; to acquire certainly.","example":"to secure an estate"},{"definition":"To plight or pledge."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"securing-us","text":"/səˈkjɝɪŋ/"}]},{"word":"PATHWAY","idx":10279,"count":4837820,"meanings":[{"definitions":[{"definition":"A footpath or other path or track."},{"definition":"A sequence of biochemical compounds, and the reactions linking them, that describe a process in metabolism or catabolism."},{"definition":"A course of action."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɑːθˌweɪ/"},{"text":"/ˈpæθˌweɪ/"}]},{"word":"DETECTORS","idx":10280,"count":4836632,"meanings":[{"definitions":[{"definition":"A device capable of registering a specific substance or physical phenomenon, and that optionally sounds an alarm or triggers a warning.","example":"Smoke detectors are mandatory in public buildings."}],"partOfSpeech":"n"}]},{"word":"NEWSGROUPS","idx":10281,"count":4834453,"meanings":[{"definitions":[{"definition":"A repository on a computer network where people can post messages, usually about a single subject."}],"partOfSpeech":"n"}]},{"word":"SHALLOW","idx":10282,"count":4834372,"meanings":[{"definitions":[{"definition":"A shallow portion of an otherwise deep body of water.","example":"The ship ran aground in an unexpected shallow."},{"definition":"A fish, the rudd."},{"definition":"A costermonger's barrow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make or become less deep."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having little depth; significantly less deep than wide.","example":"Saute the onions in a shallow pan."},{"definition":"Extending not far downward.","example":"The water is shallow here."},{"definition":"Concerned mainly with superficial matters.","example":"It was a glamorous but shallow lifestyle."},{"definition":"Lacking interest or substance.","example":"The acting is good, but the characters are shallow."},{"definition":"Not intellectually deep; not penetrating deeply; simple; not wise or knowing.","example":"shallow learning"},{"definition":"Not deep in tone."},{"definition":"Not far forward, close to the net."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shallow-us","text":"/ˈʃæl.oʊ/"}]},{"word":"STIR","idx":10283,"count":4833763,"meanings":[{"definitions":[{"definition":"The act or result of stirring (moving around the particles of a liquid etc.)","example":"Can you give the soup a little stir?"},{"definition":"Agitation; tumult; bustle; noise or various movements."},{"definition":"Public disturbance or commotion; tumultuous disorder; seditious uproar."},{"definition":"Agitation of thoughts; conflicting passions."},{"definition":"Jail; prison.","example":"He's going to be spending maybe ten years in stir."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To incite to action"},{"definition":"To disturb the relative position of the particles of, as of a liquid, by passing something through it; to agitate.","example":"She stirred the pudding with a spoon."},{"definition":"To agitate the content of (a container), by passing something through it.","example":"Would you please stand here and stir this pot so that the chocolate doesn't burn?"},{"definition":"To bring into debate; to agitate; to moot."},{"definition":"To change the place of in any manner; to move."},{"definition":"To move; to change one’s position."},{"definition":"To be in motion; to be active or bustling; to exert or busy oneself."},{"definition":"To become the object of notice; to be on foot."},{"definition":"To rise, or be up and about, in the morning."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stir-us","text":"/stɝ/"}]},{"word":"SPIKE","idx":10284,"count":4833410,"meanings":[{"definitions":[{"definition":"In a violin-family instrument, the carved wooden plug which sits in the bottom block of the instrument."},{"definition":"The spike of a cello or double bass that makes contact with the floor and supports the weight of the instrument."},{"definition":"A sort of very large nail."},{"definition":"A piece of pointed metal etc. set with points upward or outward.","example":"The trap was lined with spikes."},{"definition":"Anything resembling such a nail in shape."},{"definition":"An ear of corn or grain."},{"definition":"A kind of inflorescence in which sessile flowers are arranged on an unbranched elongated axis."},{"definition":"(chiefly in the plural) A running shoe with spikes in the sole to provide grip."},{"definition":"A sharp peak in a graph."},{"definition":"A surge in power or in the price of a commodity etc."},{"definition":"The long, narrow part of a high-heeled shoe that elevates the heel."},{"definition":"A long nail for storing papers by skewering them; (by extension) the metaphorical place where rejected newspaper articles are sent."},{"definition":"An attack from, usually, above the height of the net performed with the intent to send the ball straight to the floor of the opponent or off the hands of the opposing block."},{"definition":"An adolescent male deer."},{"definition":"The casual ward of a workhouse."},{"definition":"Spike lavender.","example":"oil of spike"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten with spikes, or long, large nails.","example":"to spike down planks"},{"definition":"To set or furnish with spikes."},{"definition":"To embed nails into (a tree) so that any attempt to cut it down will damage equipment or injure people."},{"definition":"To fix on a spike."},{"definition":"To discard; to decide not to publish or make public."},{"definition":"To increase sharply.","example":"Traffic accidents spiked in December when there was ice on the roads."},{"definition":"To covertly put alcohol or another intoxicating substance into a drink.","example":"She spiked my lemonade with vodka!"},{"definition":"To add a small amount of one substance to another.","example":"The water sample to be tested has been spiked with arsenic, antimony, mercury, and lead in quantities commonly found in industrial effluents."},{"definition":"To attack from, usually, above the height of the net with the intent to send the ball straight to the floor of the opponent or off the hands of the opposing block."},{"definition":"To render (a gun) unusable by driving a metal spike into its touch hole."},{"definition":"(football slang) To slam the football to the ground, usually in celebration of scoring a touchdown, or to stop expiring time on the game clock after snapping the ball as to save time for the losing team to attempt to score the tying or winning points."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spike-us","text":"/spaɪk/"}]},{"word":"PLATED","idx":10285,"count":4833142,"meanings":[{"definitions":[{"definition":"To cover the surface material of an object with a thin coat of another material, usually a metal.","example":"This ring is plated with a thin layer of gold."},{"definition":"To place the various elements of a meal on the diner's plate prior to serving.","example":"After preparation, the chef will plate the dish."},{"definition":"To score a run.","example":"The single plated the runner from second base."},{"definition":"To arm or defend with metal plates."},{"definition":"To beat into thin plates."},{"definition":"(travel industry) To specify which airline a ticket will be issued on behalf of.","example":"Tickets are normally plated on an itinerary's first international airline."},{"definition":"To categorise stamps based on their position on the original sheet, in order to reconstruct an entire sheet."},{"definition":"(particularly with early British stamps) to identify the printing plate used."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Covered with plates or scales."},{"definition":"Having a coating of a more precious metal."},{"definition":"Served on a plate.","example":"a plated meal"}],"partOfSpeech":"j"}]},{"word":"DRAWER","idx":10287,"count":4830969,"meanings":[{"definitions":[{"definition":"An open-topped box that can be slid in and out of the cabinet that contains it, used for storing clothing or other articles."},{"definition":"A side panel containing supplementary content."},{"definition":"Agent noun of draw; one who draws."},{"definition":"An artist who primarily makes drawings."},{"definition":"One who writes a bank draft, check/cheque, or promissory note."},{"definition":"A barman; a person who draws the beer from the taps."},{"definition":"Someone who taps palm sap for making toddy."},{"definition":"A wagoner or person who pushes underground tubs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"drawer-us","text":"/dɹɔɹ/"}]},{"word":"INGREDIENT","idx":10288,"count":4830835,"meanings":[{"definitions":[{"definition":"One of the substances present in a mixture, especially food."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ingredient-uk","text":"/ɪnˈɡɹiːdi.ənt/"}]},{"word":"SPECTRA","idx":10290,"count":4828972,"meanings":[{"definitions":[{"definition":"A range; a continuous, infinite, one-dimensional set, possibly bounded by extremes."},{"definition":"Specifically, a range of colours representing light (electromagnetic radiation) of contiguous frequencies; hence electromagnetic spectrum, visible spectrum, ultraviolet spectrum, etc."},{"definition":"The autism spectrum."},{"definition":"The pattern of absorption or emission of radiation produced by a substance when subjected to energy (radiation, heat, electricity, etc.)."},{"definition":"The set of eigenvalues of a matrix."},{"definition":"Of a bounded linear operator A, the set of scalar values λ such that the operator A—λI, where I denotes the identity operator, does not have a bounded inverse; intended as a generalisation of the linear algebra sense."},{"definition":"(abstract algebra) The set, denoted Spec(R), of all prime ideals of a given ring R, commonly augmented with a Zariski topology and considered as a topological space."},{"definition":"Specter, apparition."},{"definition":"The image of something seen that persists after the eyes are closed."}],"partOfSpeech":"n"}]},{"word":"LIFTING","idx":10291,"count":4828674,"meanings":[{"definitions":[{"definition":"To raise or rise.","example":"The fog eventually lifted, leaving the streets clear."},{"definition":"To steal."},{"definition":"To source directly without acknowledgement; to plagiarise."},{"definition":"To arrest (a person)."},{"definition":"To remove (a ban, restriction, etc.)."},{"definition":"To alleviate, to lighten (pressure, tension, stress, etc.)"},{"definition":"To cause to move upwards."},{"definition":"To lift weights; to weight-lift.","example":"She lifts twice a week at the gym."},{"definition":"To try to raise something; to exert the strength for raising or bearing."},{"definition":"To elevate or improve in rank, condition, etc.; often with up."},{"definition":"To bear; to support."},{"definition":"To collect, as moneys due; to raise."},{"definition":"To transform (a function) into a corresponding function in a different context."},{"definition":"To buy a security or other asset previously offered for sale."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action or process by which something is lifted; elevation"},{"definition":"Weightlifting; a form of exercise in which weights are lifted"},{"definition":"Plastic surgery for tightening facial tissues and improving the facial appearance"},{"definition":"Theft."},{"definition":"A certain operation on a measure space; see lifting theory."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lifting-us","text":"/ˈlɪft.ɪŋ/"}]},{"word":"CURTAIN","idx":10293,"count":4827869,"meanings":[{"definitions":[{"definition":"A piece of cloth covering a window, bed, etc. to offer privacy and keep out light."},{"definition":"A similar piece of cloth that separates the audience and the stage in a theater."},{"definition":"(by extension) The beginning of a show; the moment the curtain rises.","example":"He took so long to shave his head that we arrived 45 minutes after curtain and were denied late entry."},{"definition":"(fortifications) The flat area of wall which connects two bastions or towers; the main area of a fortified wall."},{"definition":"(also \"final curtain\") Death."},{"definition":"That part of a wall of a building which is between two pavilions, towers, etc."},{"definition":"A flag; an ensign."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover (a window) with a curtain; to hang curtains."},{"definition":"To hide, cover or separate as if by a curtain."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"curtain-us","text":"/ˈkɝtn̩/"},{"audio":"curtain-uk","text":"/ˈkɜːtn̩/"}]},{"word":"DISCLOSED","idx":10294,"count":4827564,"meanings":[{"definitions":[{"definition":"To open up, unfasten."},{"definition":"To uncover, physically expose to view."},{"definition":"To expose to the knowledge of others; to make known, state openly, reveal."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of wings) Expanded, spread; (of a winged creature) with its wings extended or spread."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disclosed"}]},{"word":"TACTICAL","idx":10296,"count":4826876,"meanings":[{"definitions":[{"definition":"A combinator of proof tactics."},{"definition":"A private war reenactment event involving mock battles or skirmishes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to tactics"},{"definition":"Of, or relating to military operations that are smaller or more local than strategic ones"},{"definition":"Adroit, skilful or ingenious"},{"definition":"Having a military appearance, typically with accessories such as a bipod, adjustable stock, detachable magazine or black coloration"}],"partOfSpeech":"j"}]},{"word":"PILOTS","idx":10297,"count":4826195,"meanings":[{"definitions":[{"definition":"A person who steers a ship, a helmsman."},{"definition":"A person who knows well the depths and currents of a harbor or coastal area, who is hired by a vessel to help navigate the harbor or coast."},{"definition":"A guide book for maritime navigation."},{"definition":"An instrument for detecting the compass error."},{"definition":"A pilot vehicle."},{"definition":"A person authorised to drive such a vehicle during an escort."},{"definition":"A guide or escort through an unknown or dangerous area."},{"definition":"Something serving as a test or trial.","example":"We would like to run a pilot in your facility before rolling out the program citywide."},{"definition":"A person who is in charge of the controls of an aircraft."},{"definition":"A sample episode of a proposed TV series produced to decide if it should be made or not. If approved, typically the first episode of an actual TV series."},{"definition":"A cowcatcher."},{"definition":"A pilot light."},{"definition":"One who flies a kite."},{"definition":"A short plug, sometimes made interchangeable, at the end of a counterbore to guide the tool."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To control (an aircraft or watercraft)."},{"definition":"To guide (a vessel) through coastal waters."},{"definition":"To test or have a preliminary trial of (an idea, a new product, etc.)"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpaɪləts/"}]},{"word":"MAILBOX","idx":10298,"count":4825513,"meanings":[{"definitions":[{"definition":"A box into which mail is put"},{"definition":"A folder or account for the storage of e-mail; an electronic in-box or mailstore."}],"partOfSpeech":"n"}]},{"word":"EXPEDITION","idx":10300,"count":4824834,"meanings":[{"definitions":[{"definition":"The act of expediting something; prompt execution."},{"definition":"A military journey; an enterprise against some enemy or into enemy territory."},{"definition":"The quality of being expedite; speed, quickness."},{"definition":"An important or long journey, for example a march or a voyage"},{"definition":"A trip, especially a long one, made by a person or a group of people for a specific purpose","example":"a naval expedition"},{"definition":"The group of people making such excursion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a trip or expedition; to travel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"expedition-us","text":"/ɛkspəˈdɪʃən/"}]},{"word":"PILE","idx":10301,"count":4824165,"meanings":[{"definitions":[{"definition":"A mass of things heaped together; a heap."},{"definition":"A group or list of related items up for consideration, especially in some kind of selection process.","example":"When we were looking for a new housemate, we put the nice woman on the \"maybe\" pile, and the annoying guy on the \"no\" pile"},{"definition":"A mass formed in layers.","example":"a pile of shot"},{"definition":"A funeral pile; a pyre."},{"definition":"A large amount of money.","example":"He made a pile from that invention of his."},{"definition":"A large building, or mass of buildings."},{"definition":"A bundle of pieces of wrought iron to be worked over into bars or other shapes by rolling or hammering at a welding heat; a fagot."},{"definition":"A vertical series of alternate disks of two dissimilar metals (especially copper and zinc), laid up with disks of cloth or paper moistened with acid water between them, for producing a current of electricity; a voltaic pile, or galvanic pile."},{"definition":"An atomic pile; an early form of nuclear reactor."},{"definition":"The reverse (or tails) of a coin."},{"definition":"A list or league"},{"definition":"A dart; an arrow."},{"definition":"The head of an arrow or spear."},{"definition":"A large stake, or piece of pointed timber, steel etc., driven into the earth or sea-bed for the support of a building, a pier, or other superstructure, or to form a cofferdam, etc."},{"definition":"One of the ordinaries or subordinaries having the form of a wedge, usually placed palewise, with the broadest end uppermost."},{"definition":"(usually in the plural) A hemorrhoid."},{"definition":"Hair, especially when very fine or short; the fine underfur of certain animals. (Formerly countable, now treated as a collective singular.)"},{"definition":"The raised hairs, loops or strands of a fabric; the nap of a cloth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(often used with the preposition \"up\") To lay or throw into a pile or heap; to heap up; to collect into a mass; to accumulate","example":"They were piling up wood on the wheelbarrow."},{"definition":"To cover with heaps; or in great abundance; to fill or overfill; to load.","example":"We piled the camel with our loads."},{"definition":"To add something to a great number."},{"definition":"(of vehicles) To create a hold-up."},{"definition":"To place (guns, muskets, etc.) together in threes so that they can stand upright, supporting each other."},{"definition":"To drive piles into; to fill with piles; to strengthen with piles."},{"definition":"To give a pile to; to make shaggy."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pile-us","text":"/paɪl/"}]},{"word":"OPERATIVE","idx":10302,"count":4823410,"meanings":[{"definitions":[{"definition":"An employee or other worker with some particular function or skill."},{"definition":"A spy, secret agent, or detective."},{"definition":"A participant in an operation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Effectual or important.","example":"He's usually in a good mood — the operative word there being \"usually\". Today was a disaster."},{"definition":"Functional, in working order."},{"definition":"Having the power of acting; hence, exerting force, physical or moral; active in the production of effects.","example":"an operative motive"},{"definition":"Producing the appropriate or designed effect; efficacious.","example":"an operative dose, rule, or penalty"},{"definition":"Based upon, or consisting of, a surgical operation or operations.","example":"operative surgery"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"operative-uk","text":"/ˈɒpəɹətɪv/"}]},{"word":"HUMOUR","idx":10303,"count":4821851,"meanings":[{"definitions":[{"definition":"The quality of being amusing, comical, funny.","example":"She has a great sense of humour, and I always laugh a lot whenever we get together."},{"definition":"A mood, especially a bad mood; a temporary state of mind or disposition brought upon by an event; an abrupt illogical inclination or whim.","example":"He was in a particularly vile humour that afternoon."},{"definition":"Any of the fluids in an animal body, especially the four \"cardinal humours\" of blood, yellow bile, black bile and phlegm that were believed to control the health and mood of the human body."},{"definition":"Either of the two regions of liquid within the eyeball, the aqueous humour and vitreous humour."},{"definition":"Moist vapour, moisture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pacify by indulging.","example":"I know you don't believe my story, but humour me for a minute and imagine it to be true."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"humour-us","text":"/ˈhjuːmɚ/"}]},{"word":"MATURITY","idx":10305,"count":4819555,"meanings":[{"definitions":[{"definition":"The state of being mature, ready or ripe.","example":"Some foods and drinks, like wine, only reach their full taste at maturity, which literally comes at a price"},{"definition":"When bodily growth has completed and/or reproduction can begin."},{"definition":"The state of a debt obligation at the end of the term of maturation thereof, once all interest and any applicable fees have accrued to the principal."},{"definition":"Date when payment is due.","example":"The note was cashed at maturity."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"maturity-us","text":"/məˈtʊəɹəti/"}]},{"word":"CALLER","idx":10306,"count":4818758,"meanings":[{"definitions":[{"definition":"The person who makes a telephone call.","example":"- I've got someone on the line."},{"definition":"A visitor.","example":"a gentleman caller"},{"definition":"(bingo) The person who stands at the front of the hall and announces the numbers."},{"definition":"A function that calls another (the callee)."},{"definition":"A whistle or similar item used to call foxes."},{"definition":"The person who directs dancers in certain dances, such as American line dances and square dances."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɔlɚ/"},{"text":"/ˈkɔːlə/"}]},{"word":"DISTORTION","idx":10308,"count":4818028,"meanings":[{"definitions":[{"definition":"An act of distorting."},{"definition":"A result of distorting."},{"definition":"A misrepresentation of the truth.","example":"The story he told was a bit of a distortion."},{"definition":"Noise or other artifacts caused in the electronic reproduction of sound or music.","example":"This recording sounds awful due to the distortion."},{"definition":"An effect used in music, most commonly on guitars in rock or metal."},{"definition":"(optics) an aberration that causes magnification to change over the field of view."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪsˈtɔːʃən/"}]},{"word":"PROSECUTION","idx":10309,"count":4817557,"meanings":[{"definitions":[{"definition":"The act of prosecuting a scheme or endeavor.","example":"The prosecution of the war fell to Winston Churchill."},{"definition":"The institution of legal proceedings (particularly criminal) against a person."},{"definition":"The prosecuting party."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌpɹɑ.səˈkju.ʃən/"}]},{"word":"HET","idx":10310,"count":4815974,"meanings":[{"definitions":[{"definition":"A heterosexual person."},{"definition":"Fan fiction based on celebrities or fictional characters involved in an opposite-sex romantic and/or sexual relationship."},{"definition":"Heterozygote"},{"definition":"The eighth letter of many Semitic alphabets (Phoenician, Aramaic, Hebrew, Syriac, Arabic and others)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Heterosexual."},{"definition":"Heated."},{"definition":"Heterozygous"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To cause an increase in temperature of (an object or space); to cause to become hot (often with \"up\").","example":"I'll heat up the water."},{"definition":"To become hotter.","example":"There's a pot of soup heating on the stove."},{"definition":"To excite or make hot by action or emotion; to make feverish."},{"definition":"To excite ardour in; to rouse to action; to excite to excess; to inflame, as the passions."},{"definition":"To arouse, to excite (sexually).","example":"The massage heated her up."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"het-us","text":"/hɛt/"}]},{"word":"LANDSCAPING","idx":10311,"count":4813258,"meanings":[{"definitions":[{"definition":"To create or maintain a landscape."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Improved land (trees, gardens, leveled ground, etc)."},{"definition":"The act of improving a landscape."}],"partOfSpeech":"n"}]},{"word":"TONGA","idx":10312,"count":4813052,"meanings":[{"definitions":[{"definition":"A light, two-wheeled, horse-drawn carriage used for transportation in India, Pakistan, and Bangladesh."},{"definition":"A drug useful in neuralgia, derived from a Fijian plant supposed to be of the aroid genus Epipremnum."}],"partOfSpeech":"n"}]},{"word":"MOL","idx":10313,"count":4813019,"meanings":[{"definitions":[{"definition":"In the International System of Units, the base unit of amount of substance; the amount of substance of a system which contains as many elementary entities (atoms, ions, molecules, etc.) as there are atoms in 0.012 kg of carbon-12. Symbol: mol. The number of atoms is known as Avogadro’s number."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mol-us","text":"/mol/"}]},{"word":"IMPRINT","idx":10314,"count":4812829,"meanings":[{"definitions":[{"definition":"An impression; the mark left behind by printing something.","example":"The day left an imprint in my mind."},{"definition":"The name and details of a publisher or printer, as printed in a book etc.; a publishing house."},{"definition":"A distinctive marking, symbol or logo.","example":"The shirts bore the company imprint on the right sleeve."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To leave a print, impression, image, etc.","example":"For a fee, they can imprint the envelopes with a monogram."},{"definition":"To learn something indelibly at a particular stage of life, such as who one's parents are."},{"definition":"To mark a gene as being from a particular parent so that only one of the two copies of the gene is expressed."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"imprint-1-us","text":"/ˈɪm.pɹɪnt/"},{"audio":"imprint-1-au","text":"/ˈɪm.pɹɪnt/"}]},{"word":"RECEIPTS","idx":10317,"count":4808150,"meanings":[{"definitions":[{"definition":"The act of receiving, or the fact of having been received.","example":"A balance payable on receipt of the goods."},{"definition":"The fact of having received a blow, injury etc."},{"definition":"(in the plural) A quantity or amount received; takings.","example":"This weekend's receipts alone cover our costs to mount the production!"},{"definition":"A written acknowledgment that a specified article or sum of money has been received."},{"definition":"(usually in the plural) (A piece of) evidence, documentation, etc. to prove one's past actions, accomplishments, etc."},{"definition":"(usually in the plural, by extension) (A piece of) evidence (e.g. documentation or screen captures) of past wrongdoing or problematic behavior or statements."},{"definition":"(archaic in New England and rural US since end of 20th century, elsewhere since middle of 20th century) A recipe, instructions, prescription."},{"definition":"A receptacle."},{"definition":"A revenue office."},{"definition":"Reception, as an act of hospitality."},{"definition":"Capability of receiving; capacity."},{"definition":"A recess; a retired place."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give or write a receipt (for something).","example":"to receipt delivered goods"},{"definition":"To put a receipt on, as by writing or stamping; to mark a bill as having been paid.","example":"to receipt a bill"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"receipts-us"}]},{"word":"ASSISTING","idx":10318,"count":4807753,"meanings":[{"definitions":[{"definition":"To help.","example":"This book will assist you in getting your life in order."},{"definition":"To make a pass that leads directly towards scoring."},{"definition":"To help compensate for what is missing with the help of a medical technique or therapy."},{"definition":"To stand (at a place) or to (an opinion).","example":"A great part of the nobility assisted to his opinion."},{"definition":"To be present (at an event, occasion etc.)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Assistance; help given"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Helpful; auxiliary (to)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"assisting-us","text":"/əˈsɪstɪŋ/"}]}]