[{"word":"GENERATOR","idx":5061,"count":13041439,"meanings":[{"definitions":[{"definition":"One who, or that which, generates, begets, causes, or produces."},{"definition":"A piece of apparatus, equipment, etc, to convert or change energy from one form to another."}],"partOfSpeech":"n"}]},{"word":"EXAMINE","idx":5063,"count":13030604,"meanings":[{"definitions":[{"definition":"To observe or inspect carefully or critically","example":"He examined the crime scene for clues."},{"definition":"To check the health or condition of something or someone","example":"The doctor examined the patient."},{"definition":"To determine the aptitude, skills or qualifications of someone by subjecting them to an examination"},{"definition":"To interrogate","example":"The witness was examined under oath."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/examine-us.mp3","text":"/ɪɡˈzæmɪn/"}]},{"word":"JIMMY","idx":5064,"count":13030009,"meanings":[{"definitions":[{"definition":"(especially New England and Philadelphia) Chocolate sprinkles used as a topping for ice cream, cookies, or cupcakes."},{"definition":"A marijuana cigarette."},{"definition":"A device used to circumvent a locking mechanism; a slim jim."},{"definition":"(Royal Navy) First Lieutenant (Executive Officer)"},{"definition":"A jemmy; a crowbar used by burglars to open windows and doors."},{"definition":"A penis."},{"definition":"A condom."},{"definition":"(SE) Men's underwear."},{"definition":"A male crab; a cock."},{"definition":"A coal-car."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pry (something, especially a lock) open with or as if with a crowbar."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/jimmy-us.mp3","text":"/ˈdʒɪmi/"}]},{"word":"GRAHAM","idx":5065,"count":13026222,"meanings":[{"definitions":[{"definition":"Flour made by grinding wheat berries including the bran."},{"definition":"A graham cracker."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡɹæm/"}]},{"word":"SUSPENSION","idx":5066,"count":13025162,"meanings":[{"definitions":[{"definition":"The act of suspending, or the state of being suspended.","example":"suspension from a hook"},{"definition":"A temporary or conditional delay, interruption or discontinuation."},{"definition":"The state of a solid or substance produced when its particles are mixed with, but not dissolved in, a fluid, and are capable of separation by straining."},{"definition":"The act of keeping a person who is listening in doubt and expectation of what is to follow."},{"definition":"The temporary barring of a person from a workplace, society, etc. pending investigation into alleged misconduct."},{"definition":"The process of barring a student from school grounds as a form of punishment (particularly out-of-school suspension).","example":"suspension from school as a disciplinary measure"},{"definition":"The act of or discord produced by prolonging one or more tones of a chord into the chord which follows, thus producing a momentary discord, suspending the concord which the ear expects."},{"definition":"A stay or postponement of the execution of a sentence, usually by letters of suspension granted on application to the Lord Ordinary."},{"definition":"A topological space derived from another by taking the product of the original space with an interval and collapsing each end of the product to a point."},{"definition":"A function derived, in a standard way, from another, such that the instant function's domain and codomain are suspensions of the original function's."},{"definition":"The system of springs and shock absorbers connected to the wheels in an automobile, which allows the vehicle to move smoothly with reduced shock to its occupants."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˈspɛnʃən/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/suspension-au.mp3"}]},{"word":"SAD","idx":5070,"count":13010129,"meanings":[{"definitions":[{"definition":"To make melancholy; to sadden or grieve (someone)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(heading) Emotionally negative."},{"definition":"Sated, having had one's fill; satisfied, weary."},{"definition":"Steadfast, valiant."},{"definition":"Dignified, serious, grave."},{"definition":"Naughty; troublesome; wicked."},{"definition":"Unfashionable; socially inadequate or undesirable.","example":"I can't believe you use drugs; you're so sad!"},{"definition":"Soggy (to refer to pastries)."},{"definition":"Heavy; weighty; ponderous; close; hard.","example":"sad bread"}],"partOfSpeech":"j"},{"definitions":[{"definition":"The letter ص in the Arabic script."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/sad-1-us.mp3","text":"/sæd/"}]},{"word":"CORRECTION","idx":5071,"count":13009622,"meanings":[{"definitions":[{"definition":"The act of correcting."},{"definition":"A substitution for an error or mistake."},{"definition":"Punishment that is intended to rehabilitate an offender."},{"definition":"An amount or quantity of something added or subtracted so as to correct."},{"definition":"A decline in a stock market price after a large rise."},{"definition":"(procedure word, military) a station's indication that previous information was incorrect and will continue with correct information from the last correct transmitted","example":"I have four T-80 tanks at grid Three-niner-niner-four-eight-eight, Correction: Grid Three niner-niner-four-eight-five. How copy? Over."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/correction-us.mp3","text":"/kəˈɹɛkʃən/"}]},{"word":"WOLF","idx":5072,"count":13001992,"meanings":[{"definitions":[{"definition":"The gray wolf, specifically all subspecies of the gray wolf (Canis lupus) that are not dingoes or dogs.","example":"Check out my pet. He's a wolf."},{"definition":"A man who makes amorous advances to many women."},{"definition":"A wolf tone or wolf note.","example":"The soft violin solo was marred by persistent wolves."},{"definition":"Any very ravenous, rapacious, or destructive person or thing; especially, want; starvation.","example":"They toiled hard to keep the wolf from the door."},{"definition":"One of the destructive, and usually hairy, larvae of several species of beetles and grain moths."},{"definition":"A white worm, or maggot, which infests granaries."},{"definition":"An eating ulcer or sore. See lupus."},{"definition":"A willying machine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To devour; to gobble; to eat (something) voraciously."},{"definition":"To make amorous advances to many women; to hit on women; to cruise for sex."},{"definition":"To hunt for wolves."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/wolf-us.mp3","text":"/wʊlf/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/wolf-uk.mp3","text":"/wʊlf/"}]},{"word":"SLOWLY","idx":5073,"count":13000552,"meanings":[{"definitions":[{"definition":"(manner) At a slow pace."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/slowly-us.mp3","text":"/ˈsloʊli/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/slowly-uk.mp3","text":"/ˈsləʊli/"}]},{"word":"AUTHENTICATION","idx":5074,"count":12998105,"meanings":[{"definitions":[{"definition":"Something which validates or confirms the authenticity of something"},{"definition":"Proof of the identity of a user logging on to some network"},{"definition":"A hallmark or assay-mark on a piece of metalwork"}],"partOfSpeech":"n"}]},{"word":"COMMUNICATE","idx":5075,"count":12992824,"meanings":[{"definitions":[{"definition":"To impart"},{"definition":"To share"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/communicate-us.mp3","text":"/kəˈmjuːnɪkeɪt/"}]},{"word":"RUGBY","idx":5076,"count":12992179,"meanings":[{"definitions":[{"definition":"(usually uncountable) A form of football in which players can hold or kick an ovoid ball. The ball cannot be handled forwards and points are scored by touching the ball to the ground in the area past their opponent’s territory or kicking the ball between goalposts and over a crossbar.","example":"The scrum is a distinctive element of rugby."},{"definition":"A loose fitting shirt with a collar, as worn by rugby players."},{"definition":"Rubber cement, contact cement."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/rugby-us.mp3","text":"/ˈɹʌɡbi/"}]},{"word":"SUPPLEMENT","idx":5077,"count":12988231,"meanings":[{"definitions":[{"definition":"Something added, especially to make up for a deficiency."},{"definition":"An extension to a document or publication that adds information, corrects errors or brings up to date."},{"definition":"An additional section of a newspaper devoted to a specific subject."},{"definition":"An angle that, when added to a given angle, makes 180°; a supplementary angle."},{"definition":"(nutrition) A vitamin, herbal extract or chemical compound ingested to meet dietary deficiencies or enhance muscular development."},{"definition":"An additional charge, especially for food in a restaurant.","example":"There is a £2 supplement if you choose the steak."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide or make a supplement to something."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsʌpləmənt/"}]},{"word":"SHOWTIMES","idx":5078,"count":12978770,"meanings":[{"definitions":[{"definition":"The time at which an entertainment event is set to begin."},{"definition":"The time for action."}],"partOfSpeech":"n"}]},{"word":"CAL","idx":5079,"count":12967326,"meanings":[{"definitions":[{"definition":"Diameter of the bore of a firearm, typically measured between opposite lands."},{"definition":"The diameter of round or cylindrical body, as of a bullet, a projectile, or a column."},{"definition":"A nominal name for a cartridge type, which may not exactly indicate its true size and may include other measurements such as cartridge length or black powder capacity. Eg 7.62×39 or 38.40."},{"definition":"Unit of measure used to express the length of the bore of a weapon. The number of calibres is determined by dividing the length of the bore of the weapon, from the breech face of the tube to the muzzle, by the diameter of its bore. A gun tube the bore of which is 40 feet (480 inches) long and 12 inches in diameter is said to be 40 calibers long."},{"definition":"Relative size, importance, magnitude."},{"definition":"Capacity or compass of mind."},{"definition":"Degree of importance or station in society."},{"definition":"(nutrition) Kilogram calorie or large calorie. A unit of energy 1000 times larger than the gram calorie. It is equivalent to the gram kilocalorie, approximately 4.2 kilojoules."},{"definition":"The gram calorie or small calorie, a non-SI unit of energy, equivalent to approximately 4.2 joules. This unit was widely used in chemistry and physics, being the amount of energy needed to raise the temperature of 1 gram of water by 1 °C."},{"definition":"Wolfram, an ore of tungsten"},{"definition":"Calcium hydroxide, slaked lime"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kæl/"}]},{"word":"PORTIONS","idx":5080,"count":12963319,"meanings":[{"definitions":[{"definition":"An allocated amount."},{"definition":"That which is divided off or separated, as a part from a whole; a separated part of anything."},{"definition":"One's fate; lot."},{"definition":"The part of an estate given or falling to a child or heir; an inheritance."},{"definition":"A wife's fortune; a dowry."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/portions-us.mp3","text":"/ˈpɔɹʃənz/"}]},{"word":"INFANT","idx":5081,"count":12959639,"meanings":[{"definitions":[{"definition":"A very young human being, from birth to somewhere between six months and two years of age, needing almost constant care and/or attention."},{"definition":"A minor."},{"definition":"A noble or aristocratic youth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bear or bring forth (a child); to produce, in general."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/infant-us.mp3","text":"/ˈɪn.fənt/"}]},{"word":"PROMOTING","idx":5082,"count":12956304,"meanings":[{"definitions":[{"definition":"To raise (someone) to a more important, responsible, or remunerative job or rank.","example":"He promoted his clerk to office manager."},{"definition":"To advocate or urge on behalf of (something or someone); to attempt to popularize or sell by means of advertising or publicity.","example":"They promoted the abolition of daylight saving time."},{"definition":"To encourage, urge or incite."},{"definition":"(usually in passive form) To elevate to a higher league.","example":"At the end of the season, three teams are promoted to the Premier League."},{"definition":"To increase the activity of (a catalyst) by changing its surface structure."},{"definition":"To exchange (a pawn) for a queen or other piece when it reaches the eighth rank.","example":"Having crossed the chessboard, his pawn was promoted to a queen."},{"definition":"To move on to a subsequent stage of education.","example":"At the end of Primary 6 students can promote directly to the secondary section of SIS."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/promoting-us.mp3","text":"/pɹəˈmoʊtɪŋ/"}]},{"word":"SECTORS","idx":5083,"count":12948547,"meanings":[{"definitions":[{"definition":"Section"},{"definition":"Zone (designated area)."},{"definition":"Part of a circle, extending to the center"},{"definition":"Fixed-sized unit (traditionally 512 bytes) of sequential data stored on a track of a digital medium (compare to block)"},{"definition":"An area designated by boundaries within which a unit operates, and for which it is responsible"},{"definition":"One of the subdivisions of a coastal frontier"},{"definition":"A fictional region of space designated for navigational or governance purposes."},{"definition":"(calculation) an instrument consisting of two rulers of equal length joined by a hinge."},{"definition":"A field of economic activity","example":"public sector;  private sector"},{"definition":"A toothed gear whose face is the arc of a circle."},{"definition":"A fixed, continuous section of the track, such that sectors do not overlap but all sectors make up the whole track."}],"partOfSpeech":"n"}]},{"word":"FLUID","idx":5085,"count":12943336,"meanings":[{"definitions":[{"definition":"Any substance which can flow with relative ease, tends to assume the shape of its container, and obeys Bernoulli's principle; a liquid, gas or plasma."},{"definition":"A liquid (as opposed to a solid or gas)."},{"definition":"(specifically, typically in the plural) Intravenous fluids."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to fluid."},{"definition":"In a state of flux; subject to change."},{"definition":"Moving smoothly, or giving the impression of a liquid in motion."},{"definition":"(of an asset) Convertible into cash."},{"definition":"Genderfluid."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/fluid-us.mp3","text":"/ˈfluːɪd/"}]},{"word":"GROUNDS","idx":5086,"count":12943233,"meanings":[{"definitions":[{"definition":"The surface of the Earth, as opposed to the sky or water or underground.","example":"Look, I found a ten dollar bill on the ground!"},{"definition":"Terrain."},{"definition":"Soil, earth.","example":"The fox escaped from the hounds by going to ground."},{"definition":"The bottom of a body of water."},{"definition":"Basis, foundation, groundwork, legwork."},{"definition":"(chiefly in the plural) Reason, (epistemic) justification, cause.","example":"He could not come on grounds of health, or on health grounds."},{"definition":"Background, context, framework, surroundings."},{"definition":"The area on which a battle is fought, particularly as referring to the area occupied by one side or the other. Often, according to the eventualities, \"to give ground\" or \"to gain ground\"."},{"definition":"(by extension) Advantage given or gained in any contest; e.g. in football, chess, debate or academic discourse."},{"definition":"The plain surface upon which the figures of an artistic composition are set.","example":"crimson flowers on a white ground"},{"definition":"In sculpture, a flat surface upon which figures are raised in relief."},{"definition":"In point lace, the net of small meshes upon which the embroidered pattern is applied.","example":"Brussels ground"},{"definition":"In etching, a gummy substance spread over the surface of a metal to be etched, to prevent the acid from eating except where an opening is made by the needle."},{"definition":"(chiefly in the plural) One of the pieces of wood, flush with the plastering, to which mouldings etc. are attached.","example":"Grounds are usually put up first and the plastering floated flush with them."},{"definition":"A soccer stadium.","example":"Manchester United's ground is known as Old Trafford."},{"definition":"An electrical conductor connected to the earth, or a large conductor whose electrical potential is taken as zero (such as a steel chassis)."},{"definition":"The area of grass on which a match is played (a cricket field); the entire arena in which it is played; the part of the field behind a batsman's popping crease where he can not be run out (hence to make one's ground)."},{"definition":"A composition in which the bass, consisting of a few bars of independent notes, is continually repeated to a varying melody."},{"definition":"The tune on which descants are raised; the plain song."},{"definition":"The pit of a theatre."},{"definition":"Basis or justification for something.","example":"grounds for divorce"},{"definition":"The collective land areas that compose a larger area.","example":"the castle grounds"},{"definition":"The sediment at the bottom of a liquid, or from which a liquid has been filtered."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To connect (an electrical conductor or device) to a ground."},{"definition":"To punish, especially a child or teenager, by forcing him/her to stay at home and/or give up certain privileges.","example":"Eric, you are grounded until further notice for lying to us about where you were last night!"},{"definition":"To forbid (an aircraft or pilot) to fly.","example":"Because of the bad weather, all flights were grounded."},{"definition":"To give a basic education in a particular subject; to instruct in elements or first principles.","example":"Jim was grounded in maths."},{"definition":"To hit a ground ball. Compare fly (verb(regular)) and line (verb)."},{"definition":"To place something on the ground."},{"definition":"To run aground; to strike the bottom and remain fixed.","example":"The ship grounded on the bar."},{"definition":"To found; to fix or set, as on a foundation, reason, or principle; to furnish a ground for; to fix firmly."},{"definition":"To cover with a ground, as a copper plate for etching, or as paper or other materials with a uniform tint as a preparation for ornament."},{"definition":"To improve or focus the mental or emotional state of.","example":"I ground myself with meditation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/grounds-us.mp3","text":"/ɡɹaʊndz/"}]},{"word":"FITS","idx":5087,"count":12942004,"meanings":[{"definitions":[{"definition":"The degree to which something fits.","example":"Since he put on weight, his jeans have been a tight fit."},{"definition":"Conformity of elements one to another.","example":"It's hard to get a good fit using second-hand parts."},{"definition":"The part of an object upon which anything fits tightly."},{"definition":"Measure of how well a particular commercial execution captures the character or values of a brand.","example":"The Wonder Bread advertising research results showed the “White Picket Fence” commercial had strong fit ratings."},{"definition":"Goodness of fit."},{"definition":"The quality of a partnership's combined holding of cards in a suit, particularly of trump.","example":"During the auction, it is often a partnership's goal to find an eight-card major suit fit."},{"definition":"A section of a poem or ballad."},{"definition":"A seizure or convulsion.","example":"My grandfather died after having a fit."},{"definition":"A sudden and vigorous appearance of a symptom over a short period of time."},{"definition":"A sudden outburst of emotion.","example":"He had a laughing fit which lasted more than ten minutes."},{"definition":"A sudden burst (of an activity)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be suitable for.","example":"It fits the purpose."},{"definition":"To conform to in size and shape.","example":"If I lose a few kilos, the gorgeous wedding dress might fit me."},{"definition":"To be of the right size and shape","example":"I wanted to borrow my little sister's jeans, but they didn't fit."},{"definition":"(with to) To make conform in size and shape.","example":"I want to fit the drapes to the windows."},{"definition":"To be in agreement with.","example":"These definitions fit most of the usage."},{"definition":"To adjust.","example":"The regression program fit a line to the data."},{"definition":"To attach, especially when requiring exact positioning or sizing."},{"definition":"To equip or supply.","example":"The chandler will fit us with provisions for a month."},{"definition":"To make ready.","example":"I'm fitting the ship for a summer sail home."},{"definition":"To be seemly."},{"definition":"To be proper or becoming."},{"definition":"To be in harmony.","example":"The paint, the fabrics, the rugs all fit."},{"definition":"To suffer a fit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/fits-us.mp3","text":"/fɪts/"}]},{"word":"KICK","idx":5088,"count":12941649,"meanings":[{"definitions":[{"definition":"A hit or strike with the leg, foot or knee.","example":"A kick to the knee."},{"definition":"The action of swinging a foot or leg.","example":"The ballerina did a high kick and a leap."},{"definition":"Something that tickles the fancy; something fun or amusing.","example":"I finally saw the show. What a kick!"},{"definition":"The removal of a person from an online activity."},{"definition":"Any bucking motion of an object that lacks legs or feet.","example":"The car had a nasty kick the whole way."},{"definition":"Piquancy."},{"definition":"A stimulation provided by an intoxicating substance."},{"definition":"A pass played by kicking with the foot."},{"definition":"The distance traveled by kicking the ball.","example":"a long kick up the field."},{"definition":"A recoil of a gun."},{"definition":"Pocket."},{"definition":"An increase in speed in the final part of a running race."},{"definition":"One who kicks."},{"definition":"One who takes kicks."},{"definition":"The kicking strap."},{"definition":"An outboard motor."},{"definition":"An unexpected situation, detail or circumstance, often unpleasant.","example":"John wants to climb the wall, but the kicker is that it is thirty feet tall."},{"definition":"An enticement for investors, e.g. warranty added to the investment contract."},{"definition":"An unpaired card which is part of a pair, two pair, or three of a kind poker hand.","example":"Jill's hand was two pair, aces and sevens, with a king kicker."},{"definition":"Small text above a headline that indicates the topic of the story."},{"definition":"The last one or two paragraphs of a story."},{"definition":"A lighthearted or humorous item used to round off a news broadcast."},{"definition":"A device that periodically displaces a newspaper from the print production line, to aid in gathering the newspapers into fixed-size bundles."},{"definition":"A launch ramp."},{"definition":"The fermenting mass of fruit that is the basis of pruno, or \"prison wine\"."},{"definition":"A relaxed party."},{"definition":"A backlight positioned at an angle."},{"definition":"A particular type of Texan who is associated with country/western attire, attitudes and/or philosophy."},{"definition":"An introduction; something that leads into the beginning of something.","example":"After the long lead-in, the climax of the story was a disappointment."},{"definition":"A region of data at the beginning of a compact disc, holding the table of contents."},{"definition":"A short phrase that begins the caption of a photograph."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike or hit with the foot or other extremity of the leg.","example":"Did you kick your brother?"},{"definition":"To make a sharp jerking movement of the leg, as to strike something.","example":"He enjoyed the simple pleasure of watching the kickline kick."},{"definition":"To direct to a particular place by a blow with the foot or leg.","example":"Kick the ball into the goal."},{"definition":"(with \"off\" or \"out\") To eject summarily."},{"definition":"To forcibly remove a participant from an online activity.","example":"He was kicked by ChanServ for flooding."},{"definition":"To overcome (a bothersome or difficult issue or obstacle); to free oneself of (a problem).","example":"I still smoke, but they keep telling me to kick the habit."},{"definition":"To move or push suddenly and violently.","example":"He was kicked sideways by the force of the blast."},{"definition":"(of a firearm) To recoil; to push by recoiling."},{"definition":"To attack (a piece) in order to force it to move."},{"definition":"To accelerate quickly with a few pedal strokes in an effort to break away from other riders.","example":"Contador kicks again to try to rid himself of Rasmussen."},{"definition":"To show opposition or resistance."},{"definition":"To work a press by impact of the foot on a treadle."},{"definition":"To die."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/kick-us.mp3","text":"/kɪk/"}]},{"word":"REGARDS","idx":5089,"count":12939920,"meanings":[{"definitions":[{"definition":"A steady look, a gaze."},{"definition":"One's concern for another; esteem; relation, reference."},{"definition":"(preceded by “in” or “with”) A particular aspect or detail; respect, sense."},{"definition":"The worth or estimation in which something or someone is held.","example":"He is held in great regard in Whitehall."},{"definition":"Good wishes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look at; to observe.","example":"She regarded us warily."},{"definition":"To consider, look upon (something) in a given way etc.","example":"He regards honesty as a duty."},{"definition":"To take notice of, pay attention to."},{"definition":"To face toward."},{"definition":"To have to do with, to concern.","example":"That argument does not regard the question."},{"definition":"To set store by (something), to hold (someone) in esteem; to consider to have value, to respect."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/regards-us.mp3","text":"/ɹɪˈɡɑɹdz/"}]},{"word":"MEAL","idx":5090,"count":12937343,"meanings":[{"definitions":[{"definition":"Food that is prepared and eaten, usually at a specific time, and usually in a comparatively large quantity (as opposed to a snack).","example":"Breakfast is the morning meal, lunch is the noon meal, and dinner, or supper, is the evening meal."},{"definition":"Food served or eaten as a repast."},{"definition":"A time or an occasion."},{"definition":"The coarse-ground edible part of various grains often used to feed animals; flour or a coarser blend than flour."},{"definition":"A speck or spot."},{"definition":"A part; a fragment; a portion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To yield or be plentiful in meal."},{"definition":"To defile or taint."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/meal-us.mp3","text":"[miːʟ̩]"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/meal-uk.mp3","text":"/miːl/"}]},{"word":"TA","idx":5091,"count":12936942,"meanings":[{"definitions":[{"definition":"Thanks.","example":"Ta for the cup of tea."},{"definition":"(baby talk) give (imperative)","example":"Mommy needs the bottle back. Ta!"}],"partOfSpeech":"i"},{"definitions":[{"definition":"Indicating destination: In the direction of, and arriving at.","example":"We are walking to the shop."},{"definition":"Used to indicate the target or recipient of an action.","example":"He devoted himself to education."},{"definition":"Used to indicate result of action.","example":"His face was beaten to a pulp."},{"definition":"Used to indicate a resulting feeling or emotion.","example":"To everyone's great relief, the tuneless carol singers finally ceased their warbling."},{"definition":"Used after an adjective to indicate its application.","example":"similar to ..., relevant to ..., pertinent to ..., I was nice to him, he was cruel to her, I am used to walking."},{"definition":"Denotes the end of a range.","example":"It takes 2 to 4 weeks to process typical applications."},{"definition":"As a.","example":"With God to friend (with God as a friend);   with The Devil to fiend (with the Devil as a foe);   lambs slaughtered to lake (lambs slaughtered as a sacrifice);   took her to wife (took her as a wife);   was sold to slave (was sold as a slave)."},{"definition":"Used to indicate a ratio or comparison.","example":"I have ten dollars to your four."},{"definition":"Used to indicate that the preceding term is to be raised to the power of the following value; indicates exponentiation.","example":"Three squared or three to the second power is nine."},{"definition":"(time) Preceding.","example":"ten to ten = 9:50; We're going to leave at ten to (the hour)."},{"definition":"Used to describe what something consists of or contains.","example":"Anyone could do this job; there's nothing to it."},{"definition":"At.","example":"Stay where you're to and I'll come find you, b'y."}],"partOfSpeech":"pr"},{"definitions":[{"definition":"In solfège, the lowered seventh note of a major scale (the note B-flat in the fixed-do system): te."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/ta-1-au.mp3","text":"/tɑː/"}]},{"word":"HURT","idx":5092,"count":12936269,"meanings":[{"definitions":[{"definition":"An emotional or psychological humiliation or bad experience.","example":"how to overcome old hurts of the past"},{"definition":"A bodily injury causing pain; a wound or bruise."},{"definition":"Injury; damage; detriment; harm"},{"definition":"A roundel azure (blue circular spot)."},{"definition":"A band on a trip-hammer helve, bearing the trunnions."},{"definition":"A husk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be painful.","example":"Does your leg still hurt? / It is starting to feel better."},{"definition":"To cause (a creature) physical pain and/or injury.","example":"If anybody hurts my little brother, I will get upset."},{"definition":"To cause (somebody) emotional pain."},{"definition":"To undermine, impede, or damage.","example":"This latest gaffe hurts the legislator’s reelection prospects still further."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Wounded, physically injured."},{"definition":"Pained."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/hurt-us.mp3","text":"/hɝt/"}]},{"word":"MACHINERY","idx":5093,"count":12936031,"meanings":[{"definitions":[{"definition":"The machines constituting a production apparatus, in a plant etc., collectively."},{"definition":"The working parts of a machine as a group."},{"definition":"The collective parts of something which allow it to function."},{"definition":"The literary devices used in a work, notably for dramatic effect"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/machinery-us.mp3","text":"/məˈʃiːnəɹi/"}]},{"word":"BANDWIDTH","idx":5094,"count":12935437,"meanings":[{"definitions":[{"definition":"The width, usually measured in hertz, of a frequency band."},{"definition":"Of a signal, the width of the smallest frequency band within which the signal can fit."},{"definition":"The rate of data flow in digital networks typically measured in bits per second; the bitrate."},{"definition":"The capacity, energy or time required.","example":"I think it's a worthy project, but I just don't have the bandwidth right now."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbændwɪdθ/"}]},{"word":"UNLIKE","idx":5095,"count":12933815,"meanings":[{"definitions":[{"definition":"Something that is not like something else; something different."},{"definition":"The act of withdrawing one's like from a post on social media."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not like; dissimilar (to); having no resemblance.","example":"The brothers are quite unlike each other."},{"definition":"Unequal.","example":"They contributed in unlike amounts."},{"definition":"Not likely; improbable; unlikely."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Differently from; not in a like or similar manner."},{"definition":"In contrast with; as opposed to."},{"definition":"Not typical of one's character or personality.","example":"Being late is unlike him."}],"partOfSpeech":"pr"},{"definitions":[{"definition":"To dislike."},{"definition":"To withdraw support for a particular thing, especially on social networking websites.","example":"I unliked the post after I found out the author was racist."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/unlike-us.mp3","text":"/ʌnˈlaɪk/"}]},{"word":"EQUATION","idx":5096,"count":12933641,"meanings":[{"definitions":[{"definition":"The act or process of equating two or more things, or the state of those things being equal (that is, identical).","example":"We need to bring the balance of power into equation"},{"definition":"An assertion that two expressions are equal, expressed by writing the two expressions separated by an equal sign; from which one is to determine a particular quantity."},{"definition":"A small correction to observed values to remove the effects of systematic errors in an observation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/equation-us.mp3","text":"/ɪˈkweɪʃən/"}]},{"word":"BASKETS","idx":5097,"count":12933398,"meanings":[{"definitions":[{"definition":"A lightweight container, generally round, open at the top, and tapering toward the bottom.","example":"A basket of fake fruit adorned the table."},{"definition":"A wire or plastic container similar in shape to a basket, used for carrying articles for purchase in a shop."},{"definition":"In an online shop, a notional place to store items before ordering them."},{"definition":"A circular hoop, from which a net is suspended, which is the goal through which the players try to throw the ball.","example":"The point guard drove toward the basket."},{"definition":"The act of putting the ball through the basket, thereby scoring points.","example":"The last-second basket sealed the victory."},{"definition":"The game of basketball.","example":"Let's play some basket."},{"definition":"A dance movement in some line dances, where men put their arms round the women's lower backs, and the women put their arms over the mens' shoulders, and the group (usually of four, any more is difficult) spins round, which should result in the women's feet leaving the ground."},{"definition":"The bulge of the male genitals seen through clothing."},{"definition":"In a stage-coach, two outside seats facing each other."},{"definition":"A protection for the hand on a sword or a singlestick; a guard of a bladed weapon."},{"definition":"(ballooning) The gondola or wicker basket suspended from the balloon, in which the pilot and passengers travel."},{"definition":"The bell or vase of the Corinthian capital."},{"definition":"Bastard.","example":"Wait till I catch you, you little basket!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place in a basket or baskets."},{"definition":"To cross-collateralize the royalty advances for multiple works so that the creator is not paid until all of those works have achieved a certain level of success."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/baskets.mp3"}]},{"word":"PROBABILITY","idx":5098,"count":12929028,"meanings":[{"definitions":[{"definition":"The state of being probable; likelihood."},{"definition":"An event that is likely to occur."},{"definition":"The relative likelihood of an event happening."},{"definition":"A number, between 0 and 1, expressing the precise likelihood of an event happening.","example":"The probability of an event A occurring is denoted P(A)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/probability-us.mp3","text":"/pɹɑbəˈbɪlɪɾi/"}]},{"word":"POT","idx":5099,"count":12927383,"meanings":[{"definitions":[{"definition":"A flat-bottomed vessel (usually metal) used for cooking food."},{"definition":"Various similar open-topped vessels, particularly"},{"definition":"Pothole, sinkhole, vertical cave e.g. Rowten Pot"},{"definition":"Ruin or deterioration.","example":"After his arrest, his prospects went to pot."},{"definition":"An iron hat with a broad brim worn as a helmet."},{"definition":"A pot-shaped non-conducting (usually ceramic) stand that supports an electrified rail while insulating it from the ground."},{"definition":"The money available to be won in a hand of poker or a round of other games of chance; any sum of money being used as an enticement."},{"definition":"A favorite: a heavily-backed horse."},{"definition":"A plaster cast."},{"definition":"Marijuana"},{"definition":"A simple electromechanical device used to control resistance or voltage (often to adjust sound volume) in an electronic device by rotating or sliding when manipulated by a human thumb, screwdriver, etc."},{"definition":"A large, swollen, or protruding abdomen; a paunch."},{"definition":"A potbelly stove."},{"definition":"A Vietnamese Pot-bellied pig."},{"definition":"A small portion or dose of a liquid which is medicinal, poisonous, or magical.","example":"He hoped to win the princess's heart by mixing the love potion the witch gave him into her drink."},{"definition":"A shot taken at an easy or random target."},{"definition":"Criticism of an easy target; a cheap shot."},{"definition":"An old size of paper, 12.5 × 15 inches.","example":"pott paper"},{"definition":"Marijuana"},{"definition":"A simple electromechanical device used to control resistance or voltage (often to adjust sound volume) in an electronic device by rotating or sliding when manipulated by a human thumb, screwdriver, etc."},{"definition":"A small portion or dose of a liquid which is medicinal, poisonous, or magical.","example":"He hoped to win the princess's heart by mixing the love potion the witch gave him into her drink."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put (something) into a pot.","example":"to pot a plant"},{"definition":"To preserve by bottling or canning.","example":"potted meat"},{"definition":"To cause a ball to fall into a pocket."},{"definition":"To be capable of being potted.","example":"The black ball doesn't pot; the red is in the way."},{"definition":"To shoot with a firearm."},{"definition":"To take a pot shot, or haphazard shot, with a firearm."},{"definition":"To secure; gain; win; bag."},{"definition":"To send someone to gaol, expeditiously."},{"definition":"To tipple; to drink."},{"definition":"To drain (e.g. sugar of the molasses) in a perforated cask."},{"definition":"To seat a person, usually a young child, on a potty or toilet, typically during toilet teaching."},{"definition":"To apply a plaster cast to a broken limb."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pot-us.mp3","text":"/pɑt/"}]},{"word":"DIMENSION","idx":5100,"count":12925504,"meanings":[{"definitions":[{"definition":"A single aspect of a given thing."},{"definition":"A measure of spatial extent in a particular direction, such as height, width or breadth, or depth."},{"definition":"A construct whereby objects or individuals can be distinguished."},{"definition":"The number of independent coordinates needed to specify uniquely the location of a point in a space; also, any of such independent coordinates."},{"definition":"The number of elements of any basis of a vector space."},{"definition":"One of the physical properties that are regarded as fundamental measures of a physical quantity, such as mass, length and time.","example":"The dimension of velocity is length divided by time."},{"definition":"Any of the independent ranges of indices in a multidimensional array."},{"definition":"A universe or plane of existence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark, cut or shape something to specified dimensions."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/dimension-us.mp3","text":"/daɪˈmɛnʃən/"}]},{"word":"WRIGHT","idx":5101,"count":12925206,"meanings":[{"definitions":[{"definition":"A builder or maker of something."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹaɪt/"}]},{"word":"BARRY","idx":5103,"count":12921548,"meanings":[{"definitions":[{"definition":"A field divided transversely into several equal parts, and consisting of two different tinctures interchangeably disposed."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɑːɹi/"}]},{"word":"PROVEN","idx":5104,"count":12920984,"meanings":[{"definitions":[{"definition":"To proofread."},{"definition":"To make resistant, especially to water."},{"definition":"To allow yeast-containing dough to rise."},{"definition":"To test the activeness of yeast."},{"definition":"To demonstrate that something is true or viable; to give proof for.","example":"I will prove that my method is more effective than yours."},{"definition":"To turn out; to manifest.","example":"It proved to be a cold day."},{"definition":"To turn out to be.","example":"Have an exit strategy should your calculations prove incorrect."},{"definition":"To put to the test, to make trial of.","example":"The exception proves the rule."},{"definition":"To ascertain or establish the genuineness or validity of; to verify.","example":"to prove a will"},{"definition":"To experience."},{"definition":"To take a trial impression of; to take a proof of.","example":"to prove a page"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been proved; having proved its value or truth.","example":"It's a proven fact that morphine is a more effective painkiller than acetaminophen is."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpɹuvən/"},{"text":"/ˈpɹuːvən/"}]},{"word":"SCHEDULES","idx":5105,"count":12917359,"meanings":[{"definitions":[{"definition":"A slip of paper; a short note."},{"definition":"A written or printed table of information, often forming an annex or appendix to a statute or other regulatory instrument, or to a legal contract.","example":"schedule of tribes"},{"definition":"A serial record of items, systematically arranged."},{"definition":"A procedural plan, usually but not necessarily tabular in nature, indicating a sequence of operations and the planned times at which those operations are to occur.","example":"stick to the schedule"},{"definition":"An allocation or ordering of a set of tasks on one or several resources."}],"partOfSpeech":"n"}]},{"word":"ADMISSIONS","idx":5106,"count":12907686,"meanings":[{"definitions":[{"definition":"The act or practice of admitting."},{"definition":"Permission to enter, or the entrance itself; admittance; entrance; access","example":"I request admission for two adults"},{"definition":"The granting of an argument or position not fully proved; the act of acknowledging something asserted; acknowledgement; concession."},{"definition":"Acquiescence or concurrence in a statement made by another, and distinguishable from a confession in that an admission presupposes prior inquiry by another, but a confession may be made without such inquiry."},{"definition":"A fact, point, or statement admitted; as, admission made out of court are received in evidence"},{"definition":"Declaration of the bishop that he approves of the presentee as a fit person to serve the cure of the church to which he is presented."},{"definition":"The cost or fee associated with attendance or entry.","example":"There is no way he has seen that show, the admission is more than he makes in a week."}],"partOfSpeech":"n"}]},{"word":"CACHED","idx":5107,"count":12887996,"meanings":[{"definitions":[{"definition":"To place in a cache."}],"partOfSpeech":"ve"}]},{"word":"WARREN","idx":5108,"count":12887808,"meanings":[{"definitions":[{"definition":"The system of burrows where rabbits live."},{"definition":"An enclosed piece of land set aside for breeding game, especially rabbits."},{"definition":"A mazelike place of dark alleys etc in which it's easy to lose oneself; especially one that may be overcrowded."},{"definition":"A heart-shaped hoe."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɔɹən/"},{"text":"/ˈwɒɹən/"}]},{"word":"SLIP","idx":5109,"count":12886015,"meanings":[{"definitions":[{"definition":"A thin, slippery mix of clay and water."},{"definition":"Mud, slime."},{"definition":"A twig or shoot; a cutting."},{"definition":"A descendant, a scion."},{"definition":"A young person (now usually with of introducing descriptive qualifier).","example":"She couldn't hurt a fly, young slip of a girl that she is."},{"definition":"A long, thin piece of something."},{"definition":"A small piece of paper, especially one longer than it is wide, typically a form for writing on or one giving printed information.","example":"a salary slip"},{"definition":"(marine insurance) A memorandum of the particulars of a risk for which a policy is to be executed. It usually bears the broker's name and is initiated by the underwriters."},{"definition":"An act or instance of slipping.","example":"I had a slip on the ice and bruised my hip."},{"definition":"A woman's undergarment worn under a skirt or dress to conceal unwanted nudity that may otherwise be revealed by the skirt or dress itself; a shift."},{"definition":"A slipdress."},{"definition":"A mistake or error."},{"definition":"A berth; a space for a ship to moor."},{"definition":"A difference between the theoretical distance traveled per revolution of the propeller and the actual advance of the vessel."},{"definition":"A slipway."},{"definition":"A one-time return to previous maladaptive behaviour after cure."},{"definition":"Any of several fielding positions to the off side of the wicket keeper, designed to catch the ball after being deflected from the bat; a fielder in that position (See first slip, second slip, third slip, fourth slip and fifth slip.)"},{"definition":"A number between 0 and 1 that is the difference between the angular speed of a rotating magnetic field and the angular speed of its rotor, divided by the angular speed of the magnetic field."},{"definition":"A leash or string by which a dog is held; so called from its being made in such a manner as to slip, or become loose, by relaxation of the hand."},{"definition":"An escape; a secret or unexpected desertion.","example":"He gave the warden the slip and escaped from the prison."},{"definition":"A portion of the columns of a newspaper etc. struck off by itself; a proof from a column of type when set up and in the galley."},{"definition":"A child's pinafore."},{"definition":"An outside covering or case.","example":"a pillow slip"},{"definition":"A counterfeit piece of money, made from brass covered with silver."},{"definition":"Matter found in troughs of grindstones after the grinding of edge tools."},{"definition":"An aqueous suspension of minerals, usually clay, used, among other things, to stick workpieces together."},{"definition":"A particular quantity of yarn."},{"definition":"A narrow passage between buildings."},{"definition":"A long seat or narrow pew in churches, often without a door."},{"definition":"A dislocation of a lead, destroying continuity."},{"definition":"The motion of the centre of resistance of the float of a paddle wheel, or the blade of an oar, through the water horizontally, or the difference between a vessel's actual speed and the speed it would have if the propelling instrument acted upon a solid; also, the velocity, relatively to still water, of the backward current of water produced by the propeller."},{"definition":"The difference between the actual and synchronous speeds of an induction motor."},{"definition":"A fish, the sole."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lose one’s traction on a slippery surface; to slide due to a lack of friction."},{"definition":"To err."},{"definition":"To accidentally reveal a secret or otherwise say something unintentional."},{"definition":"To move or fly (out of place); to shoot; often with out, off, etc.","example":"A bone may slip out of place."},{"definition":"To pass (a note, money, etc.), often covertly.","example":"She thanked the porter and slipped a ten-dollar bill into his hand."},{"definition":"To cause to move smoothly and quickly; to slide; to convey gently or secretly."},{"definition":"To move quickly and often secretively; to depart, withdraw, enter, appear, intrude, or escape as if by sliding.","example":"Some errors slipped into the appendix."},{"definition":"To move down; to slide.","example":"Profits have slipped over the past six months."},{"definition":"To release (a dog, a bird of prey, etc.) to go after a quarry."},{"definition":"To remove the skin of a soft fruit, such as a tomato or peach, by blanching briefly in boiling water, then transferring to cold water so that the skin peels, or slips, off easily."},{"definition":"To omit; to lose by negligence."},{"definition":"To cut slips from; to cut; to take off; to make a slip or slips of.","example":"to slip a piece of cloth or paper"},{"definition":"To cause to slip or slide off, or out of place.","example":"A horse slips his bridle; a dog slips his collar."},{"definition":"To bring forth (young) prematurely; to slink."},{"definition":"To cause (a schedule or release, etc.) to go, or let it go, beyond the allotted deadline."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/slip-us.mp3","text":"/slɪp/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/slip-au.mp3","text":"/slɪp/"}]},{"word":"STUDIED","idx":5110,"count":12881982,"meanings":[{"definitions":[{"definition":"Practiced; self-conscious; careful.","example":"She gave a studied reply."},{"definition":"Qualified by, or versed in, study; learned."}],"partOfSpeech":"j"},{"definitions":[{"definition":"(usually academic) To review materials already learned in order to make sure one does not forget them, usually in preparation for an examination.","example":"I need to study my biology notes."},{"definition":"(academic) To take a course or courses on a subject.","example":"I study medicine at the university."},{"definition":"To acquire knowledge on a subject with the intention of applying it in practice.","example":"Biologists study living things."},{"definition":"To look at minutely.","example":"He studied the map in preparation for the hike."},{"definition":"To fix the mind closely upon a subject; to dwell upon anything in thought; to muse; to ponder."},{"definition":"To endeavor diligently; to be zealous."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/studied-us.mp3","text":"/ˈstʌdid/"}]},{"word":"REVIEWER","idx":5111,"count":12879631,"meanings":[{"definitions":[{"definition":"A person who writes reviews for a newspaper or other publication; a critic."},{"definition":"An inspector."}],"partOfSpeech":"n"}]},{"word":"INVOLVES","idx":5112,"count":12878082,"meanings":[{"definitions":[{"definition":"To roll or fold up; to wind round; to entwine."},{"definition":"To envelop completely; to surround; to cover; to hide.","example":"to involve in darkness or obscurity"},{"definition":"To complicate or make intricate, as in grammatical structure."},{"definition":"To connect with something as a natural or logical consequence or effect; to include necessarily; to imply."},{"definition":"To take in; to gather in; to mingle confusedly; to blend or merge."},{"definition":"To envelop, enfold, entangle.","example":"He's involved in the crime."},{"definition":"To engage (someone) to participate in a task.","example":"By getting involved in her local community, Mary met lots of people and also helped make it a nicer place to live."},{"definition":"To raise to any assigned power; to multiply, as a quantity, into itself a given number of times.","example":"a quantity involved to the third or fourth power"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/involves-us.mp3"}]},{"word":"QUARTERLY","idx":5113,"count":12876640,"meanings":[{"definitions":[{"definition":"A periodical publication that appears four times per year."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Occurring once every quarter year (three months).","example":"quarterly rent payments"},{"definition":"(of a coat of arms) Divided into four parts crosswise.","example":"The arms of Hohenzollern is quarterly argent and sable."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Once every quarter year (three months)."}],"partOfSpeech":"v"}]},{"word":"RPM","idx":5114,"count":12872296,"meanings":[{"definitions":[{"definition":"Abbreviation of revolutions per minute."}],"partOfSpeech":"n"},{"definitions":[{"definition":"RPM Package Manager, or formerly Red Hat Package Manager, a package management system used by some distributions of the Linux operating system – most importantly those by Red Hat."}],"partOfSpeech":"pn"}]},{"word":"PROFITS","idx":5115,"count":12872162,"meanings":[{"definitions":[{"definition":"Total income or cash flow minus expenditures. The money or other benefit a non-governmental organization or individual receives in exchange for products and services sold at an advertised price."},{"definition":"Benefit, positive result obtained.","example":"Reading such an enlightening book on the subject was of much profit to his studies."},{"definition":"In property law, a nonpossessory interest in land whereby a party is entitled to enter the land of another for the purpose of taking the soil or the substance of the soil (coal, oil, minerals, and in some jurisdictions timber and game)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To benefit (somebody), be of use to (somebody)."},{"definition":"(construed with from) To benefit, gain."},{"definition":"(construed with from) To take advantage of, exploit, use."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/profits-us.mp3","text":"/ˈpɹɑfɪts/"}]},{"word":"DEVIL","idx":5116,"count":12869511,"meanings":[{"definitions":[{"definition":"An evil creature."},{"definition":"(with article) The chief devil; Satan."},{"definition":"A fictional image of a man, usually red or orange in skin color; with a set of horns on his head, a pointed goatee and a long tail and carrying a pitchfork; that represents evil and portrayed to children in an effort to discourage bad behavior."},{"definition":"The bad part of the conscience; the opposite to the angel.","example":"The devil in me wants to let him suffer."},{"definition":"A wicked or naughty person, or one who harbors reckless, spirited energy, especially in a mischievous way; usually said of a young child.","example":"Those two kids are devils in a toy store."},{"definition":"A thing that is awkward or difficult to understand or do.","example":"That math problem was a devil."},{"definition":"(with an article, as an intensifier) Hell.","example":"She is having a devil of a time fixing it."},{"definition":"A person, especially a man; used to express a particular opinion of him, usually in the phrases poor devil and lucky devil."},{"definition":"A dust devil."},{"definition":"(Christian Science) An evil or erring entity."},{"definition":"(in compounds) A barren, unproductive and unused area.","example":"devil strip"},{"definition":"A dish, as a bone with the meat, broiled and excessively peppered; a grill with Cayenne pepper."},{"definition":"A machine for tearing or cutting rags, cotton, etc."},{"definition":"A Tasmanian devil."},{"definition":"An endurance event where riders who fall behind are periodically eliminated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make like a devil; to invest with the character of a devil."},{"definition":"To annoy or bother."},{"definition":"To work as a ‘devil’; to work for a lawyer or writer without fee or recognition."},{"definition":"To prepare (food) with spices, making it spicy:"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/devil-us.mp3","text":"/ˈdɛvəl/"}]},{"word":"GRASS","idx":5117,"count":12868953,"meanings":[{"definitions":[{"definition":"Any plant of the family Poaceae, characterized by leaves that arise from nodes in the stem and leaf bases that wrap around the stem, especially those grown as ground cover rather than for grain."},{"definition":"Various plants not in family Poaceae that resemble grasses."},{"definition":"A lawn."},{"definition":"Marijuana."},{"definition":"An informer, police informer; one who betrays a group (of criminals, etc) to the authorities.","example":"What just happened must remain secret. Don't be a 'grass."},{"definition":"Sharp, closely spaced discontinuities in the trace of a cathode-ray tube, produced by random interference."},{"definition":"Noise on an A-scope or similar type of radar display."},{"definition":"The season of fresh grass; spring or summer."},{"definition":"That which is transitory."},{"definition":"(folk etymology) Asparagus; \"sparrowgrass\"."},{"definition":"The surface of a mine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lay out on the grass; to knock down (an opponent etc.)."},{"definition":"To act as a grass or informer, to betray; to report on (criminals etc) to the authorities."},{"definition":"To cover with grass or with turf."},{"definition":"To feed with grass."},{"definition":"To expose, as flax, on the grass for bleaching, etc."},{"definition":"To bring to the grass or ground; to land."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/grass-us.mp3","text":"[ɡɹ̠eəs]"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/grass-uk.mp3","text":"[ɡɹ̠ɑːs]"}]},{"word":"COMPLY","idx":5118,"count":12868396,"meanings":[{"definitions":[{"definition":"To yield assent; to accord; to acquiesce, agree, consent; to adapt oneself, to conform."},{"definition":"To accomplish, to fulfil."},{"definition":"To be ceremoniously courteous; to make one's compliments."},{"definition":"To enfold; to embrace."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/comply-us.mp3","text":"/kəmˈplaɪ/"}]},{"word":"FLORIST","idx":5120,"count":12860636,"meanings":[{"definitions":[{"definition":"A person who sells flowers."},{"definition":"A person who cultivates flowers."},{"definition":"A person who studies or writes about flowers."},{"definition":"A florist's shop."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈflɒɹɪst/"},{"text":"/ˈflɔːɹɪst/"}]},{"word":"ILLUSTRATED","idx":5121,"count":12858193,"meanings":[{"definitions":[{"definition":"To shed light upon."},{"definition":"To clarify something by giving, or serving as, an example or a comparison.","example":"We illustrate our definitions by including quotations or simple examples."},{"definition":"To provide a book or other publication with pictures, diagrams or other explanatory or decorative features.","example":"The economics textbook was illustrated with many graphs."},{"definition":"To give renown or honour to; to make illustrious."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A newspaper featuring illustrations."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪləstɹeɪtɪd/"}]},{"word":"CHERRY","idx":5122,"count":12855670,"meanings":[{"definitions":[{"definition":"A small fruit, usually red, black or yellow, with a smooth hard seed and a short hard stem."},{"definition":"Prunus subg. Cerasus, trees or shrubs that bear cherries."},{"definition":"The wood of a cherry tree."},{"definition":"(color) Cherry red."},{"definition":"Virginity, especially female virginity as embodied by a hymen."},{"definition":"A subtree consisting of a node with exactly two leaves."},{"definition":"A cricket ball."},{"definition":"Cherrytop."},{"definition":"Burning tip of a cigarette."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Containing or having the taste of cherries."},{"definition":"Of a bright red colour; cherry red."},{"definition":"(often of cars) In excellent condition; mint condition."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/cherry-us.mp3","text":"/ˈt͡ʃɛɹi/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/cherry-uk.mp3","text":"/ˈt͡ʃɛɹi/"}]},{"word":"CONTINENTAL","idx":5123,"count":12854435,"meanings":[{"definitions":[{"definition":"Someone from the continent."},{"definition":"A member of the Continental army."},{"definition":"Paper scrip (paper money) issued by the continental congress, largely worthless by the end of the war."},{"definition":"(by extension) The smallest amount; a whit; a jot.","example":"I don't care a continental!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to a continent or continents.","example":"continental drift"},{"definition":"Of the mainland, as opposed to an island offshore","example":"continental Europe"},{"definition":"(chiefly in the UK) Relating to, or characteristic of, continental Europe","example":"continental breakfast"},{"definition":"Of or relating to the confederated colonies collectively, in the time of the Revolutionary War.","example":"continental money"}],"partOfSpeech":"j"}]},{"word":"ALTERNATE","idx":5124,"count":12846709,"meanings":[{"definitions":[{"definition":"That which alternates with something else; vicissitude."},{"definition":"A substitute; an alternative; one designated to take the place of another, if necessary, in performing some duty."},{"definition":"A proportion derived from another proportion by interchanging the means."},{"definition":"A replacement of equal or greater value or function."},{"definition":"Figures or tinctures that succeed each other by turns."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform by turns, or in succession; to cause to succeed by turns; to interchange regularly."},{"definition":"To happen, succeed, or act by turns; to follow reciprocally in place or time; followed by with.","example":"The flood and ebb tides alternate with each other."},{"definition":"To vary by turns.","example":"The land alternates between rocky hills and sandy plains."},{"definition":"To perform an alternation (removal of alternate vertices) on (a polytope or tessellation); to remove vertices (from a face or edge) as part of an alternation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Happening by turns; one following the other in succession of time or place; first one and then the other (repeatedly)","example":"alternate picking is a guitar playing technique"},{"definition":"Designating the members in a series, which regularly intervene between the members of another series, as the odd or even numbers of the numerals; every other; every second.","example":"the alternate members 1, 3, 5, 7, etc."},{"definition":"Other; alternative.","example":"He lives in an alternate universe and an alternate reality."},{"definition":"(of leaves) Distributed singly at different heights of the stem, and at equal intervals as respects angular divergence.","example":"Many trees have alternate leaf arrangement (e.g. birch, oak and mulberry)."}],"partOfSpeech":"j"}]},{"word":"ACHIEVEMENT","idx":5126,"count":12845656,"meanings":[{"definitions":[{"definition":"The act of achieving or performing; a successful performance; accomplishment"},{"definition":"A great or heroic deed or feat; something accomplished by valor or boldness"},{"definition":"An escutcheon or ensign armorial; now generally applied to the funeral shield commonly called hatchment."},{"definition":"An award for completing a particular task or meeting an objective in a video game.","example":"Finishing the game does not give you a 100% score until you have unlocked all of the achievements."},{"definition":"(grammar) The lexical aspect (aktionsart) of verbs or predicates that change in an instant."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/achievement-us.mp3","text":"/əˈtʃiːvmənt/"}]},{"word":"LIMITATIONS","idx":5127,"count":12844407,"meanings":[{"definitions":[{"definition":"The act of limiting or the state of being limited."},{"definition":"A restriction; a boundary, real or metaphorical, caused by some thing or some circumstance.","example":"Getting into his wheelchair after his amputation, it felt like a limitation you could roll in."},{"definition":"An imperfection or shortcoming that limits something's use or value."},{"definition":"A time period after which some legal action may no longer be brought.","example":"The lawyer obtained impunity by dragging his obviously guilty client's case beyond the ten-year limitation."}],"partOfSpeech":"n"}]},{"word":"WEBCAM","idx":5129,"count":12835042,"meanings":[{"definitions":[{"definition":"A video camera whose output may be viewed in real time over a computer network, especially over the World Wide Web."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a video communication via webcam."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈwɛbˌkæm/"}]},{"word":"CUTS","idx":5130,"count":12832156,"meanings":[{"definitions":[{"definition":"The act of cutting.","example":"He made a fine cut with his sword."},{"definition":"The result of cutting.","example":"a smooth or clear cut"},{"definition":"An opening resulting from cutting; an incision or wound.","example":"Look at this cut on my finger!"},{"definition":"A notch, passage, or channel made by cutting or digging; a furrow; a groove.","example":"a cut for a railroad"},{"definition":"A share or portion.","example":"The lawyer took a cut of the profits."},{"definition":"A batsman's shot played with a swinging motion of the bat, to hit the ball backward of point."},{"definition":"Sideways movement of the ball through the air caused by a fast bowler imparting spin to the ball."},{"definition":"In lawn tennis, etc., a slanting stroke causing the ball to spin and bound irregularly; also, the spin thus given to the ball."},{"definition":"In a strokeplay competition, the early elimination of those players who have not then attained a preannounced score, so that the rest of the competition is less pressed for time and more entertaining for spectators."},{"definition":"A passage omitted or to be omitted from a play.","example":"The director asked the cast to note down the following cuts."},{"definition":"A particular version or edit of a film."},{"definition":"The act or right of dividing a deck of playing cards.","example":"The player next to the dealer makes a cut by placing the bottom half on top."},{"definition":"The card obtained by dividing the pack."},{"definition":"The manner or style a garment etc. is fashioned in.","example":"I like the cut of that suit."},{"definition":"A slab, especially of meat.","example":"That’s our finest cut of meat."},{"definition":"An attack made with a chopping motion of the blade, landing with its edge or point."},{"definition":"A deliberate snub, typically a refusal to return a bow or other acknowledgement of acquaintance."},{"definition":"An unkind act; a cruelty."},{"definition":"A definable part, such as an individual song, of a recording, particularly of commercial records, audio tapes, CDs, etc.","example":"The drummer on the last cut of their CD is not identified."},{"definition":"A truncation, a context that represents a moment in time when other archaeological deposits were removed for the creation of some feature such as a ditch or pit."},{"definition":"A haircut."},{"definition":"The partition of a graph’s vertices into two subgroups."},{"definition":"A string of railway cars coupled together."},{"definition":"An engraved block or plate; the impression from such an engraving.","example":"a book illustrated with fine cuts"},{"definition":"A common workhorse; a gelding."},{"definition":"The failure of a college officer or student to be present at any appointed exercise."},{"definition":"A skein of yarn."},{"definition":"That which is used to dilute or adulterate a recreational drug.","example":"Don't buy his coke: it's full of cut."},{"definition":"A notch shaved into an eyebrow."},{"definition":"A time period when one tries to lose fat while retaining muscle mass."},{"definition":"A hidden or secure place."},{"definition":"(with \"the\") Corporal punishment at school."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(heading) To incise, to cut into the surface of something."},{"definition":"To admit of incision or severance; to yield to a cutting instrument."},{"definition":"(heading, social) To separate, remove, reject or reduce."},{"definition":"(audio, usually as imperative) To cease recording activities.","example":"After the actors read their lines, the director yelled, \"Cut!\""},{"definition":"To make an abrupt transition from one scene or image to another.","example":"The camera then cut to the woman on the front row who was clearly overcome and crying tears of joy."},{"definition":"To edit a film by selecting takes from original footage."},{"definition":"To remove and place in memory for later use.","example":"Select the text, cut it, and then paste it in the other application."},{"definition":"To enter a queue in the wrong place.","example":"One student kept trying to cut in front of the line."},{"definition":"To intersect or cross in such a way as to divide in half or nearly so.","example":"This road cuts right through downtown."},{"definition":"To make the ball spin sideways by running one's fingers down the side of the ball while bowling it."},{"definition":"To deflect (a bowled ball) to the off, with a chopping movement of the bat."},{"definition":"To change direction suddenly.","example":"The football player cut to his left to evade a tackle."},{"definition":"To divide a pack of playing cards into two.","example":"If you cut then I'll deal."},{"definition":"To write.","example":"cut orders;  cut a check"},{"definition":"To dilute or adulterate something, especially a recreational drug.","example":"Drug dealers sometimes cut cocaine with lidocaine."},{"definition":"To exhibit (a quality)."},{"definition":"To stop or disengage.","example":"Cut the engines when the plane comes to a halt!"},{"definition":"To drive (a ball) to one side, as by (in billiards or croquet) hitting it fine with another ball, or (in tennis) striking it with the racket inclined."},{"definition":"To lose body mass after bulking, aiming to keep the additional muscle but lose the fat."},{"definition":"To perform (a dancing movement etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/cuts-au.mp3","text":"/kʌts/"}]},{"word":"FUNERAL","idx":5131,"count":12827388,"meanings":[{"definitions":[{"definition":"A ceremony to honour and remember a deceased person. Often distinguished from a memorial service by the presence of the body of the deceased.","example":"Many mourners turned up at the local artist's funeral to pay homage."},{"definition":"(chiefly in the plural) A funeral sermon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to a funeral."},{"definition":"Similar to a funeral in mood; dignified or solemn."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/funeral-us.mp3","text":"/ˈfjunəɹəl/"}]},{"word":"EARRINGS","idx":5133,"count":12822060,"meanings":[{"definitions":[{"definition":"A piece of jewelry worn on the ear."}],"partOfSpeech":"n"}]},{"word":"ENJOYED","idx":5134,"count":12819458,"meanings":[{"definitions":[{"definition":"To receive pleasure or satisfaction from something","example":"Enjoy your holidays!   I enjoy dancing."},{"definition":"To have the use or benefit of something.","example":"I plan to go travelling while I still enjoy good health."},{"definition":"To be satisfied or receive pleasure.","example":"I enjoyed a lot."},{"definition":"To have sexual intercourse with."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/enjoyed-us.mp3","text":"/ɪnˈdʒɔɪd/"}]},{"word":"AUTOMATED","idx":5135,"count":12816951,"meanings":[{"definitions":[{"definition":"To replace or enhance human labor with machines.","example":"Many offices still need to automate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made automatic"},{"definition":"Done by machine."}],"partOfSpeech":"j"}]},{"word":"CHAPTERS","idx":5136,"count":12814410,"meanings":[{"definitions":[{"definition":"(authorship) One of the main sections into which the text of a book is divided.","example":"Detective novel writers try to keep up the suspense until the last chapter."},{"definition":"A section of a social or religious body."},{"definition":"A sequence (of events), especially when presumed related and likely to continue."},{"definition":"A decretal epistle."},{"definition":"A location or compartment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide into chapters."},{"definition":"To put into a chapter."},{"definition":"(with \"out\") To use administrative procedure to remove someone."},{"definition":"To take to task."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/chapters-us.mp3","text":"/ˈt͡ʃæptɚz/"}]},{"word":"PEE","idx":5137,"count":12811886,"meanings":[{"definitions":[{"definition":"Urine."},{"definition":"The name of the Latin-script letter P.","example":"Mind your pees and cues."},{"definition":"Pence; penny (a quantity of money)","example":"I bought these carrots for fifty pee."},{"definition":"The bill of an anchor."},{"definition":"The sliding weight on a steelyard."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To urinate.","example":"The schoolboy called out to his friend while he was peeing in the urinal."},{"definition":"(mildly vulgar) To drizzle.","example":"It's peeing with rain."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pee-uk.mp3","text":"/piː/"}]},{"word":"CHARLIE","idx":5138,"count":12810984,"meanings":[{"definitions":[{"definition":"An enemy; the Vietcong; short for Victor Charlie."},{"definition":"Cocaine."},{"definition":"(often with \"right\" and/or \"proper\") A fool.","example":"You look a right Charlie in that clown outfit! — Yes, we make a right pair of Charlies."},{"definition":"(usually in the plural) A woman's breast"},{"definition":"A nightwatchman."},{"definition":"A short, pointed beard, like that of King Charles I."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/charlie-au.mp3"}]},{"word":"NIPPLES","idx":5140,"count":12804977,"meanings":[{"definitions":[{"definition":"The projection of a mammary gland from which, on female mammals, milk is secreted."},{"definition":"A mechanical device through which liquids or gases can be passed in a regulated manner."},{"definition":"An artificial nipple (definition 1) used for bottle-feeding infants."},{"definition":"Any small physical protrusion, such as the lumps on the F and J keys on computer keyboards."},{"definition":"Any small physical protrusion on an automotive, a machine part or any other part that fits into a groove on another part."},{"definition":"A perforated segment that fits into part of the breech of a muzzle-loading gun, on which the percussion cap is fixed."},{"definition":"A short tube threaded at both ends, used as a connector."},{"definition":"An internally threaded piece which holds a bicycle spoke in place on the rim.","example":"Turn the nipples on to the bicycle spokes only one turn, for each spoke on the new wheel all the way around until they are all snug, then check alignment."}],"partOfSpeech":"n"}]},{"word":"PASSENGER","idx":5141,"count":12804602,"meanings":[{"definitions":[{"definition":"One who rides or travels in a vehicle, but who does not operate it and is not a member of the crew.","example":"Somebody in a team who does not do their fair share of the work."},{"definition":"A young hunting bird that can fly and is taken while it is still in its first year."},{"definition":"A passer-by; a wayfarer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride as a passenger in a vehicle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/passenger-us.mp3","text":"/ˈpæsənd͡ʒɚ/"}]},{"word":"CONVENIENT","idx":5142,"count":12801318,"meanings":[{"definitions":[{"definition":"Serving to reduce a difficulty, or accessible with minimum difficulty; expedient.","example":"Fast food might be convenient, but it's also very unhealthy."},{"definition":"Fit; suitable; appropriate."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/convenient-us.mp3","text":"/kənˈvinjənt/"}]},{"word":"MARS","idx":5144,"count":12792948,"meanings":[{"definitions":[{"definition":"A blemish."},{"definition":"A small lake."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To spoil; to ruin; to scathe; to damage."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/mars-us.mp3","text":"/ˈmɑɹz/"}]},{"word":"TVS","idx":5146,"count":12782654,"meanings":[{"definitions":[{"definition":"The assessed value of an asset from which the tax owing is computed."},{"definition":"An electronic communication medium that allows the transmission of real-time visual images, and often sound.","example":"It’s a good thing that television doesn’t transmit smell."},{"definition":"A device for receiving television signals and displaying them in visual form.","example":"I have an old television in the study."},{"definition":"Collectively, the programs broadcast via the medium of television.","example":"fifty-seven channels and nothing on television"},{"definition":"Vision at a distance."},{"definition":"The amount of air breathed in or out during normal respiration."},{"definition":"A person who sometimes wears clothes traditionally worn by and associated with the opposite sex; typically a male who cross-dresses occasionally by habit or personal choice."},{"definition":"A person, typically a heterosexual male, who compulsively seeks and derives paraphilic sexual arousal from cross-dressing, especially if the urges and behavior cause the patient distress or social impairment."}],"partOfSpeech":"n"}]},{"word":"SIZED","idx":5147,"count":12775596,"meanings":[{"definitions":[{"definition":"To adjust the size of; to make a certain size."},{"definition":"To classify or arrange by size."},{"definition":"To approximate the dimensions, estimate the size of."},{"definition":"To take a greater size; to increase in size."},{"definition":"(Cambridge University) To order food or drink from the buttery; hence, to enter a score, as upon the buttery book."},{"definition":"To swell; to increase the bulk of."},{"definition":"To apply glue or other primer to a surface which is to be painted."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a certain size. Usually used in combination with an adverb.","example":"A badly-sized pair of shoes."}],"partOfSpeech":"j"}]},{"word":"MANGA","idx":5148,"count":12774174,"meanings":[{"definitions":[{"definition":"A comic originating in Japan."},{"definition":"An artistic style heavily used in, and associated with, Japanese comics, and that has also been adopted by a comparatively low number of comics from other countries."},{"definition":"A comic in manga style, regardless of the country of origin.","example":"Lately I've been reading a Brazilian manga."},{"definition":"A covering for a crucifix."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmæŋɡə/"}]},{"word":"NOTICED","idx":5149,"count":12773325,"meanings":[{"definitions":[{"definition":"To remark upon; to mention."},{"definition":"To become aware of; to observe.","example":"Did you notice the flowers in her yard?"},{"definition":"To lavish attention upon; to treat (someone) favourably."},{"definition":"To be noticeable; to show."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/noticed-us.mp3","text":"/ˈnoʊtɪst/"}]},{"word":"SOCKET","idx":5150,"count":12770550,"meanings":[{"definitions":[{"definition":"An opening into which a plug or other connecting part is designed to fit (e.g. a light bulb socket)."},{"definition":"A hollow into a bone which a part fits, such as an eye, or another bone, in the case of a joint."},{"definition":"One endpoint of a two-way communication link, used for interprocess communication across a network."},{"definition":"One endpoint of a two-way named pipe on Unix and Unix-like systems, used for interprocess communication."},{"definition":"A hollow tool for grasping and lifting tools dropped in a well-boring."},{"definition":"The hollow of a candlestick."},{"definition":"A steel apparatus attached to a saddle to protect the thighs and legs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place or fit in a socket."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/socket-us.mp3","text":"/ˈsɑkɪt/"}]},{"word":"SILENT","idx":5151,"count":12768385,"meanings":[{"definitions":[{"definition":"That which is silent; a time of silence."},{"definition":"A silent movie"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Free from sound or noise; absolutely still; perfectly quiet."},{"definition":"Not speaking; indisposed to talk; speechless; mute; taciturn; not loquacious; not talkative."},{"definition":"Keeping at rest; inactive; calm; undisturbed.","example":"The wind is silent."},{"definition":"(pronunciation) Not pronounced; having no sound; quiescent.","example":"Silent letters can make some words difficult to spell."},{"definition":"Having no effect; not operating; inefficient."},{"definition":"With the sound turned off; usually on silent or in silent mode.","example":"My phone was on silent."},{"definition":"Without audio capability.","example":"The Magnavox Odyssey was a silent console."},{"definition":"Hidden, unseen.","example":"a silent voter; a silent partner"},{"definition":"Of an edit or change to a text, not explicitly acknowledged.","example":"silent revisions; a silent emendation"},{"definition":"Not implying significant modifications which would affect a peptide sequence."},{"definition":"Undiagnosed or undetected because of an absence of symptoms."},{"definition":"Of distilled spirit: having no flavour or odour."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/silent-us.mp3","text":"/ˈsaɪlənt/"}]},{"word":"LITERARY","idx":5152,"count":12767813,"meanings":[{"definitions":[{"definition":"Relating to literature.","example":"a literary history"},{"definition":"Relating to writers, or the profession of literature.","example":"a literary man"},{"definition":"Knowledgeable of literature or writing."},{"definition":"Appropriate to literature rather than everyday writing."},{"definition":"Bookish."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/literary-us.mp3","text":"/ˈlɪtəɹɛ(ə)ɹi/"}]},{"word":"EGG","idx":5153,"count":12766528,"meanings":[{"definitions":[{"definition":"An approximately spherical or ellipsoidal body produced by birds, reptiles, insects and other animals, housing the embryo during its development."},{"definition":"The egg of a domestic fowl (especially a hen) or its contents, used as food.","example":"I also determine the minimal amount of egg required to make good mayonnaise."},{"definition":"The female primary cell, the ovum."},{"definition":"Anything shaped like an egg, such as an Easter egg or a chocolate egg."},{"definition":"A swelling on one's head, usually large or noticeable, associated with an injury."},{"definition":"(mildly) A Caucasian who behaves as if they were (East) Asian (from being \"white\" outside and \"yellow\" inside)."},{"definition":"A foolish or obnoxious person.","example":"Shut up, you egg!"},{"definition":"A person, fellow.","example":"bad egg"},{"definition":"A person who is regarded as having not yet realized they are transgender, has not yet come out, or is in the early stages of transitioning."},{"definition":"One of the blocks of data injected into a program's address space for use by certain forms of shellcode, such as \"omelettes\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw eggs at."},{"definition":"To dip in or coat with beaten egg."},{"definition":"To distort a circular cross-section (as in a tube) to an elliptical or oval shape, either inadvertently or intentionally.","example":"After I cut the tubing, I found that I had slightly egged it in the vise."},{"definition":"To encourage, incite."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/egg-us.mp3","text":"/eɪɡ/"}]},{"word":"SIGNALS","idx":5155,"count":12760317,"meanings":[{"definitions":[{"definition":"A sequence of states representing an encoded message in a communication channel."},{"definition":"Any variation of a quantity or change in an entity over time that conveys information upon detection."},{"definition":"A sign made to give notice of some occurrence, command, or danger, or to indicate the start of a concerted action."},{"definition":"An on-off light, semaphore, or other device used to give an indication to another person."},{"definition":"(of a radio, TV, telephone, internet, etc.) An electromagnetic action, normally a voltage that is a function of time, that conveys the information of the radio or TV program or of communication with another party.","example":"My mobile phone can't get a signal in the railway station."},{"definition":"An action, change or process done to convey information and thus reduce uncertainty."},{"definition":"A token; an indication; a foreshadowing; a sign."},{"definition":"Useful information, as opposed to noise."},{"definition":"A simple interprocess communication used to notify a process or thread of an occurrence."},{"definition":"A signalling interaction between cells"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To indicate; to convey or communicate by a signal."},{"definition":"To communicate with (a person or system) by a signal.","example":"Seeing the flames, he ran to the control room and signalled headquarters."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsɪɡnəlz/"}]},{"word":"CAPS","idx":5156,"count":12758083,"meanings":[{"definitions":[{"definition":"A close-fitting hat, either brimless or peaked.","example":"The children were all wearing caps to protect them from the sun."},{"definition":"A special hat to indicate rank, occupation, etc."},{"definition":"An academic mortarboard."},{"definition":"A protective cover or seal.","example":"He took the cap off the bottle and splashed himself with some cologne."},{"definition":"A crown for covering a tooth.","example":"He had golden caps on his teeth."},{"definition":"The summit of a mountain, etc.","example":"There was snow on the cap of the mountain."},{"definition":"An artificial upper limit or ceiling.","example":"We should put a cap on the salaries, to keep them under control."},{"definition":"The top part of a mushroom."},{"definition":"(toy) A small amount of percussive explosive in a paper strip or plastic cup for use in a toy gun.","example":"Billy spent all morning firing caps with his friends, re-enacting storming the beach at Normandy."},{"definition":"A small explosive device used to detonate a larger charge of explosives.","example":"He wired the cap to the bundle of dynamite, then detonated it remotely."},{"definition":"A bullet used to shoot someone."},{"definition":"An international appearance.","example":"Rio Ferdinand won his 50th cap for England in a game against Sweden."},{"definition":"The top, or uppermost part; the chief."},{"definition":"A respectful uncovering of the head."},{"definition":"The whole top of the head of a bird from the base of the bill to the nape of the neck."},{"definition":"The uppermost of any assemblage of parts.","example":"the cap of column, door, etc.; a capital, coping, cornice, lintel, or plate"},{"definition":"Something covering the top or end of a thing for protection or ornament."},{"definition":"A collar of iron or wood used in joining spars, as the mast and the topmast, the bowsprit and the jib boom; also, a covering of tarred canvas at the end of a rope."},{"definition":"A portion of a spherical or other convex surface."},{"definition":"A large size of writing paper.","example":"flat cap; foolscap; legal cap"},{"definition":"A lie or exaggeration.","example":"no cap"},{"definition":"Capitalization."},{"definition":"An uppercase letter."},{"definition":"Capacitor","example":"Parasitic caps."},{"definition":"A recording or screenshot.","example":"Anyone have a cap of the games last night?"},{"definition":"A capsule of a drug."},{"definition":"A wooden drinking-bowl with two handles."},{"definition":"Capital letters; capitals."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or seal with a cap."},{"definition":"To award a cap as a mark of distinction."},{"definition":"To lie over or on top of something."},{"definition":"To surpass or outdo."},{"definition":"To set an upper limit on something.","example":"cap wages."},{"definition":"To make something even more wonderful at the end.","example":"That really capped my day."},{"definition":"To select a player to play for a specified side."},{"definition":"To shoot (someone) with a firearm.","example":"In a school shooting, where some kid caps a bunch of other kids, where did he get the weapon? From a family member, probably their gun cabinet."},{"definition":"To select to play for the national team.","example":"Peter Shilton is the most capped English footballer."},{"definition":"To salute by uncovering the head respectfully."},{"definition":"To deprive of a cap."},{"definition":"To tell a lie."},{"definition":"To convert text to uppercase."},{"definition":"To take a screenshot or to record a copy of a video."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/caps-us.mp3","text":"/kæps/"}]},{"word":"ORIENTATION","idx":5157,"count":12750803,"meanings":[{"definitions":[{"definition":"The determination of the relative position of something or someone."},{"definition":"The relative physical position or direction of something."},{"definition":"The construction of a Christian church to have its aisle in an east-west direction with the altar at the east end."},{"definition":"An inclination, tendency or direction."},{"definition":"The ability to orient.","example":"The homing instinct in pigeons is an example of orientation."},{"definition":"An adjustment to a new environment."},{"definition":"An introduction to a (new) environment."},{"definition":"The direction of print across the page; landscape or portrait."},{"definition":"The choice of which ordered bases are \"positively\" oriented and which are \"negatively\" oriented on a real vector space."},{"definition":"The designation of a parametrised curve as \"positively\" or \"negatively\" oriented (or \"nonorientable\"); the analogous description of a surface or hypersurface."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɔɹiɛnˈteɪʃən/"}]},{"word":"PILL","idx":5158,"count":12749153,"meanings":[{"definitions":[{"definition":"A small, usually round or cylindrical object designed for easy swallowing, usually containing some sort of medication."},{"definition":"(definite, i.e. used with \"the\") Contraceptive medication, usually in the form of a pill to be taken by a woman; an oral contraceptive pill.","example":"Jane went on the pill when she left for college."},{"definition":"A comical or entertaining person."},{"definition":"A contemptible, annoying, or unpleasant person."},{"definition":"A small piece of any substance, for example a ball of fibres formed on the surface of a textile by rubbing."},{"definition":"A baseball."},{"definition":"A bullet (projectile)."},{"definition":"A rounded rectangle indicating the tag or category that an item belongs to."},{"definition":"The peel or skin."},{"definition":"An inlet on the coast; a small tidal pool or bay."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a woven fabric surface, to form small matted balls of fiber."},{"definition":"To form into the shape of a pill.","example":"Pilling is a skill rarely used by modern pharmacists."},{"definition":"To medicate with pills.","example":"She pills herself with all sorts of herbal medicines."},{"definition":"To persuade or convince someone of something."},{"definition":"To peel; to remove the outer layer of hair, skin, or bark."},{"definition":"To peel; to make by removing the skin."},{"definition":"To be peeled; to peel off in flakes."},{"definition":"To pillage; to despoil or impoverish."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pill-us.mp3","text":"/pɪl/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pill-uk.mp3","text":"/pɪl/"}]},{"word":"THEFT","idx":5159,"count":12744763,"meanings":[{"definitions":[{"definition":"The act of stealing property."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/θɛft/"}]},{"word":"CHILDHOOD","idx":5160,"count":12740200,"meanings":[{"definitions":[{"definition":"The state of being a child."},{"definition":"The time during which one is a child, from between infancy and puberty."},{"definition":"(by extension) The early stages of development of something."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/childhood-us.mp3","text":"/ˈtʃaɪldhʊd/"}]},{"word":"SWING","idx":5161,"count":12734467,"meanings":[{"definitions":[{"definition":"The manner in which something is swung.","example":"Door swing indicates direction the door opens."},{"definition":"The sweep or compass of a swinging body."},{"definition":"A line, cord, or other thing suspended and hanging loose, upon which anything may swing."},{"definition":"A hanging seat in a children's playground, for acrobats in a circus, or on a porch for relaxing."},{"definition":"A dance style."},{"definition":"The genre of music associated with this dance style."},{"definition":"The amount of change towards or away from something."},{"definition":"Sideways movement of the ball as it flies through the air."},{"definition":"Capacity of a turning lathe, as determined by the diameter of the largest object that can be turned in it."},{"definition":"In a musical theater production, a performer who understudies several roles."},{"definition":"A basic dance step in which a pair link hands and turn round together in a circle."},{"definition":"Free course; unrestrained liberty."},{"definition":"Influence or power of anything put in motion."},{"definition":"A type of hook with the arm more extended."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rotate about an off-centre fixed point.","example":"The plant swung in the breeze."},{"definition":"To dance."},{"definition":"To ride on a swing.","example":"The children laughed as they swung."},{"definition":"To participate in the swinging lifestyle; to participate in wife-swapping."},{"definition":"To hang from the gallows."},{"definition":"(of a ball) to move sideways in its trajectory."},{"definition":"To fluctuate or change.","example":"It wasn't long before the crowd's mood swung towards restless irritability."},{"definition":"To move (an object) backward and forward; to wave.","example":"He swung his sword as hard as he could."},{"definition":"To change (a numerical result); especially to change the outcome of an election."},{"definition":"To make (something) work; especially to afford (something) financially.","example":"If it’s not too expensive, I think we can swing it."},{"definition":"To play notes that are in pairs by making the first of the pair slightly longer than written (augmentation) and the second shorter, resulting in a bouncy, uneven rhythm."},{"definition":"(of a bowler) to make the ball move sideways in its trajectory."},{"definition":"To move one's arm in a punching motion."},{"definition":"In dancing, to turn around in a small circle with one's partner, holding hands or arms.","example":"\"to swing one's partner\", or simply \"to swing\""},{"definition":"To admit or turn something for the purpose of shaping it; said of a lathe.","example":"The lathe can swing a pulley of 12 inches diameter."},{"definition":"To put (a door, gate, etc.) on hinges so that it can swing or turn."},{"definition":"To turn round by action of wind or tide when at anchor.","example":"A ship swings with the tide."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/swing-us.mp3","text":"/ˈswɪŋ/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/swing-au.mp3","text":"/ˈswɪŋ/"}]},{"word":"SYMBOLS","idx":5162,"count":12733176,"meanings":[{"definitions":[{"definition":"A character or glyph representing an idea, concept or object.","example":"$ is the symbol for dollars in the US and some other countries."},{"definition":"A thing considered the embodiment of a concept or object.","example":"The lion is the symbol of courage; the lamb is the symbol of meekness or patience."},{"definition":"A type of noun whereby the form refers to the same entity independently of the context; a symbol arbitrarily denotes a referent. See also icon and index."},{"definition":"A summary of a dogmatic statement of faith.","example":"The Apostles, Nicene Creed and the confessional books of Protestantism, such as the Augsburg Confession of Lutheranism are considered symbols."},{"definition":"The numerical expression which defines a plane's position relative to the assumed axes."},{"definition":"That which is thrown into a common fund; hence, an appointed or accustomed duty."},{"definition":"Share; allotment."},{"definition":"An internal identifier used by a debugger to relate parts of the compiled program to the corresponding names in the source code."},{"definition":"A signalling event on a communications channel; a signal that cannot be further divided into meaningful information."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To symbolize."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/symbols-us.mp3","text":"/ˈsɪmbəlz/"}]},{"word":"LAT","idx":5163,"count":12732598,"meanings":[{"definitions":[{"definition":"A staff, particularly one of an Indian kind."},{"definition":"A monumental pillar, particularly the Buddhist columns erected in East India."},{"definition":"(usually in the plural) A latrine: a rudimentary or military facility for urination and defecation."},{"definition":"The gold-backed monetary unit of Latvia from August 1922 until April 1941, when it was replaced by the Soviet ruble; it was typically pegged at about 25 to the British pound."},{"definition":"The floating fiat monetary unit of Latvia from 1992 until January 2014, when it was replaced by the euro."},{"definition":"A coin or bill of either currency."},{"definition":"(usually in the plural) A latissimus dorsi muscle."},{"definition":"Latitude"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/lɑːt/"}]},{"word":"META","idx":5164,"count":12731331,"meanings":[{"definitions":[{"definition":"Self-referential; structured analogously, but at a higher level.","example":"Suppose you have a genie that grants you three wishes. If you wish for infinite wishes, that is a meta wish."},{"definition":"Prominent in the metagame; effective and frequently used in competitive gameplay.","example":"I don't think the character will be meta even with the recent buffs."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Boundary marker."},{"definition":"Either of the conical columns at each end of an Ancient Roman circus."},{"definition":"Metagame; the most effective tactics and strategies used in a competitive video game."},{"definition":"Metoidioplasty."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/meta-1-uk.mp3","text":"/ˈmɛtə/"}]},{"word":"HUMANS","idx":5165,"count":12729034,"meanings":[{"definitions":[{"definition":"A human being, whether man, woman or child.","example":"Humans share common ancestors with other apes."}],"partOfSpeech":"n"}]},{"word":"ANALOG","idx":5166,"count":12726931,"meanings":[{"definitions":[{"definition":"Something that bears an analogy to something else"},{"definition":"An organ or structure that is similar in function to one in another kind of organism but is of dissimilar evolutionary origin"},{"definition":"A structural derivative of a parent compound that often differs from it by a single element"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a device or system) in which the value of a data item (such as time) is represented by a continuous(ly) variable physical quantity that can be measured (such as the shadow of a sundial)"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/analog-us.mp3","text":"/ˈæ.nə.lɔɡ/"}]},{"word":"FACIAL","idx":5167,"count":12721452,"meanings":[{"definitions":[{"definition":"A personal care beauty treatment which involves cleansing and moisturizing of the human face."},{"definition":"A kind of early silent film focusing on the facial expressions of the actor."},{"definition":"(in some contact sports) A foul play which involves one player hitting another in the face."},{"definition":"A sex act of male ejaculation onto another person's face.","example":"He gave his wife a creamy facial."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or affecting the face."},{"definition":"(by extension) (of a law or regulation validity) on its face; as it appears (as opposed to as it is applied)","example":"The facial constitutionality of the law is in question."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/facial-au.mp3","text":"/ˈfeɪʃəl/"}]},{"word":"CHOOSING","idx":5168,"count":12717377,"meanings":[{"definitions":[{"definition":"To pick; to make the choice of; to select.","example":"I chose a nice ripe apple from the fruit bowl."},{"definition":"To elect.","example":"He was chosen as president in 1990."},{"definition":"To decide to act in a certain way.","example":"I chose to walk to work today."},{"definition":"To wish; to desire; to prefer."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of making a choice."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʃuːzɪŋ/"}]},{"word":"TALENT","idx":5169,"count":12712170,"meanings":[{"definitions":[{"definition":"A marked natural ability or skill.","example":"He has a real talent for drawing."},{"definition":"A unit of weight and money used in ancient times in Greece, the Roman Empire, and the Middle East."},{"definition":"A desire or inclination for something."},{"definition":"People of talent, viewed collectively; a talented person.","example":"The director searched their talent pool to fill the new opening."},{"definition":"The men or (especially) women of a place or area, judged by their attractiveness.","example":"Not much talent in this bar tonight—let's hit the clubs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/talent-us.mp3","text":"/ˈtælənt/"}]},{"word":"DATED","idx":5170,"count":12707511,"meanings":[{"definitions":[{"definition":"To note the time or place of writing or executing; to express in an instrument the time of its execution.","example":"to date a letter, a bond, a deed, or a charter"},{"definition":"To note or fix the time of (an event); to give the date of."},{"definition":"To determine the age of something.","example":"to date the building of the pyramids"},{"definition":"To take (someone) on a date, or a series of dates."},{"definition":"(by extension) To have a steady relationship with; to be romantically involved with."},{"definition":"(by extension) To have a steady relationship with each other; to be romantically involved with each other.","example":"They met a couple of years ago, but have been dating for about five months."},{"definition":"To make or become old, especially in such a way as to fall out of fashion, become less appealing or attractive, etc.","example":"The comedian dated himself by making quips about bands from the 1960s."},{"definition":"(with from) To have beginning; to begin; to be dated or reckoned."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Marked with a date.","example":"The first dated entry in the diary was from October 1922."},{"definition":"Outdated.","example":"\"Omnibus\" is a dated term for a bus."},{"definition":"Anachronistic; being obviously inappropriate for its present context.","example":"Calling a happy person gay seems awfully dated nowadays; people will assume you mean something else."},{"definition":"No longer fashionable.","example":"Slang can become dated very quickly."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/dated-us.mp3","text":"/ˈdeɪtɪd/"}]},{"word":"FLEXIBILITY","idx":5171,"count":12700246,"meanings":[{"definitions":[{"definition":"The quality of being flexible; suppleness; pliability."},{"definition":"The quality of having options.","example":"I had some flexibility in terms of whether to stay in a hotel or in a bed-and-breakfast."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/flexibility-us.mp3"}]},{"word":"SEEKER","idx":5172,"count":12696541,"meanings":[{"definitions":[{"definition":"One who seeks."},{"definition":"Especially, a religious seeker: a pilgrim, or one who aspires to enlightenment or salvation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsikɚ/"},{"text":"/ˈsiːkə/"}]},{"word":"WISDOM","idx":5173,"count":12696160,"meanings":[{"definitions":[{"definition":"An element of personal character that enables one to distinguish the wise from the unwise."},{"definition":"A piece of wise advice."},{"definition":"The discretionary use of knowledge for the greatest good."},{"definition":"The ability to apply relevant knowledge in an insightful way, especially to different situations from that in which the knowledge was gained."},{"definition":"The ability to make a decision based on the combination of knowledge, experience, and intuitive understanding."},{"definition":"The ability to know and apply spiritual truths."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/wisdom-us.mp3","text":"/ˈwɪzdəm/"}]},{"word":"SHOOT","idx":5174,"count":12695618,"meanings":[{"definitions":[{"definition":"The emerging stem and embryonic leaves of a new plant."},{"definition":"A photography session."},{"definition":"A hunt or shooting competition."},{"definition":"An event that is unscripted or legitimate."},{"definition":"The act of shooting; the discharge of a missile; a shot."},{"definition":"A rush of water; a rapid."},{"definition":"A weft thread shot through the shed by the shuttle; a pick."},{"definition":"A shoat; a young pig."},{"definition":"A vein of ore running in the same general direction as the lode."},{"definition":"An inclined plane, either artificial or natural, down which timber, coal, ore, etc., are caused to slide; a chute."},{"definition":"The act of taking all point cards in one hand."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To launch a projectile."},{"definition":"To move or act quickly or suddenly."},{"definition":"To act or achieve."},{"definition":"To measure the distance and direction to (a point)."},{"definition":"To inject a drug (such as heroin) intravenously."},{"definition":"To develop, move forward."},{"definition":"To protrude; to jut; to project; to extend.","example":"The land shoots into a promontory."},{"definition":"To plane straight; to fit by planing."},{"definition":"To variegate as if by sprinkling or intermingling; to color in spots or patches.W"},{"definition":"To shoot the moon."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A mild expletive, expressing disbelief or disdain","example":"Didn't you have a concert tonight?"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/shoot-us.mp3","text":"/ʃuːt/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/shoot-uk.mp3","text":"/ʃuːt/"}]},{"word":"BOUNDARY","idx":5175,"count":12695163,"meanings":[{"definitions":[{"definition":"The dividing line or location between two areas."},{"definition":"(often in the plural) The bounds, confines, or limits between immaterial things (such as one’s comfort zone, privacy, or professional sphere and the realm beyond)."},{"definition":"An edge or line marking an edge of the playing field."},{"definition":"An event whereby the ball is struck and either touches or passes over a boundary (with or without bouncing), usually resulting in an award of 4 (four) or 6 (six) runs respectively for the batting team."},{"definition":"(of a set) The set of points in the closure of a set S, not belonging to the interior of that set."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/boundary-us.mp3","text":"/ˈbaʊndəɹi/"}]},{"word":"MINT","idx":5176,"count":12694588,"meanings":[{"definitions":[{"definition":"A building or institution where money (originally, only coins) is produced under government licence."},{"definition":"A large amount of money. A vast sum or amount, etc.","example":"It must have cost a mint to produce!"},{"definition":"Any place regarded as a source of unlimited supply; the supply itself."},{"definition":"Any plant in the genus Mentha in the family Lamiaceae, typically aromatic with square stems."},{"definition":"The flavouring of the plant, either a sweet, a jelly or sauce."},{"definition":"Any plant in the mint family, Lamiaceae."},{"definition":"A green colour, like that of mint."},{"definition":"A mint-flavored candy, often eaten to sweeten the smell of the breath."},{"definition":"(provincial) Intent, purpose; an attempt, try; effort, endeavor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reproduce (coins), usually en masse, under licence."},{"definition":"To invent; to forge; to fabricate; to fashion."},{"definition":"(provincial) To try, attempt; take aim."},{"definition":"(provincial) To try, attempt, endeavor; to take aim at; to try to hit; to purpose."},{"definition":"To hint; suggest; insinuate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(with condition) Like new.","example":"in mint condition."},{"definition":"In near-perfect condition; uncirculated."},{"definition":"Unused with original gum; as issued originally."},{"definition":"Very good."},{"definition":"Attractive; beautiful; handsome."},{"definition":"Of a green colour, like that of the mint plant."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/mint-us.mp3","text":"/mɪnt/"}]},{"word":"OFFSET","idx":5178,"count":12689932,"meanings":[{"definitions":[{"definition":"Anything that acts as counterbalance; a compensating equivalent.","example":"Today's victory was an offset to yesterday's defeat."},{"definition":"A form of countertrade arrangement, in which the seller agrees to purchase within a set time frame products of a certain value from the buying country. This kind of agreement may be used in large international public sector contracts such as arms sales."},{"definition":"(c. 1555) A time at which something begins; outset."},{"definition":"The offset printing process, in which ink is carried from a metal plate to a rubber blanket and from there to the printing surface.","example":"offset lithographs"},{"definition":"The difference between a target memory address and a base address.","example":"An array of bytes uses its index as the offset, of words a multiple thereof."},{"definition":"(signal analysis) The displacement between the base level of a measurement and the signal's real base level.","example":"The raw signal data was subjected to a baseline correction process to subtract the sensor's offset and drift variations."},{"definition":"The distance by which one thing is out of alignment with another.","example":"There is a small offset between the switch and the indicator which some users found confusing."},{"definition":"A short distance measured at right angles from a line actually run to some point in an irregular boundary, or to some object."},{"definition":"An abrupt bend in an object, such as a rod, by which one part is turned aside out of line, but nearly parallel, with the rest; the part thus bent aside."},{"definition":"A short prostrate shoot that takes root and produces a tuft of leaves, etc."},{"definition":"A spur from a range of hills or mountains."},{"definition":"A horizontal ledge on the face of a wall, formed by a diminution of its thickness, or by the weathering or upper surface of a part built out from it; a set-off."},{"definition":"A terrace on a hillside."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To compensate for, by applying a change in the opposite direction.","example":"I'll offset the time difference locally."},{"definition":"To form an offset in (a wall, rod, pipe, etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɑfˈsɛt/"},{"text":"/ɒfˈsɛt/"}]},{"word":"PAYDAY","idx":5179,"count":12682146,"meanings":[{"definitions":[{"definition":"The day of the week or month, or the specific day, on which an employee's wages or salary is paid."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpeɪdeɪ/"}]},{"word":"ELITE","idx":5181,"count":12673836,"meanings":[{"definitions":[{"definition":"A special group or social class of people which have a superior intellectual, social or economic status as, the elite of society."},{"definition":"Someone who is among the best at a certain task."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of high birth or social position; aristocratic or patrician."},{"definition":"Representing the choicest or most select of a group."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/eɪˈliːt/"}]},{"word":"GI","idx":5182,"count":12673643,"meanings":[{"definitions":[{"definition":"A martial arts uniform."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡiː/"}]},{"word":"SPIN","idx":5183,"count":12671696,"meanings":[{"definitions":[{"definition":"Rapid circular motion.","example":"He put some spin on the cue ball."},{"definition":"A quantum angular momentum associated with subatomic particles, which also creates a magnetic moment."},{"definition":"A favourable comment or interpretation intended to bias opinion on an otherwise unpleasant situation.","example":"The politician was mocked in the press for his reliance on spin rather than facts."},{"definition":"Rotation of the ball as it flies through the air; sideways movement of the ball as it bounces."},{"definition":"A condition of flight where a stalled aircraft is simultaneously pitching, yawing and rolling in a spinning motion."},{"definition":"A brief trip by vehicle, especially one made for pleasure.","example":"I'm off out for a spin in my new sports car."},{"definition":"A bundle of spun material; a mass of strands and filaments."},{"definition":"A single play of a record by a radio station."},{"definition":"A search of a prisoner's cell for forbidden articles."},{"definition":"Unmarried woman, spinster."},{"definition":"The use of an exercise bicycle, especially as part of a gym class."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rotate, revolve, gyrate (usually quickly); to partially or completely rotate to face another direction.","example":"I spun myself around a few times."},{"definition":"To make yarn by twisting and winding fibers together.","example":"They spin the cotton into thread."},{"definition":"To present, describe, or interpret, or to introduce a bias or slant, so as to give something a favorable or advantageous appearance."},{"definition":"(of a bowler) To make the ball move sideways when it bounces on the pitch."},{"definition":"(of a ball) To move sideways when bouncing."},{"definition":"To form into thin strips or ribbons, as with sugar"},{"definition":"To form (a web, a cocoon, silk, etc.) from threads produced by the extrusion of a viscid, transparent liquid, which hardens on coming into contact with the air; said of the spider, the silkworm, etc."},{"definition":"To shape, as malleable sheet metal, into a hollow form, by bending or buckling it by pressing against it with a smooth hand tool or roller while the metal revolves, as in a lathe."},{"definition":"To move swiftly.","example":"to spin along the road in a carriage, on a bicycle, etc."},{"definition":"To stream or issue in a thread or a small current or jet.","example":"Blood spins from a vein."},{"definition":"To wait in a loop until some condition becomes true."},{"definition":"To play (vinyl records, etc.) as a disc jockey."},{"definition":"To use an exercise bicycle, especially as part of a gym class."},{"definition":"An abnormal condition in journal bearings where the bearing seizes to the shaft that is rotating and rotates inside the journal, destroying both the shaft and the journal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/spin-us.mp3","text":"/spɪn/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/spin-au.mp3","text":"/spɪn/"}]},{"word":"HOLDERS","idx":5184,"count":12665447,"meanings":[{"definitions":[{"definition":"A thing that holds.","example":"Put your umbrella in the umbrella holder."},{"definition":"A person who temporarily or permanently possesses something.","example":"He's been an account holder with us since 2004."},{"definition":"One who is employed in the hold of a vessel."},{"definition":"The defending champion."}],"partOfSpeech":"n"}]},{"word":"BELIEVES","idx":5185,"count":12663723,"meanings":[{"definitions":[{"definition":"To accept as true, particularly without absolute certainty (i.e., as opposed to knowing)","example":"I believe there are faeries."},{"definition":"To accept that someone is telling the truth.","example":"Why did I ever believe you?"},{"definition":"To have religious faith; to believe in a greater truth.","example":"After that night in the church, I believed."},{"definition":"To opine, think, reckon"}],"partOfSpeech":"ve"}]},{"word":"POEMS","idx":5187,"count":12662561,"meanings":[{"definitions":[{"definition":"A literary piece written in verse."},{"definition":"A piece of writing in the tradition of poetry, an instance of poetry."},{"definition":"A piece of poetic writing, that is with an intensity or depth of expression or inspiration greater than is usual in prose."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/poems-us.mp3","text":"/poʊmz/"}]},{"word":"DEADLINE","idx":5188,"count":12662277,"meanings":[{"definitions":[{"definition":"A time limit in the form of a date on or before which something must be completed.","example":"I must make this deadline or my boss will kill me!"},{"definition":"A guideline marked on a plate for a printing press."},{"definition":"A line that does not move."},{"definition":"A boundary around a prison, prisoners crossing which would be shot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To render an item non-mission-capable; to ground an aircraft, etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/deadline-uk.mp3","text":"/ˈdɛdˌlaɪn/"}]},{"word":"JURISDICTION","idx":5189,"count":12657881,"meanings":[{"definitions":[{"definition":"The power, right, or authority to interpret and apply the law."},{"definition":"The power or right to exercise authority."},{"definition":"The power or right to perform some action as part of applying the law."},{"definition":"The authority of a sovereign power to govern or legislate."},{"definition":"The limits or territory within which authority may be exercised."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/d͡ʒɝɪsˈdɪkʃən/"},{"text":"/d͡ʒɔːɹɪsˈdɪkʃən/"}]},{"word":"ROBOT","idx":5190,"count":12656312,"meanings":[{"definitions":[{"definition":"A machine built to carry out some complex task or group of tasks by physically moving, especially one which can be programmed."},{"definition":"An intelligent mechanical being designed to look like a human or other creature, and usually made from metal."},{"definition":"A person who does not seem to have any emotions."},{"definition":"A traffic light (from earlier robot policeman)."},{"definition":"A theodolite which follows the movements of a prism and can be used by a one-man crew."},{"definition":"A style of dance popular in disco in which the dancer imitates the stiff movements of a stereotypical android robot."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/robot-us.mp3","text":"/ˈɹoʊbɑt/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/robot-au.mp3","text":"/ˈɹoʊbət/"}]},{"word":"DISPLAYING","idx":5191,"count":12650318,"meanings":[{"definitions":[{"definition":"To show conspicuously; to exhibit; to demonstrate; to manifest."},{"definition":"To make a display; to act as one making a show or demonstration."},{"definition":"To extend the front of (a column), bringing it into line."},{"definition":"To make conspicuous by using large or prominent type."},{"definition":"To discover; to descry."},{"definition":"To spread out, to unfurl."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/displaying-us.mp3","text":"/dɪsˈpleɪ.ɪŋ/"}]},{"word":"WITNESS","idx":5192,"count":12643368,"meanings":[{"definitions":[{"definition":"Attestation of a fact or event; testimony.","example":"She can bear witness, since she was there at the time."},{"definition":"One who sees or has personal knowledge of something.","example":"As a witness to the event, I can confirm that he really said that."},{"definition":"Someone called to give evidence in a court.","example":"The witness for the prosecution did not seem very credible."},{"definition":"One who is called upon to witness an event or action, such as a wedding or the signing of a document.","example":"The bridesmaid and best man at a wedding typically serve as the witnesses."},{"definition":"Something that serves as evidence; a sign or token."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To furnish proof of, to show.","example":"1667: round he throws his baleful eyes / That witness'd huge affliction and dismay — John Milton, Paradise Lost, Book 1 ll. 56-7"},{"definition":"To take as evidence."},{"definition":"To see or gain knowledge of through experience.","example":"He witnessed the accident."},{"definition":"(construed with to or for) To present personal religious testimony; to preach at (someone) or on behalf of."},{"definition":"To see the execution of (a legal instrument), and subscribe it for the purpose of establishing its authenticity.","example":"to witness a bond or a deed"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/witness-us.mp3","text":"/ˈwɪtnəs/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/witness-au.mp3","text":"/ˈwɪtnəs/"}]},{"word":"COLLINS","idx":5193,"count":12638925,"meanings":[{"definitions":[{"definition":"Any of various alcoholic drinks made with lemon juice, sugar, and carbonated water."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɑlɪnz/"},{"text":"/ˈkɒlɪnz/"}]},{"word":"EQUIPPED","idx":5194,"count":12635856,"meanings":[{"definitions":[{"definition":"To supply with something necessary in order to carry out a specific action or task; to provide with (e.g. weapons, provisions, munitions, rigging)"},{"definition":"To dress up; to array; to clothe."},{"definition":"To prepare (someone) with a skill."},{"definition":"To equip oneself with (an item)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪˈkwɪpt/"}]},{"word":"STAGES","idx":5195,"count":12632816,"meanings":[{"definitions":[{"definition":"A phase.","example":"Completion of an identifiable stage of maintenance such as removing an aircraft engine for repair or storage."},{"definition":"A platform; a surface, generally elevated, upon which show performances or other public events are given.","example":"The band returned to the stage to play an encore."},{"definition":"A floor or storey of a house."},{"definition":"A floor elevated for the convenience of mechanical work, etc.; scaffolding; staging."},{"definition":"A platform, often floating, serving as a kind of wharf."},{"definition":"A stagecoach, an enclosed horsedrawn carriage used to carry passengers.","example":"The stage pulled into town carrying the payroll for the mill and three ladies."},{"definition":"A place of rest on a regularly travelled road; a station; a place appointed for a relay of horses."},{"definition":"A degree of advancement in a journey; one of several portions into which a road or course is marked off; the distance between two places of rest on a road.","example":"a stage of ten miles"},{"definition":"The number of an electronic circuit’s block, such as a filter, an amplifier, etc.","example":"a 3-stage cascade of a 2nd-order bandpass Butterworth filter"},{"definition":"The place on a microscope where the slide is located for viewing.","example":"He placed the slide on the stage."},{"definition":"A level; one of the sequential areas making up the game.","example":"How do you get past the flying creatures in the third stage?"},{"definition":"A place where anything is publicly exhibited, or a remarkable affair occurs; the scene."},{"definition":"The succession of rock strata laid down in a single age on the geologic time scale."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce on a stage, to perform a play.","example":"The local theater group will stage \"Pride and Prejudice\"."},{"definition":"To demonstrate in a deceptive manner.","example":"The salesman's demonstration of the new cleanser was staged to make it appear highly effective."},{"definition":"To orchestrate; to carry out.","example":"A protest will be staged in the public square on Monday."},{"definition":"To place in position to prepare for use.","example":"We staged the cars to be ready for the start, then waited for the starter to drop the flag."},{"definition":"To determine what stage (a disease, etc.) has progressed to"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsteɪd͡ʒɪz/"}]},{"word":"ENCOURAGED","idx":5196,"count":12632676,"meanings":[{"definitions":[{"definition":"To mentally support; to motivate, give courage, hope or spirit.","example":"I encouraged him during his race."},{"definition":"To spur on, strongly recommend.","example":"We encourage the use of bicycles in the town centre."},{"definition":"To foster, give help or patronage","example":"The royal family has always encouraged the arts in word and deed"}],"partOfSpeech":"ve"}]},{"word":"WINDS","idx":5198,"count":12628386,"meanings":[{"definitions":[{"definition":"Real or perceived movement of atmospheric air usually caused by convection or differences in air pressure.","example":"As they accelerated onto the motorway, the wind tore the plywood off the car's roof-rack."},{"definition":"Air artificially put in motion by any force or action.","example":"the wind of a cannon ball;  the wind of a bellows"},{"definition":"The ability to breathe easily.","example":"After the second lap he was already out of wind."},{"definition":"News of an event, especially by hearsay or gossip. (Used with catch, often in the past tense.)","example":"Steve caught wind of Martha's dalliance with his best friend."},{"definition":"One of the five basic elements in Indian and Japanese models of the Classical elements)."},{"definition":"Flatus.","example":"Eww. Someone just passed wind."},{"definition":"Breath modulated by the respiratory and vocal organs, or by an instrument."},{"definition":"The woodwind section of an orchestra. Occasionally also used to include the brass section."},{"definition":"A direction from which the wind may blow; a point of the compass; especially, one of the cardinal points, which are often called the \"four winds\"."},{"definition":"Types of playing-tile in the game of mah-jongg, named after the four winds."},{"definition":"A disease of sheep, in which the intestines are distended with air, or rather affected with a violent inflammation. It occurs immediately after shearing."},{"definition":"Mere breath or talk; empty effort; idle words."},{"definition":"A bird, the dotterel."},{"definition":"The region of the solar plexus, where a blow may paralyze the diaphragm and cause temporary loss of breath or other injury."},{"definition":"The act of winding or turning; a turn; a bend; a twist."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To blow air through a wind instrument or horn to make a sound."},{"definition":"To cause (someone) to become breathless, as by a blow to the abdomen, or by physical exertion, running, etc.","example":"The boxer was winded during round two."},{"definition":"To cause a baby to bring up wind by patting its back after being fed."},{"definition":"To turn a boat or ship around, so that the wind strikes it on the opposite side."},{"definition":"To expose to the wind; to winnow; to ventilate."},{"definition":"To perceive or follow by scent.","example":"The hounds winded the game."},{"definition":"To rest (a horse, etc.) in order to allow the breath to be recovered; to breathe."},{"definition":"To turn a windmill so that its sails face into the wind."},{"definition":"To turn coils of (a cord or something similar) around something.","example":"to wind thread on a spool or into a ball"},{"definition":"To tighten the spring of a clockwork mechanism such as that of a clock.","example":"Please wind that old-fashioned alarm clock."},{"definition":"To entwist; to enfold; to encircle."},{"definition":"To travel in a way that is not straight.","example":"Vines wind round a pole.  The river winds through the plain."},{"definition":"To have complete control over; to turn and bend at one's pleasure; to vary or alter or will; to regulate; to govern."},{"definition":"To introduce by insinuation; to insinuate."},{"definition":"To cover or surround with something coiled about.","example":"to wind a rope with twine"},{"definition":"To cause to move by exerting a winding force; to haul or hoist, as by a winch."},{"definition":"To turn (a ship) around, end for end."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/wɪndz/"}]},{"word":"POWDER","idx":5199,"count":12627415,"meanings":[{"definitions":[{"definition":"The fine particles which are the result of reducing dry substance by pounding, grinding, or triturating, or the result of decay; dust."},{"definition":"A mixture of fine dry, sweet-smelling particles applied to the face or other body parts, to reduce shine or to alleviate chaffing."},{"definition":"An explosive mixture used in gunnery, blasting, etc.; gunpowder."},{"definition":"A very pale blue colour."},{"definition":"Freshly fallen, uncompacted snow, especially in the context of Alpine skiing","example":"Expert skiers love skiing on powder snow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reduce to fine particles; to pound, grind, or rub into a powder."},{"definition":"To sprinkle with powder, or as if with powder.","example":"to powder one's hair"},{"definition":"To use powder on the hair or skin."},{"definition":"To turn into powder; to become powdery."},{"definition":"To sprinkle with salt; to corn, as meat."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/powder-us.mp3"},{"text":"/ˈpaʊ.də(ɹ)/"}]},{"word":"BROADWAY","idx":5200,"count":12620441,"meanings":[{"definitions":[{"definition":"An esplanade."}],"partOfSpeech":"n"}]},{"word":"ACQUIRED","idx":5201,"count":12619643,"meanings":[{"definitions":[{"definition":"To get."},{"definition":"To gain, usually by one's own exertions; to get as one's own","example":"He acquired a title."},{"definition":"To contract."},{"definition":"To sample signals and convert them into digital values."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Developed after birth; not congenital."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/acquired-us.mp3","text":"/əˈkwaɪɹd/"}]},{"word":"ASSESS","idx":5202,"count":12614289,"meanings":[{"definitions":[{"definition":"To determine, estimate or judge the value of; to evaluate","example":"He assessed the situation."},{"definition":"To impose or charge, especially as punishment for an infraction.","example":"A $10.00 late fee will be assessed on all overdue accounts."},{"definition":"To calculate and demand (the tax money due) from a person or entity.","example":"Once you've submitted a tax return, the Tax Department will assess the amount of tax you still owe."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/assess-us.mp3","text":"/əˈsɛs/"}]},{"word":"WASH","idx":5203,"count":12612759,"meanings":[{"definitions":[{"definition":"The process or an instance of washing or being washed by water or other liquid.","example":"I'm going to have a quick wash before coming to bed."},{"definition":"A liquid used for washing."},{"definition":"A lotion or other liquid with medicinal or hygienic properties.","example":"hand wash"},{"definition":"The quantity of clothes washed at a time.","example":"There's a lot in that wash: maybe you should split it into two piles."},{"definition":"A smooth and translucent painting created using a paintbrush holding a large amount of solvent and a small amount of paint."},{"definition":"The sound of breaking of the seas, e.g., on the shore.","example":"I could hear the wash of the wave."},{"definition":"The wake of a moving ship.","example":"Sail away from the wash to avoid rocking the boat."},{"definition":"The turbulence left in the air by a moving airplane."},{"definition":"Ground washed away to the sea or a river."},{"definition":"A piece of ground washed by the action of water, or sometimes covered and sometimes left dry; the shallowest part of a river, or arm of the sea; also, a bog; a marsh."},{"definition":"A shallow body of water."},{"definition":"In arid and semi-arid regions, the normally dry bed of an intermittent or ephemeral stream; an arroyo or wadi."},{"definition":"A situation in which losses and gains or advantages and disadvantages are equivalent; a situation in which there is no net change."},{"definition":"A fictitious kind of sale of stock or other securities between parties of one interest, or by a broker who is both buyer and seller, and who minds his own interest rather than that of his clients."},{"definition":"Waste liquid, the refuse of food, the collection from washed dishes, etc., from a kitchen, often used as food for pigs; pigwash."},{"definition":"In distilling, the fermented wort before the spirit is extracted."},{"definition":"A mixture of dunder, molasses, water, and scummings, used in the West Indies for distillation."},{"definition":"A thin coat of paint or metal laid on anything for beauty or preservation."},{"definition":"The blade of an oar."},{"definition":"The backward current or disturbed water caused by the action of oars, or of a steamer's screw or paddles, etc."},{"definition":"Ten strikes, or bushels, of oysters."},{"definition":"The upper surface of a member or material when given a slope to shed water; hence, a structure or receptacle shaped so as to receive and carry off water.","example":"a carriage wash in a stable"},{"definition":"A lighting effect that fills a scene with a chosen colour."},{"definition":"(stagecraft) A lighting fixture that can cast a wide beam of light to evenly fill an area with light, as opposed to a spotlight."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clean with water.","example":"Dishwashers wash dishes much more efficiently than most humans."},{"definition":"To move or erode by the force of water in motion.","example":"Heavy rains wash a road or an embankment."},{"definition":"To separate valuable material (such as gold) from worthless material by the action of flowing water."},{"definition":"To clean oneself with water.","example":"I wash every morning after getting up."},{"definition":"To cover with water or any liquid; to wet; to fall on and moisten.","example":"Waves wash the shore."},{"definition":"To move with a lapping or swashing sound; to lap or splash.","example":"to hear the water washing"},{"definition":"To be eroded or carried away by the action of water."},{"definition":"To be cogent, convincing; to withstand critique."},{"definition":"To bear without injury the operation of being washed.","example":"Some calicoes do not wash."},{"definition":"To be wasted or worn away by the action of water, as by a running or overflowing stream, or by the dashing of the sea; said of road, a beach, etc."},{"definition":"To cover with a thin or watery coat of colour; to tint lightly and thinly."},{"definition":"To overlay with a thin coat of metal.","example":"steel washed with silver"},{"definition":"To cause dephosphorization of (molten pig iron) by adding substances containing iron oxide, and sometimes manganese oxide."},{"definition":"To pass (a gas or gaseous mixture) through or over a liquid for the purpose of purifying it, especially by removing soluble constituents."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/wash-us.mp3","text":"/wɑʃ/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/wash-uk.mp3","text":"/wɒʃ/"}]},{"word":"CARTRIDGES","idx":5204,"count":12611549,"meanings":[{"definitions":[{"definition":"The package consisting of the bullet, primer, and casing containing gunpowder; a round of ammunition."},{"definition":"(by extension) A prefabricated subassembly that can be easily installed in or removed from a larger mechanism or replaced with another interchangeable subassembly."},{"definition":"A vessel which contains the ink or toner for a computer printer and can be easily replaced with another."},{"definition":"Magnetic tape storage, used for storing (backup) copies of data."},{"definition":"A removable enclosure containing read-only memory devices, used for rapid loading of software onto a home computer or video game console."},{"definition":"A small paper package, e.g. in an old book about making printer's type: After all the type has been cast: \"The Boy will paper up each sort in a cartridge by itself\"."}],"partOfSpeech":"n"}]},{"word":"STONES","idx":5205,"count":12611462,"meanings":[{"definitions":[{"definition":"A hard earthen substance that can form large rocks."},{"definition":"A small piece of stone, a pebble."},{"definition":"A gemstone, a jewel, especially a diamond."},{"definition":"(plural: stone) A unit of mass equal to 14 pounds. Used to measure the weights of people, animals, cheese, wool, etc. 1 stone ≈ 6.3503 kilograms"},{"definition":"The central part of some fruits, particularly drupes; consisting of the seed and a hard endocarp layer.","example":"a peach stone"},{"definition":"A hard, stone-like deposit.","example":"kidney stone"},{"definition":"A playing piece made of any hard material, used in various board games such as backgammon, and go."},{"definition":"A dull light grey or beige, like that of some stones."},{"definition":"A 42-pound, precisely shaped piece of granite with a handle attached, which is bowled down the ice."},{"definition":"A monument to the dead; a gravestone or tombstone."},{"definition":"A mirror, or its glass."},{"definition":"A testicle of an animal."},{"definition":"A stand or table with a smooth, flat top of stone, commonly marble, on which to arrange the pages of a book, newspaper, etc. before printing; also called imposing stone."},{"definition":"Testicles; balls."},{"definition":"Courage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pelt with stones, especially to kill by pelting with stones.","example":"She got stoned to death after they found her."},{"definition":"To wall with stones."},{"definition":"To remove a stone from (fruit etc.)."},{"definition":"To form a stone during growth, with reference to fruit etc."},{"definition":"To intoxicate, especially with narcotics. (Usually in passive)"},{"definition":"To do nothing, to stare blankly into space and not pay attention when relaxing or when bored."},{"definition":"To lap with an abrasive stone to remove surface irregularities."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/stones-us.mp3","text":"/stoʊnz/"}]},{"word":"ENTRANCE","idx":5206,"count":12610212,"meanings":[{"definitions":[{"definition":"The action of entering, or going in.","example":"Her entrance attracted no attention whatsoever."},{"definition":"The act of taking possession, as of property, or of office.","example":"the entrance of an heir upon his inheritance, or of a magistrate into office"},{"definition":"The place of entering, as a gate or doorway.","example":"Place your bag by the entrance so that you can find it easily."},{"definition":"The right to go in.","example":"You'll need a ticket to gain entrance to the museum."},{"definition":"The entering upon; the beginning, or that with which the beginning is made; the commencement; initiation.","example":"a difficult entrance into business"},{"definition":"The causing to be entered upon a register, as a ship or goods, at a customhouse; an entering.","example":"His entrance of the arrival was made the same day."},{"definition":"The angle which the bow of a vessel makes with the water at the water line."},{"definition":"The bow, or entire wedgelike forepart of a vessel, below the water line."},{"definition":"When a musician starts playing or singing, entry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To delight and fill with wonder.","example":"The children were immediately entranced by all the balloons."},{"definition":"To put into a trance."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/entrance-1-uk.mp3","text":"/ˈɛn.tɹəns/"}]},{"word":"GNOME","idx":5207,"count":12609820,"meanings":[{"definitions":[{"definition":"A brief reflection or maxim; a pithy saying."},{"definition":"(magic, Rosicrucianism) An elemental (spirit or corporeal creature associated with a classical element) associated with earth."},{"definition":"(fantasy literature) One of a race of imaginary human-like beings, usually depicted as short and typically bearded males, who inhabit the inner parts of the earth and act as guardians of mines, mineral treasure, etc.; in modern fantasy literature, when distinguished from dwarves, gnomes are usually even smaller than dwarves and more focussed on engineering than mining."},{"definition":"A dwarf; a goblin; a person of small stature or misshapen features, or of strange appearance."},{"definition":"The northern pygmy owl, Glaucidium gnoma, a small owl of the western United States."},{"definition":"A small statue of a dwarf-like character, often bearded, placed in a garden."},{"definition":"An upper atmospheric optical phenomenon associated with thunderstorms, a compact blue starter."},{"definition":"A banker, especially a secretive international one.","example":"the gnomes of Zurich"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/gnome-1-uk.mp3","text":"/nəʊm/"}]},{"word":"ROOTS","idx":5208,"count":12609370,"meanings":[{"definitions":[{"definition":"The part of a plant, generally underground, that anchors and supports the plant body, absorbs and stores water and nutrients, and in some plants is able to perform vegetative reproduction.","example":"This tree's roots can go as deep as twenty metres underground."},{"definition":"A root vegetable."},{"definition":"The part of a tooth extending into the bone holding the tooth in place.","example":"Root damage is a common problem of overbrushing."},{"definition":"The part of a hair under the skin that holds the hair in place.","example":"The root is the only part of the hair that is alive."},{"definition":"The part of a hair near the skin that has not been dyed, permed, or otherwise treated.","example":"He dyed his hair black last month, so the grey roots can be seen."},{"definition":"The primary source; origin.","example":"The love of money is the root of all evil."},{"definition":"Of a number or expression, a number which, when raised to a specified power, yields the specified number or expression.","example":"The cube root of 27 is 3."},{"definition":"A square root (understood if no power is specified; in which case, “the root of” is often abbreviated to “root”).","example":"Multiply by root 2."},{"definition":"A zero (of an equation)."},{"definition":"The single node of a tree that has no parent."},{"definition":"The primary lexical unit of a word, which carries the most significant aspects of semantic content and cannot be reduced into smaller constituents. Inflectional stems often derive from roots."},{"definition":"(philology) A word from which another word or words are derived."},{"definition":"The fundamental tone of any chord; the tone from whose harmonics, or overtones, a chord is composed."},{"definition":"The lowest place, position, or part."},{"definition":"In UNIX terminology, the first user account with complete access to the operating system and its configuration, found at the root of the directory structure; the person who manages accounts on a UNIX system.","example":"I have to log in as root before I do that."},{"definition":"The highest directory of a directory structure which may contain both files and subdirectories.","example":"I installed the files in the root directory."},{"definition":"A penis, especially the base of a penis."},{"definition":"An act of sexual intercourse.","example":"Fancy a root?"},{"definition":"A sexual partner."},{"definition":"Ancestry.","example":"I have both Irish and German roots."},{"definition":"Beginnings; origin.","example":"Jazz has its roots in blues."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/roots-us.mp3","text":"/ɹuːts/"}]},{"word":"DECLARATION","idx":5209,"count":12609210,"meanings":[{"definitions":[{"definition":"A written or oral indication of a fact, opinion, or belief."},{"definition":"A list of items for various legal purposes, e.g. customs declaration."},{"definition":"The act or process of declaring."},{"definition":"The act, by the captain of a batting side, of declaring an innings closed."},{"definition":"In common law, the formal document specifying plaintiff's cause of action, including the facts necessary to sustain a proper cause of action, and to advise the defendant of the grounds upon which he is being sued."},{"definition":"The specification of an object, such as a variable or function, establishing its existence but not necessarily describing its contents."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/declaration-us.mp3","text":"/ˌdɛkləˈɹeɪʃən/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/declaration-au.mp3","text":"/ˌdɛkləˈɹeɪʃən/"}]},{"word":"LOSING","idx":5210,"count":12607223,"meanings":[{"definitions":[{"definition":"To cause (something) to cease to be in one's possession or capability due to unfortunate or unknown circumstances, events or reasons.","example":"He lost his hearing in the explosion."},{"definition":"To wander from; to miss, so as not to be able to find; to go astray from.","example":"I lost my way in the forest."},{"definition":"To fail to win (a game, competition, trial, etc).","example":"We lost the football match."},{"definition":"To be unable to follow or trace (somebody or something) any longer.","example":"Mission control lost the satellite as its signal died down."},{"definition":"To cause (somebody) to be unable to follow or trace one any longer.","example":"We managed to lose our pursuers in the forest."},{"definition":"To cease exhibiting; to overcome (a behavior or emotion)."},{"definition":"To shed, remove, discard, or eliminate.","example":"When we get into the building, please lose the hat."},{"definition":"Of a clock, to run slower than expected.","example":"It's already 5:30? My watch must have lost a few minutes."},{"definition":"(ditransitive) To cause (someone) the loss of something; to deprive of."},{"definition":"To fail to catch with the mind or senses; to miss.","example":"I lost a part of what he said."},{"definition":"To cause to part with; to deprive of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is lost; a loss."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That loses or has lost.","example":"Being on the losing team is disappointing."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/losing-us.mp3","text":"/ˈluːzɪŋ/"}]},{"word":"ATTEMPTS","idx":5211,"count":12606763,"meanings":[{"definitions":[{"definition":"The action of trying at something.","example":"It was worth the attempt."},{"definition":"An assault or attack, especially an assassination attempt.","example":"1584 No man can charge us of any attempt against the realm. (Allen's Defence Of English Catholics, cited after Edinburgh review 1883, p. 378)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To try.","example":"A group of 80 budding mountaineers attempted Kilimanjaro, but 30 of them didn't make it to the top."},{"definition":"To try to move, by entreaty, by afflictions, or by temptations; to tempt."},{"definition":"To try to win, subdue, or overcome.","example":"one who attempts the virtue of a woman"},{"definition":"To attack; to make an effort or attack upon; to try to take by force.","example":"to attempt the enemy's camp"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/attempts-us.mp3","text":"/əˈtɛmpts/"}]},{"word":"GADGETS","idx":5212,"count":12604953,"meanings":[{"definitions":[{"definition":"A thing whose name cannot be remembered; thingamajig, doohickey."},{"definition":"Any device or machine, especially one whose name cannot be recalled. Often either clever or complicated.","example":"He bought a neat new gadget for shredding potatoes."},{"definition":"Any consumer electronics product."},{"definition":"A sequence of machine code instructions crafted as part of an exploit that attempts to divert execution to a memory location chosen by the attacker."}],"partOfSpeech":"n"}]},{"word":"NOBLE","idx":5213,"count":12604679,"meanings":[{"definitions":[{"definition":"An aristocrat; one of aristocratic blood.","example":"This country house was occupied by nobles in the 16th century."},{"definition":"A medieval gold coin of England in the 14th and 15th centuries, usually valued at 6s 8d."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having honorable qualities; having moral eminence and freedom from anything petty, mean or dubious in conduct and character.","example":"He is a noble man who would never put his family in jeopardy."},{"definition":"Grand; stately; magnificent; splendid.","example":"a noble edifice"},{"definition":"Of exalted rank; of or relating to the nobility; distinguished from the masses by birth, station, or title; highborn.","example":"noble blood; a noble personage"},{"definition":"(of a polyhedron) Both isohedral and isogonal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/noble-us.mp3","text":"/ˈnoʊbəl/"}]},{"word":"AUTOMATION","idx":5215,"count":12592519,"meanings":[{"definitions":[{"definition":"The act or process of converting the controlling of a machine or device to a more automatic system, such as computer or electronic controls."}],"partOfSpeech":"n"}]},{"word":"IMPACTS","idx":5216,"count":12585629,"meanings":[{"definitions":[{"definition":"The striking of one body against another; collision."},{"definition":"The force or energy of a collision of two objects.","example":"The hatchet cut the wood on impact."},{"definition":"A forced impinging.","example":"His spine had an impingement; L4 and L5 made impact, which caused numbness in his leg."},{"definition":"A significant or strong influence; an effect.","example":"His friend's opinion had an impact on his decision."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To collide or strike, the act of impinging.","example":"When the hammer impacts the nail, it bends."},{"definition":"To compress; to compact; to press into something or pack together.","example":"The footprints of birds do not impact the soil in the way those of dinosaurs do."},{"definition":"To influence; to affect; to have an impact on.","example":"I can make the changes, but it will impact the schedule."},{"definition":"To stamp or impress onto something.","example":"Ideas impacted on the mind."}],"partOfSpeech":"ve"}]},{"word":"REV","idx":5217,"count":12575365,"meanings":[{"definitions":[{"definition":"To increase the speed of a motor, or to operate at a higher speed.","example":"He revved the engine in a rather macho style."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Revolution"},{"definition":"A member of the Christian clergy; a minister."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɛv/"}]},{"word":"GOSPEL","idx":5218,"count":12572666,"meanings":[{"definitions":[{"definition":"The first section of the Christian New Testament scripture, comprising the books of Matthew, Mark, Luke and John, concerned with the life, crucifixion, death, resurrection, and teachings of Jesus."},{"definition":"An account of the life, crucifixion, death, resurrection, and teachings of Jesus, generally written during the first several centuries of the Common Era."},{"definition":"The teaching of Divine grace as distinguished from the Law or Divine commandments."},{"definition":"A message expected to have positive reception or effect, one promoted as offering important (or even infalliable) guiding principles."},{"definition":"That which is absolutely authoritative (definitive)."},{"definition":"Gospel music."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To instruct in the gospel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/gospel-uk.mp3","text":"/ˈɡɒspəl/"}]},{"word":"ADVANTAGES","idx":5219,"count":12569204,"meanings":[{"definitions":[{"definition":"Any condition, circumstance, opportunity or means, particularly favorable to success, or to any desired end.","example":"The enemy had the advantage of a more elevated position."},{"definition":"Superiority; mastery; — used with of to specify its nature or with over to specify the other party."},{"definition":"Superiority of state, or that which gives it; benefit; gain; profit","example":"Having the faster car is of little advantage."},{"definition":"The score where one player wins a point after deuce but needs the next to carry the game."},{"definition":"The continuation of the game after a foul against the attacking team, because the attacking team are in an advantageous position."},{"definition":"Interest of money; increase; overplus (as the thirteenth in the baker's dozen)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide (someone) with an advantage, to give an edge to"},{"definition":"To do something for one's own benefit; to take advantage of"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/advantages-us.mp3","text":"/əd.ˈvæn.tɪ.dʒɪz/"}]},{"word":"SHORE","idx":5220,"count":12568485,"meanings":[{"definitions":[{"definition":"Land adjoining a non-flowing body of water, such as an ocean, lake or pond.","example":"lake shore;  bay shore;  gulf shore;  island shore;  mainland shore;  river shore;  estuary shore;  pond shore;  sandy shore;  rocky shore"},{"definition":"(from the perspective of one on a body of water) Land, usually near a port.","example":"The passengers signed up for shore tours."},{"definition":"A prop or strut supporting the weight or flooring above it.","example":"The shores stayed upright during the earthquake."},{"definition":"(Obsolete except in Hiberno-English) A sewer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To set on shore."},{"definition":"(without up) To provide with support."},{"definition":"(usually with up) To reinforce (something at risk of failure).","example":"The workers were shoring up the dock after part of it fell into the water."},{"definition":"To cut, originally with a sword or other bladed weapon, now usually with shears, or as if using shears."},{"definition":"To remove the fleece from a sheep etc by clipping."},{"definition":"To deform because of forces pushing in opposite directions."},{"definition":"To transform by displacing every point in a direction parallel to some given line by a distance proportional to the point’s distance from the line."},{"definition":"To make a vertical cut in the coal."},{"definition":"To reap, as grain."},{"definition":"To deprive of property; to fleece."},{"definition":"To warn or threaten."},{"definition":"To offer."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/shore-us.mp3","text":"/ʃɔɹ/"}]},{"word":"LOVES","idx":5221,"count":12566621,"meanings":[{"definitions":[{"definition":"Strong affection."},{"definition":"A person who is the object of romantic feelings; a darling, a sweetheart, a beloved."},{"definition":"A term of friendly address, regardless of feelings.","example":"Hello love, how can I help you?"},{"definition":"A thing, activity etc which is the object of one's deep liking or enthusiasm."},{"definition":"Sexual desire; attachment based on sexual attraction."},{"definition":"Sexual activity."},{"definition":"An instance or episode of being in love; a love affair."},{"definition":"Used as the closing, before the signature, of a letter, especially between good friends or family members, or by the young."},{"definition":"Alternative letter-case form of Love."},{"definition":"A thin silk material."},{"definition":"A climbing plant, Clematis vitalba."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually transitive, sometimes intransitive, stative) To have a strong affection for (someone or something).","example":"I love my spouse.   I love you!"},{"definition":"To need, thrive on.","example":"Mold loves moist, dark places."},{"definition":"To be strongly inclined towards something; an emphatic form of like.","example":"I love walking barefoot on wet grass;  I'd love to join the team;  I love what you've done with your hair"},{"definition":"(usually transitive, sometimes intransitive) To care deeply about, to be dedicated to (someone or something)."},{"definition":"To derive delight from a fact or situation.","example":"I love the fact that the coffee shop now offers fat-free chai latte."},{"definition":"To have sex with (perhaps from make love).","example":"I wish I could love her all night long."},{"definition":"To praise; commend."},{"definition":"To praise as of value; prize; set a price on."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/loves-us.mp3","text":"/lʌvz/"}]},{"word":"INDUCED","idx":5222,"count":12566340,"meanings":[{"definitions":[{"definition":"To lead by persuasion or influence; incite or prevail upon."},{"definition":"To cause, bring about, lead to.","example":"His meditation induced a compromise.   Opium induces sleep."},{"definition":"To cause or produce (electric current or a magnetic state) by a physical process of induction."},{"definition":"To infer by induction."},{"definition":"To lead in, bring in, introduce."},{"definition":"To draw on, place upon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/induced-us.mp3","text":"/ɪnˈduːst/"}]},{"word":"LL","idx":5223,"count":12564191,"meanings":[{"definitions":[{"definition":"Lines"}],"partOfSpeech":"n"}]},{"word":"KNIGHT","idx":5224,"count":12563918,"meanings":[{"definitions":[{"definition":"A young servant or follower; a trained military attendant in service of a lord."},{"definition":"A minor nobleman with an honourable military rank who had served as a page and squire."},{"definition":"(by extension) An armored and mounted warrior of the Middle Ages.","example":"King Arthur and the Knights of the Round Table"},{"definition":"(modern) A person on whom a knighthood has been conferred by a monarch."},{"definition":"A brave, chivalrous and honorable man devoted to a noble cause or love interest."},{"definition":"A chess piece, often in the shape of a horse's head, that is moved two squares in one direction and one at right angles to that direction in a single move, leaping over any intervening pieces."},{"definition":"A playing card bearing the figure of a knight; the knave or jack."},{"definition":"Any of various nymphalid butterflies of the genus Ypthima."},{"definition":"(modern) A generic name for various mushrooms belonging to the fungal order gilled mushrooms; scientific name Tricholoma."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To confer knighthood upon.","example":"The king knighted the young squire."},{"definition":"To promote (a pawn) to a knight."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/knight-us.mp3","text":"/naɪt/"}]},{"word":"PREPARING","idx":5225,"count":12556793,"meanings":[{"definitions":[{"definition":"To make ready for a specific future purpose; to set up; to assemble or equip.","example":"We prepared the spacecraft for takeoff."},{"definition":"To make ready for eating or drinking; to cook.","example":"We prepared a fish for dinner."},{"definition":"To make oneself ready; to get ready, make preparation.","example":"We prepared for a bumpy ride."},{"definition":"To produce or make by combining elements; to synthesize, compound.","example":"She prepared a meal from what was left in the cupboards."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Preparation"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/preparing-us.mp3","text":"/pɹɪˈpɛɹɪŋ/"}]},{"word":"LOOSE","idx":5226,"count":12556710,"meanings":[{"definitions":[{"definition":"The release of an arrow."},{"definition":"A state of laxity or indulgence; unrestrained freedom, abandonment."},{"definition":"All play other than set pieces (scrums and line-outs)."},{"definition":"Freedom from restraint."},{"definition":"A letting go; discharge."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To let loose, to free from restraints."},{"definition":"To unfasten, to loosen."},{"definition":"To make less tight, to loosen."},{"definition":"Of a grip or hold, to let go."},{"definition":"To shoot (an arrow)"},{"definition":"To set sail."},{"definition":"To solve; to interpret."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not fixed in place tightly or firmly.","example":"This wheelbarrow has a loose wheel."},{"definition":"Not held or packaged together.","example":"'You can buy apples in a pack, but they are cheaper loose."},{"definition":"Not under control.","example":"The dog is loose again."},{"definition":"Not fitting closely","example":"'I wear loose clothes when it is hot."},{"definition":"Not compact.","example":"'It is difficult walking on loose gravel."},{"definition":"Relaxed.","example":"She danced with a loose flowing movement."},{"definition":"Not precise or exact; vague; indeterminate.","example":"a loose way of reasoning"},{"definition":"Indiscreet.","example":"Loose talk costs lives."},{"definition":"(somewhat dated) Free from moral restraint; immoral, unchaste."},{"definition":"Not being in the possession of any competing team during a game.","example":"He caught an elbow going after a loose ball."},{"definition":"Not costive; having lax bowels."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Begin shooting; release your arrows"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/loose-1-us.mp3","text":"/luːs/"}]},{"word":"AIMS","idx":5227,"count":12555862,"meanings":[{"definitions":[{"definition":"The pointing of a weapon, as a gun, a dart, or an arrow, or object, in the line of direction with the object intended to be struck; the line of fire; the direction of anything, such as a spear, a blow, a discourse, a remark, towards a particular point or object, with a view to strike or affect it.","example":"Take time with the aim of your gun."},{"definition":"The point intended to be hit, or object intended to be attained or affected."},{"definition":"Intention or goal","example":"My number one aim in life is to make money to make my parents, siblings and kids happy."},{"definition":"The ability of someone to aim straight; one's faculty for being able to hit a physical target","example":"The police officer has excellent aim, always hitting the bullseye in shooting practice."},{"definition":"Conjecture; guess."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To point or direct a missile, or a weapon which propels as missile, towards an object or spot with the intent of hitting it","example":"He aimed at the target, but the arrow flew straight over it."},{"definition":"To direct the intention or purpose; to attempt the accomplishment of a purpose; to try to gain; to endeavor;—followed by at, or by an infinitive","example":"to aim at a pass"},{"definition":"To direct or point (e.g. a weapon), at a particular object; to direct, as a missile, an act, or a proceeding, at, to, or against an object","example":"She aimed a punch at her ex-boyfriend."},{"definition":"To direct (something verbal) towards a certain person, thing, or group","example":"to aim a satirical comment at Communists in general"},{"definition":"To guess or conjecture."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/eɪmz/"}]},{"word":"RECIPIENT","idx":5228,"count":12555432,"meanings":[{"definitions":[{"definition":"One who receives.","example":"My e-mail never reached the intended recipient."},{"definition":"An individual receiving donor organs or tissues."},{"definition":"The portion of an alembic or other still in which the distilled liquid is collected."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Receiving"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹəˈsɪp.i.ənt/"}]},{"word":"LINKING","idx":5229,"count":12555304,"meanings":[{"definitions":[{"definition":"To connect two or more things."},{"definition":"(of a Web page) To contain a hyperlink to another page.","example":"My homepage links to my wife's."},{"definition":"To supply (somebody) with a hyperlink; to direct by means of a link.","example":"Haven't you seen his Web site? I'll link you to it."},{"definition":"To post a hyperlink to.","example":"Stop linking those unfunny comics all the time!"},{"definition":"To demonstrate a correlation between two things."},{"definition":"To combine objects generated by a compiler into a single executable."},{"definition":"To skip or trip along smartly; to go quickly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Linkage"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Serving to connect other things together.","example":"Conjunctions frequently function as linking words in a sentence."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈlɪŋkɪŋ/"}]},{"word":"EXTENSIONS","idx":5230,"count":12552534,"meanings":[{"definitions":[{"definition":"The act of extending; a stretching out; enlargement in length or breadth; an increase"},{"definition":"The state of being extended"},{"definition":"That property of a body by which it occupies a portion of space (or time, e.g. \"spatiotemporal extension\")"},{"definition":"A part of a building that has been extended from the original"},{"definition":"Capacity of a concept or general term to include a greater or smaller number of objects; — correlative of intension."},{"definition":"A written engagement on the part of a creditor, allowing a debtor further time to pay a debt."},{"definition":"The operation of stretching a broken bone so as to bring the fragments into the same straight line."},{"definition":"An exercise in which an arm or leg is straightened against resistance."},{"definition":"A simple offensive action, consisting of extending the weapon arm forward."},{"definition":"A numerical code used to specify a specific telephone in a telecommunication network."},{"definition":"A file extension.","example":"Files with the .txt extension usually contain text."},{"definition":"An optional software component that adds functionality to an application.","example":"a browser extension"},{"definition":"The set of tuples of values that, used as arguments, satisfy the predicate."},{"definition":"(grammar) A kind of derivative morpheme applied to verbs in Bantu languages."}],"partOfSpeech":"n"}]},{"word":"APPEALS","idx":5231,"count":12550346,"meanings":[{"definitions":[{"definition":"An application for the removal of a cause or suit from an inferior to a superior judge or court for re-examination or review."},{"definition":"The mode of proceeding by which such removal is effected."},{"definition":"The right of appeal."},{"definition":"An accusation; a process which formerly might be instituted by one private person against another for some heinous crime demanding punishment for the particular injury suffered, rather than for the offense against the public."},{"definition":"An accusation of a felon at common law by one of his accomplices, which accomplice was then called an approver."},{"definition":"A summons to answer to a charge."},{"definition":"A call to a person or an authority for help, proof or a decision; entreaty.","example":"He made an appeal for volunteers to help at the festival."},{"definition":"Resort to physical means; recourse."},{"definition":"Power to attract or interest."},{"definition":"A call to or use of a principle or quality for purposes of persuasion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To call upon another to decide a question controverted, to corroborate a statement, to vindicate one's rights, etc."},{"definition":"To call on (someone) for aid","example":"I appeal to all of you to help the orphans."},{"definition":"(informal elsewhere) To apply for the removal of a cause from an inferior to a superior judge or court for the purpose of reexamination or for decision."},{"definition":"To be attractive.","example":"That idea appeals to me."},{"definition":"To ask an umpire for a decision on whether a batsman is out or not, usually by saying \"How's that\" or \"Howzat\"."},{"definition":"To accuse (someone of something)."},{"definition":"To summon; to challenge."},{"definition":"To invoke (used with to)."}],"partOfSpeech":"ve"}]},{"word":"EARNED","idx":5233,"count":12540187,"meanings":[{"definitions":[{"definition":"To gain (success, reward, recognition) through applied effort or work.","example":"You can have the s'mores: you earned them, clearing the walkway of snow so well."},{"definition":"To receive payment for work.","example":"He earns seven million dollars a year as CEO.  My bank account is only earning one percent interest."},{"definition":"To receive payment for work.","example":"Now that you are earning, you can start paying me rent."},{"definition":"To cause (someone) to receive payment or reward.","example":"My CD earns me six percent!"},{"definition":"To achieve by being worthy of.","example":"to earn a spot in the top 20"},{"definition":"To curdle, as milk."},{"definition":"To long; to yearn."},{"definition":"To grieve."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɜːnd/"},{"text":"/ɝnd/"}]},{"word":"ILLNESS","idx":5234,"count":12539579,"meanings":[{"definitions":[{"definition":"An instance of a disease or poor health.","example":"Her grandmother had passed away after a long illness."},{"definition":"A state of bad health or disease.","example":"Many working days this year have been lost through illness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/illness-us.mp3","text":"/ˈɪl.nəs/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/illness-uk.mp3","text":"/ˈɪl.nəs/"}]},{"word":"ATHLETICS","idx":5236,"count":12534433,"meanings":[{"definitions":[{"definition":"(especially Britain) A group of sporting activities including track and field, road running, cross country and racewalking."},{"definition":"(especially US) Physical activities such as sports and games requiring stamina, fitness and skill."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æθˈlɛtɪks/"}]},{"word":"SOUTHEAST","idx":5237,"count":12520872,"meanings":[{"definitions":[{"definition":"The direction of the cardinal compass point halfway between south and east, specifically 135°, abbreviated as SE."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Southeastern, southeasternmost; occupying a position that is relatively southeast of another."},{"definition":"Towards the southeast; southeastwards."},{"definition":"From the southeast, southeasterly."}],"partOfSpeech":"j"}]},{"word":"HO","idx":5239,"count":12515925,"meanings":[{"definitions":[{"definition":"A stop; a halt; a moderation of pace."},{"definition":"A whore; a sexually promiscuous woman; in general use as a highly offensive name-calling word for a woman with connotations of loose sexuality.","example":"Bros before hoes!"},{"definition":"Care, anxiety, trouble, sorrow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Used to attract attention to something sighted, usually by lookouts."},{"definition":"Halloo; hey; a call to excite attention, or to give notice of approach"},{"definition":"Said as a limb is swung in attack."}],"partOfSpeech":"i"},{"definitions":[{"definition":"To care, be anxious, long."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hoʊ/"},{"text":"/həʊ/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/ho-au.mp3"}]},{"word":"ALTERNATIVES","idx":5240,"count":12512859,"meanings":[{"definitions":[{"definition":"A situation which allows a mutually exclusive choice between two or more possibilities; a choice between two or more possibilities."},{"definition":"One of several mutually exclusive things which can be chosen."},{"definition":"The remaining option; something available after other possibilities have been exhausted."},{"definition":"Alternative rock"}],"partOfSpeech":"n"}]},{"word":"PENDING","idx":5241,"count":12509596,"meanings":[{"definitions":[{"definition":"To hang down."},{"definition":"To arch over (something); to vault."},{"definition":"To hang; to depend."},{"definition":"To pen; to confine."},{"definition":"To consider pending; to delay or postpone (something)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Awaiting a conclusion or a confirmation."},{"definition":"Begun but not completed."},{"definition":"About to happen; imminent or impending."}],"partOfSpeech":"j"},{"definitions":[{"definition":"While waiting for something; until.","example":"Pending the outcome of the investigation, the police officer is suspended from duty."},{"definition":"During.","example":"Pending the investigation, the police officer is suspended from duty."}],"partOfSpeech":"pr"}],"phonetics":[{"text":"/ˈpɛndɪŋ/"}]},{"word":"DETERMINING","idx":5243,"count":12507793,"meanings":[{"definitions":[{"definition":"To set the boundaries or limits of."},{"definition":"To ascertain definitely; to figure out, find out, or conclude by analyzing, calculating, or investigating."},{"definition":"To fix the form or character of; to shape; to prescribe imperatively; to regulate; to settle."},{"definition":"To fix the course of; to impel and direct; with a remoter object preceded by to.","example":"The news of his father's illness determined him to depart immediately."},{"definition":"To bring to a conclusion, as a question or controversy; to settle authoritative or judicial sentence; to decide.","example":"The court has determined the cause."},{"definition":"To resolve on; to have a fixed intention of; also, to cause to come to a conclusion or decision; to lead.","example":"I determined to go home at once."},{"definition":"To define or limit by adding a differentia."},{"definition":"To bring to an end; to finish."}],"partOfSpeech":"ve"}]},{"word":"CORP","idx":5245,"count":12500878,"meanings":[{"definitions":[{"definition":"A non-commissioned officer army rank with NATO code OR-4. The rank below a sergeant but above a lance corporal and private."},{"definition":"A non-commissioned officer rank in the police force, below a sergeant but above a private or patrolman."},{"definition":"A worker in charge of the wagonway, reporting to the deputy."},{"definition":"The white linen cloth on which the elements of the Eucharist are placed; a communion cloth."},{"definition":"A body corporate, created by law or under authority of law, having a continuous existence independent of the existences of its members, and powers and liabilities distinct from those of its members."},{"definition":"The municipal governing body of a borough or city."},{"definition":"In Fascist Italy, a joint association of employers' and workers' representatives."},{"definition":"A protruding belly; a paunch."}],"partOfSpeech":"n"}]},{"word":"PERSONALIZED","idx":5246,"count":12495791,"meanings":[{"definitions":[{"definition":"To adapt something to the needs or tastes of an individual"},{"definition":"To represent something abstract as a person; to embody"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Adapted to the needs of an individual"},{"definition":"Embodied"}],"partOfSpeech":"j"}]},{"word":"GT","idx":5248,"count":12493779,"meanings":[{"definitions":[{"definition":"Drop (as a measurement in medical prescriptions)"}],"partOfSpeech":"n"}]},{"word":"SH","idx":5249,"count":12493091,"meanings":[{"definitions":[{"definition":"Requesting silence."}],"partOfSpeech":"i"}]},{"word":"CONDITIONING","idx":5250,"count":12490899,"meanings":[{"definitions":[{"definition":"To subject to the process of acclimation.","example":"I became conditioned to the absence of seasons in San Diego."},{"definition":"To subject to different conditions, especially as an exercise.","example":"They were conditioning their shins in their karate class."},{"definition":"To place conditions or limitations upon."},{"definition":"To shape the behaviour of someone to do something."},{"definition":"To treat (the hair) with hair conditioner."},{"definition":"To contract; to stipulate; to agree."},{"definition":"To test or assay, as silk (to ascertain the proportion of moisture it contains)."},{"definition":"(colleges) To put under conditions; to require to pass a new examination or to make up a specified study, as a condition of remaining in one's class or in college.","example":"to condition a student who has failed in some branch of study"},{"definition":"To impose upon an object those relations or conditions without which knowledge and thought are alleged to be impossible."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of modifying a person or animal's behaviour."},{"definition":"Any preparation or training, especially athletic training of the body."},{"definition":"The storage of a material specimen under specified temperature, humidity for a specified time prior to testing."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kənˈdɪʃənɪŋ/"}]},{"word":"TEENAGE","idx":5251,"count":12488595,"meanings":[{"definitions":[{"definition":"Brushwood for fences and hedges."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to an age between thirteen and nineteen years old.","example":"Fred's teenage years were the most difficult of times."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtiːnɪd͡ʒ/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/teenage-1-au.mp3"}]},{"word":"SOAP","idx":5252,"count":12485378,"meanings":[{"definitions":[{"definition":"A substance able to mix with both oil and water, used for cleaning, often in the form of a solid bar or in liquid form, derived from fats or made synthetically.","example":"I tried washing my hands with soap, but the stain wouldn't go away."},{"definition":"A metallic salt derived from a fatty acid"},{"definition":"Flattery or excessively complacent conversation."},{"definition":"Money, specially when used as a bribe."},{"definition":"A soap opera."},{"definition":"A solid masonry unit or brick reduced in depth or height from standard dimensions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply soap to in washing.","example":"Be sure to soap yourself well before rinsing."},{"definition":"To cover, lather or in any other form treat with soap, often as a prank.","example":"Those kids soaped my windows!"},{"definition":"To be discreet about (a topic)."},{"definition":"To flatter; to wheedle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/soap-us.mp3","text":"/soʊp/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/soap-uk.mp3","text":"/səʊp/"}]},{"word":"AE","idx":5253,"count":12480269,"meanings":[{"definitions":[{"definition":"One"}],"partOfSpeech":"j"}]},{"word":"TRIPLE","idx":5254,"count":12478554,"meanings":[{"definitions":[{"definition":"Three times or thrice the number, amount, size, etc"},{"definition":"A drink with three portions of alcohol.","example":"I've had a hard day; make that a triple."},{"definition":"A hamburger with three patties.","example":"I'd like a triple with cheese."},{"definition":"A three-base hit","example":"The shortstop hit a triple to lead off the ninth."},{"definition":"A three-point field goal"},{"definition":"A takeout shot in which three stones are removed from play."},{"definition":"A sequence of three elements or 3-tuple."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To multiply by three","example":"The company tripled their earnings per share over last quarter."},{"definition":"To get a three-base hit","example":"The batter tripled into the gap."},{"definition":"To become three times as large","example":"Our earnings have tripled in the last year."},{"definition":"To serve or operate as (something), in addition to two other functions."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made up of three related elements, often matching","example":"The triple markings on this vase are quite unique."},{"definition":"Of three times the quantity.","example":"Give me a triple serving of mashed potatoes."},{"definition":"Designed for three users.","example":"a triple room"},{"definition":"Folded in three; composed of three layers."},{"definition":"Having three aspects.","example":"a triple meaning"},{"definition":"Of time, three times as fast as very fast."},{"definition":"One of three; third."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/triple-us.mp3"},{"text":"/ˈtɹɪpl/"}]},{"word":"COOPER","idx":5255,"count":12476378,"meanings":[{"definitions":[{"definition":"A craftsman who makes and repairs barrels and similar wooden vessels such as casks, buckets and tubs."},{"definition":"A drink of half stout and half porter."},{"definition":"A floating grog shop supplying the North Sea fishing industry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make and repair barrels etc."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkuːpə(ɹ)/"}]},{"word":"NYC","idx":5256,"count":12475941,"meanings":[{"definitions":[{"definition":"Nice"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/naɪs/"}]},{"word":"JAM","idx":5258,"count":12468316,"meanings":[{"definitions":[{"definition":"A sweet mixture of fruit boiled with sugar and allowed to congeal. Often spread on bread or toast or used in jam tarts."},{"definition":"A difficult situation."},{"definition":"Blockage, congestion.","example":"A traffic jam caused us to miss the game's first period."},{"definition":"An informal, impromptu performance or rehearsal."},{"definition":"(by extension) A song; a track."},{"definition":"(by extension) An informal event where people brainstorm and collaborate on projects."},{"definition":"A kind of frock for children."},{"definition":"(interior decorating) Either of the vertical components that form the side of an opening in a wall, such as that of a door frame, window frame, or fireplace."},{"definition":"Any thick mass of rock that prevents miners from following the lode or vein."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To get something stuck in a confined space.","example":"Her poor little baby toe got jammed in the door."},{"definition":"To brusquely force something into a space; cram, squeeze.","example":"The rush-hour train was jammed with commuters."},{"definition":"To cause congestion or blockage. Often used with \"up\"","example":"A single accident can jam the roads for hours."},{"definition":"To block or confuse a broadcast signal."},{"definition":"To throw a pitch at or near the batter's hands.","example":"Jones was jammed by the pitch."},{"definition":"To play music (especially improvisation as a group, or an informal unrehearsed session)."},{"definition":"To injure a finger or toe by sudden compression of the digit's tip.","example":"When he tripped on the step he jammed his toe."},{"definition":"To attempt to score points.","example":"Toughie jammed four times in the second period."},{"definition":"To bring (a vessel) so close to the wind that half her upper sails are laid aback."},{"definition":"To give up on a date or some joint endeavour; stand up, chicken out, jam out."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/jam-us.mp3","text":"/ˈdʒæm/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/jam-uk.mp3","text":"/ˈdʒæm/"}]},{"word":"SECURED","idx":5259,"count":12463155,"meanings":[{"definitions":[{"definition":"To make safe; to relieve from apprehensions of, or exposure to, danger; to guard; to protect."},{"definition":"To put beyond hazard of losing or of not receiving; to make certain; to assure; frequently with against or from, or formerly with of.","example":"to secure a creditor against loss; to secure a debt by a mortgage"},{"definition":"To make fast; to close or confine effectually; to render incapable of getting loose or escaping.","example":"to secure a prisoner; to secure a door, or the hatches of a ship"},{"definition":"To get possession of; to make oneself secure of; to acquire certainly.","example":"to secure an estate"},{"definition":"To plight or pledge."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/secured-us.mp3","text":"/səˈkjɔɹd/"}]},{"word":"UNUSUAL","idx":5260,"count":12459909,"meanings":[{"definitions":[{"definition":"Something that is unusual; an anomaly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not usual, out of the ordinary","example":"Every once in a while, though, Idol comes across an unusual talent who just blows everyone away."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/unusual-us.mp3","text":"/ʌnˈjuːʒuəl/"}]},{"word":"ANSWERED","idx":5261,"count":12457330,"meanings":[{"definitions":[{"definition":"To make a reply or response to.","example":"He answered the question."},{"definition":"To speak in defence against; to reply to in defence.","example":"to answer a charge or accusation"},{"definition":"To respond to a call by someone at a door or telephone, or other similar piece of equipment.","example":"Nobody answered when I knocked on the door."},{"definition":"To suit a need or purpose satisfactorily.","example":"It answers the need."},{"definition":"To be accountable or responsible; to make amends.","example":"He has a lot to answer for."},{"definition":"To file a document in response to a complaint."},{"definition":"To correspond to; to be in harmony with; to be in agreement with."},{"definition":"To be opposite, or to act in opposition."},{"definition":"To be or act in conformity, or by way of accommodation, correspondence, relation, or proportion; to conform; to correspond; to suit; usually with to."},{"definition":"To respond to satisfactorily; to meet successfully by way of explanation, argument, or justification; to refute."},{"definition":"To be or act in compliance with, in fulfillment or satisfaction of, as an order, obligation, or demand.","example":"He answered my claim upon him."},{"definition":"To render account to or for."},{"definition":"To atone for; to be punished for."},{"definition":"To be or act as an equivalent to, or as adequate or sufficient for; to serve for; to repay."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/answered-us.mp3","text":"/ænsɜːd/"}]},{"word":"PARTNERSHIPS","idx":5262,"count":12453817,"meanings":[{"definitions":[{"definition":"The state of being associated with a partner."},{"definition":"An association of two or more people to conduct a business,"},{"definition":"The period when two specific batsmen are batting, from the fall of one wicket until the fall of the next; the number of runs scored during this period,"}],"partOfSpeech":"n"}]},{"word":"DESTRUCTION","idx":5263,"count":12453758,"meanings":[{"definitions":[{"definition":"The act of destroying.","example":"The destruction of the condemned building will take place at noon."},{"definition":"The results of a destructive event.","example":"Amid the seemingly endless destruction, a single flower bloomed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/destruction-us.mp3","text":"/ˌdɪsˈtɹʌkʃən/"}]},{"word":"SLOTS","idx":5264,"count":12452126,"meanings":[{"definitions":[{"definition":"A broad, flat, wooden bar, a slat, especially as used to secure a door, window, etc."},{"definition":"A metal bolt or wooden bar, especially as a crosspiece."},{"definition":"An implement for baring, bolting, locking or securing a door, box, gate, lid, window or the like."},{"definition":"A channel opening in the stator or rotor of a rotating machine for ventilation and insertion of windings."},{"definition":"The barrel or tube of a wave."},{"definition":"A narrow depression, perforation, or aperture; especially, one for the reception of a piece fitting or sliding in it."},{"definition":"A gap in a schedule or sequence."},{"definition":"The allocated time for an aircraft's departure or arrival at an airport's runway."},{"definition":"In a flying display, the fourth position; after the leader and two wingmen."},{"definition":"A space in memory or on disk etc. in which a particular type of object can be stored.","example":"The game offers four save slots."},{"definition":"A slot machine designed for gambling.","example":"I walked past the poker tables and went straight to the slots."},{"definition":"The vagina."},{"definition":"The track of an animal, especially a deer; spoor."},{"definition":"(Antarctica) A crack or fissure in a glacier or snowfield; a chasm; a crevasse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bar, bolt or lock a door or window."},{"definition":"To shut with violence; to slam.","example":"to slot a door"},{"definition":"To put something (such as a coin) into a slot (narrow aperture)"},{"definition":"To assign something or someone into a slot (gap in a schedule or sequence)"},{"definition":"To put something where it belongs."},{"definition":"(Rhodesia, in the context of the Rhodesian Bush War) To kill."},{"definition":"(Antarctica) To fall, or cause to fall, into a crevasse."}],"partOfSpeech":"ve"}]},{"word":"INCREASINGLY","idx":5265,"count":12442507,"meanings":[{"definitions":[{"definition":"Increasing in amount or intensity"}],"partOfSpeech":"v"}]}]