[{"word":"SERENITY","idx":13470,"count":3139273,"meanings":[{"definitions":[{"definition":"The state of being serene; calmness; peacefulness."},{"definition":"A lack of agitation or disturbance."},{"definition":"A title given to a reigning prince or similar dignitary."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"serenity-us","text":"/səˈɹɛnɪti/"}]},{"word":"UPLOADS","idx":13471,"count":3138730,"meanings":[{"definitions":[{"definition":"Such a file transfer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transfer data to a computer on a network, especially to a server on the Internet.","example":"You will have to convert your photograph to a jpg format if you wish to upload it."}],"partOfSpeech":"ve"}]},{"word":"ORE","idx":13472,"count":3138666,"meanings":[{"definitions":[{"definition":"Rock or other material that contains valuable or utilitarian materials; primarily a rock containing metals or gems for which it is typically mined and processed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ore-us","text":"/ɔɹ/"}]},{"word":"PANT","idx":13473,"count":3138558,"meanings":[{"definitions":[{"definition":"A quick breathing; a catching of the breath; a gasp."},{"definition":"Eager longing."},{"definition":"A violent palpitation of the heart."},{"definition":"A pair of pants (trousers or underpants)."},{"definition":"(used attributively as a modifier) Of or relating to pants.","example":"Pant leg"},{"definition":"(Scotland and northeast England) Any public drinking fountain."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To breathe quickly or in a labored manner, as after exertion or from eagerness or excitement; to respire with heaving of the breast; to gasp."},{"definition":"To long eagerly; to desire earnestly."},{"definition":"To long for (something); to be eager for (something)."},{"definition":"Of the heart, to beat with unnatural violence or rapidity; to palpitate."},{"definition":"To sigh; to flutter; to languish."},{"definition":"To heave, as the breast."},{"definition":"To bulge and shrink successively, of iron hulls, etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pant-us","text":"/pænt/"}]},{"word":"GALLONS","idx":13475,"count":3138226,"meanings":[{"definitions":[{"definition":"A unit of volume, equivalent to eight pints"},{"definition":"Exactly 4.54609 liters; an imperial gallon"},{"definition":"231 cubic inches or approximately 3.785 liters for liquids (a \"U.S. liquid gallon\")"},{"definition":"One-eighth of a U.S. bushel or approximately 4.405 liters for dry goods (a \"U.S. dry gallon\")."},{"definition":"(in the plural) A large quantity (of any liquid).","example":"The pipe burst and gallons of water flooded into the kitchen."}],"partOfSpeech":"n"}]},{"word":"ATTAINMENT","idx":13476,"count":3138108,"meanings":[{"definitions":[{"definition":"The act of attaining; the act of arriving at or reaching; the act of obtaining by exertion or effort."},{"definition":"That which is attained, or obtained by exertion; acquisition; acquirement."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"attainment-us","text":"/əˈteɪnmənt/"}]},{"word":"SANITARY","idx":13477,"count":3137434,"meanings":[{"definitions":[{"definition":"Sanitary towel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to health."},{"definition":"Clean and free from pathogens; hygienic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sanitary-us"}]},{"word":"COOPERATE","idx":13479,"count":3136641,"meanings":[{"definitions":[{"definition":"To work or act together, especially for a common purpose or benefit."},{"definition":"To allow for mutual unobstructed action"},{"definition":"To function in harmony, side by side"},{"definition":"To engage in economic cooperation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cooperate-us","text":"/koʊˈɒpəɹeɪt/"},{"audio":"cooperate-uk","text":"/koʊˈɒpəɹeɪt/"}]},{"word":"DREAMING","idx":13480,"count":3136420,"meanings":[{"definitions":[{"definition":"To see imaginary events in one's mind while sleeping."},{"definition":"To hope, to wish."},{"definition":"To daydream.","example":"Stop dreaming and get back to work."},{"definition":"To envision as an imaginary experience (usually when asleep).","example":"I dreamed a vivid dream last night."},{"definition":"To consider the possibility (of).","example":"I wouldn't dream of snubbing you in public."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An instance of dreaming; a dream or reverie."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɹiː.mɪŋ/"}]},{"word":"NORMS","idx":13481,"count":3135997,"meanings":[{"definitions":[{"definition":"That which is normal or typical.","example":"Unemployment is the norm in this part of the country."},{"definition":"A rule that is enforced by members of a community.","example":"Not eating your children is just one of those societal norms."},{"definition":"A sentence with non-descriptive meaning, such as a command, permission or prohibition."},{"definition":"A function, generally denoted v\\mapsto\\left|v\\right| or v\\mapsto\\left\\|v\\right\\|, that maps vectors to non-negative scalars and has the following properties:"},{"definition":"A high level of performance in a chess tournament, several of which are required for a player to receive a title."}],"partOfSpeech":"n"}]},{"word":"IMPLANTS","idx":13482,"count":3135842,"meanings":[{"definitions":[{"definition":"Anything surgically implanted in the body, such as a tissue graft or prosthesis, particularly breast implants."},{"definition":"(travel) A representative of a travel company, working within the office of a large client and exclusively dealing with that client."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fix firmly or set securely or deeply."},{"definition":"To insert (something) surgically into the body."},{"definition":"Of an embryo, to become attached to and embedded in the womb."}],"partOfSpeech":"ve"}]},{"word":"FORTUNATE","idx":13483,"count":3135403,"meanings":[{"definitions":[{"definition":"Auspicious.","example":"It is a fortunate sign if the sun shines on a newly wedded couple."},{"definition":"Happening by good luck or favorable chance.","example":"Patrick was the unlikely match-winner as Berkeley earned a fortunate victory over Chisolm."},{"definition":"Favored by fortune.","example":"This is a time when we think of those less fortunate than ourselves."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fortunate-us","text":"/ˈfɔɹt͡ʃnɪt/"}]},{"word":"MUSHROOMS","idx":13485,"count":3134851,"meanings":[{"definitions":[{"definition":"Any of the fleshy fruiting bodies of fungi typically produced above ground on soil or on their food sources (such as decaying wood).","example":"Some mushrooms are edible and taste good, while others are poisonous and taste foul."},{"definition":"A fungus producing such fruiting bodies."},{"definition":"Champignon or Agaricus bisporus, the mushroom species most commonly used in cooking."},{"definition":"Any of the mushroom-shaped pegs in bar billiards."},{"definition":"A concrete column with a thickened portion at the top, used to support a slab."},{"definition":"One who rises suddenly from a low condition in life; an upstart."},{"definition":"Something that grows very quickly or seems to appear suddenly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grow quickly to a large size.","example":"The town’s population mushroomed from 10,000 to 110,000 in five years."},{"definition":"To gather mushrooms.","example":"We used to go mushrooming in the forest every weekend."},{"definition":"To form the shape of a mushroom."}],"partOfSpeech":"ve"}]},{"word":"HORMONES","idx":13486,"count":3134544,"meanings":[{"definitions":[{"definition":"Any substance produced by one tissue and conveyed by the bloodstream to another to effect physiological activity."},{"definition":"A synthetic compound with the same activity."},{"definition":"Any similar substance in plants."}],"partOfSpeech":"n"}]},{"word":"HYPE","idx":13487,"count":3134220,"meanings":[{"definitions":[{"definition":"Promotion or propaganda; especially exaggerated claims.","example":"After all the hype for the diet plan, only the results ended up slim."},{"definition":"A drug addict."},{"definition":"A throw in which the wrestler lifts his opponent from the ground, swings him to one side, knocks up his nearer thigh from the back with the knee, and throws him on his back."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To promote heavily; to advertise or build up.","example":"They started hyping the new magazine months before its release."},{"definition":"To throw (an opponent) using this technique."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Hyped."},{"definition":"Excellent, cool."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hype-au","text":"/haɪp/"}]},{"word":"INTERPRETATIONS","idx":13488,"count":3134178,"meanings":[{"definitions":[{"definition":"An act of interpreting or explaining what is obscure; a translation; a version; a construction.","example":"the interpretation of a dream, or of an enigma."},{"definition":"A sense given by an interpreter; an exposition or explanation given; meaning .","example":"Commentators give various interpretations of the same passage of Scripture."},{"definition":"The discipline or study of translating one spoken or signed language into another (as opposed to translation, which concerns itself with written language)."},{"definition":"The power of explaining."},{"definition":"An artist's way of expressing his thought or embodying his conception of nature."},{"definition":"An act or process of applying general principles or formulae to the explanation of the results obtained in special cases."},{"definition":"An approximation that allows aspects of a mathematical theory to be discussed in ordinary language."},{"definition":"(model theory) An assignment of a truth value to each propositional symbol of a propositional calculus."},{"definition":"The practice and discipline of explaining natural and cultural heritage to visitors at museums, historic sites, zoos, aquaria, science centres, art galleries, etc. Also called heritage interpretation, mediation, guiding, etc."}],"partOfSpeech":"n"}]},{"word":"FAULTS","idx":13490,"count":3133646,"meanings":[{"definitions":[{"definition":"A defect; something that detracts from perfection."},{"definition":"A mistake or error.","example":"No! This is my fault, not yours."},{"definition":"A weakness of character; a failing.","example":"For all her faults, she’s a good person at heart."},{"definition":"A minor offense."},{"definition":"Blame; the responsibility for a mistake.","example":"The fault lies with you."},{"definition":"A fracture in a rock formation causing a discontinuity."},{"definition":"In coal seams, coal rendered worthless by impurities in the seam.","example":"slate fault  dirt fault"},{"definition":"An illegal serve."},{"definition":"An abnormal connection in a circuit."},{"definition":"Want; lack"},{"definition":"A lost scent; act of losing the scent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To criticize, blame or find fault with something or someone."},{"definition":"To fracture."},{"definition":"To commit a mistake or error."},{"definition":"To undergo a page fault."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɔlts/"},{"text":"/fɒlts/"}]},{"word":"GREASE","idx":13494,"count":3132154,"meanings":[{"definitions":[{"definition":"Animal fat in a melted or soft state"},{"definition":"(extension) Any oily or fatty matter."},{"definition":"Shorn but not yet cleansed wool"},{"definition":"Inflammation of a horse's heels, also known as scratches or pastern dermatitis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put grease or fat on something, especially in order to lubricate."},{"definition":"To bribe."},{"definition":"To cause to go easily; to facilitate."},{"definition":"To perform a landing extraordinarily smoothly.","example":"To my amazement, I greased the landing despite the tricky crosswinds."},{"definition":"To kill, murder."},{"definition":"To cheat or cozen; to overreach."},{"definition":"To affect (a horse) with grease, the disease."}],"partOfSpeech":"ve"}]},{"word":"URINARY","idx":13496,"count":3131792,"meanings":[{"definitions":[{"definition":"A urinary device or fixture: a urinal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to urine, its production, function, or excretion."},{"definition":"Of or relating to the organs involved in the formation and excretion of urine."}],"partOfSpeech":"j"}]},{"word":"CAIRNS","idx":13497,"count":3131719,"meanings":[{"definitions":[{"definition":"A rounded or conical heap of stones erected by early inhabitants of the British Isles, apparently as a sepulchral monument."},{"definition":"A pile of stones heaped up as a landmark, to guide travelers on land or at sea, or to arrest attention, as in surveying, or in leaving traces of an exploring party, etc."},{"definition":"A cairn terrier."}],"partOfSpeech":"n"}]},{"word":"PREMISE","idx":13499,"count":3131689,"meanings":[{"definitions":[{"definition":"A proposition antecedently supposed or proved; something previously stated or assumed as the basis of further argument; a condition; a supposition."},{"definition":"Any of the first propositions of a syllogism, from which the conclusion is deduced."},{"definition":"(usually in the plural) Matters previously stated or set forth; especially, that part in the beginning of a deed, the office of which is to express the grantor and grantee, and the land or thing granted or conveyed, and all that precedes the habendum; the thing demised or granted."},{"definition":"(usually in the plural) A piece of real estate; a building and its adjuncts.","example":"trespass on another’s premises"},{"definition":"(authorship) The fundamental concept that drives the plot of a film or other story."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To state or assume something as a proposition to an argument."},{"definition":"To make a premise."},{"definition":"To set forth beforehand, or as introductory to the main subject; to offer previously, as something to explain or aid in understanding what follows."},{"definition":"To send before the time, or beforehand; hence, to cause to be before something else; to employ previously."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"premise-uk","text":"/ˈpɹɛ.mɪs/"}]},{"word":"EPIDEMIC","idx":13500,"count":3131684,"meanings":[{"definitions":[{"definition":"A widespread disease that affects many individuals in a population."},{"definition":"An occurrence of a disease or disorder in a population at a frequency higher than that expected in a given time period."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Like or having to do with an epidemic; widespread","example":"Epidemic hysteria occurred upon the incumbent’s reelection."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"epidemic","text":"/ˌɛpɪˈdɛmɪk/"}]},{"word":"CONDOMS","idx":13502,"count":3131405,"meanings":[{"definitions":[{"definition":"A flexible sleeve made of latex or other impermeable material such as sheepskin, worn over an erect penis during intercourse as a contraceptive or as a way to prevent the spread of STDs."}],"partOfSpeech":"n"}]},{"word":"RITE","idx":13503,"count":3131222,"meanings":[{"definitions":[{"definition":"A religious custom."},{"definition":"(by extension) A prescribed behavior."},{"definition":"That which complies with justice, law or reason.","example":"We're on the side of right in this contest."},{"definition":"A legal, just or moral entitlement.","example":"You have no right to go through my personal diary."},{"definition":"The right side or direction.","example":"The pharmacy is just on the right past the bookshop."},{"definition":"The right hand or fist."},{"definition":"The ensemble of right-wing political parties; political conservatives as a group.","example":"The political right holds too much power."},{"definition":"The outward or most finished surface, as of a coin, piece of cloth, a carpet, etc."},{"definition":"A wave breaking from right to left (viewed from the shore)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Straight, not bent.","example":"a right line"},{"definition":"Of an angle, having a size of 90 degrees, or one quarter of a complete rotation; the angle between two perpendicular lines.","example":"The kitchen counter formed a right angle with the back wall."},{"definition":"Of a geometric figure, incorporating a right angle between edges, faces, axes, etc.","example":"a right triangle, a right prism, a right cone"},{"definition":"Complying with justice, correctness or reason; correct, just, true.","example":"I thought you'd made a mistake, but it seems you were right all along."},{"definition":"Appropriate, perfectly suitable; fit for purpose.","example":"Is this the right software for my computer?"},{"definition":"Healthy, sane, competent.","example":"I'm afraid my father is no longer in his right mind."},{"definition":"Real; veritable (used emphatically).","example":"You've made a right mess of the kitchen!"},{"definition":"All right; not requiring assistance."},{"definition":"Most favourable or convenient; fortunate."},{"definition":"Designating the side of the body which is positioned to the east if one is facing north. This arrow points to the reader's right: →","example":"After the accident, her right leg was slightly shorter than her left."},{"definition":"Designed to be placed or worn outward.","example":"the right side of a piece of cloth"},{"definition":"Pertaining to the political right; conservative."}],"partOfSpeech":"j"},{"definitions":[{"definition":"On the right side."},{"definition":"Towards the right side."},{"definition":"Exactly, precisely.","example":"Luckily we arrived right at the start of the film."},{"definition":"Immediately, directly.","example":"Can't you see it? It's right beside you!"},{"definition":"Very, extremely, quite.","example":"I made a right stupid mistake there, didn't I?"},{"definition":"According to fact or truth; actually; truly; really."},{"definition":"In a correct manner.","example":"Do it right or don't do it at all."},{"definition":"(still used in some titles) To a great extent or degree.","example":"Members of the Queen's Privy Council are styled The Right Honourable for life."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Yes, that is correct; I agree."},{"definition":"I agree with whatever you say; I have no opinion."},{"definition":"Signpost word to change the subject in a discussion or discourse."},{"definition":"Used to check agreement at the end of an utterance.","example":"You're going, right?"},{"definition":"Used to add seriousness or decisiveness before a statement."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"rite-us","text":"/ɹaɪt/"}]},{"word":"DIRECTIVES","idx":13504,"count":3130916,"meanings":[{"definitions":[{"definition":"An instruction or guideline that indicates how to perform an action or reach a goal."},{"definition":"A construct in source code that indicates how it should be processed but is not necessarily part of the program to be run."},{"definition":"An authoritative decision from an official body, which may or may not have binding force."},{"definition":"(European Union law) A form of legislative act addressed to the member states. The directive binds the member state to reach certain objectives in their national legislation."},{"definition":"The directive case."}],"partOfSpeech":"n"}]},{"word":"CINNAMON","idx":13505,"count":3130642,"meanings":[{"definitions":[{"definition":"A small evergreen tree native to Sri Lanka and southern India, Cinnamomum verum or Cinnamomum zeylanicum, belonging to the family Lauraceae."},{"definition":"Several related trees, notably the Indonesian cinnamon (Cinnamomum burmanni) and Chinese cinnamon or cassia (Cinnamomum aromaticum or Cinnamomum cassia)."},{"definition":"A spice from the dried aromatic bark of the cinnamon tree, either rolled into strips or ground into a powder. The word is commonly used as trade name for spices made of any of the species above."},{"definition":"A warm yellowish-brown color, the color of cinnamon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Containing cinnamon, or having a cinnamon taste."},{"definition":"Of a yellowish-brown color."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cinnamon-us","text":"/ˈsɪn.ə.mən/"}]},{"word":"LAC","idx":13507,"count":3129942,"meanings":[{"definitions":[{"definition":"A resinous substance produced mainly on the banyan tree by the female of Kerria lacca, a scale insect."},{"definition":"One hundred thousand (commonly used in Pakistan and India)."},{"definition":"Short for Cadillac.","example":"Last night I was driving around in my lac."},{"definition":"Laceration.","example":"hand lac"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lac-1-uk","text":"/læk/"}]},{"word":"DISCHARGED","idx":13508,"count":3129577,"meanings":[{"definitions":[{"definition":"To accomplish or complete, as an obligation."},{"definition":"To free of a debt, claim, obligation, responsibility, accusation, etc.; to absolve; to acquit; to forgive; to clear."},{"definition":"To send away (a creditor) satisfied by payment; to pay one's debt or obligation to."},{"definition":"To set aside; to annul; to dismiss."},{"definition":"To expel or let go."},{"definition":"To let fly, as a missile; to shoot."},{"definition":"To release (an accumulated charge)."},{"definition":"To relieve of an office or employment; to send away from service; to dismiss."},{"definition":"To release legally from confinement; to set at liberty.","example":"to discharge a prisoner"},{"definition":"To operate (any weapon that fires a projectile, such as a shotgun or sling)."},{"definition":"To release (an auxiliary assumption) from the list of assumptions used in arguments, and return to the main argument."},{"definition":"To unload a ship or another means of transport."},{"definition":"To put forth, or remove, as a charge or burden; to take out, as that with which anything is loaded or filled.","example":"to discharge a cargo"},{"definition":"To give forth; to emit or send out.","example":"A pipe discharges water."},{"definition":"To let fly; to give expression to; to utter.","example":"He discharged a horrible oath."},{"definition":"To bleach out or to remove or efface, as by a chemical process.","example":"to discharge the colour from a dyed fabric in order to form light figures on a dark background"},{"definition":"To prohibit; to forbid."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"discharged-us","text":"/dɪsˈtʃɑɹdʒd/"}]},{"word":"ALBA","idx":13509,"count":3128968,"meanings":[{"definitions":[{"definition":"A type of lyrical poetry, traditionally Provençal, about lovers who must part at dawn."},{"definition":"A white-flowered shrub rose of the hybrid Rosa × alba."},{"definition":"A flower of the hybrid Rosa × alba."},{"definition":"A book specially designed to keep photographs, stamps, or autographs."},{"definition":"A collection, especially of literary items"},{"definition":"A phonograph record that is composed of several tracks"},{"definition":"A jacket or cover for such a phonograph record."},{"definition":"A group of audio recordings, on any medium, intended for distribution as a group."},{"definition":"In Ancient Rome, a white tablet or register on which the praetor's edicts and other public notices were recorded."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæl.bə/"}]},{"word":"UNDERWORLD","idx":13510,"count":3128412,"meanings":[{"definitions":[{"definition":"The world of the dead, located underneath the world of the living; the afterlife."},{"definition":"That part of society that is engaged in crime or vice."},{"definition":"The portion of a game that is set below ground."}],"partOfSpeech":"n"}]},{"word":"VARIANTS","idx":13511,"count":3128173,"meanings":[{"definitions":[{"definition":"Something that is slightly different from a type or norm.","example":"All breeds of dog are variants of the species “Canis lupus familiaris”."},{"definition":"A different sequence of a gene (locus)."},{"definition":"A variable that can hold any of various unrelated data types."},{"definition":"One of a set of words or other linguistic forms that conveys the same meaning or serves the same function."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈvɛɹi.ənts/"}]},{"word":"FETAL","idx":13512,"count":3127968,"meanings":[{"definitions":[{"definition":"Pertaining to, or connected with, a fetus.","example":"fetal circulation"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfitl̩/"}]},{"word":"PALMS","idx":13513,"count":3127466,"meanings":[{"definitions":[{"definition":"Any of various evergreen trees from the family Palmae or Arecaceae, which are mainly found in the tropics."},{"definition":"A branch or leaf of the palm, anciently borne or worn as a symbol of victory or rejoicing."},{"definition":"(by extension) Triumph; victory."},{"definition":"Any of 23 awards that can be earned after obtaining the Eagle Scout rank, but generally only before turning 18 years old."},{"definition":"The inner and somewhat concave part of the human hand that extends from the wrist to the bases of the fingers."},{"definition":"The corresponding part of the forefoot of a lower mammal."},{"definition":"A linear measure equal either to the breadth of the hand or to its length from the wrist to the ends of the fingers; a hand; used in measuring a horse's height."},{"definition":"(sailmaking) A metallic disk attached to a strap and worn in the palm of the hand; used to push the needle through the canvas, in sewing sails, etc."},{"definition":"The broad flattened part of an antler, as of a full-grown fallow deer; so called as resembling the palm of the hand with its protruding fingers."},{"definition":"The flat inner face of an anchor fluke."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hold or conceal something in the palm of the hand, e.g, for an act of sleight of hand or to steal something."},{"definition":"To hold something without bending the fingers significantly.","example":"John palmed the ball."},{"definition":"To move something with the palm of the hand."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"palms-us"}]},{"word":"LAWSUITS","idx":13514,"count":3127389,"meanings":[{"definitions":[{"definition":"In civil law, a case where two or more people disagree and one or more of the parties take the case to a court for resolution.","example":"The lawyer advised his client against filing a lawsuit as it would take a lot of time and money to resolve."}],"partOfSpeech":"n"}]},{"word":"SEATED","idx":13515,"count":3127196,"meanings":[{"definitions":[{"definition":"To put an object into a place where it will rest; to fix; to set firm.","example":"Be sure to seat the gasket properly before attaching the cover."},{"definition":"To provide with places to sit.","example":"The waiter seated us and asked what we would like to drink."},{"definition":"To request or direct one or more persons to sit.","example":"Please seat the audience after the anthem and then introduce the first speaker."},{"definition":"(legislature) To recognize the standing of a person or persons by providing them with one or more seats which would allow them to participate fully in a meeting or session.","example":"Only half the delegates from the state were seated at the convention because the state held its primary too early."},{"definition":"To assign the seats of.","example":"to seat a church"},{"definition":"To cause to occupy a post, site, or situation; to station; to establish; to fix; to settle."},{"definition":"To rest; to lie down."},{"definition":"To settle; to plant with inhabitants.","example":"to seat a country"},{"definition":"To put a seat or bottom in.","example":"to seat a chair"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sitting"},{"definition":"Of a woman's skirt, stretched out and baggy over the wearer's buttocks from much sitting while wearing the skirt"},{"definition":"Fixed; confirmed"},{"definition":"Located; situated"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"seated-us","text":"/ˈsiːtɪd/"}]},{"word":"LATTICE","idx":13516,"count":3126448,"meanings":[{"definitions":[{"definition":"A flat panel constructed with widely-spaced crossed thin strips of wood or other material, commonly used as a garden trellis."},{"definition":"A bearing with vertical and horizontal bands that cross each other."},{"definition":"A regular spacing or arrangement of geometric points, often decorated with a motif."},{"definition":"A discrete subgroup of Rn which is isomorphic to Zn (considered as an additive group) and spans the real vector space Rn."},{"definition":"A model of the tuning relationships of a just intonation system, comprising an array of points in a periodic multidimensional pattern."},{"definition":"(Lie theory) A discrete subgroup L of a given locally compact group G whose quotient space G/L has finite invariant measure."},{"definition":"A partially ordered set in which every pair of elements has a unique supremum and a unique infimum."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a lattice of.","example":"to lattice timbers"},{"definition":"To close, as an opening, with latticework; to furnish with a lattice.","example":"to lattice a window"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lattice-uk","text":"/ˈlæt.ɪs/"}]},{"word":"DONG","idx":13517,"count":3126204,"meanings":[{"definitions":[{"definition":"The currency of Vietnam, 100 xus. Symbol: ₫"},{"definition":"A penis."},{"definition":"(by extension) A dildo, specifically a synthetic anatomical replica of the penis."},{"definition":"Onomatopoeia for the ringing sound made by a bell with a low pitch."},{"definition":"A submunicipal administrative unit of a city in North or South Korea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a bell: to make a low-pitched ringing sound."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dong-au","text":"/dɒŋ/"}]},{"word":"REALIZATION","idx":13518,"count":3125978,"meanings":[{"definitions":[{"definition":"The act of realizing."},{"definition":"The result of an artistic effort.","example":"The painter's realization of her concept was breathtaking."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"realization-us","text":"/-laɪˈzeɪʃən/"}]},{"word":"REPORTEDLY","idx":13519,"count":3125324,"meanings":[{"definitions":[{"definition":"According to reports or rumors; supposedly."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɹɪˈpɔːtɪdli/"}]},{"word":"ABSORBED","idx":13520,"count":3125006,"meanings":[{"definitions":[{"definition":"To include so that it no longer has separate existence; to overwhelm; to cause to disappear as if by swallowing up; to incorporate; to assimilate; to take in and use up."},{"definition":"To engulf, as in water; to swallow up."},{"definition":"To suck up; to drink in; to imbibe, like a sponge or as the lacteals of the body; to chemically take in."},{"definition":"To take in energy and convert it, as","example":"Heat, light, and electricity are absorbed in the substances into which they pass."},{"definition":"To engross or engage wholly; to occupy fully"},{"definition":"To occupy or consume time."},{"definition":"Assimilate mentally."},{"definition":"To assume or pay for as part of a commercial transaction."},{"definition":"To defray the costs."},{"definition":"To accept or purchase in quantity."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fully occupied with one's thoughts; engrossed."},{"definition":"Something that has been absorbed, taken in, engulfed, imbibed, or assimilated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"absorbed-us","text":"/æbˈsɔɹbd/"}]},{"word":"CHORD","idx":13522,"count":3123447,"meanings":[{"definitions":[{"definition":"A harmonic set of three or more notes that is heard as if sounding simultaneously."},{"definition":"A straight line between two points of a curve."},{"definition":"A horizontal member of a truss."},{"definition":"The distance between the leading and trailing edge of a wing, measured in the direction of the normal airflow."},{"definition":"An imaginary line from the luff of a sail to its leech."},{"definition":"A keyboard shortcut that involves two or more distinct keypresses, such as Ctrl+M followed by P."},{"definition":"The string of a musical instrument."},{"definition":"A cord."},{"definition":"An edge that is not part of a cycle but connects two vertices of the cycle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write chords for."},{"definition":"To accord; to harmonize together.","example":"This note chords with that one."},{"definition":"To provide with musical chords or strings; to string; to tune."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chord-us","text":"/kɔɹd/"}]},{"word":"TURF","idx":13526,"count":3121984,"meanings":[{"definitions":[{"definition":"A layer of earth covered with grass; sod."},{"definition":"A piece of such a layer cut from the soil. May be used as sod to make a lawn, dried for peat, stacked to form earthen structures, etc."},{"definition":"A sod of peat used as fuel."},{"definition":"The territory claimed by a person, gang, etc. as their own."},{"definition":"(with \"the\") A racetrack; or the sport of racing horses."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover with turf; to create a lawn by laying turfs."},{"definition":"(Ultimate Frisbee) To throw a frisbee well short of its intended target, usually causing it to hit the ground within 10 yards of its release."},{"definition":"To fire from a job or dismiss from a task.","example":"Eight managers were turfed after the merger of the two companies."},{"definition":"To cancel a project or product.","example":"The company turfed the concept car because the prototype performed poorly."},{"definition":"To expel, eject, or throw out; to turf out."},{"definition":"To transfer or attempt to transfer (a patient or case); to eschew or avoid responsibility for."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɝf/"},{"text":"/tɜːf/"},{"audio":"turf-au"}]},{"word":"ASPHALT","idx":13527,"count":3121584,"meanings":[{"definitions":[{"definition":"A sticky, black and highly viscous liquid or semi-solid, composed almost entirely of bitumen, that is present in most crude petroleums and in some natural deposits."},{"definition":"Asphalt concrete, a hard ground covering used for roads and walkways."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pave with asphalt."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"asphalt-us","text":"/ˈæsfɔlt/"}]},{"word":"REPLAY","idx":13528,"count":3121356,"meanings":[{"definitions":[{"definition":"The replaying of (something), for example of televised footage.","example":"Show us that replay one more time."},{"definition":"Saved video footage of the gameplay of a computer game"},{"definition":"A replayed match, often after the first game or match ended in a draw."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play again."},{"definition":"To display a recording of a previous event, especially multiple times."}],"partOfSpeech":"ve"}]},{"word":"IMPROPER","idx":13529,"count":3121296,"meanings":[{"definitions":[{"definition":"To appropriate; to limit."},{"definition":"To behave improperly"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Unsuitable to needs or circumstances; inappropriate; inapt"},{"definition":"Not in keeping with conventional mores or good manners; indecent or immodest"},{"definition":"Not according to facts; inaccurate or erroneous"},{"definition":"Not consistent with established facts; incorrect"},{"definition":"Not properly named; See, for example, improper fraction"},{"definition":"Not specific or appropriate to individuals; general; common."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"improper-uk","text":"/ɪmˈpɹɒp.ə/"}]},{"word":"FLAVORS","idx":13530,"count":3121207,"meanings":[{"definitions":[{"definition":"To add flavoring to something."}],"partOfSpeech":"ve"}]},{"word":"DILEMMA","idx":13531,"count":3121080,"meanings":[{"definitions":[{"definition":"A circumstance in which a choice must be made between two or more alternatives that seem equally undesirable."},{"definition":"A difficult circumstance or problem."},{"definition":"A type of syllogism of the form \"if A is true then B is true; if C is true then D is true; either A or C is true; therefore either B or D is true\"."},{"definition":"Offering to an opponent a choice between two (equally unfavorable) alternatives."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dilemma-us","text":"/daɪˈlɛmə/"}]},{"word":"IG","idx":13532,"count":3120572,"meanings":[{"definitions":[{"definition":"To ignore deliberately."}],"partOfSpeech":"ve"}]},{"word":"REBUILDING","idx":13533,"count":3120389,"meanings":[{"definitions":[{"definition":"To build again."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of building something again."}],"partOfSpeech":"n"}]},{"word":"COMMENTING","idx":13536,"count":3119037,"meanings":[{"definitions":[{"definition":"To remark."},{"definition":"(with \"on\" or \"about\") To make remarks or notes."},{"definition":"To comment or remark on."},{"definition":"(of code) To insert comments into (source code).","example":"I wish I'd commented this complicated algorithm back when I remembered how it worked."},{"definition":"(of code) To comment out (code); to disable by converting into a comment."}],"partOfSpeech":"ve"}]},{"word":"SHIFTED","idx":13537,"count":3118000,"meanings":[{"definitions":[{"definition":"(sometimes figurative) To move from one place to another; to redistribute.","example":"We'll have to shift these boxes to the downtown office."},{"definition":"To change in form or character; swap."},{"definition":"To change position.","example":"His political stance shifted daily."},{"definition":"To change residence; to leave and live elsewhere.","example":"We are shifting to America next month."},{"definition":"To change (clothes, especially underwear)."},{"definition":"To change (someone's) clothes; sometimes specifically, to change underwear."},{"definition":"To change gears (in a car).","example":"I crested the hill and shifted into fifth."},{"definition":"(typewriters) To move the keys of a typewriter over in order to type capital letters and special characters."},{"definition":"(computer keyboards) To switch to a character entry mode for capital letters and special characters."},{"definition":"To manipulate a binary number by moving all of its digits left or right; compare rotate.","example":"Shifting 1001 to the left yields 10010; shifting it right yields 100."},{"definition":"To remove the first value from an array."},{"definition":"To dispose of.","example":"How can I shift a grass stain?"},{"definition":"To hurry.","example":"If you shift, you might make the 2:19."},{"definition":"To engage in sexual petting."},{"definition":"To resort to expedients for accomplishing a purpose; to contrive; to manage."},{"definition":"To practice indirect or evasive methods."},{"definition":"In violin-playing, to move the left hand from its original position next to the nut."}],"partOfSpeech":"ve"}]},{"word":"TANGIBLE","idx":13538,"count":3117941,"meanings":[{"definitions":[{"definition":"A physical object, something that can be touched."},{"definition":"Real or concrete results.","example":"Yes, but what are the tangibles?"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Touchable; able to be touched or felt; perceptible by the sense of touch"},{"definition":"Possible to be treated as fact; real or concrete."},{"definition":"Comprehensible by the mind; understandable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tangible-us","text":"/ˈtændʒəbəl/"}]},{"word":"SMOKED","idx":13539,"count":3117683,"meanings":[{"definitions":[{"definition":"Of food, preserved by treatment with smoke.","example":"smoked salmon"},{"definition":"Of glass, tinted."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To inhale and exhale the smoke from a burning cigarette, cigar, pipe, etc.","example":"He's smoking his pipe."},{"definition":"To inhale and exhale tobacco smoke.","example":"Do you smoke?"},{"definition":"To give off smoke.","example":"My old truck was still smoking even after the repairs."},{"definition":"To preserve or prepare (food) for consumption by treating with smoke.","example":"You'll need to smoke the meat for several hours."},{"definition":"To dry or medicate by smoke."},{"definition":"To fill or scent with smoke; hence, to fill with incense; to perfume."},{"definition":"To make unclear or blurry."},{"definition":"(chiefly as present participle) To perform (e.g. music) energetically or skillfully.","example":"The horn section was really smokin' on that last tune."},{"definition":"To beat someone at something.","example":"We smoked them at rugby."},{"definition":"To kill, especially with a gun.","example":"He got smoked by the mob."},{"definition":"To thrash; to beat."},{"definition":"To smell out; to hunt out; to find out; to detect."},{"definition":"To ridicule to the face; to mock."},{"definition":"To burn; to be kindled; to rage."},{"definition":"To raise a dust or smoke by rapid motion."},{"definition":"To suffer severely; to be punished."},{"definition":"To punish (a person) for a minor offense by excessive physical exercise."},{"definition":"To cover (a key blank) with soot or carbon to aid in seeing the marks made by impressioning."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"smoked-us","text":"/smoʊkt/"}]},{"word":"HAWKS","idx":13540,"count":3117529,"meanings":[{"definitions":[{"definition":"A diurnal predatory bird of the family Accipitridae, smaller than an eagle.","example":"It is illegal to hunt hawks or other raptors in many parts of the world."},{"definition":"Any diurnal predatory terrestrial bird of similar size and appearance to the accipitrid hawks, such as a falcon"},{"definition":"An advocate of aggressive political positions and actions."},{"definition":"An uncooperative or purely-selfish participant in an exchange or game, especially when untrusting, acquisitive or treacherous. Refers specifically to the Prisoner's Dilemma, alias the Hawk-Dove game."},{"definition":"A plasterer's tool, made of a flat surface with a handle below, used to hold an amount of plaster prior to application to the wall or ceiling being worked on: a mortarboard."},{"definition":"A noisy effort to force up phlegm from the throat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hunt with a hawk."},{"definition":"To make an attack while on the wing; to soar and strike like a hawk.","example":"to hawk at flies"},{"definition":"To sell; to offer for sale by outcry in the street; to carry (merchandise) about from place to place for sale; to peddle.","example":"The vendors were hawking their wares from little tables lining either side of the market square."},{"definition":"To cough up something from one's throat."},{"definition":"To try to cough up something from one's throat; to clear the throat loudly.","example":"Grandpa sat on the front porch, hawking and wheezing, as he packed his pipe with cheap tobacco."}],"partOfSpeech":"ve"}]},{"word":"ZIFF","idx":13541,"count":3117162,"meanings":[{"definitions":[{"definition":"A juvenile thief."}],"partOfSpeech":"n"}]},{"word":"PLACEBO","idx":13542,"count":3116281,"meanings":[{"definitions":[{"definition":"A dummy medicine containing no active ingredients; an inert treatment."},{"definition":"The vespers sung in the office for the dead."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"placebo-uk","text":"/pləˈsiː.bəʊ/"}]},{"word":"IRONS","idx":13543,"count":3116159,"meanings":[{"definitions":[{"definition":"A common, inexpensive metal, silvery grey when untarnished, that rusts, is attracted by magnets, and is used in making steel."},{"definition":"A metallic chemical element having atomic number 26 and symbol Fe."},{"definition":"Any material, not a steel, predominantly made of elemental iron.","example":"wrought iron, ductile iron, cast iron, pig iron, gray iron"},{"definition":"A tool or appliance made of metal, which is heated and then used to transfer heat to something else; most often a thick piece of metal fitted with a handle and having a flat, roughly triangular bottom, which is heated and used to press wrinkles from clothing, and now usually containing an electrical heating apparatus."},{"definition":"(usually plural, irons) Shackles."},{"definition":"A firearm, either a long gun or a handgun."},{"definition":"A dark shade of the colour/color silver."},{"definition":"(shortened from iron hoof, rhyming with poof; countable) A male homosexual."},{"definition":"A golf club used for middle-distance shots."},{"definition":"Used as a symbol of great strength or toughness, or to signify a very strong or tough material.","example":"He appeared easygoing, but inside he was pure iron."},{"definition":"Weight used as resistance for the purpose of strength training.","example":"He lifts iron on the weekends."},{"definition":"A safety curtain in a theatre."},{"definition":"Dumb bombs, those without guidance systems."},{"definition":"Shackles","example":"Up the irons!"},{"definition":"A lack of forward motion."},{"definition":"The stirrups."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pass an iron over (clothing or some other item made of cloth) in order to remove creases."},{"definition":"To shackle with irons; to fetter or handcuff."},{"definition":"To furnish or arm with iron.","example":"to iron a wagon"}],"partOfSpeech":"ve"}]},{"word":"COMET","idx":13544,"count":3116034,"meanings":[{"definitions":[{"definition":"A celestial body consisting mainly of ice, dust and gas in a (usually very eccentric) orbit around the Sun and having a \"tail\" of matter blown back from it by the solar wind as it approaches the Sun."},{"definition":"A celestial phenomenon with the appearance given by the orbiting celestial body."},{"definition":"Any of several species of hummingbird found in the Andes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"comet-us","text":"/ˈkɒmət/"}]},{"word":"BERG","idx":13545,"count":3115373,"meanings":[{"definitions":[{"definition":"An iceberg."},{"definition":"Mountain"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"berg-uk","text":"/bɜːɡ/"}]},{"word":"BALTIC","idx":13546,"count":3115246,"meanings":[{"definitions":[{"definition":"Of or pertaining to the Baltic region or the Baltic Sea."},{"definition":"Of or pertaining to any of the Baltic languages."},{"definition":"Of or pertaining to the Balts (the Baltic peoples)."},{"definition":"Extremely cold."}],"partOfSpeech":"j"}]},{"word":"CORRECTIVE","idx":13547,"count":3115244,"meanings":[{"definitions":[{"definition":"Something that corrects or counteracts something.","example":"alkalies are correctives of acids"},{"definition":"Limitation; restriction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to correction; serving to correct.","example":"As the currents were changing rapidly, the captain had to make many corrective course changes."},{"definition":"Qualifying; limiting."}],"partOfSpeech":"j"}]},{"word":"COMPETENCY","idx":13548,"count":3115221,"meanings":[{"definitions":[{"definition":"A sufficient supply (of)."},{"definition":"A sustainable income."},{"definition":"The ability to perform some task; competence."},{"definition":"Meeting specified qualifications to perform."},{"definition":"Implicit knowledge of a language’s structure."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"competency-uk","text":"/ˈkɒmpətənsi/"}]},{"word":"MUSE","idx":13549,"count":3114242,"meanings":[{"definitions":[{"definition":"A source of inspiration."},{"definition":"A poet; a bard."},{"definition":"An act of musing; a period of thoughtfulness."},{"definition":"A gap or hole in a hedge, fence, etc. through which a wild animal is accustomed to pass; a muset.","example":"Find a hare without a muse. (old proverb)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become lost in thought, to ponder."},{"definition":"To say (something) with due consideration or thought."},{"definition":"To think on; to meditate on."},{"definition":"To wonder at."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"muse-us","text":"/mjuz/"}]},{"word":"PROBING","idx":13550,"count":3113887,"meanings":[{"definitions":[{"definition":"To explore, investigate, or question","example":"If you probe further, you may discover different reasons."},{"definition":"To insert a probe into."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of investigating or exploring."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That investigates or explores deeply; that attempts to elicit information that is concealed.","example":"He was unsettled by her probing questions."}],"partOfSpeech":"j"}]},{"word":"TEACHINGS","idx":13551,"count":3113457,"meanings":[{"definitions":[{"definition":"Something taught by a religious or philosophical authority.","example":"Many follow the teachings of Confucius."},{"definition":"The profession of educating people.","example":"Teaching has seen continual changes over the past decades."}],"partOfSpeech":"n"}]},{"word":"LOTTO","idx":13553,"count":3112797,"meanings":[{"definitions":[{"definition":"A game of chance similar to bingo"},{"definition":"A lottery"}],"partOfSpeech":"n"}]},{"word":"YOUNGEST","idx":13556,"count":3111198,"meanings":[{"definitions":[{"definition":"In the early part of growth or life; born not long ago.","example":"a lamb is a young sheep;  these picture books are for young readers"},{"definition":"At an early stage of existence or development; having recently come into existence.","example":"the age of space travel is still young;   a young business"},{"definition":"(Not) advanced in age; (far towards or) at a specified stage of existence or age.","example":"How young is your dog?   Her grandmother turned 70 years young last month."},{"definition":"Junior (of two related people with the same name)."},{"definition":"(of a decade of life) Early."},{"definition":"Youthful; having the look or qualities of a young person.","example":"My grandmother is a very active woman and is quite young for her age."},{"definition":"Of or belonging to the early part of life.","example":"The cynical world soon shattered my young dreams."},{"definition":"Having little experience; inexperienced; unpracticed; ignorant; weak."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The youngest child in a family, or individual in a group."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈjʌŋɡəst/"}]},{"word":"CONTINGENT","idx":13557,"count":3110534,"meanings":[{"definitions":[{"definition":"An event which may or may not happen; that which is unforeseen, undetermined, or dependent on something future."},{"definition":"That which falls to one in a division or apportionment among a number; a suitable share."},{"definition":"A quota of troops."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Possible or liable, but not certain to occur."},{"definition":"(with upon or on) Dependent on something that is undetermined or unknown.","example":"The success of his undertaking is contingent upon events which he cannot control."},{"definition":"Dependent on something that may or may not occur.","example":"a contingent estate"},{"definition":"Not logically necessarily true or false."},{"definition":"Temporary.","example":"contingent labor"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kənˈtɪn.dʒənt/"}]},{"word":"REFRESHING","idx":13558,"count":3110131,"meanings":[{"definitions":[{"definition":"To renew or revitalize.","example":"Sleep refreshes the body and the mind."},{"definition":"To become fresh again; to be revitalized."},{"definition":"To reload (a document, especially a webpage) and show any new changes."},{"definition":"To cause (a web browser or similar software) to refresh its display."},{"definition":"To perform the periodic energizing required to maintain the contents of computer memory, the display luminance of a computer screen, etc."},{"definition":"To take refreshment; to eat or drink."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of refresh; refreshment given or received."},{"definition":"That which gives refreshment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That refreshes someone; pleasantly fresh and different; granting vitality and energy."},{"definition":"Serving to refresh, particularly with respect to an electronic screen, or a browser window or similar computer application."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹəˈfɹɛʃɪŋ/"}]},{"word":"TEXTURES","idx":13559,"count":3108758,"meanings":[{"definitions":[{"definition":"The feel or shape of a surface or substance; the smoothness, roughness, softness, etc. of something.","example":"The beans had a grainy, gritty texture in her mouth."},{"definition":"The quality given to a work of art by the composition and interaction of its parts.","example":"The piece of music had a mainly homophonic texture."},{"definition":"An image applied to a polygon to create the appearance of a surface."},{"definition":"The act or art of weaving."},{"definition":"Something woven; a woven fabric; a web."},{"definition":"A tissue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create or apply a texture","example":"Drag the trowel through the plaster to texture the wall."}],"partOfSpeech":"ve"}]},{"word":"SYRUP","idx":13561,"count":3108136,"meanings":[{"definitions":[{"definition":"Any thick liquid that has a high sugar content and which is added to or poured over food as a flavouring.","example":"maple syrup"},{"definition":"(by extension) Any viscous liquid.","example":"cough syrup"},{"definition":"(shortened from \"syrup of figs\") A wig."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"syrup-us","text":"/ˈsi.ɹəp/"}]},{"word":"WARMTH","idx":13563,"count":3107429,"meanings":[{"definitions":[{"definition":"A moderate degree of heat; the sensation of being warm."},{"definition":"Friendliness, kindness or affection."},{"definition":"Fervor, intensity of emotion or expression."},{"definition":"The effect of using mostly red and yellow hues."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"warmth-us","text":"/wɔɹmθ/"}]},{"word":"DEP","idx":13565,"count":3107120,"meanings":[{"definitions":[{"definition":"Short for department."},{"definition":"Short for deposit."},{"definition":"Short for departure."},{"definition":"A deposition."},{"definition":"A deputy."},{"definition":"A dépanneur."},{"definition":"A dependency."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deputize."},{"definition":"Depart or departs"},{"definition":"Deposed"}],"partOfSpeech":"ve"}]},{"word":"LUST","idx":13566,"count":3106979,"meanings":[{"definitions":[{"definition":"A feeling of strong desire, especially such a feeling driven by sexual arousal.","example":"Seeing Kim fills me with a passionate lust."},{"definition":"A general want or longing, not necessarily sexual.","example":"The boarders hide their lust to go home."},{"definition":"A delightful cause of joy, pleasure.","example":"An ideal son is his father's lasting lust."},{"definition":"Virility; vigour; active power"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually in the phrase \"lust after\") To look at or watch with a strong desire, especially of a sexual nature.","example":"He was lusting after the woman in the tight leather miniskirt."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lust-uk","text":"/lʌst/"}]},{"word":"CORRELATED","idx":13567,"count":3106557,"meanings":[{"definitions":[{"definition":"To compare things and bring them into a relation having corresponding characteristics"},{"definition":"To be related by a correlation"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Mutually related in a correlation","example":"The variable \"age15-24\" was not included as this is highly correlated with the variable \"students\" and \"students\" were thought to be a more distinct group than the whole of the 15-24 age group."}],"partOfSpeech":"j"}]},{"word":"DOMINION","idx":13569,"count":3106048,"meanings":[{"definitions":[{"definition":"Power or the use of power; sovereignty over something; stewardship, supremacy."},{"definition":"Predominance; ascendancy"},{"definition":"(sometimes figurative) A kingdom, nation, or other sphere of influence; governed territory.","example":"the dominions of a king  the dominion of the passions"},{"definition":"An order of angel in Christian angelology, ranked above virtues and below thrones."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dominion-us","text":"/doʊˈmɪnjən/"}]},{"word":"VERSES","idx":13570,"count":3104329,"meanings":[{"definitions":[{"definition":"A poetic form with regular meter and a fixed rhyme scheme.","example":"Restoration literature is well known for its carefully constructed verse."},{"definition":"Poetic form in general.","example":"The restrictions of verse have been steadily relaxed over time."},{"definition":"One of several similar units of a song, consisting of several lines, generally rhymed.","example":"Note the shift in tone between the first verse and the second."},{"definition":"A small section of the Jewish or Christian Bible."},{"definition":"A portion of an anthem to be performed by a single voice to each part."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To compose verses."},{"definition":"To tell in verse, or poetry."},{"definition":"To educate about, to teach about.","example":"He versed us in the finer points of category theory."},{"definition":"To oppose, to compete against, especially in a video game.","example":"Verse him, G!"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"verses-us","text":"/-əz/"}]},{"word":"NANOTECHNOLOGY","idx":13572,"count":3103490,"meanings":[{"definitions":[{"definition":"The science and technology of creating nanoparticles and of manufacturing machines which have sizes within the range of nanometres."}],"partOfSpeech":"n"}]},{"word":"ASTRONOMICAL","idx":13573,"count":3103128,"meanings":[{"definitions":[{"definition":"Of or relating to astronomy."},{"definition":"Very large; of vast measure."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"astronomical-us","text":"/ˌæstɹəˈnɑːmɪkəl/"}]},{"word":"SOLVENT","idx":13574,"count":3101965,"meanings":[{"definitions":[{"definition":"A liquid that dissolves a solid, liquid, or gaseous solute, resulting in a solution."},{"definition":"That which resolves.","example":"a solvent of mystery"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Able to pay all debts as they become due, and having no more liabilities than assets."},{"definition":"Having the power of dissolving; causing solution."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[ˈsɒlvənt]"}]},{"word":"TOGGLE","idx":13575,"count":3101854,"meanings":[{"definitions":[{"definition":"A wooden or metal pin, short rod, crosspiece or similar, fixed transversely in the eye of a rope or chain to be secured to any other loop, ring, or bight, e.g. a sea painter to a lifeboat."},{"definition":"(in particular) A rod-shaped button bound with slack to the fabric."},{"definition":"A toggle switch."},{"definition":"An appliance for transmitting force at right angles to its direction."},{"definition":"A horizontal piece of wood that is placed on a door, flat, or other wooden structure, but is not on one of the edges of the structure."},{"definition":"(skydiving) A loop of webbing or a dowel affixed to the end of the steering/brake lines of a parachute providing the pilot with a means of control."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To alternate between two positions using a single switch or lever.","example":"Clicking a button will alternately toggle its light on OR off."},{"definition":"To switch between alternate states.","example":"You can quickly toggle the case of selected text by pressing Alt+C."},{"definition":"To fix like a toggle iron; to fix fast."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"toggle-us","text":"/ˈtɑ.ɡəl/"}]},{"word":"AMPLITUDE","idx":13577,"count":3100838,"meanings":[{"definitions":[{"definition":"The measure of something's size, especially in terms of width or breadth; largeness, magnitude."},{"definition":"The maximum absolute value of the vertical component of a curve or function, especially one that is periodic."},{"definition":"The maximum absolute value of some quantity that varies."},{"definition":"The arc of the horizon between the true east or west point and the center of the sun, or a star, at its rising or setting. At the rising, the amplitude is eastern or ortive: at the setting, it is western, occiduous, or occasive. It is also northern or southern, when north or south of the equator."},{"definition":"The arc of the horizon between the true east or west point and the foot of the vertical circle passing through any star or object."},{"definition":"The horizontal line which measures the distance to which a projectile is thrown; the range."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"amplitude-us","text":"/ˈæm.plɪ.tud/"}]},{"word":"AESTHETIC","idx":13578,"count":3100660,"meanings":[{"definitions":[{"definition":"The study of art or beauty."},{"definition":"That which appeals to the senses."},{"definition":"The artistic motifs defining a collection of things, especially works of art; more broadly, their vibe.","example":"Her most recent works have this quirky, half-serious 90's teen culture-inspired aesthetic."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Concerned with beauty, artistic impact, or appearance."},{"definition":"Beautiful or appealing to one's sense of beauty and/or art.","example":"It works well enough, but the shabby exterior offends his aesthetic sensibilities."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"aesthetic-us","text":"/ɛs.ˈθɛ.tɪk/"}]},{"word":"COMMERCIALLY","idx":13579,"count":3100614,"meanings":[{"definitions":[{"definition":"In a commercial manner: a manner pertaining to commerce."}],"partOfSpeech":"v"}]},{"word":"SPACING","idx":13583,"count":3099202,"meanings":[{"definitions":[{"definition":"To roam, walk, wander."},{"definition":"To set some distance apart."},{"definition":"To insert or utilise spaces in a written text."},{"definition":"To eject into outer space, usually without a space suit."},{"definition":"To travel into and through outer space."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb space."},{"definition":"A way in which objects or people are separated by spaces.","example":"The spacing of the desks in the exam hall was intended to prevent candidates from copying each other's work."},{"definition":"The space between two objects or people.","example":"Put some more spacing between those two words to make them more readable."},{"definition":"The activity of working or living in outer space; the occupation of a spacer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That inserts space between two objects."}],"partOfSpeech":"j"}]},{"word":"FRAMEWORKS","idx":13584,"count":3098142,"meanings":[{"definitions":[{"definition":"A support structure comprising joined parts or conglomerated particles and intervening open spaces of similar or larger size."},{"definition":"The arrangement of support beams that represent a building's general shape and size."},{"definition":"The larger branches of a tree that determine its shape."},{"definition":"A basic conceptual structure.","example":"These ‘three principles of connexion’ compose the framework of principles in Hume's account of the association of ideas."},{"definition":"A reusable piece of code (and, sometimes, other utilities) providing a standard environment within which an application can be implemented."},{"definition":"The identification and categorisation of processes or steps that constitute a complex task or mindset in order to render explicit the tacit and implicit."}],"partOfSpeech":"n"}]},{"word":"COMPLETENESS","idx":13585,"count":3098125,"meanings":[{"definitions":[{"definition":"The state or condition of being complete"},{"definition":"The property of a logical theory that whenever a wff is valid then it must also be a theorem. Symbolically, letting T represent a theory within logic L, this can be represented as the property that whenever T \\vDash \\phi is true, then T \\vdash \\phi must also be true, for any wff φ of logic L."}],"partOfSpeech":"n"}]},{"word":"IRREGULAR","idx":13586,"count":3097883,"meanings":[{"definitions":[{"definition":"A soldier who is not a member of an official military force and, often, does not follow regular army tactics"},{"definition":"One who does not regularly attend a venue"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Nonstandard; not conforming to rules or expectations"},{"definition":"(of a surface) rough"},{"definition":"Without symmetry, regularity, or uniformity"},{"definition":"(of a polygon) not regular; having sides that are not equal or angles that are not equal"},{"definition":"(of a polyhedron) whose faces are not all regular polygons (or are not equally inclined to each other)"},{"definition":"(grammar, of a word) not following the regular or expected patterns of inflection in a given language","example":"\"Calves\", \"cacti\", and \"children\" are irregular plurals."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪˈɹɛɡjəlɚ/"}]},{"word":"BARKER","idx":13587,"count":3096553,"meanings":[{"definitions":[{"definition":"Someone or something who barks.","example":"My neighbor's dog is a constant barker that keeps me awake at night."},{"definition":"A person employed to solicit customers by calling out to passersby, e.g. at a carnival.","example":"Bob had amassed a considerable stockpile of double entendres from his days working as a barker for a strip joint."},{"definition":"A shelf-talker."},{"definition":"A video game mode where the action is demonstrated to entice someone to play the game.","example":"The barker mode of the arcade video game convinced the teenager to spend a quarter."},{"definition":"A pistol."},{"definition":"The spotted redshank."},{"definition":"A person who removes needed or valuable tree bark, as on a cinnamon or cinchona plantation.","example":"The professor of barker has been made largely obsolete by the realization that in most cases saplings can be cultivated far more profitably."},{"definition":"A tanner.","example":"The profession of barker has been made largely obsolete by the introduction of more effective tanning agents, but it lives on as a surname."},{"definition":"A machine used to remove unneeded bark from wood.","example":"Run these logs through the barker so we can use them as fence posts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"barker-au"}]},{"word":"SOLIDS","idx":13588,"count":3096318,"meanings":[{"definitions":[{"definition":"A substance in the fundamental state of matter that retains its size and shape without need of a container (as opposed to a liquid or gas)."},{"definition":"A three-dimensional figure (as opposed to a surface, an area, or a curve)."},{"definition":"A favor.","example":"I owe him; he did me a solid last year."},{"definition":"An article of clothing which is of a single color throughout.","example":"I prefer solids over paisleys."},{"definition":"(in the plural) Food which is not liquid-based.","example":"The doctor said I can't eat any solids four hours before the operation."}],"partOfSpeech":"n"}]},{"word":"MERGERS","idx":13589,"count":3096122,"meanings":[{"definitions":[{"definition":"One that merges."},{"definition":"The act or process of merging two or more parts into a single unit.","example":"Club mergers reduced the number of teams by half"},{"definition":"The legal union of two or more corporations into a single entity, typically assets and liabilities being assumed by the buying party."},{"definition":"An absorption of one or more estate(s) or contract(s) into one other, all being held by the same owner; of several counts of accusation into one judgement, etc."},{"definition":"A type of sound change where two or more sounds merge into one."}],"partOfSpeech":"n"}]},{"word":"CAPTURING","idx":13590,"count":3096013,"meanings":[{"definitions":[{"definition":"To take control of; to seize by force or stratagem.","example":"to capture an enemy, a vessel, or a criminal"},{"definition":"To store (as in sounds or image) for later revisitation.","example":"She captured the details of the fresco in a series of photographs."},{"definition":"To reproduce convincingly.","example":"His film adaptation captured the spirit of the original work."},{"definition":"To remove or take control of an opponent’s piece in a game (e.g., chess, go, checkers).","example":"He captured his opponent’s queen on the 15th move."}],"partOfSpeech":"ve"}]},{"word":"FILTRATION","idx":13591,"count":3095699,"meanings":[{"definitions":[{"definition":"The act or process of filtering; the mechanical separation of a liquid from the undissolved particles floating in it."},{"definition":"A totally ordered collection of subsets."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fɪlˈtɹeɪʃən/"}]},{"word":"CERTIFY","idx":13592,"count":3095645,"meanings":[{"definitions":[{"definition":"To attest to (a fact) as the truth."},{"definition":"To authenticate or verify in writing."},{"definition":"To attest that a product, service, organization, or person has met an official standard.","example":"These blankets have been certified as fireproof."},{"definition":"To inform; to tell (a person) that something is true."},{"definition":"To assure (oneself) of something; to ascertain."}],"partOfSpeech":"ve"}]},{"word":"CONSULTED","idx":13594,"count":3094839,"meanings":[{"definitions":[{"definition":"To seek the opinion or advice of another; to take counsel; to deliberate together; to confer."},{"definition":"To advise or offer expertise."},{"definition":"To work as a consultant or contractor rather than as a full-time employee of a firm."},{"definition":"To ask advice of; to seek the opinion of (a person)"},{"definition":"To refer to (something) for information."},{"definition":"To have reference to, in judging or acting; to have regard to; to consider; as, to consult one's wishes."},{"definition":"To deliberate upon; to take for."},{"definition":"To bring about by counsel or contrivance; to devise; to contrive."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kənˈsʌltɪd/"}]},{"word":"REALISED","idx":13595,"count":3094838,"meanings":[{"definitions":[{"definition":"To make real; to convert from the imaginary or fictitious into reality; to bring into real existence","example":"The objectives of the project were never fully realized."},{"definition":"To become aware of (a fact or situation, especially of something that has been true for a long time).","example":"He realized that he had left his umbrella on the train."},{"definition":"To cause to seem real; to sense vividly or strongly; to make one's own in thought or experience."},{"definition":"To acquire as an actual possession; to obtain as the result of plans and efforts; to gain; to get","example":"to realize large profits from a speculation"},{"definition":"To convert any kind of property into money, especially property representing investments, such as shares, bonds, etc.","example":"By realizing the company's assets, the liquidator was able to return most of the shareholders' investments."},{"definition":"To convert into real property; to make real estate of."},{"definition":"To turn an abstract linguistic object into actual language, especially said of a phoneme's conversion into speech sound.","example":"The southern /v/ is realized as the voiced approximant [ʋ]."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"realised-us","text":"/ˈɹi.ə.laɪzd/"}]},{"word":"EIGHTEEN","idx":13598,"count":3094087,"meanings":[{"definitions":[{"definition":"The cardinal number occurring after seventeen and before nineteen, represented in Roman numerals as XVIII and in Arabic numerals as 18."}],"partOfSpeech":"nu"}],"phonetics":[{"text":"/ˈeɪ(t).tin/"},{"audio":"eighteen-us"},{"text":"/ˈeɪ.tiːn/"}]},{"word":"SINGULAR","idx":13599,"count":3093829,"meanings":[{"definitions":[{"definition":"(grammar) A form of a word that refers to only one person or thing."},{"definition":"That which is not general; a specific determinate instance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Being only one of a larger population.","example":"A singular experiment cannot be regarded as scientific proof of the existence of a phenomenon."},{"definition":"Being the only one of the kind; unique.","example":"She has a singular personality."},{"definition":"Distinguished by superiority: peerless, unmatched, eminent, exceptional, extraordinary.","example":"a man of singular gravity or attainments"},{"definition":"Out of the ordinary; curious.","example":"It was very singular; I don't know why he did it."},{"definition":"(grammar) Referring to only one thing or person."},{"definition":"(of matrix) Having no inverse."},{"definition":"(of transformation) Having the property that the matrix of coefficients of the new variables has a determinant equal to zero."},{"definition":"(of a cardinal number) Not equal to its own cofinality."},{"definition":"Each; individual.","example":"to convey several parcels of land, all and singular"},{"definition":"Engaged in by only one on a side; single."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"singular-us","text":"/ˈsɪŋɡjəlɚ/"}]},{"word":"INCREMENTAL","idx":13600,"count":3093421,"meanings":[{"definitions":[{"definition":"Pertaining to an increment."},{"definition":"Occurring over a series of gradual increments, or small steps."}],"partOfSpeech":"j"}]},{"word":"DEMONS","idx":13602,"count":3092729,"meanings":[{"definitions":[{"definition":"An evil supernatural spirit."},{"definition":"A neutral supernatural spirit."},{"definition":"Someone with great strength, passion or skill for a particular activity, pursuit etc.; an enthusiast.","example":"He’s a demon at the card tables."},{"definition":"A form of patience (known as Canfield in the US)."},{"definition":"Any of various hesperiid butterflies of the genera Notocrypta and Udaspes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"demons-us"}]},{"word":"UNACCEPTABLE","idx":13603,"count":3092460,"meanings":[{"definitions":[{"definition":"Something that is not acceptable."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Unsatisfactory; not acceptable"},{"definition":"Not conforming to accepted usage"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌʌn.æk.ˈsɛp.tə.bl̩/"}]},{"word":"REDISTRIBUTE","idx":13604,"count":3092057,"meanings":[{"definitions":[{"definition":"To distribute again."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˌɹɪːdɪˈstɹɪbjuːt/"}]},{"word":"COPING","idx":13605,"count":3091883,"meanings":[{"definitions":[{"definition":"To deal effectively with something, especially if difficult.","example":"I thought I would never be able to cope with life after the amputation, but I have learned how to be happy again."},{"definition":"To cut and form a mitred joint in wood or metal."},{"definition":"To clip the beak or talons of a bird."},{"definition":"To cover (a joint or structure) with coping."},{"definition":"To form a cope or arch; to bend or arch; to bow."},{"definition":"To bargain for; to buy."},{"definition":"To exchange or barter."},{"definition":"To make return for; to requite; to repay."},{"definition":"To match oneself against; to meet; to encounter."},{"definition":"To encounter; to meet; to have to do with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The top layer of a brick wall, especially one that slopes in order to throw off water."},{"definition":"The process of managing taxing circumstances, expending effort to solve personal and interpersonal problems, and seeking to master, minimize, reduce or tolerate stress or conflict."},{"definition":"Clipping the beak or talons of a bird."}],"partOfSpeech":"n"}]},{"word":"OUTBREAK","idx":13608,"count":3090168,"meanings":[{"definitions":[{"definition":"An eruption; the sudden appearance of a rash, disease, etc.","example":"Any epidemic outbreak causes understandable panic."},{"definition":"An outburst or sudden eruption, especially of violence and mischief.","example":"There has been an outbreak of broken windows in the street."},{"definition":"A sudden increase.","example":"There has been an outbreak of vandalism at the school."},{"definition":"A geological layer that breaks out."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To burst out."},{"definition":"To break forth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"outbreak-us","text":"/ˈaʊtbɹeɪk/"}]},{"word":"ABDOMINAL","idx":13609,"count":3090148,"meanings":[{"definitions":[{"definition":"A fish of the order Abdominales."},{"definition":"(usually plurale tantum) An abdominal muscle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the abdomen; ventral.","example":"abdominal cavity"},{"definition":"Having the ventral fins under the abdomen and behind the pectoral fins."},{"definition":"Ventral, in describing a fin."},{"definition":"Belonging to the order Abdominales of fish."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"abdominal-us","text":"/æbˈdɑm.ə.nl̩/"}]},{"word":"DEFICIENCIES","idx":13611,"count":3087091,"meanings":[{"definitions":[{"definition":"Inadequacy or incompleteness."},{"definition":"An insufficiency, especially of something essential to health."},{"definition":"The amount by which the number of double points on a curve is short of the maximum for curves of the same degree."},{"definition":"The codimension of a linear system in the corresponding complete linear system."}],"partOfSpeech":"n"}]},{"word":"CURVED","idx":13612,"count":3086969,"meanings":[{"definitions":[{"definition":"To bend; to crook.","example":"to curve a line"},{"definition":"To cause to swerve from a straight course.","example":"to curve a ball in pitching it"},{"definition":"To bend or turn gradually from a given direction.","example":"the road curves to the right"},{"definition":"To grade on a curve (bell curve of a normal distribution).","example":"The teacher will curve the test."},{"definition":"To reject, to turn down romantic advances.","example":"I was once curved three times by the same woman."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a curve or curves."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kɝːvd/"},{"text":"/kɜːvd/"}]},{"word":"MILESTONE","idx":13613,"count":3086751,"meanings":[{"definitions":[{"definition":"A stone milepost (or by extension in other materials), one of a series of numbered markers placed along a road at regular intervals, typically at the side of the road or in a median."},{"definition":"An important event in a person's life or career, in the history of a nation, in the life of some project, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place milestones along (a road, etc.)."},{"definition":"To plan out a project as a series of major steps."}],"partOfSpeech":"ve"}]},{"word":"ERASE","idx":13614,"count":3086642,"meanings":[{"definitions":[{"definition":"The operation of deleting data."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove markings or information","example":"I erased that note because it was wrong."},{"definition":"To obliterate information from (a storage medium), such as to clear or (with magnetic storage) to demagnetize.","example":"I'm going to erase this tape."},{"definition":"To obliterate (information) from a storage medium, such as to clear or to overwrite.","example":"I'm going to erase those files."},{"definition":"To remove a runner from the bases via a double play or pick off play","example":"Jones was erased by a 6-4-3 double play."},{"definition":"To be erased (have markings removed, have information removed or be cleared of information).","example":"The chalkboard erased easily."},{"definition":"To disregard (a group, an orientation, etc.); to prevent from having an active role in society."},{"definition":"To kill; assassinate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"erase-us","text":"/ɪˈɹeɪs/"}]},{"word":"LIEN","idx":13615,"count":3086579,"meanings":[{"definitions":[{"definition":"A tendon."},{"definition":"A right to take possession of a debtor’s property as security until a debt or duty is discharged."},{"definition":"(possibly obsolete) The spleen."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈliːn/"}]},{"word":"NIP","idx":13616,"count":3086133,"meanings":[{"definitions":[{"definition":"A small quantity of something edible or a potable liquor.","example":"He had a nip of whiskey."},{"definition":"A nipple, usually of a woman.","example":"Did you manage to sneak a peek at her nips, bro?"},{"definition":"A playful bite.","example":"The puppy gave his owner’s finger a nip."},{"definition":"A pinch with the nails or teeth."},{"definition":"Briskly cold weather.","example":"There is a nip in the air. It is nippy outside."},{"definition":"A seizing or closing in upon; a pinching","example":"the nip of masses of ice"},{"definition":"A small cut, or a cutting off the end."},{"definition":"A more or less gradual thinning out of a stratum."},{"definition":"A blast; a killing of the ends of plants by frost."},{"definition":"A biting sarcasm; a taunt."},{"definition":"A short turn in a rope."},{"definition":"(papermaking) The place of intersection where one roll touches another"},{"definition":"A pickpocket."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To catch and enclose or compress tightly between two surfaces, or points which are brought together or closed; to pinch; to close in upon."},{"definition":"To remove by pinching, biting, or cutting with two meeting edges of anything; to clip."},{"definition":"To blast, as by frost; to check the growth or vigor of; to destroy."},{"definition":"To annoy, as by nipping."},{"definition":"To taunt."},{"definition":"To squeeze or pinch."},{"definition":"To steal; especially to cut a purse."},{"definition":"To make a quick, short journey or errand, usually a round trip.","example":"Why don’t you nip down to the grocer’s for some milk?"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"nip-au","text":"/nɪp/"}]},{"word":"BITES","idx":13617,"count":3086130,"meanings":[{"definitions":[{"definition":"The act of biting."},{"definition":"The wound left behind after having been bitten.","example":"That snake bite really hurts!"},{"definition":"The swelling of one's skin caused by an insect's mouthparts or sting.","example":"After just one night in the jungle I was covered with mosquito bites."},{"definition":"A piece of food of a size that would be produced by biting; a mouthful.","example":"There were only a few bites left on the plate."},{"definition":"Something unpleasant.","example":"That's really a bite!"},{"definition":"An act of plagiarism.","example":"That song is a bite of my song!"},{"definition":"A small meal or snack.","example":"I'll have a quick bite to quiet my stomach until dinner."},{"definition":"Aggression"},{"definition":"The hold which the short end of a lever has upon the thing to be lifted, or the hold which one part of a machine has upon another."},{"definition":"A cheat; a trick; a fraud."},{"definition":"A sharper; one who cheats."},{"definition":"A blank on the edge or corner of a page, owing to a portion of the frisket, or something else, intervening between the type and paper."},{"definition":"A cut, a proportion of profits; an amount of money."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut into something by clamping the teeth.","example":"As soon as you bite that sandwich, you'll know how good it is."},{"definition":"To hold something by clamping one's teeth."},{"definition":"To attack with the teeth.","example":"That dog is about to bite!"},{"definition":"To behave aggressively; to reject advances.","example":"If you see me, come and say hello. I don't bite."},{"definition":"To take hold; to establish firm contact with.","example":"I needed snow chains to make the tires bite."},{"definition":"To have significant effect, often negative.","example":"For homeowners with adjustable rate mortgages, rising interest will really bite."},{"definition":"(of a fish) To bite a baited hook or other lure and thus be caught.","example":"Are the fish biting today?"},{"definition":"To accept something offered, often secretly or deceptively, to cause some action by the acceptor.","example":"I've planted the story. Do you think they'll bite?"},{"definition":"(of an insect) To sting.","example":"These mosquitoes are really biting today!"},{"definition":"To cause a smarting sensation; to have a property which causes such a sensation; to be pungent.","example":"It bites like pepper or mustard."},{"definition":"(sometimes figurative) To cause sharp pain or damage to; to hurt or injure.","example":"Pepper bites the mouth."},{"definition":"To cause sharp pain; to produce anguish; to hurt or injure; to have the property of so doing."},{"definition":"To take or keep a firm hold.","example":"The anchor bites."},{"definition":"To take hold of; to hold fast; to adhere to.","example":"The anchor bites the ground."},{"definition":"To lack quality; to be worthy of derision; to suck.","example":"This music really bites."},{"definition":"To perform oral sex on. Used in invective.","example":"You don't like that I sat on your car? Bite me."},{"definition":"To plagiarize, to imitate.","example":"He always be biting my moves."},{"definition":"To deceive or defraud; to take in."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/baɪts/"}]},{"word":"PROSE","idx":13618,"count":3085898,"meanings":[{"definitions":[{"definition":"Language, particularly written language, not intended as poetry.","example":"Though known mostly for her prose, she also produced a small body of excellent poems."},{"definition":"Language which evinces little imagination or animation; dull and commonplace discourse."},{"definition":"A hymn with no regular meter, sometimes introduced into the Mass."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write or repeat in a dull, tedious, or prosy way."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prose-us","text":"/ˈpɹoʊz/"}]},{"word":"INCIDENTAL","idx":13620,"count":3084963,"meanings":[{"definitions":[{"definition":"Minor items, not further defined. Incidental expense.","example":"She's costing us a lot in incidentals."},{"definition":"Something that is incidental."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Loosely associated; existing as a byproduct, tangent, or accident; being a likely consequence.","example":"That character, though colorful, is incidental to the overall plot."},{"definition":"Occurring by chance"},{"definition":"(of radiation) Entering or approaching, prior to reflection (more frequently incident)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[ɪnsɪˈdɛ.ɾ̃əl]"}]},{"word":"ARGUING","idx":13622,"count":3084735,"meanings":[{"definitions":[{"definition":"To show grounds for concluding (that); to indicate, imply."},{"definition":"To debate, disagree or discuss opposing or differing viewpoints.","example":"He also argued for stronger methods to be used against China."},{"definition":"To have an argument, a quarrel."},{"definition":"To present (a viewpoint or an argument therefor).","example":"He argued his point."},{"definition":"To prove."},{"definition":"To accuse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Argument"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"arguing-uk","text":"/ˈɑː(ɹ).ɡju.ɪŋ/"}]},{"word":"VEIN","idx":13623,"count":3084240,"meanings":[{"definitions":[{"definition":"A blood vessel that transports blood from the capillaries back to the heart."},{"definition":"(in plural) The entrails of a shrimp."},{"definition":"In leaves, a thickened portion of the leaf containing the vascular bundle."},{"definition":"The nervure of an insect’s wing."},{"definition":"A stripe or streak of a different colour or composition in materials such as wood, cheese, marble or other rocks."},{"definition":"A topic of discussion; a train of association, thoughts, emotions, etc.","example":"in the same vein"},{"definition":"A style, tendency, or quality.","example":"The play is in a satirical vein."},{"definition":"A fissure, cleft or cavity, as in the earth or other substance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark with veins or a vein-like pattern."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vein-us","text":"/veɪn/"}]},{"word":"SCALABLE","idx":13624,"count":3084063,"meanings":[{"definitions":[{"definition":"Capable of being climbed."},{"definition":"Able to be changed in scale; resizeable."},{"definition":", (logistics), Able to greatly increase in capacity, with relative ease."}],"partOfSpeech":"j"}]},{"word":"HALE","idx":13625,"count":3083225,"meanings":[{"definitions":[{"definition":"Health, welfare."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Sound, entire, healthy; robust, not impaired."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To drag or pull, especially forcibly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hale-uk","text":"/heɪl/"}]},{"word":"SWEAR","idx":13627,"count":3082372,"meanings":[{"definitions":[{"definition":"To take an oath, to promise."},{"definition":"To use offensive, profane, or obscene language."},{"definition":"To be lazy; rest for a short while during working hours."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A swear word."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Heavy."},{"definition":"Top-heavy; too high."},{"definition":"Dull; heavy; lazy; slow; reluctant; unwilling."},{"definition":"Niggardly."},{"definition":"A lazy time; a short rest during working hours (especially field labour); a siesta."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"swear-us","text":"/swɛɚ/"}]},{"word":"BEL","idx":13629,"count":3081561,"meanings":[{"definitions":[{"definition":"A measure of relative power, defined as log10(P 1/P 2), where P1 and P2 are the measured and reference power respectively."},{"definition":"A tropical fruit tree from India, Aegle marmelos."},{"definition":"The fruit of the tree, also called the wood apple."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bel-us","text":"/bɛl/"}]},{"word":"CLOWN","idx":13630,"count":3081501,"meanings":[{"definitions":[{"definition":"A slapstick performance artist often associated with a circus and usually characterized by bright, oversized clothing, a red nose, face paint, and a brightly colored wig."},{"definition":"A person who acts in a silly fashion."},{"definition":"A stupid person."},{"definition":"A man of coarse nature and manners; an awkward fellow; an illbred person; a boor."},{"definition":"One who works upon the soil; a rustic; a churl; a yokel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act in a silly or playful fashion."},{"definition":"To ridicule."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"clown-uk","text":"/klaʊn/"}]},{"word":"SPONTANEOUS","idx":13631,"count":3080831,"meanings":[{"definitions":[{"definition":"Self-generated; happening without any apparent external cause.","example":"He made a spontaneous offer of help."},{"definition":"Done by one's own free choice, or without planning."},{"definition":"Proceeding from natural feeling or native tendency without external or conscious constraint"},{"definition":"Arising from a momentary impulse"},{"definition":"Controlled and directed internally; self-active; spontaneous movement characteristic of living things"},{"definition":"Produced without being planted or without human cultivation or labor."},{"definition":"Random."},{"definition":"Sudden, without warning."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"spontaneous-us","text":"/spɑnˈteɪ.ni.əs/"}]},{"word":"SUMMERS","idx":13632,"count":3080503,"meanings":[{"definitions":[{"definition":"One of four seasons, traditionally the second, marked by the longest and typically hottest days of the year due to the inclination of the Earth and thermal lag. Typically regarded as being from June 21 to September 22 or 23 in parts of the USA, the months of June, July and August in the United Kingdom and the months of December, January and February in the Southern Hemisphere.","example":"the heat of summer"},{"definition":"Year; used to give the age of a person, usually a young one.","example":"He was barely eighteen summers old."},{"definition":"Someone with light, pinkish skin that has a blue undertone, light hair and eyes, seen as best suited to certain colors of clothing."},{"definition":"A pack-horse."},{"definition":"A horizontal beam supporting a building."},{"definition":"A person who sums."},{"definition":"A machine or algorithm that sums."}],"partOfSpeech":"n"},{"definitions":[{"definition":"In the summer."}],"partOfSpeech":"v"}]},{"word":"TABOO","idx":13633,"count":3079923,"meanings":[{"definitions":[{"definition":"An inhibition or ban that results from social custom or emotional aversion."},{"definition":"(in Polynesia) Something which may not be used, approached or mentioned because it is sacred."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark as taboo."},{"definition":"To ban."},{"definition":"To avoid."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Excluded or forbidden from use, approach or mention."},{"definition":"Culturally forbidden."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/tæˈbuː/"}]},{"word":"EQUESTRIAN","idx":13634,"count":3079864,"meanings":[{"definitions":[{"definition":"An equestrian person; a horserider."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of horseback riding or horseback riders.","example":"After his death an equestrian statue was created."},{"definition":"Of or relating to the ancient Roman class of equites/equestrians"}],"partOfSpeech":"j"}]},{"word":"WETLAND","idx":13635,"count":3078212,"meanings":[{"definitions":[{"definition":"(usually in the plural) Land that is covered mostly with water, with occasional marshy and soggy areas."}],"partOfSpeech":"n"}]},{"word":"METHODOLOGIES","idx":13637,"count":3078109,"meanings":[{"definitions":[{"definition":"(originally science) The study of methods used in a field.","example":"research methodology"},{"definition":"A collection of methods, practices, procedures and rules used by those who work in some field.","example":"agile methodology"},{"definition":"The implementation of such methods etc."}],"partOfSpeech":"n"}]},{"word":"MALICIOUS","idx":13638,"count":3077492,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or as a result of malice or spite"},{"definition":"Spiteful and deliberately harmful","example":"He was sent off for a malicious tackle on Jones."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/məˈlɪʃəs/"}]},{"word":"CONSUME","idx":13639,"count":3077450,"meanings":[{"definitions":[{"definition":"To use up.","example":"The power plant consumes 30 tons of coal per hour."},{"definition":"To eat.","example":"Baby birds consume their own weight in food each day."},{"definition":"To completely occupy the thoughts or attention of.","example":"Desire consumed him."},{"definition":"To destroy completely.","example":"The building was consumed by fire."},{"definition":"To waste away slowly."},{"definition":"To trade money for good or services as an individual.","example":"If you consume this product while in Japan, you may be subject to consumption tax."},{"definition":"To absorb information, especially through the mass media.","example":"The Internet has changed the way we consume news."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"consume-us","text":"/kənˈsuːm/"},{"audio":"consume-uk","text":"/kənˈsjuːm/"}]},{"word":"AMAZED","idx":13640,"count":3077159,"meanings":[{"definitions":[{"definition":"To fill with wonder and surprise; to astonish, astound, surprise or perplex.","example":"He was amazed when he found that the girl was a robot."},{"definition":"To undergo amazement; to be astounded."},{"definition":"To stupefy; to knock unconscious."},{"definition":"To bewilder; to stupefy; to bring into a maze."},{"definition":"To terrify, to fill with panic."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Astonished; confounded with fear, surprise, or wonder; greatly surprised. The following adposition may be: at, with or by."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈmeɪzd/"}]},{"word":"FOURTEEN","idx":13641,"count":3076740,"meanings":[{"definitions":[{"definition":"The cardinal number occurring after thirteen and before fifteen, represented in Roman numerals as XIV and in Arabic numerals as 14."}],"partOfSpeech":"nu"}],"phonetics":[{"text":"/ˈfɔɹt.tin/"},{"audio":"fourteen-us"},{"text":"/ˈfɔː.tiːn/"}]},{"word":"LEGISLATORS","idx":13642,"count":3076549,"meanings":[{"definitions":[{"definition":"Someone who creates or enacts laws"}],"partOfSpeech":"n"}]},{"word":"VOLCANO","idx":13643,"count":3076134,"meanings":[{"definitions":[{"definition":"A vent or fissure on the surface of a planet (usually in a mountainous form) with a magma chamber attached to the mantle of a planet or moon, periodically erupting forth lava and volcanic gases onto the surface."},{"definition":"A form of firework."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"volcano-us","text":"/vɑlˈkeɪnoʊ/"}]},{"word":"CAPACITIES","idx":13644,"count":3076004,"meanings":[{"definitions":[{"definition":"The ability to hold, receive or absorb"},{"definition":"A measure of such ability; volume"},{"definition":"The maximum amount that can be held","example":"It was hauling a capacity load."},{"definition":"Capability; the ability to perform some task"},{"definition":"The maximum that can be produced."},{"definition":"Mental ability; the power to learn"},{"definition":"A faculty; the potential for growth and development"},{"definition":"A role; the position in which one functions"},{"definition":"Legal authority (to make an arrest for example)"},{"definition":"Electrical capacitance."},{"definition":"(operations) The maximum that can be produced on a machine or in a facility or group.","example":"Its capacity rating was 150 tons per hour, but its actual maximum capacity was 200 tons per hour."}],"partOfSpeech":"n"}]},{"word":"SKELETON","idx":13646,"count":3075011,"meanings":[{"definitions":[{"definition":"The system that provides support to an organism, internal and made up of bones and cartilage in vertebrates, external in some other animals."},{"definition":"An anthropomorphic representation of a skeleton.","example":"She dressed up as a skeleton for Halloween."},{"definition":"A very thin person.","example":"She lost so much weight while she was ill that she became a skeleton."},{"definition":"The central core of something that gives shape to the entire structure.","example":"The skeleton of the organisation is essentially the same as it was ten years ago, but many new faces have come and gone."},{"definition":"A frame that provides support to a building or other construction."},{"definition":"A client-helper procedure that communicates with a stub.","example":"In remote method invocation, the client helper is a ‘stub’ and the service helper is a ‘skeleton’."},{"definition":"The vertices and edges of a polyhedron, taken collectively."},{"definition":"A very thin form of light-faced type."},{"definition":"(attributive) Reduced to a minimum or bare essentials."},{"definition":"A type of tobogganing in which competitors lie face down, and descend head first."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reduce to a skeleton; to skin; to skeletonize"},{"definition":"To minimize"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"skeleton-us","text":"/ˈskɛlətən/"}]},{"word":"SOMEDAY","idx":13647,"count":3074927,"meanings":[{"definitions":[{"definition":"Sometime; at some unspecified time in the future."}],"partOfSpeech":"v"}]},{"word":"TSP","idx":13648,"count":3074410,"meanings":[{"definitions":[{"definition":"A small spoon used to stir the contents of a cup or glass."},{"definition":"A unit of measure, equivalent to one-third of a tablespoon or roughly five milliliters."}],"partOfSpeech":"n"}]},{"word":"SUSPECTS","idx":13650,"count":3073379,"meanings":[{"definitions":[{"definition":"A person who is suspected of something, in particular of committing a crime."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To imagine or suppose (something) to be true, or to exist, without proof.","example":"to suspect the presence of disease"},{"definition":"To distrust or have doubts about (something or someone).","example":"to suspect the truth of a story"},{"definition":"To believe (someone) to be guilty.","example":"I suspect him of being the thief."},{"definition":"To have suspicion."},{"definition":"To look up to; to respect."}],"partOfSpeech":"ve"}]},{"word":"DISPLACED","idx":13651,"count":3072839,"meanings":[{"definitions":[{"definition":"To put out of place; to disarrange."},{"definition":"To move something, or someone, especially to forcibly move people from their homeland."},{"definition":"To supplant, or take the place of something or someone; to substitute."},{"definition":"To replace, on account of being superior to or more suitable than that which is being replaced.","example":"Electronic calculators soon displaced the older mechanical kind."},{"definition":"(of a floating ship) To have a weight equal to that of the water displaced."},{"definition":"To repress"}],"partOfSpeech":"ve"}]},{"word":"SOUNDED","idx":13652,"count":3072513,"meanings":[{"definitions":[{"definition":"To produce a sound.","example":"When the horn sounds, take cover."},{"definition":"To convey an impression by one's sound.","example":"He sounded good when we last spoke."},{"definition":"To be conveyed in sound; to be spread or published; to convey intelligence by sound."},{"definition":"To resound."},{"definition":"(often with in) To arise or to be recognizable as arising in or from a particular area of law."},{"definition":"To cause to produce a sound.","example":"He sounds the instrument."},{"definition":"(of a vowel or consonant) To pronounce.","example":"The \"e\" in \"house\" isn't sounded."},{"definition":"Dive downwards, used of a whale.","example":"The whale sounded and eight hundred feet of heavy line streaked out of the line tub before he ended his dive."},{"definition":"To ascertain, or try to ascertain, the thoughts, motives, and purposes of (a person); to examine; to try; to test; to probe.","example":"When I sounded him, he appeared to favor the proposed deal."},{"definition":"Test; ascertain the depth of water with a sounding line or other device.","example":"Mariners on sailing ships would sound the depth of the water with a weighted rope."},{"definition":"To examine with the instrument called a sound or sonde, or by auscultation or percussion.","example":"to sound a patient, or the bladder or urethra"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sounded-us","text":"/ˈsaʊndɪd/"}]},{"word":"EXPORTER","idx":13653,"count":3072252,"meanings":[{"definitions":[{"definition":"One who, or that which, exports: especially a person who or organization that exports or sells goods made in one country for delivery in another country.","example":"India is the leading exporter of guar gum, making up nearly 85 per cent of the global production."}],"partOfSpeech":"n"}]},{"word":"HONESTY","idx":13654,"count":3072193,"meanings":[{"definitions":[{"definition":"The act, quality, or condition of being honest.","example":"academic / artistic / emotional / intellectual honesty"},{"definition":"Honor; decency, propriety."},{"definition":"Chastity."},{"definition":"Any of various crucifers in the genus Lunaria, several of which are grown as ornamentals, particularly Lunaria annua."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"honesty-us","text":"/ˈɑːnəsti/"}]},{"word":"DWARF","idx":13655,"count":3072068,"meanings":[{"definitions":[{"definition":"Any member of a race of beings from (especially Scandinavian and other Germanic) folklore, usually depicted as having some sort of supernatural powers and being skilled in crafting and metalworking, often as short with long beards, and sometimes as clashing with elves."},{"definition":"A person of short stature, often one whose limbs are disproportionately small in relation to the body as compared with normal adults, usually as the result of a genetic condition."},{"definition":"An animal, plant or other thing much smaller than the usual of its sort.","example":"dwarf honeysuckle"},{"definition":"A star of relatively small size."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To render (much) smaller, turn into a dwarf (version)."},{"definition":"To make appear (much) smaller, puny, tiny.","example":"The newly-built skyscraper dwarfs all older buildings in the downtown skyline."},{"definition":"To make appear insignificant.","example":"Bach dwarfs all other composers."},{"definition":"To become (much) smaller."},{"definition":"To hinder from growing to the natural size; to make or keep small; to stunt."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Miniature.","example":"It is possible to grow the plants as dwarf as one desires."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dwarf-us","text":"/dwɔɹf/"}]},{"word":"HUM","idx":13657,"count":3070763,"meanings":[{"definitions":[{"definition":"Indicating thinking or pondering.","example":"Hmm... I just can't decide between the two."},{"definition":"A demand for an answer to a question.","example":"Just where were you until 2 a.m.? Hmm?"},{"definition":"An expression used to show contentment for something","example":"Mmm, this is a tasty pie!"},{"definition":"An expression used to show thought or reflection","example":"Mmm, I see what you mean."},{"definition":"An expression used to show being muffled or not able to speak clearly, as well as \"mmph\"."},{"definition":"Yes."},{"definition":"Expression of hesitation, uncertainty or space filler in conversation. See uh.","example":"Let’s see... um... how about this?"}],"partOfSpeech":"i"},{"definitions":[{"definition":"A hummed tune, i.e. created orally with lips closed."},{"definition":"An often indistinct sound resembling human humming.","example":"They could hear a hum coming from the kitchen, and found the dishwasher on."},{"definition":"Busy activity, like the buzz of a beehive."},{"definition":"Unpleasant odour."},{"definition":"An imposition or hoax; humbug."},{"definition":"A kind of strong drink."},{"definition":"A phenomenon, or collection of phenomena, involving widespread reports of a persistent and invasive low-frequency humming, rumbling, or droning noise not audible to all people."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a sound from the vocal chords without pronouncing any real words, with one's lips closed.","example":"We are humming happily along with the music."},{"definition":"To express by humming.","example":"The team ominously hummed “We shall overcome” as they came back onto the field after the break."},{"definition":"To drone like certain insects naturally do in motion, or sounding similarly"},{"definition":"To buzz, be busily active like a beehive","example":"The streets were humming with activity."},{"definition":"To produce low sounds which blend continuously"},{"definition":"To reek, smell bad.","example":"This room really hums — have you ever tried spring cleaning, mate?"},{"definition":"To flatter by approving; to cajole; to deceive or impose upon; to humbug."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hum-us","text":"/ˈhʌm/"}]},{"word":"BIS","idx":13658,"count":3068458,"meanings":[{"definitions":[{"definition":"A bisexual person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Twice; showing that something is, or is to be, repeated, such as a passage of music, or an item in accounts."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/baɪz/"}]},{"word":"NORTHEASTERN","idx":13659,"count":3068125,"meanings":[{"definitions":[{"definition":"Of, related to, located in, or from the northeast."}],"partOfSpeech":"j"}]},{"word":"SHOCKS","idx":13661,"count":3067296,"meanings":[{"definitions":[{"definition":"A sudden, heavy impact.","example":"The train hit the buffers with a great shock."},{"definition":"A discontinuity arising in the solution of a partial differential equation."},{"definition":"An arrangement of sheaves for drying; a stook."},{"definition":"A lot consisting of sixty pieces; a term applied in some Baltic ports to loose goods."},{"definition":"(by extension) A tuft or bunch of something, such as hair or grass.","example":"His head boasted a shock of sandy hair."},{"definition":"A small dog with long shaggy hair, especially a poodle or spitz; a shaggy lapdog."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to be emotionally shocked, to cause (someone) to feel surprised and upset.","example":"The disaster shocked the world."},{"definition":"To give an electric shock to."},{"definition":"To meet with a shock; to collide in a violent encounter."},{"definition":"To collect, or make up, into a shock or shocks; to stook.","example":"to shock rye"}],"partOfSpeech":"ve"}]},{"word":"REWARDING","idx":13662,"count":3066813,"meanings":[{"definitions":[{"definition":"To give a reward to or for.","example":"Why are you rewarding that bad behaviour?"},{"definition":"To recompense.","example":"Decorations are meant to reward the most meritous acts and services."},{"definition":"To give (something) as a reward."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Giving or resulting in reward or satisfaction."}],"partOfSpeech":"j"}]},{"word":"KILLERS","idx":13663,"count":3066658,"meanings":[{"definitions":[{"definition":"One who or that which kills.","example":"Carbon monoxide is a silent killer."},{"definition":"That which causes stress or is extremely difficult, especially that which may cause failure at a task.","example":"That test was a killer."},{"definition":"Something that is so far ahead of its competition that it effectively kills off that competition.","example":"Digital streaming platforms are CD killers."},{"definition":"A knockout form of darts or pool involving several players."},{"definition":"A club used for killing fish."},{"definition":"A particularly heavy type of handstamp, or portion of one, often obscuring a large part of the postage stamp."},{"definition":"A diacritical mark used in Indic scripts to suppress an inherent vowel (e.g., the Hindi viram, the Bengali or Oriya hasanta) or render the entire syllable silent (e.g., the Burmese virama, the Khmer toandakhiat)."},{"definition":"A sea mammal related to dolphins and porpoises (Orcinus orca)."}],"partOfSpeech":"n"}]},{"word":"BATTALION","idx":13664,"count":3066598,"meanings":[{"definitions":[{"definition":"An army unit having two or more companies, etc. and a headquarters. Traditionally forming part of a regiment."},{"definition":"An army unit having two or more companies, etc. and a headquarters; forming part of a brigade."},{"definition":"Any large body of troops."},{"definition":"(by extension) A great number of things."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into battalions."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bəˈtælɪən/"}]},{"word":"MULTICULTURAL","idx":13665,"count":3066342,"meanings":[{"definitions":[{"definition":"Relating or pertaining to several different cultures.","example":"31.X.2001 Viewed from the boardrooms of Britain, the market is becoming more multicultural than could have been imagined just five years ago. - The Guardian (2001)"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"multicultural","text":"/ˌmʌltiˈkʌltʃəɹəl/"}]},{"word":"LASERS","idx":13666,"count":3066286,"meanings":[{"definitions":[{"definition":"A device that produces a monochromatic, coherent beam of light."},{"definition":"A beam of light produced by such a device; a laser beam."},{"definition":"A laser printer."},{"definition":"A gum resin obtained from certain umbelliferous plants."},{"definition":"Such a plant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut with a laser"},{"definition":"To throw with laser-like precision"}],"partOfSpeech":"ve"}]},{"word":"CANDID","idx":13667,"count":3066199,"meanings":[{"definitions":[{"definition":"A spontaneous or unposed photograph.","example":"His portraits looked stiff and formal but his candids showed life being lived."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Impartial and free from prejudice."},{"definition":"Straightforward, open and sincere."},{"definition":"Not posed or rehearsed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"candid-us","text":"/ˈkæn.dɪd/"}]},{"word":"SCHOOLING","idx":13668,"count":3065877,"meanings":[{"definitions":[{"definition":"(of fish) To form into, or travel in a school."},{"definition":"To educate, teach, or train (often, but not necessarily, in a school).","example":"Many future prime ministers were schooled in Eton."},{"definition":"To defeat emphatically, to teach an opponent a harsh lesson."},{"definition":"To control, or compose, one's expression.","example":"She took care to school her expression, not giving away any of her feelings."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Training or instruction."},{"definition":"Institutional education; attendance of school.","example":"I never let my schooling interfere with my education."},{"definition":"The training of a horse at dressage."},{"definition":"Discipline; reproof; reprimand.","example":"He gave his son a good schooling."},{"definition":"Compensation for instruction; price or reward paid to an instructor for teaching pupils."}],"partOfSpeech":"n"}]},{"word":"DATASET","idx":13669,"count":3064674,"meanings":[{"definitions":[{"definition":"A file of related records on a computer-readable medium such as disk, especially one on a mainframe computer; a dataset."},{"definition":"A modem (that connects a device such as a teletype to an ordinary telephone)."},{"definition":"A set of data to be analyzed."}],"partOfSpeech":"n"}]},{"word":"SCHOOLGIRL","idx":13671,"count":3063313,"meanings":[{"definitions":[{"definition":"A girl attending school."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To restrain in a schoolgirl pin."}],"partOfSpeech":"ve"}]},{"word":"CAESAR","idx":13672,"count":3063233,"meanings":[{"definitions":[{"definition":"Emperor, ruler, dictator"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsizɚ/"},{"text":"/ˈsiːzə/"}]},{"word":"SAVERS","idx":13673,"count":3063213,"meanings":[{"definitions":[{"definition":"One who saves.","example":"a saver of souls"},{"definition":"One who keeps savings more than usual.","example":"He's a saver and she's a spender; you think the marriage would be doomed but he keeps them from going into bankruptcy and she makes sure they have a lot of fun."}],"partOfSpeech":"n"}]},{"word":"PINES","idx":13675,"count":3062800,"meanings":[{"definitions":[{"definition":"Any coniferous tree of the genus Pinus.","example":"The northern slopes were covered mainly in pine."},{"definition":"Any tree (usually coniferous) which resembles a member of this genus in some respect."},{"definition":"The wood of this tree."},{"definition":"(obsolete except South Africa) A pineapple."},{"definition":"A painful longing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To languish; to lose flesh or wear away through distress."},{"definition":"To long, to yearn so much that it causes suffering.","example":"Laura was pining for Bill all the time he was gone."},{"definition":"To grieve or mourn for."},{"definition":"To inflict pain upon; to torment."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pines-us","text":"/paɪnz/"}]},{"word":"STELLAR","idx":13677,"count":3062189,"meanings":[{"definitions":[{"definition":"(notcomp) Of, pertaining to, or characteristic of stars."},{"definition":"Heavenly."},{"definition":"(by extension) Exceptional.","example":"The actress gave a stellar performance."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈstɛlɚ/"},{"text":"/ˈstɛlə/"}]},{"word":"DAVENPORT","idx":13678,"count":3061454,"meanings":[{"definitions":[{"definition":"A large sofa, especially a formal one."},{"definition":"A writing desk."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdævənpɔːt/"}]},{"word":"LOCATING","idx":13679,"count":3061095,"meanings":[{"definitions":[{"definition":"To place; to set in a particular spot or position."},{"definition":"To find out where something is located."},{"definition":"To designate the site or place of; to define the limits of (Note: the designation may be purely descriptive: it need not be prescriptive.)","example":"The council must locate the new hospital"},{"definition":"To place oneself; to take up one's residence; to settle."}],"partOfSpeech":"ve"}]},{"word":"MONOGRAM","idx":13680,"count":3060555,"meanings":[{"definitions":[{"definition":"A picture drawn in line only, before the colour and/or shading is applied; an outline sketch."},{"definition":"A sentence consisting of only one line, or an epigram consisting of only one verse, of poetry."},{"definition":"A design composed of one or more letters, often intertwined, used as an identifying mark of an individual or institution."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark something with a monogram."}],"partOfSpeech":"ve"}]},{"word":"ENHANCES","idx":13682,"count":3059890,"meanings":[{"definitions":[{"definition":"To lift, raise up."},{"definition":"To augment or make something greater."},{"definition":"To improve something by adding features."},{"definition":"To be raised up; to grow larger.","example":"A debt enhances rapidly by compound interest."},{"definition":"(radiology) To take up contrast agent (for an organ, tissue, or lesion)."}],"partOfSpeech":"ve"}]},{"word":"FUCKS","idx":13684,"count":3058134,"meanings":[{"definitions":[{"definition":"An act of sexual intercourse."},{"definition":"A sexual partner, especially a casual one."},{"definition":"A highly contemptible person."},{"definition":"A thing of no value, a small amount.","example":"I don't give a fuck."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have sexual intercourse, to copulate.","example":"Fighting for peace is like fucking for virginity."},{"definition":"To have sexual intercourse with."},{"definition":"To insert one’s penis, a dildo or other phallic object, into a specified orifice or cleft."},{"definition":"To put in an extremely difficult or impossible situation.","example":"I'm afraid they're gonna fuck you on this one."},{"definition":"To defraud, deface or otherwise treat badly.","example":"I got fucked at the used car lot."},{"definition":"Used to express great displeasure with someone or something.","example":"Fuck those jerks, and fuck their stupid rules!"},{"definition":"(usually followed by up) To break, to destroy."},{"definition":"To make a joke at one's expense; to make fun of in an embarrassing manner."},{"definition":"To throw, to lob something. (angrily)","example":"He fucked the dirty cloth out the window."},{"definition":"To scold","example":"The sergeant fucked me upside down."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fʌks/"}]},{"word":"RELATIONAL","idx":13685,"count":3057616,"meanings":[{"definitions":[{"definition":"Relating to relations."},{"definition":"Friendly and peaceful."},{"definition":"Of a database technology using tables and the principles set forth by Dr. Edgar F. Codd. (Contrary to popular notion, \"relation\" in this context refers to tables, and not linkages.)"},{"definition":"(aesthetics) Dealing with the whole of human relations and their social context, rather than an independent and private space."}],"partOfSpeech":"j"}]},{"word":"ORNAMENT","idx":13686,"count":3057576,"meanings":[{"definitions":[{"definition":"An element of decoration; that which embellishes or adorns."},{"definition":"A Christmas tree decoration."},{"definition":"A musical flourish that is unnecessary to the overall melodic or harmonic line, but serves to decorate or \"ornament\" that line."},{"definition":"(in the plural) The articles used in church services."},{"definition":"A characteristic that has a decorative function (typically in order to attract a mate)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate.","example":"We will ornament the windows with trim to make the room seem brighter."},{"definition":"To add to.","example":"The editor ornamented his plain writing, making it fancier but less clear."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ornament-us-noun","text":"/ˈɔɹnəmənt/"}]},{"word":"GRAFFITI","idx":13687,"count":3056453,"meanings":[{"definitions":[{"definition":"Drawings or words drawn on a surface in a public place, usually made without authorization."},{"definition":"Informal inscriptions, figure drawings, etc., as opposed to official inscriptions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark a surface with such images."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɹəˈfiti/"},{"text":"/ɡɹəˈfiːti/"}]},{"word":"CASSETTES","idx":13688,"count":3055743,"meanings":[{"definitions":[{"definition":"A small flat case containing magnetic tape on two reels, used to record and play back audio and video material."},{"definition":"Any similar small cartridge, such as for a computer disk or cassette air conditioner"},{"definition":"A lightproof container for photographic film."},{"definition":"A modular DNA sequence encoding one or more genes for a single biochemical function."},{"definition":"A set of sprockets mounted onto a splined shaft on the freehub."},{"definition":"A saggar (ceramic container used in a kiln)"}],"partOfSpeech":"n"}]},{"word":"PUSSIES","idx":13689,"count":3055728,"meanings":[{"definitions":[{"definition":"A cat."},{"definition":"An affectionate term for a woman or girl, seen as having characteristics associated with cats such as sweetness."},{"definition":"The female genitalia; the vulva and/or vagina.","example":"You have a lovely pussy!"},{"definition":"Anything soft and furry; a bloom form, or catkin, as on the pussy willow."},{"definition":"(normally in the phrase \"to get some pussy\") Sexual intercourse with a woman.","example":"I’m gonna get me some pussy tonight."},{"definition":"A coward; a weakling; an ineffectual, timid, or pathetic person.","example":"You're such a pussy!"},{"definition":"A game of tip-cat."}],"partOfSpeech":"n"}]},{"word":"URGES","idx":13690,"count":3054809,"meanings":[{"definitions":[{"definition":"A strong desire; an itch to do something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press; to push; to drive; to impel; to force onward."},{"definition":"To press the mind or will of; to ply with motives, arguments, persuasion, or importunity."},{"definition":"To provoke; to exasperate."},{"definition":"To press hard upon; to follow closely."},{"definition":"To present in an urgent manner; to insist upon.","example":"to urge an argument; to urge the necessity of a case"},{"definition":"To treat with forcible means; to take severe or violent measures with.","example":"to urge an ore with intense heat"},{"definition":"To press onward or forward."},{"definition":"To be pressing in argument; to insist; to persist."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"urges-uk"}]},{"word":"TIFF","idx":13693,"count":3054216,"meanings":[{"definitions":[{"definition":"A small argument; a petty quarrel."},{"definition":"Liquor; especially, a small draught of liquor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To quarrel."},{"definition":"To deck out; to dress."},{"definition":"(British India) To have lunch."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɪf/"}]},{"word":"REFRIGERATION","idx":13695,"count":3053488,"meanings":[{"definitions":[{"definition":"The process of transferring heat from an object in order to cool it."},{"definition":"The process of preserving something by cooling."},{"definition":"The cooling of the body for therapeutic purposes."}],"partOfSpeech":"n"}]},{"word":"ATTACKING","idx":13696,"count":3052252,"meanings":[{"definitions":[{"definition":"To apply violent force to someone or something.","example":"This species of snake will only attack humans if it feels threatened."},{"definition":"To aggressively challenge a person, idea, etc., with words (particularly in newspaper headlines, because it typesets into less space than \"criticize\" or similar).","example":"She published an article attacking the recent pay cuts."},{"definition":"To begin to affect; to act upon injuriously or destructively; to begin to decompose or waste."},{"definition":"To deal with something in a direct way; to set to work upon.","example":"I attacked the meal with a hearty appetite."},{"definition":"To aim balls at the batsman’s wicket."},{"definition":"To set a field, or bowl in a manner designed to get wickets."},{"definition":"To bat aggressively, so as to score runs quickly."},{"definition":"To move forward in an active attempt to score a point, as opposed to trying not to concede."},{"definition":"To accelerate quickly in an attempt to get ahead of the other riders."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Carrying out an attack."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈtækɪŋ/"}]},{"word":"MICROSCOPE","idx":13697,"count":3052163,"meanings":[{"definitions":[{"definition":"An optical instrument used for observing small objects."},{"definition":"Any instrument for imaging very small objects (such as an electron microscope)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To examine with a microscope, to put under a microscope (literally or figuratively)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmaɪkɹəˌskoʊp/"},{"text":"/ˈmaɪkɹəˌskəʊp/"}]},{"word":"COUNTDOWN","idx":13699,"count":3050522,"meanings":[{"definitions":[{"definition":"A count backward in fixed units to the time of some event, especially the launch of a space vehicle."},{"definition":"The acts of preparation carried out during this period."},{"definition":"A radio or television program counting down the top songs of a given week, usually in reverse order ending with the No. 1."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To count down."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkaʊntˌdaʊn/"}]},{"word":"THREATEN","idx":13700,"count":3050485,"meanings":[{"definitions":[{"definition":"To make a threat against someone; to use threats.","example":"He threatened me with a knife."},{"definition":"To menace, or be dangerous.","example":"The rocks threatened the ship's survival."},{"definition":"To portend, or give a warning of.","example":"The black clouds threatened heavy rain."},{"definition":"To be close to equaling or surpassing (a record, etc.)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"threaten-us","text":"/ˈθɹɛt.n̩/"}]},{"word":"DECKER","idx":13701,"count":3050142,"meanings":[{"definitions":[{"definition":"One who, or that which, decks or adorns; a coverer.","example":"a table decker"},{"definition":"(used in conjunction with a number) Something having numerous levels.","example":"We traveled in a double-decker bus."}],"partOfSpeech":"n"}]},{"word":"BAIT","idx":13703,"count":3049271,"meanings":[{"definitions":[{"definition":"Any substance, especially food, used in catching fish, or other animals, by alluring them to a hook, snare, trap, or net."},{"definition":"Food containing poison or a harmful additive to kill animals that are pests."},{"definition":"Anything which allures; something used to lure or entice someone or something into doing something"},{"definition":"A portion of food or drink, as a refreshment taken on a journey; also, a stop for rest and refreshment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attract with bait; to entice."},{"definition":"To affix bait to a trap or a fishing hook or fishing line."},{"definition":"To set dogs on (an animal etc.) to bite or worry; to attack with dogs, especially for sport.","example":"to bait a bear with dogs;  to bait a bull"},{"definition":"To intentionally annoy, torment, or threaten by constant rebukes or threats; to harass."},{"definition":"To feed and water (a horse or other animal), especially during a journey."},{"definition":"(of a horse or other animal) To take food, especially during a journey."},{"definition":"(of a person) To stop to take a portion of food and drink for refreshment during a journey."},{"definition":"To flap the wings; to flutter as if to fly; or to hover, as a hawk when she stoops to her prey."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Obvious; blatant."},{"definition":"Well-known; famous; renowned."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bait-us","text":"/beɪt/"}]},{"word":"EXTERN","idx":13704,"count":3048776,"meanings":[{"definitions":[{"definition":"A person affiliated with an institution in a lesser capacity, for example, as a non-resident or as a part-time affiliate."},{"definition":"Outward form or part; exterior."},{"definition":"In the C and C++ programming languages, a variable that can be separately declared in many places, all of them referring to the same variable."}],"partOfSpeech":"n"},{"definitions":[{"definition":"External; outward; not inherent"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɛk.ˌstɜː(ɹ)n/"}]},{"word":"BADGES","idx":13705,"count":3048651,"meanings":[{"definitions":[{"definition":"A distinctive mark, token, sign, emblem or cognizance, worn on one's clothing, as an insignia of some rank, or of the membership of an organization.","example":"the badge of a society; the badge of a policeman"},{"definition":"A small nameplate, identifying the wearer, and often giving additional information."},{"definition":"A card, sometimes with a barcode or magnetic strip, granting access to a certain area."},{"definition":"Something characteristic; a mark; a token."},{"definition":"(thieves' cant) A brand on the hand of a thief, etc.","example":"He has got his badge, and piked: He was burned in the hand, and is at liberty."},{"definition":"A carved ornament on the stern of a vessel, containing a window or the representation of one."},{"definition":"A distinctive mark worn by servants, retainers, and followers of royalty or nobility, who, being beneath the rank of gentlemen, have no right to armorial bearings."},{"definition":"A small overlay on an icon that shows additional information about that item, such as the number of new alerts or messages."},{"definition":"An icon or emblem awarded to a user for some achievement.","example":"When you have checked in to the site from ten different cities, you unlock the Traveller badge."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark or distinguish with a badge.","example":"The television was badged as 'GE', but wasn't made by them."},{"definition":"To show a badge to.","example":"He calmed down a lot when the policeman badged him."},{"definition":"To enter a restricted area by showing one's badge."}],"partOfSpeech":"ve"}]},{"word":"KITTEN","idx":13707,"count":3048546,"meanings":[{"definitions":[{"definition":"A young cat, especially before sexual maturity (reached at about seven months)."},{"definition":"A young rabbit, rat, hedgehog, squirrel, fox, beaver, badger, etc."},{"definition":"A moth of the genus Furcula."},{"definition":"A term of endearment, especially for a woman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give birth to kittens."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"kitten-us","text":"[ˈkɪ.ʔn̩]"},{"audio":"kitten-uk","text":"/ˈkɪtən/"}]},{"word":"CODEC","idx":13708,"count":3048388,"meanings":[{"definitions":[{"definition":"A device or program capable of performing transformations on a data stream or signal.","example":"Audio and video codecs are important in making multimedia files small enough to distribute and simple to play back."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"codec-uk"}]},{"word":"BROADCASTS","idx":13709,"count":3047788,"meanings":[{"definitions":[{"definition":"A transmission of a radio or television programme intended to be received by anyone with a receiver."},{"definition":"A programme (bulletin, documentary, show, etc.) so transmitted.","example":"The DJ was feeling nervous before his first national broadcast."},{"definition":"The act of scattering seed; a crop grown from such seed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transmit a message or signal through radio waves or electronic means."},{"definition":"To transmit a message over a wide area; specifically, to send an email in a single transmission to a (typically large) number of people."},{"definition":"To appear as a performer, presenter, or speaker in a broadcast programme."},{"definition":"To sow seeds over a wide area."}],"partOfSpeech":"ve"}]},{"word":"BRIDES","idx":13710,"count":3047745,"meanings":[{"definitions":[{"definition":"A woman in the context of her own wedding; one who is going to marry or has just been married."},{"definition":"An object ardently loved."},{"definition":"An individual loop or other device connecting the patterns in lacework"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a bride of"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bɹaɪdz/"}]},{"word":"DENT","idx":13711,"count":3046809,"meanings":[{"definitions":[{"definition":"A shallow deformation in the surface of an object, produced by an impact.","example":"The crash produced a dent in the left side of the car."},{"definition":"A type of maize/corn with a relatively soft outer hull, and a soft type of starch that shrinks at maturity to leave an indentation in the surface of the kernel."},{"definition":"(by extension) A sudden negative change, such as loss, damage, weakening, consumption or diminution, especially one produced by an external force, event or action","example":"That purchase put a bit of a dent in my wallet."},{"definition":"A tooth, as of a card, a gear wheel, etc."},{"definition":"A slot or a wire in a reed"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To impact something, producing a dent."},{"definition":"To develop a dent or dents.","example":"Copper is soft and dents easily."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dent-uk","text":"/dɛnt/"}]},{"word":"CHECKSUM","idx":13712,"count":3046204,"meanings":[{"definitions":[{"definition":"A number, derived by applying a suitable algorithm to some data, used to check whether errors have occurred in transmission, storage or data entry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To compute a checksum."}],"partOfSpeech":"ve"}]},{"word":"STEALING","idx":13713,"count":3046130,"meanings":[{"definitions":[{"definition":"To take illegally, or without the owner's permission, something owned by someone else.","example":"Three irreplaceable paintings were stolen from the gallery."},{"definition":"(of ideas, words, music, a look, credit, etc.) To appropriate without giving credit or acknowledgement.","example":"They stole my idea for a biodegradable, disposable garbage de-odorizer."},{"definition":"To get or effect surreptitiously or artfully.","example":"He stole glances at the pretty woman across the street."},{"definition":"To acquire at a low price.","example":"He stole the car for two thousand less than its book value."},{"definition":"To draw attention unexpectedly in (an entertainment), especially by being the outstanding performer. Usually used in the phrase steal the show."},{"definition":"To move silently or secretly.","example":"He stole across the room, trying not to wake her."},{"definition":"To convey (something) clandestinely."},{"definition":"To withdraw or convey (oneself) clandestinely."},{"definition":"To advance safely to (another base) during the delivery of a pitch, without the aid of a hit, walk, passed ball, wild pitch, or defensive indifference."},{"definition":"To dispossess"},{"definition":"To borrow for a short moment.","example":"Can I steal your pen?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to steal, theft."},{"definition":"(chiefly in the plural) That which is stolen; stolen property."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"stealing-us","text":"/ˈstiːlɪŋ/"}]},{"word":"BULLETS","idx":13714,"count":3045974,"meanings":[{"definitions":[{"definition":"A projectile, usually of metal, shot from a gun at high speed."},{"definition":"An entire round of unfired ammunition for a firearm, including the projectile, the cartridge casing, the propellant charge, etc."},{"definition":"Ammunition for a sling or slingshot which has been manufactured for such use."},{"definition":"A printed symbol in the form of a solid circle, (•), often used in lieu of numbers for marking items in a list. (see also bulleted)"},{"definition":"A large scheduled repayment of the principal of a loan; a balloon payment."},{"definition":"A rejection letter, as for employment, admission to a school or a competition.","example":"John's not going to any of his top schools; he got a bullet from the last of them yesterday."},{"definition":"One year of prison time"},{"definition":"An ace (the playing card)."},{"definition":"Anything that is projected extremely fast."},{"definition":"(in attributive use) Very fast (speedy).","example":"bullet chess"},{"definition":"A plumb or sinker."},{"definition":"(particularly in Northern Ireland) The heavy projectile thrown in a game of road bowling."},{"definition":"A roughly bullet-shaped sweet consisting of a cylinder of liquorice covered in chocolate."},{"definition":"A small ball."},{"definition":"A cannonball."},{"definition":"The fetlock of a horse."},{"definition":"A young or little bull; a male calf."},{"definition":"A pair of aces as a starting hand in Texas hold 'em"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To draw attention to (text) by, or as if by, placing a graphic bullet in front of it."},{"definition":"To speed, like a bullet.","example":"Their debut started slow, but bulleted to number six in its fourth week."},{"definition":"To make a shot, especially with great speed.","example":"He bulleted a header for his first score of the season."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bullets-us","text":"/ˈbʊl.ɪts/"}]},{"word":"EMPHASIZED","idx":13715,"count":3045963,"meanings":[{"definitions":[{"definition":"To stress, give emphasis or extra weight to (something).","example":"His two-fingered gesture emphasized what he had told his boss to do with his job."}],"partOfSpeech":"ve"}]},{"word":"GLOSSY","idx":13716,"count":3045309,"meanings":[{"definitions":[{"definition":"A glossy magazine.","example":"The supermarket glossies are full of celebrity gossip and fad diets."},{"definition":"A glossy photograph."},{"definition":"A film depicting people with glamorous lifestyles."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a smooth, silk-like, reflective surface."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"glossy-us"}]},{"word":"INFORMATIONS","idx":13717,"count":3044128,"meanings":[{"definitions":[{"definition":"That which resolves uncertainty; anything that answers the question of \"what a given entity is\"."},{"definition":"Things that are or can be known about a given topic; communicable knowledge of something.","example":"I need some more information about this issue."},{"definition":"The act of informing or imparting knowledge; notification.","example":"For your information, I did this because I wanted to."},{"definition":"A statement of criminal activity brought before a judge or magistrate; in the UK, used to inform a magistrate of an offence and request a warrant; in the US, an accusation brought before a judge without a grand jury indictment."},{"definition":"The act of informing against someone, passing on incriminating knowledge; accusation."},{"definition":"The systematic imparting of knowledge; education, training."},{"definition":"The creation of form; the imparting of a given quality or characteristic; forming, animation."},{"definition":"[…] the meaning that a human assigns to data by means of the known conventions used in its representation."},{"definition":"Divine inspiration."},{"definition":"A service provided by telephone which provides listed telephone numbers of a subscriber."},{"definition":"Any unambiguous abstract data, the smallest possible unit being the bit."},{"definition":"As contrasted with data, information is processed to extract relevant data."},{"definition":"(information technology) Any ordered sequence of symbols (or signals) (that could contain a message)."}],"partOfSpeech":"n"}]},{"word":"HAIRED","idx":13718,"count":3043626,"meanings":[{"definitions":[{"definition":"To remove the hair from."},{"definition":"To grow hair (where there was a bald spot)."},{"definition":"To cause to have hair; to provide with hair"},{"definition":"To string the bow for a violin."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having hair; not bald or hairless."},{"definition":"(in combination) Having some specific type of hair.","example":"She was a raven-haired beauty."}],"partOfSpeech":"j"}]},{"word":"DIRECTIONAL","idx":13719,"count":3043168,"meanings":[{"definitions":[{"definition":"Something that indicates direction, such as a vehicle's turn signal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Indicating direction."},{"definition":"Of or relating to guidance or help."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈɹɛkʃənəl/"}]},{"word":"BREEDERS","idx":13720,"count":3042337,"meanings":[{"definitions":[{"definition":"A person who breeds plants or animals (professionally)."},{"definition":"A person who has had or who is capable of having children; a person who is focussed on the rearing of their own children."},{"definition":"A heterosexual; i.e. one whose sexual intercourse can lead to breeding.","example":"Since the breeders started coming here, you can never tell who likes cock."},{"definition":"Ellipsis of breeder reactor; a type of nuclear reactor that creates material suitable for the production of atomic weapons."},{"definition":"A pattern that exhibits quadratic growth by generating multiple copies of a secondary pattern, each of which then generates multiple copies of a tertiary pattern."}],"partOfSpeech":"n"}]},{"word":"ALTERATIONS","idx":13721,"count":3042306,"meanings":[{"definitions":[{"definition":"The act of altering or making different."},{"definition":"The state of being altered; a change made in the form or nature of a thing; changed condition."}],"partOfSpeech":"n"}]},{"word":"LETHAL","idx":13723,"count":3040987,"meanings":[{"definitions":[{"definition":"Any weapon that causes death."},{"definition":"An allele that causes the death of the organism that carries it."},{"definition":"One of the higher alcohols of the paraffine series obtained from spermaceti as a white crystalline solid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Deadly; mortal; fatal."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈliː.θəl/"}]},{"word":"BIOGRAPHICAL","idx":13724,"count":3038522,"meanings":[{"definitions":[{"definition":"Of or relating to an account of a person's life"}],"partOfSpeech":"j"}]},{"word":"CONFIRMS","idx":13725,"count":3037668,"meanings":[{"definitions":[{"definition":"To strengthen; to make firm or resolute."},{"definition":"To administer the sacrament of confirmation on (someone)."},{"definition":"To assure the accuracy of previous statements."}],"partOfSpeech":"ve"}]},{"word":"CAVITY","idx":13726,"count":3037278,"meanings":[{"definitions":[{"definition":"A hole or hollow depression."},{"definition":"A hollow area within the body (such as the sinuses)."},{"definition":"A small or large hole in a tooth caused by caries; often also a soft area adjacent to the hole also affected by caries."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[ˈkʰævɪɾi]"}]},{"word":"MOLDED","idx":13727,"count":3035204,"meanings":[{"definitions":[{"definition":"To shape in or on a mold; to form into a particular shape; to give shape to."},{"definition":"To guide or determine the growth or development of; influence"},{"definition":"To fit closely by following the contours of."},{"definition":"To make a mold of or from (molten metal, for example) before casting."},{"definition":"To ornament with moldings."},{"definition":"To be shaped in or as if in a mold.","example":"These shoes gradually molded to my feet."},{"definition":"To cause to become moldy; to cause mold to grow upon."},{"definition":"To become moldy; to be covered or filled, in whole or in part, with a mold."},{"definition":"To cover with mold or soil."}],"partOfSpeech":"ve"}]},{"word":"PROBATE","idx":13730,"count":3033985,"meanings":[{"definitions":[{"definition":"The legal process of verifying the legality of a will."},{"definition":"A copy of a legally recognised and qualified will."},{"definition":"Proof"},{"definition":"A court (tribunal) whose function is to administer estates (property of a decedent) and prove wills"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To establish the legality of (a will)."}],"partOfSpeech":"ve"}]},{"word":"TERRESTRIAL","idx":13731,"count":3033276,"meanings":[{"definitions":[{"definition":"An inhabitant of the planet Earth."},{"definition":"A ground-dwelling plant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or inhabiting the land of the Earth or its inhabitants, earthly."},{"definition":"Of, relating to, or composed of land."},{"definition":"Living or growing in or on land (as opposed to other habitat); not aquatic, etc.","example":"a terrestrial plant"},{"definition":"Of a planet, being composed primarily of silicate rocks or metals; see also terrestrial planet."},{"definition":"Concerned with the world or worldly matters."},{"definition":"Of or pertaining to the second highest degree of glory."},{"definition":"Broadcast using radio waves as opposed to satellite or cable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"terrestrial-uk","text":"/təˈɹɛstɹi.əl/"}]},{"word":"DECALS","idx":13732,"count":3033263,"meanings":[{"definitions":[{"definition":"A design or picture produced in order to be transferred to another surface either permanently or temporarily."},{"definition":"A decorative sticker."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdekəlz/"}]},{"word":"COMPLETES","idx":13733,"count":3032972,"meanings":[{"definitions":[{"definition":"A completed survey."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To finish; to make done; to reach the end.","example":"He completed the assignment on time."},{"definition":"To make whole or entire.","example":"The last chapter completes the book nicely."},{"definition":"To call from the small blind in an unraised pot."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəmˈpliːts/"}]},{"word":"BEAMS","idx":13734,"count":3032813,"meanings":[{"definitions":[{"definition":"Any large piece of timber or iron long in proportion to its thickness, and prepared for use."},{"definition":"One of the principal horizontal timbers of a building; one of the transverse members of a ship's frame on which the decks are laid — supported at the sides by knees in wooden ships and by stringers in steel ones."},{"definition":"The maximum width of a vessel (note that a vessel with a beam of 15 foot can also be said to be 15 foot abeam)","example":"This ship has more beam than that one."},{"definition":"The crossbar of a mechanical balance, from the ends of which the scales are suspended."},{"definition":"The principal stem of the antler of a deer."},{"definition":"The pole of a carriage or chariot."},{"definition":"A cylinder of wood, making part of a loom, on which weavers wind the warp before weaving and the cylinder on which the cloth is rolled, as it is woven."},{"definition":"The straight part or shank of an anchor."},{"definition":"The central bar of a plow, to which the handles and colter are secured, and to the end of which are attached the oxen or horses that draw it."},{"definition":"In steam engines, a heavy iron lever having an oscillating motion on a central axis, one end of which is connected with the piston rod from which it receives motion, and the other with the crank of the wheel shaft."},{"definition":"A ray or collection of approximately parallel rays emitted from the sun or other luminous body.","example":"a beam of energy"},{"definition":"A ray; a gleam.","example":"a beam of hope, or of comfort"},{"definition":"One of the long feathers in the wing of a hawk."},{"definition":"A horizontal bar which connects the stems of two or more notes to group them and to indicate metric value."},{"definition":"An elevated rectangular dirt pile used to cheaply build an elevated portion of a railway."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To emit beams of light; shine; radiate.","example":"to beam forth light"},{"definition":"To smile broadly or especially cheerfully."},{"definition":"To furnish or supply with beams"},{"definition":"To give the appearance of beams to."},{"definition":"To transmit matter or information via a high-tech wireless mechanism.","example":"Beam me up, Scotty; there's no intelligent life down here."},{"definition":"(currying) To stretch something (for example an animal hide) on a beam."},{"definition":"To put (something) on a beam"},{"definition":"To connect (musical notes) with a beam, or thick line, in music notation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"beams-us","text":"/biːmz/"}]},{"word":"PROPS","idx":13735,"count":3032812,"meanings":[{"definitions":[{"definition":"An object placed against or under another, to support it; anything that supports.","example":"They stuck a block of wood under it as a prop."},{"definition":"The player on either side of the hooker in a scrum."},{"definition":"One of the seashells in the game of props."},{"definition":"An item placed on a stage or set to create a scene or scenario in which actors perform.","example":"They used the trophy as a prop in the movie."},{"definition":"An item placed within an advertisement in order to suggest a style of living etc."},{"definition":"The propeller of an aircraft."},{"definition":"A proposition, especially on an election-day ballot."},{"definition":"Propellant"},{"definition":"Respect for, or recognition of, another person; an expression of approval or a special acknowledgment; accolades; praise.","example":"I've got to give props to Roger for the way he handled that situation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(sometimes figurative) To support or shore up something.","example":"Try using a phone book to prop up the table where the foot is missing."},{"definition":"To play rugby in the prop position"},{"definition":"(usually with \"up\" - see prop up) To position the feet of (a person) while sitting, lying down, or reclining so that the knees are elevated at a higher level."},{"definition":"To manually start the engine of a propeller-driven aircraft with no electric starter by pulling vigorously on one of the propeller blades using the hands, so that the propeller can catch ignition."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"props-au"}]},{"word":"INCENSE","idx":13736,"count":3032805,"meanings":[{"definitions":[{"definition":"A perfume used in the rites of various religions."},{"definition":"Homage; adulation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To anger or infuriate.","example":"I think it would incense him to learn the truth."},{"definition":"To incite, stimulate."},{"definition":"To offer incense to."},{"definition":"To perfume with, or as with, incense."},{"definition":"To set on fire; to inflame; to kindle; to burn."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"incense-us","text":"/ɪnˈsɛns/"}]},{"word":"FORMULATED","idx":13737,"count":3032757,"meanings":[{"definitions":[{"definition":"To reduce to, or express in, a formula; to put in a clear and definite form of statement or expression."}],"partOfSpeech":"ve"}]},{"word":"DOUGH","idx":13738,"count":3032657,"meanings":[{"definitions":[{"definition":"A thick, malleable substance made by mixing flour with other ingredients such as water, eggs, and/or butter, that is made into a particular form and then baked.","example":"Pizza dough is very stretchy."},{"definition":"Money.","example":"Hey Martin, we are playing a hold'em card game for some dough, would you like to join?"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make into dough.","example":"The flour was doughed with a suitable quantity of water."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dough-us","text":"/doʊ/"},{"audio":"dough-uk","text":"/dəʊ/"}]},{"word":"STOOL","idx":13739,"count":3031945,"meanings":[{"definitions":[{"definition":"A seat, especially for one person and without armrests."},{"definition":"A close-stool; a seat used for urination and defecation: a chamber pot, commode, outhouse seat, or toilet."},{"definition":"A plant that has been cut down until its main stem is close to the ground, resembling a stool, to promote new growth."},{"definition":"Feces, excrement."},{"definition":"A production of feces or excrement, an act of defecation, stooling."},{"definition":"A decoy; a portable piece of wood to which a pigeon is fastened to lure wild birds."},{"definition":"A small channel on the side of a vessel, for the deadeyes of the backstays."},{"definition":"Material, such as oyster shells, spread on the sea bottom for oyster spat to adhere to."},{"definition":"A plant from which layers are propagated by bending its branches into the soil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce stool: to defecate."},{"definition":"To cut down (a plant) until its main stem is close to the ground, resembling a stool, to promote new growth."},{"definition":"To ramify; to tiller, as grain; to shoot out suckers."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stool-us","text":"/stuːl/"}]},{"word":"MACS","idx":13740,"count":3031589,"meanings":[{"definitions":[{"definition":"A waterproof long coat made of rubberized cloth."},{"definition":"By extension, any waterproof coat or raincoat."},{"definition":"Waterproof rubberized cloth."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mæks/"}]},{"word":"TOWING","idx":13741,"count":3031539,"meanings":[{"definitions":[{"definition":"The act by which something is towed."}],"partOfSpeech":"n"}]},{"word":"WELCH","idx":13742,"count":3031408,"meanings":[{"definitions":[{"definition":"A person who defaults on an obligation, especially a small one.","example":"She's a welch. That watering-can isn't hers: I lent it to her three years ago."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fail to repay a small debt."},{"definition":"To fail to fulfill an obligation."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/wɛltʃ/"}]},{"word":"ROSEMARY","idx":13743,"count":3030760,"meanings":[{"definitions":[{"definition":"A shrub, Rosmarinus officinalis, that originates from Europe and Asia Minor and produces a fragrant herb used in cooking and perfumes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rosemary-us"}]},{"word":"MILLIONAIRE","idx":13744,"count":3029469,"meanings":[{"definitions":[{"definition":"(strictly) A person whose net worth is at or greater than one million units of the local currency, but less than two million."},{"definition":"A person whose net worth is at or greater than one million units of the local currency; a multimillionaire."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌmɪl.jəˈnɛɚ/"},{"text":"/ˌmɪl.i.əˈnɛə(ɹ)/"}]},{"word":"TURQUOISE","idx":13745,"count":3029244,"meanings":[{"definitions":[{"definition":"A sky-blue, greenish-blue, or greenish-gray semi-precious gemstone."},{"definition":"A pale greenish-blue colour, like that of the gemstone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Made of turquoise (the gemstone)."},{"definition":"Having a pale greenish-blue colour."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɚ.k(w)ɔɪs/"},{"text":"/ˈtɜː(ɹ).k(w)ɔɪs/"},{"audio":"turquoise-au"}]},{"word":"ARCHIVAL","idx":13746,"count":3028510,"meanings":[{"definitions":[{"definition":"The act of archiving something.","example":"Our nightly backups include the archival of old e-mail messages."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to an archive or archiving."}],"partOfSpeech":"j"}]},{"word":"SEISMIC","idx":13747,"count":3028135,"meanings":[{"definitions":[{"definition":"Related to, or caused by an earthquake or other vibration of the Earth."},{"definition":"Of very large or widespread effect."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsaɪzmɪk/"}]},{"word":"EXPOSURES","idx":13748,"count":3027680,"meanings":[{"definitions":[{"definition":"The condition of being exposed, uncovered, or unprotected.","example":"Limit your exposure to harsh chemicals.   Get as much exposure to a new language as you can."},{"definition":"Lack of protection from weather or the elements."},{"definition":"The act of exposing something, such as a scandal."},{"definition":"That part which is facing or exposed to something, e.g. the sun, weather, sky, or a view.","example":"They rented a cabin with a beautiful southern exposure."},{"definition":"An instance of taking a photograph."},{"definition":"The piece of film exposed to light."},{"definition":"Details of the time and f-number used."},{"definition":"The amount of sun, wind etc. experienced by a particular site."}],"partOfSpeech":"n"}]},{"word":"BACCARAT","idx":13749,"count":3027417,"meanings":[{"definitions":[{"definition":"A card game resembling chemin de fer with many forms - usually entailing the player(s) betting against two or three hands dealt - also bearing some similarities to blackjack."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bɑːkəˈrɑː/"}]},{"word":"SUBSTITUTED","idx":13751,"count":3027233,"meanings":[{"definitions":[{"definition":"To use in place of something else, with the same function.","example":"I had no shallots so I substituted onion."},{"definition":"(in the phrase \"substitute X for Y\") To use X in place of Y.","example":"I had to substitute new parts for the old ones."},{"definition":"(in the phrase \"substitute X with/by Y\") To use Y in place of X; to replace X with Y.","example":"I had to substitute old parts with the new ones."},{"definition":"To remove (a player) from the field of play and bring on another in his place.","example":"He was playing poorly and was substituted after twenty minutes"},{"definition":"To serve as a replacement (for someone or something)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsʌbstɪtutɪd/"},{"text":"/ˈsʌbstɪtjuːtɪd/"}]},{"word":"HORDE","idx":13752,"count":3026646,"meanings":[{"definitions":[{"definition":"A wandering troop or gang; especially, a clan or tribe of a nomadic people (originally Tatars) migrating from place to place for the sake of pasturage, plunder, etc.; a predatory multitude."},{"definition":"A large number of people.","example":"We were beset by a horde of street vendors who thought we were tourists and would buy their cheap souvenirs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel en masse, to flock"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"horde-us","text":"/hɔɹd/"}]},{"word":"PAPERWORK","idx":13753,"count":3026360,"meanings":[{"definitions":[{"definition":"Routine work involving written documents"},{"definition":"Written documents"},{"definition":"Excessive paperwork, busy work, red tape."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpeɪ.pɚ.wɚk/"}]},{"word":"MOMMY","idx":13754,"count":3025970,"meanings":[{"definitions":[{"definition":"(usually childish) Mother."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat someone like a mother would; to mother someone."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(chiefly in the superlative) Characteristic of a mother; motherly.","example":"She is the mommiest of mommies."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mommy-us"}]},{"word":"TEENAGER","idx":13755,"count":3025962,"meanings":[{"definitions":[{"definition":"A person between 13 and 19 years of age; an adolescent."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"teenager-us","text":"/ˈtiːnˌeɪ.dʒə(ɹ)/"}]},{"word":"NANNY","idx":13756,"count":3025474,"meanings":[{"definitions":[{"definition":"A child's nurse."},{"definition":"A grandmother."},{"definition":"A godmother."},{"definition":"A female goat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To serve as a nanny."},{"definition":"To treat like a nanny's charges; to coddle."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈnæni/"}]},{"word":"SUBURB","idx":13757,"count":3025325,"meanings":[{"definitions":[{"definition":"A residential area located on the outskirts of a city or large town that usually includes businesses that cater to its residents; such as schools, grocery stores, shopping centers, restaurants, convenience stores, etc."},{"definition":"(by extension) The outer part; the environment."},{"definition":"Any subdivision of a conurbation, not necessarily on the periphery."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsʌbɝb/"},{"text":"/ˈsʌbɜːb/"},{"audio":"suburb-au"}]},{"word":"SMOKERS","idx":13759,"count":3024584,"meanings":[{"definitions":[{"definition":"A person who smokes tobacco habitually."},{"definition":"A smoking car on a train."},{"definition":"An informal social gathering for men only, at which smoking tobacco is allowed."},{"definition":"(Cambridge University) A social event featuring sketches, songs, etc., whether or not smoking is carried out."},{"definition":"A vent in the deep ocean floor from which a plume of superheated seawater, rich in minerals, erupts."},{"definition":"An illicit boxing match; see Wikipedia:Battle Royal (boxing)."},{"definition":"A device that releases smoke intended to distract bees; a bee smoker."},{"definition":"A person or an apparatus that smokes food."},{"definition":"A two-stroke engine."},{"definition":"(by extension) Any vehicle with a two-stroke engine, especially a motorcycle, as opposed to a four-stroke motorcycle or stroker."},{"definition":"A fastball."},{"definition":"A kind of pornographic film produced clandestinely in the early to mid-20th century, typically short and without sound."}],"partOfSpeech":"n"}]},{"word":"COHORT","idx":13760,"count":3024028,"meanings":[{"definitions":[{"definition":"A group of people supporting the same thing or person."},{"definition":"A demographic grouping of people, especially those in a defined age group, or having a common characteristic.","example":"The 18-24 cohort shows a sharp increase in automobile fatalities over the proximate age groupings."},{"definition":"Any division of a Roman legion, normally of about 500 men.","example":"Three cohorts of men were assigned to the region."},{"definition":"An accomplice; abettor; associate.","example":"He was able to plea down his sentence by revealing the names of three of his cohorts, as well as the source of the information."},{"definition":"Any band or body of warriors."},{"definition":"A natural group of orders of organisms, less comprehensive than a class."},{"definition":"A colleague."},{"definition":"A set of individuals in a program, especially when compared to previous sets of individuals within the same program."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To associate with such a group"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cohort-us","text":"/ˈkoʊ̯.hɔɹt/"}]},{"word":"SUCCESSION","idx":13761,"count":3023429,"meanings":[{"definitions":[{"definition":"An act of following in sequence."},{"definition":"A sequence of things in order."},{"definition":"A passing of royal powers."},{"definition":"A group of rocks or strata that succeed one another in chronological order."},{"definition":"A race or series of descendants."},{"definition":"Rotation, as of crops."},{"definition":"A right to take possession."},{"definition":"In Roman and Scots law, the taking of property by one person in place of another."},{"definition":"The person who succeeds to rank or office; a successor or heir."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"succession-us"},{"text":"/səkˈsɛʃ.ən/"}]},{"word":"DECLINING","idx":13762,"count":3023427,"meanings":[{"definitions":[{"definition":"To move downwards, to fall, to drop.","example":"The dollar has declined rapidly since 2001."},{"definition":"To become weaker or worse.","example":"My health declined in winter."},{"definition":"To bend downward; to bring down; to depress; to cause to bend, or fall."},{"definition":"To cause to decrease or diminish."},{"definition":"To turn or bend aside; to deviate; to stray; to withdraw.","example":"a line that declines from straightness"},{"definition":"To refuse, forbear.","example":"On reflection I think I will decline your generous offer."},{"definition":"(grammar, usually of substantives, adjectives and pronouns) To inflect for case, number and sometimes gender."},{"definition":"(by extension) To run through from first to last; to repeat like a schoolboy declining a noun."},{"definition":"To reject a penalty against the opposing team, usually because the result of accepting it would benefit the non-penalized team less than the preceding play.","example":"The team chose to decline the fifteen-yard penalty because their receiver had caught the ball for a thirty-yard gain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Decline"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈklaɪnɪŋ/"}]},{"word":"ALLIANCES","idx":13763,"count":3023330,"meanings":[{"definitions":[{"definition":"The state of being allied.","example":"matrimonial alliances; an alliance between church and state, or between two countries"},{"definition":"The act of allying or uniting."},{"definition":"A union or connection of interests between families, states, parties, etc., especially between families by marriage and states by compact, treaty, or league."},{"definition":"Any union resembling that of families or states; union by relationship in qualities; affinity."},{"definition":"(with the definite article) The persons or parties allied."}],"partOfSpeech":"n"}]},{"word":"SUMS","idx":13764,"count":3022843,"meanings":[{"definitions":[{"definition":"A type of administrative district used in China, Mongolia, and Russia. In Mongolia, a somon is smaller than a province. In China, it is only used in Inner Mongolia where it is equivalent to a township."},{"definition":"A quantity obtained by addition or aggregation.","example":"The sum of 3 and 4 is 7."},{"definition":"(often plural) An arithmetic computation, especially one posed to a student as an exercise (not necessarily limited to addition).","example":"We're learning about division, and the sums are tricky."},{"definition":"A quantity of money.","example":"a tidy sum"},{"definition":"A summary; the principal points or thoughts when viewed together; the amount; the substance; compendium.","example":"This is the sum and substance of his objections."},{"definition":"A central idea or point; gist."},{"definition":"The utmost degree."},{"definition":"An old English measure of corn equal to the quarter."},{"definition":"The basic unit of money in Kyrgyzstan."},{"definition":"The basic unit of money in Uzbekistan."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add together."},{"definition":"To give a summary of."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sʌmz/"}]},{"word":"LINEUP","idx":13765,"count":3022552,"meanings":[{"definitions":[{"definition":"A physical or photographic queue of people allegedly involved in a crime, allowing a witness to identify them"},{"definition":"A line of people or vehicles, in which the individual at the front end is dealt with first, the one behind is dealt with next, and so on, and in which newcomers join at the end; a queue."},{"definition":"Collectively, the members of a team.","example":"The manager fielded his strongest lineup for the game against United."},{"definition":"The batting order."},{"definition":"The members of a music group at any one time."},{"definition":"The acts performing at a concert or music festival."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlaɪn.ʌp/"},{"audio":"lineup-ca"}]},{"word":"AVERAGED","idx":13766,"count":3021741,"meanings":[{"definitions":[{"definition":"To compute the average of, especially the arithmetic mean.","example":"If you average 10, 20 and 24, you get 18."},{"definition":"Over a period of time or across members of a population, to have or generate a mean value of.","example":"I averaged 75% in my examinations this year."},{"definition":"To divide among a number, according to a given proportion.","example":"to average a loss"},{"definition":"To be, generally or on average."}],"partOfSpeech":"ve"}]},{"word":"HOTSPOT","idx":13767,"count":3021698,"meanings":[{"definitions":[{"definition":"An optical phenomenon which creates a bright spot around the shadow of the viewer's head, when the surface on which the shadow falls has special optical characteristics (as with dewy grass)."},{"definition":"A place notable for a high level of activity or danger."},{"definition":"A part of an application that consumes a significant amount of execution time."},{"definition":"Part of a control that responds dynamically as the user moves the pointer over it, as for example in an image map."},{"definition":"A location in which WiFi Internet access is available."},{"definition":"The region of a gene in which there is higher than normal rate of mutation."},{"definition":"The surface manifestation of a plume that rises from deep in the celestial body's mantle."}],"partOfSpeech":"n"}]},{"word":"GLACIER","idx":13769,"count":3021561,"meanings":[{"definitions":[{"definition":"A large body of ice which flows under its own mass, usually downhill.","example":"They warned that the effects of glacier melting on water resources are becoming “increasingly serious” for China."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"glacier-us","text":"/ˈɡleɪ.ʃɚ/"}]},{"word":"PUEBLO","idx":13770,"count":3021546,"meanings":[{"definitions":[{"definition":"A community in Spain or Spanish America, especially one of Pueblo Indians living in a stone or adobe multi-storey building."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpwɛbləʊ/"}]},{"word":"RIGOROUS","idx":13773,"count":3020634,"meanings":[{"definitions":[{"definition":"Showing, causing, or favoring rigour; scrupulously accurate or strict; thorough.","example":"a rigorous execution of law"},{"definition":"Severe; intense.","example":"a rigorous winter."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rigorous-us","text":"/ˈɹɪɡəɹəs/"}]},{"word":"GIGABIT","idx":13774,"count":3020143,"meanings":[{"definitions":[{"definition":"109 bits, a thousand million (1,000,000,000) bits."},{"definition":"230 (1,073,741,824) bits."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʒɪɡəbɪt/"},{"text":"/ˈɡɪɡəbɪt/"}]},{"word":"WORKSHEET","idx":13775,"count":3019301,"meanings":[{"definitions":[{"definition":"A sheet of paper or computerized document on which problems are worked out or solved and answers recorded."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To teach or assess by means of worksheets."}],"partOfSpeech":"ve"}]},{"word":"ALLOCATE","idx":13776,"count":3019079,"meanings":[{"definitions":[{"definition":"To set aside for a purpose."},{"definition":"To distribute according to a plan, generally followed by the adposition to.","example":"The bulk of K–12 education funds are allocated to school districts that in turn pay for the cost of operating schools."},{"definition":"To reserve a portion of memory for use by a computer program."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈæl.ə.keɪt/"}]},{"word":"RELIEVE","idx":13777,"count":3018810,"meanings":[{"definitions":[{"definition":"To ease (a person, person's thoughts etc.) from mental distress; to stop (someone) feeling anxious or worried, to alleviate the distress of.","example":"I was greatly relieved by the jury's verdict."},{"definition":"To ease (someone, a part of the body etc.) or give relief from physical pain or discomfort."},{"definition":"To alleviate (pain, distress, mental discomfort etc.)."},{"definition":"To provide comfort or assistance to (someone in need, especially in poverty)."},{"definition":"To lift up; to raise again."},{"definition":"To raise (someone) out of danger or from (a specified difficulty etc.)."},{"definition":"To free (someone) from debt or legal obligations; to give legal relief to.","example":"This shall not relieve either Party of any obligations."},{"definition":"To bring military help to (a besieged town); to lift the siege on."},{"definition":"To release (someone) from or of a difficulty, unwanted task, responsibility etc."},{"definition":"(job) To free (someone) from their post, task etc. by taking their place."},{"definition":"To make (something) stand out; to make prominent, bring into relief."},{"definition":"To go to the toilet; to defecate or urinate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"relieve-us","text":"/ɹɪˈliːv/"}]},{"word":"AFTERMATH","idx":13778,"count":3018203,"meanings":[{"definitions":[{"definition":"A second mowing; the grass which grows after the first crop of hay in the same season."},{"definition":"That which happens after, that which follows, usually of strongly negative connotation in most contexts, implying a preceding catastrophe.","example":"In contrast to most projections of the aftermath of nuclear war, in this there is no rioting or looting."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"aftermath-us","text":"/ˈæf.tɚˌmæθ/"}]},{"word":"ROACH","idx":13779,"count":3017586,"meanings":[{"definitions":[{"definition":"Certain members of the fish family Cyprinidae, including:"},{"definition":"A cockroach."},{"definition":"An extra curve of material added to the leech (aft edge) of a sail to increase the sail area."},{"definition":"A kind of headdress worn by some of the indigenous peoples of North America."},{"definition":"(smoking) Marijuana; cannabis used as a drug."},{"definition":"(smoking) A butt of a marijuana cigarette."},{"definition":"(smoking) The filter of a rolled cigarette or joint, made from card or paper."},{"definition":"A bed or stratum of some mineral."},{"definition":"Gritty or coarse rock; especially Portland stone or similar limestone."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹoʊtʃ/"},{"text":"/ɹəʊtʃ/"},{"audio":"roach-au"}]},{"word":"CLARION","idx":13780,"count":3017281,"meanings":[{"definitions":[{"definition":"A medieval brass instrument, related to the trumpet, or its sound.","example":"The clarion's call to action has been heard."},{"definition":"A different type of musical instrument resembling an organ."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sound a clarion (trumpet-like instrument)."},{"definition":"To make a similar sound to the instrument."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"clarion-us","text":"/ˈklæɹiən/"}]},{"word":"OVERRIDE","idx":13781,"count":3017162,"meanings":[{"definitions":[{"definition":"A mechanism, device or procedure used to counteract an automatic control."},{"definition":"A royalty."},{"definition":"A device for prioritizing audio signals, such that certain signals receive priority over others."},{"definition":"A method with the same name and signature as a method in a superclass, which runs instead of that method, when an object of the subclass is involved."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride across or beyond something."},{"definition":"To ride a horse too hard."},{"definition":"To counteract the normal operation of something; to countermand with orders of higher priority.","example":"The Congress promptly overrode the president's veto, passing the bill into law."},{"definition":"To define a new behaviour of a method by creating the same method of the superclass with the same name and signature."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/oʊ.vəɹˈɹaɪd/"},{"text":"/əʊ.vəˈɹaɪd/"}]},{"word":"ENTHUSIASTIC","idx":13783,"count":3015772,"meanings":[{"definitions":[{"definition":"With zealous fervor; excited, motivated.","example":"an enthusiastic lover of art"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˌθuːziˈæstɪk/"},{"text":"/ɪnˌθjuːzɪˈæstɪk/"}]},{"word":"LAME","idx":13784,"count":3015528,"meanings":[{"definitions":[{"definition":"A stupid or undesirable person."},{"definition":"A lamina; a thin layer or plate of material, as in certain kinds of armor."},{"definition":"(in the plural) A set of joined overlapping metal plates."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause (a person or animal) to become lame.","example":"1877, Anna Sewell, Black Beauty: And if you don't want to lame your horse you must look sharp and get them [stones stuck in hooves] out quickly."},{"definition":"To shine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Unable to walk properly because of a problem with one's feet or legs."},{"definition":"Moving with pain or difficulty on account of injury, defect or temporary obstruction of a function.","example":"a lame leg, arm or muscle"},{"definition":"(by extension) Hobbling; limping; inefficient; imperfect."},{"definition":"Unconvincing or unbelievable.","example":"He had a really lame excuse for missing the birthday party."},{"definition":"Failing to be cool, funny, interesting or relevant.","example":"He kept telling these extremely lame jokes all night."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lame-uk","text":"/leɪm/"}]},{"word":"CONTINUUM","idx":13785,"count":3015510,"meanings":[{"definitions":[{"definition":"A continuous series or whole, no part of which is noticeably different from its adjacent parts, although the ends or extremes of it are very different from each other."},{"definition":"A continuous extent."},{"definition":"The set of real numbers; more generally, any compact connected metric space."},{"definition":"A touch-sensitive strip, similar to an electronic standard musical keyboard, except that the note steps are 1/100 of a semitone, and so are not separately marked."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kənˈtɪnjuəm/"}]},{"word":"SQUEEZE","idx":13786,"count":3015480,"meanings":[{"definitions":[{"definition":"A close or tight fit."},{"definition":"A difficult position.","example":"I'm in a tight squeeze right now when it comes to my free time."},{"definition":"A hug or other affectionate grasp.","example":"a gentle squeeze on the arm"},{"definition":"A romantic partner.","example":"I want to be your main squeeze."},{"definition":"An illicit alcoholic drink made by squeezing Sterno through cheesecloth, etc., and mixing the result with fruit juice."},{"definition":"The act of bunting in an attempt to score a runner from third.","example":"The game ended in exciting fashion with a failed squeeze."},{"definition":"A play that forces an opponent to discard a card that gives up one or more tricks."},{"definition":"A traversal of a narrow passage.","example":"It was a tight squeeze, but I got through to the next section of the cave."},{"definition":"(epigraphy) An impression of an inscription formed by pressing wet paper onto the surface and peeling off when dry.","example":"The light not being good enough for photography, I took a squeeze of the stone."},{"definition":"The gradual closing of workings by the weight of the overlying strata."},{"definition":"A bribe or fee paid to a middleman, especially in China; the practice of requiring such a bribe or fee."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply pressure to from two or more sides at once.","example":"I squeezed the ball between my hands."},{"definition":"To embrace closely; to give a tight hug to."},{"definition":"To fit into a tight place.","example":"Can you squeeze through that gap?"},{"definition":"To remove something with difficulty, or apparent difficulty.","example":"He squeezed some money out of his wallet."},{"definition":"To put in a difficult position by presenting two or more choices.","example":"I'm being squeezed between my job and my volunteer work."},{"definition":"To oppress with hardships, burdens, or taxes; to harass."},{"definition":"To attempt to score a runner from third by bunting.","example":"Jones squeezed in Smith with a perfect bunt."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"squeeze-us","text":"/skwiːz/"}]},{"word":"BURGUNDY","idx":13789,"count":3013476,"meanings":[{"definitions":[{"definition":"A variety of red wine from this region."},{"definition":"A variety of wine resembling that of Burgundy; especially from Australia or California."},{"definition":"A dark red colour tinged with purple, like that of Burgundy (red) wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a deep purple red color like that of Burgundy wine."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈbɝ.ɡən.di/"},{"text":"/ˈbəː.ɡən.dɪ/"},{"audio":"burgundy-au"}]},{"word":"STRUGGLES","idx":13790,"count":3012492,"meanings":[{"definitions":[{"definition":"A contortion of the body in an attempt to escape or to perform a difficult task."},{"definition":"Strife, contention, great effort."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strive, to labour in difficulty, to fight (for or against), to contend.","example":"During the centuries, the people of Ireland struggled constantly to assert their right to govern themselves."},{"definition":"To strive, or to make efforts, with a twisting, or with contortions of the body.","example":"She struggled to escape from her assailant's grasp."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"struggles-us"}]},{"word":"PEP","idx":13791,"count":3012344,"meanings":[{"definitions":[{"definition":"Energy, high spirits."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To inject with energy and enthusiasm."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɛp/"}]},{"word":"FAREWELL","idx":13792,"count":3012087,"meanings":[{"definitions":[{"definition":"A wish of happiness or safety at parting, especially a permanent departure"},{"definition":"A departure; the act of leaving"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bid farewell or say goodbye."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Parting, valedictory, final.","example":"a farewell discourse;  the band's farewell tour"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Goodbye.","example":"He said \"Farewell!\" and left."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"farewell-us","text":"/fɛəɹˈwɛl/"}]},{"word":"SOHO","idx":13793,"count":3012062,"meanings":[{"definitions":[{"definition":"Ho; halloo; a word used in calling from a distant place."}],"partOfSpeech":"i"}]},{"word":"ASHES","idx":13794,"count":3011008,"meanings":[{"definitions":[{"definition":"The solid remains of a fire.","example":"Ash from a fireplace can restore minerals to your garden's soil."},{"definition":"The nonaqueous remains of a material subjected to any complete oxidation process."},{"definition":"Fine particles from a volcano, volcanic ash."},{"definition":"(in the plural) Human (or animal) remains after cremation.","example":"The urn containing his ashes was eventually removed to a closet."},{"definition":"What remains after a catastrophe."},{"definition":"A gray colour, like that of ash."},{"definition":"A shade tree of the genus Fraxinus.","example":"The ash trees are dying off due to emerald ash borer."},{"definition":"The wood of this tree."},{"definition":"The traditional name for the ae ligature (æ), as used in Old English."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reduce to a residue of ash. See ashing."},{"definition":"To hit the end off of a burning cigar or cigarette."},{"definition":"To hit the end off (a burning cigar or cigarette)."},{"definition":"(mostly used in the passive) To cover newly-sown fields of crops with ashes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ashes-us","text":"/ˈæʃ.əz/"}]},{"word":"VANGUARD","idx":13795,"count":3010646,"meanings":[{"definitions":[{"definition":"The leading units at the front of an army or fleet."},{"definition":"(by extension) The person(s) at the forefront of any group or movement."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈvænˌɡɑɹd/"},{"text":"/ˈvanˌɡɑːd/"},{"text":"/ˈvɛnˌɡɐːd/"}]},{"word":"NYLONS","idx":13796,"count":3010458,"meanings":[{"definitions":[{"definition":"Originally, the DuPont company trade name for polyamide, a copolymer whose molecules consist of alternating diamine and dicarboxylic acid monomers bonded together; now generically used for this type of polymer."},{"definition":"(in the plural) A stocking originally fabricated from nylon; also used generically for any long, sheer stocking worn on a woman's legs.","example":"I tore a hole in my nylons while walking home through the woods."},{"definition":"Stockings made from nylon"}],"partOfSpeech":"n"}]},{"word":"CHIPSET","idx":13797,"count":3010243,"meanings":[{"definitions":[{"definition":"A group of integrated circuits (\"chips\") that are designed to work together, and are usually marketed as a single product."}],"partOfSpeech":"n"}]},{"word":"NATAL","idx":13798,"count":3010028,"meanings":[{"definitions":[{"definition":"Of or relating to birth."},{"definition":"Of or relating to the buttocks."}],"partOfSpeech":"j"}]},{"word":"LOCUS","idx":13799,"count":3009222,"meanings":[{"definitions":[{"definition":"A place or locality, especially a centre of activity or the scene of a crime.","example":"The cafeteria was the locus of activity."},{"definition":"The set of all points whose coordinates satisfy a given equation or condition.","example":"A circle is the locus of points from which the distance to the center is a given value, the radius."},{"definition":"A fixed position on a chromosome that may be occupied by one or more genes."},{"definition":"(chiefly in the plural) A passage in writing, especially in a collection of ancient sacred writings arranged according to a theme."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"locus-uk","text":"/ˈləʊkəs/"}]},{"word":"EVENINGS","idx":13802,"count":3008865,"meanings":[{"definitions":[{"definition":"The time of the day between dusk and night, when it gets dark."},{"definition":"The time of the day between the approximate time of midwinter dusk and midnight (compare afternoon); the period after the end of regular office working hours."},{"definition":"A concluding time period; a point in time near the end of something; the beginning of the end of something.","example":"It was the evening of the Roman Empire."},{"definition":"A party or gathering held in the evening."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(somewhat dated) In the evening, during the evening."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈiːvnɪŋz/"}]},{"word":"MISSES","idx":13803,"count":3008606,"meanings":[{"definitions":[{"definition":"A failure to hit."},{"definition":"A failure to obtain or accomplish."},{"definition":"An act of avoidance (used with the verb give).","example":"I think I’ll give the meeting a miss."},{"definition":"The situation where an item is not found in a cache and therefore needs to be explicitly loaded."},{"definition":"A title of respect for a young woman (usually unmarried) with or without a name used.","example":"You may sit here, Miss Jones."},{"definition":"An unmarried woman; a girl."},{"definition":"A kept woman; a mistress."},{"definition":"In the game of three-card loo, an extra hand, dealt on the table, which may be substituted for the hand dealt to a player."},{"definition":"Wife or girlfriend.","example":"Harry said he couldn't stop and chat because his missus wanted to go shopping."},{"definition":"Term of address for a woman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fail to hit.","example":"I missed the target."},{"definition":"To fail to achieve or attain.","example":"to miss an opportunity"},{"definition":"To avoid; to escape.","example":"The car just missed hitting a passer-by."},{"definition":"To become aware of the loss or absence of; to feel the want or need of, sometimes with regret.","example":"I miss you! Come home soon!"},{"definition":"To fail to understand; to have a shortcoming of perception; overlook.","example":"miss the joke"},{"definition":"To fail to attend.","example":"Joe missed the meeting this morning."},{"definition":"To be late for something (a means of transportation, a deadline, etc.).","example":"I missed the plane!"},{"definition":"To be wanting; to lack something that should be present.","example":"The car is missing essential features."},{"definition":"(said of a card) To fail to help the hand of a player.","example":"Player A: J7. Player B: Q6. Table: 283. The flop missed both players!"},{"definition":"To fail to score (a goal)."},{"definition":"To go wrong; to err."},{"definition":"To be absent, deficient, or wanting."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmɪsɪz/"}]},{"word":"TROUBLES","idx":13804,"count":3008382,"meanings":[{"definitions":[{"definition":"A distressing or dangerous situation.","example":"He was in trouble when the rain started."},{"definition":"A difficulty, problem, condition, or action contributing to such a situation.","example":"The trouble was a leaking brake line.   The trouble with that suggestion is that we lack the funds to put it in motion.   The bridge column magnified the trouble with a slight tilt in the wrong direction."},{"definition":"A violent occurrence or event.","example":"the troubles in Northern Ireland"},{"definition":"Efforts taken or expended, typically beyond the normal required.","example":"It's no trouble for me to edit it."},{"definition":"A malfunction.","example":"He's been in hospital with some heart trouble.   My old car has engine trouble."},{"definition":"Liability to punishment; conflict with authority.","example":"He had some trouble with the law."},{"definition":"A fault or interruption in a stratum."},{"definition":"(Australian rhyming slang) Wife."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To disturb, stir up, agitate (a medium, especially water)."},{"definition":"To mentally distress; to cause (someone) to be anxious or perplexed.","example":"What she said about narcissism is troubling me."},{"definition":"In weaker sense: to bother or inconvenience.","example":"I will not trouble you to deliver the letter."},{"definition":"To take pains to do something.","example":"I won't trouble to post the letter today; I can do it tomorrow."},{"definition":"To worry; to be anxious."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"troubles-us","text":"/ˈtɹʌbl̩z/"}]},{"word":"FACTUAL","idx":13805,"count":3008091,"meanings":[{"definitions":[{"definition":"Pertaining to or consisting of objective claims."},{"definition":"True, accurate, corresponding to reality."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"factual-us","text":"/ˈfæk(t)ʃuəl/"}]},{"word":"TUTORING","idx":13807,"count":3007595,"meanings":[{"definitions":[{"definition":"To instruct or teach, especially an individual or small group.","example":"To help pay her tuition, the college student began to tutor high school students in calculus and physics."},{"definition":"To treat with authority or sternness."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Tuition"}],"partOfSpeech":"n"}]},{"word":"SPECTROSCOPY","idx":13808,"count":3007586,"meanings":[{"definitions":[{"definition":"The scientific study of spectra."},{"definition":"The use of spectrometers in chemical analysis."}],"partOfSpeech":"n"}]},{"word":"GEMSTONE","idx":13809,"count":3006848,"meanings":[{"definitions":[{"definition":"A gem, usually made of minerals."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gemstone-us","text":"/ˈdʒɛmˌstoʊn/"}]},{"word":"PURITY","idx":13813,"count":3005735,"meanings":[{"definitions":[{"definition":"The state or degree of being pure."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"purity-uk","text":"/ˈpjɔːɹɪti/"}]},{"word":"SHAKING","idx":13814,"count":3005624,"meanings":[{"definitions":[{"definition":"To cause (something) to move rapidly in opposite directions alternatingly.","example":"He shook the can of soda for thirty seconds before delivering it to me, so that, when I popped it open, soda went everywhere."},{"definition":"To move (one's head) from side to side, especially to indicate refusal, reluctance or disapproval.","example":"Shaking his head, he kept repeating \"No, no, no\"."},{"definition":"To move or remove by agitating; to throw off by a jolting or vibrating motion.","example":"to shake fruit down from a tree"},{"definition":"To disturb emotionally; to shock.","example":"He was shaken by what had happened."},{"definition":"To lose, evade, or get rid of (something).","example":"I can't shake the feeling that I forgot something."},{"definition":"To move from side to side.","example":"She shook with grief."},{"definition":"(usually as \"shake on\") To shake hands.","example":"OK, let's shake on it."},{"definition":"To dance.","example":"She was shaking it on the dance floor."},{"definition":"To give a tremulous tone to; to trill.","example":"to shake a note in music"},{"definition":"To threaten to overthrow.","example":"The experience shook my religious belief."},{"definition":"To be agitated; to lose firmness."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A movement that shakes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"shaking-us","text":"/ˈʃeɪkɪŋ/"}]},{"word":"UNREGISTERED","idx":13815,"count":3004589,"meanings":[{"definitions":[{"definition":"Not registered."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To undo the process of registration for."},{"definition":"To undo a registration process."}],"partOfSpeech":"ve"}]},{"word":"WITNESSED","idx":13816,"count":3002335,"meanings":[{"definitions":[{"definition":"To furnish proof of, to show.","example":"1667: round he throws his baleful eyes / That witness'd huge affliction and dismay — John Milton, Paradise Lost, Book 1 ll. 56-7"},{"definition":"To take as evidence."},{"definition":"To see or gain knowledge of through experience.","example":"He witnessed the accident."},{"definition":"(construed with to or for) To present personal religious testimony; to preach at (someone) or on behalf of."},{"definition":"To see the execution of (a legal instrument), and subscribe it for the purpose of establishing its authenticity.","example":"to witness a bond or a deed"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈwɪtnəst/"}]},{"word":"CELLAR","idx":13817,"count":3002258,"meanings":[{"definitions":[{"definition":"An enclosed underground space, often under a building, used for storage or shelter."},{"definition":"A wine collection, especially when stored in a cellar."},{"definition":"Last place in a league or competition."},{"definition":"Salt cellar"},{"definition":"A small dish for holding salt."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To store in a cellar."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsɛlɚ/"},{"text":"/ˈsɛlə(ɹ)/"},{"audio":"cellar-au"}]},{"word":"FRICTION","idx":13820,"count":3001167,"meanings":[{"definitions":[{"definition":"The rubbing of one object or surface against another."},{"definition":"A force that resists the relative motion or tendency to such motion of two bodies in contact."},{"definition":"Massage of the body to restore circulation."},{"definition":"Conflict, as between persons having dissimilar ideas or interests; clash."},{"definition":"(Second Sino-Japanese War) Conflict, as between the Communists and non-Hanjian Kuomintang forces."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"friction-us","text":"/ˈfɹɪkʃən̩/"}]},{"word":"PRONE","idx":13821,"count":3001079,"meanings":[{"definitions":[{"definition":"Lying face downward.","example":"prone position"},{"definition":"Having a downward inclination or slope."},{"definition":"Predisposed, liable, inclined.","example":"prone to failure"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹoʊn/"},{"text":"/pɹəʊn/"}]},{"word":"ENCLOSURES","idx":13823,"count":3000848,"meanings":[{"definitions":[{"definition":"Something enclosed, i.e. inserted into a letter or similar package.","example":"There was an enclosure with the letter — a photo."},{"definition":"The act of enclosing, i.e. the insertion or inclusion of an item in a letter or package.","example":"The enclosure of a photo with your letter is appreciated."},{"definition":"An area, domain, or amount of something partially or entirely enclosed by barriers.","example":"He faced punishment for creating the fenced enclosure in a public park."},{"definition":"The act of separating and surrounding an area, domain, or amount of something with a barrier.","example":"At first, untrained horses resist enclosure."},{"definition":"(British History) The post-feudal process of subdivision of common lands for individual ownership.","example":"Strip-farming disappeared after enclosure."},{"definition":"The area of a convent, monastery, etc where access is restricted to community members."}],"partOfSpeech":"n"}]},{"word":"MER","idx":13825,"count":3000228,"meanings":[{"definitions":[{"definition":"A repeat unit: a structural unit which through repetition forms a polymer."},{"definition":"Merpeople"}],"partOfSpeech":"n"}]},{"word":"EQUITABLE","idx":13826,"count":3000227,"meanings":[{"definitions":[{"definition":"Marked by or having equity."},{"definition":"Fair, just, or impartial."},{"definition":"Relating to the general principles of justice that correct or supplement the provisions of the law."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɛk.wɪ.tə.bəl/"}]},{"word":"FUSE","idx":13827,"count":2999474,"meanings":[{"definitions":[{"definition":"A cord that, when lit, conveys the fire to some explosive device."},{"definition":"The mechanism that ignites the charge in an explosive device."},{"definition":"A device to prevent the overloading of an electrical circuit, containing a component that melts and interrupts the current when too high a load is passed through it."},{"definition":"Indicating a tendency to lose one's temper.","example":"When talking about being laid off, he has a short fuse."},{"definition":"A friction match for smokers' use, having a bulbous head which when ignited is not easily blown out even in a gale of wind."},{"definition":"A kind of match made of paper impregnated with niter and having the usual igniting tip."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To melt together; to blend; to mix indistinguishably."},{"definition":"To melt together."},{"definition":"To furnish with or install a fuse."},{"definition":"To form a bicyclic compound from two similar or different types of ring such that two or more atoms are shared between the resulting rings"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fjuːz/"}]},{"word":"LOBSTER","idx":13828,"count":2997879,"meanings":[{"definitions":[{"definition":"A crustacean of the Nephropidae family, dark green or blue-black in colour turning bright red when cooked, with a hard shell and claws, which is used as a seafood."},{"definition":"A crustacean of the Palinuridae family, pinkish red in colour, with a hard, spiny shell but no claws, which is used as a seafood."},{"definition":"A soldier or officer of the imperial British Army (due to their red or scarlet uniform)."},{"definition":"An Australian twenty dollar note, due to its reddish-orange colour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for lobsters."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Red-colored, especially from a sunburn."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lobster-us","text":"/ˈlɑb.stɚ/"}]},{"word":"POPS","idx":13829,"count":2997678,"meanings":[{"definitions":[{"definition":"(usually as a form of address) Father, dad.","example":"Hey, pops, I'm home."},{"definition":"(usually as a form of address, by extension) A man old enough to be the speaker's father."},{"definition":"A loud, sharp sound as of a cork coming out of a bottle.","example":"Listen to the pop of a champagne cork."},{"definition":"(Midwest US) An effervescent or fizzy drink, most frequently nonalcoholic; soda pop.","example":"Lunch was sandwiches and a bottle of pop."},{"definition":"(Midwest US) A bottle, can, or serving of effervescent or fizzy drink, most frequently nonalcoholic; soda pop.","example":"Go in the store and buy us three pops."},{"definition":"A pop shot: a quick, possibly unaimed, shot with a firearm.","example":"The man with the gun took a pop at the rabbit."},{"definition":"(in the phrase \"a pop\") A quantity dispensed, a portion, apiece.","example":"They cost 50 pence a pop."},{"definition":"Something that stands out or is distinctive, especially to the senses.","example":"a pop of vanilla flavour"},{"definition":"The removal of a data item from the top of a stack."},{"definition":"A bird, the European redwing."},{"definition":"The sixth derivative of the position vector with respect to time (after velocity, acceleration, jerk, jounce, crackle), i.e. the rate of change of crackle."},{"definition":"A pistol."},{"definition":"Affectionate form of father.","example":"My pop used to tell me to do my homework every night."},{"definition":"(Russian Orthodoxy) A Russian Orthodox priest; a parson."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a pop, or sharp, quick sound.","example":"The muskets popped away on all sides."},{"definition":"To burst (something) with a popping sound.","example":"The boy with the pin popped the balloon."},{"definition":"(with in, out, upon, etc.) To enter, or issue forth, with a quick, sudden movement; to move from place to place suddenly; to dart.","example":"A rabbit popped out of the hole."},{"definition":"To place (something) (somewhere); to move or position (something) with a short movement.","example":"He popped his head around the door."},{"definition":"(often with over, round, along, etc.) To make a short trip or visit.","example":"I'll pop by your place later today."},{"definition":"To stand out; to be distinctive to the senses.","example":"This colour really pops."},{"definition":"To hit (something or someone).","example":"He popped me on the nose."},{"definition":"To shoot (usually somebody) with a firearm."},{"definition":"To ejaculate."},{"definition":"To remove (a data item) from the top of a stack."},{"definition":"To remove a data item from the top of (a stack)."},{"definition":"To pawn (something) (to raise money).","example":"I had to pop my watch to see me through until pay-day."},{"definition":"To swallow or consume (especially a tablet of a drug, sometimes extended to other small items such as sweets or candy)."},{"definition":"To perform (a move or stunt) while riding a board or vehicle."},{"definition":"(of the ears) To undergo equalization of pressure when the Eustachian tubes open.","example":"My ears popped as the aeroplane began to ascend."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɑps/"},{"audio":"pops-uk"}]},{"word":"OSHA","idx":13830,"count":2997648,"meanings":[{"definitions":[{"definition":"Ligusticum porteri, a perennial herb found in parts of the Rocky Mountains and northern Mexico."}],"partOfSpeech":"n"}]},{"word":"AMID","idx":13834,"count":2994953,"meanings":[{"definitions":[{"definition":"In the middle of; in the center of; surrounded by."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"amid-us","text":"/əˈmɪd/"}]},{"word":"ONIONS","idx":13835,"count":2994892,"meanings":[{"definitions":[{"definition":"A monocotyledonous plant (Allium cepa), allied to garlic, used as vegetable and spice."},{"definition":"The bulb of such a plant."},{"definition":"The genus as a whole."},{"definition":"A ball."},{"definition":"A person from Bermuda or of Bermudian descent."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"onions-us"}]},{"word":"PRETEEN","idx":13836,"count":2993232,"meanings":[{"definitions":[{"definition":"A child between 10 and 12 years of age, at the onset of adolescence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or designed for, or being children between the ages of approximately 10 and 12."}],"partOfSpeech":"j"}]},{"word":"BONDING","idx":13837,"count":2991787,"meanings":[{"definitions":[{"definition":"To connect, secure or tie with a bond; to bind.","example":"The gargantuan ape was bonded in iron chains and carted onto the stage."},{"definition":"To cause to adhere (one material with another).","example":"The children bonded their snapshots to the scrapbook pages with mucilage."},{"definition":"To form a chemical compound with.","example":"Under unusual conditions, even gold can be made to bond with other elements."},{"definition":"To guarantee or secure a financial risk.","example":"The contractor was bonded with a local underwriter."},{"definition":"To form a friendship or emotional connection.","example":"The men had bonded while serving together in Vietnam."},{"definition":"To put in a bonded warehouse; to secure (goods) until the associated duties are paid."},{"definition":"To lay bricks in a specific pattern."},{"definition":"To make a reliable electrical connection between two conductors (or any pieces of metal that may potentially become conductors).","example":"A house's distribution panel should always be bonded to the grounding rods via a panel bond."},{"definition":"To bail out by means of a bail bond."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is bonded or joined together."},{"definition":"A relationship between a parent and offspring that establishes the basis for an ongoing mutual attachment."},{"definition":"A close friendship that develops between adults, often as a result of intense experiences, as those shared in military combat."},{"definition":"A method of aggregating multiple network interfaces on a computer into a single logical interface"},{"definition":"An arrangement by which goods remain in the customs warehouses until the duties are paid."}],"partOfSpeech":"n"}]},{"word":"INSURERS","idx":13838,"count":2991634,"meanings":[{"definitions":[{"definition":"One who insures.","example":"After the accident I contacted the insurer who paid for the repairs."}],"partOfSpeech":"n"}]},{"word":"PROTOTYPES","idx":13839,"count":2991340,"meanings":[{"definitions":[{"definition":"An original form or object which is a basis for other forms or objects (particularly manufactured items), or for its generalizations and models."},{"definition":"An early sample or model built to test a concept or process.","example":"The prototype had loose wires and rough edges, but it worked."},{"definition":"A declaration of a function that specifies the name, return type, and parameters, but none of the body or actual code."},{"definition":"An instance of a category or a concept that combines its most representative attributes.","example":"A robin is a prototype of a bird; a penguin is not."},{"definition":"A type of race car, a racing sports car not based on a production car. A 4-wheeled cockpit-seating car built especially for racing on sports car circuits, that does not use the silhouette related to a consumer road car."}],"partOfSpeech":"n"}]},{"word":"CORINTHIANS","idx":13840,"count":2991171,"meanings":[{"definitions":[{"definition":"An inhabitant or a resident of Corinth, and its suburbs."},{"definition":"An inhabitant, a resident of; a thing that originates from Corinthia"},{"definition":"An accomplished amateur athlete."},{"definition":"A sailboat owner who helms his or her own boat in competitive racing."},{"definition":"A worldly, fashionable person, accepted in society though possibly dissolute."},{"definition":"(manège) Horse show-class in which contestants are members of a formal hunt and wear its livery, as opposed to appointment show-class."},{"definition":"A small tubular wafer used in desserts."}],"partOfSpeech":"n"}]},{"word":"CROSSES","idx":13841,"count":2991145,"meanings":[{"definitions":[{"definition":"A geometrical figure consisting of two straight lines or bars intersecting each other such that at least one of them is bisected by the other.","example":"Put a cross for a wrong answer and a tick for a right one."},{"definition":"Any geometric figure having this or a similar shape, such as a cross of Lorraine or a Maltese cross."},{"definition":"A wooden post with a perpendicular beam attached and used (especially in the Roman Empire) to execute criminals (by crucifixion).","example":"Criminals were commonly executed on a wooden cross."},{"definition":"(usually with the) The cross on which Christ was crucified."},{"definition":"A hand gesture made in imitation of the shape of the Cross.","example":"She made the cross after swearing."},{"definition":"A modified representation of the crucifixion stake, worn as jewellery or displayed as a symbol of religious devotion.","example":"She was wearing a cross on her necklace."},{"definition":"(figurative, from Christ's bearing of the cross) A difficult situation that must be endured.","example":"It's a cross I must bear."},{"definition":"The act of going across; the act of passing from one side to the other","example":"A quick cross of the road."},{"definition":"An animal or plant produced by crossbreeding or cross-fertilization."},{"definition":"(by extension) A hybrid of any kind."},{"definition":"A hook thrown over the opponent's punch."},{"definition":"A pass in which the ball travels from by one touchline across the pitch."},{"definition":"A place where roads intersect and lead off in four directions; a crossroad (common in UK and Irish place names such as Gerrards Cross)."},{"definition":"A monument that marks such a place. (Also common in UK or Irish place names such as Charing Cross)"},{"definition":"A coin stamped with the figure of a cross, or that side of such a piece on which the cross is stamped; hence, money in general."},{"definition":"Church lands."},{"definition":"A line drawn across or through another line."},{"definition":"An instrument for laying of offsets perpendicular to the main course."},{"definition":"A pipe-fitting with four branches whose axes usually form a right angle."},{"definition":"(Rubik's Cube) Four edge cubies of one side that are in their right places, forming the shape of a cross."},{"definition":"The thirty-sixth Lenormand card."},{"definition":"Crossfire."},{"definition":"A lacrosse stick."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make or form a cross."},{"definition":"To move relatively."},{"definition":"(social) To oppose."},{"definition":"To cross-fertilize or crossbreed.","example":"They managed to cross a sheep with a goat."},{"definition":"To stamp or mark (a cheque) in such a way as to prevent it being cashed, thus requiring it to be deposited into a bank account."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crosses-us","text":"/ˈkɹɔsɪz/"}]},{"word":"PROACTIVE","idx":13842,"count":2990726,"meanings":[{"definitions":[{"definition":"Acting in advance to deal with an expected change or difficulty","example":"We can deal with each problem as it pops up, or we can take a proactive stance and try to prevent future problems."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"proactive-us"}]},{"word":"ISSUER","idx":13843,"count":2990187,"meanings":[{"definitions":[{"definition":"One who issues, emits, or publishes."}],"partOfSpeech":"n"}]},{"word":"UNCOMFORTABLE","idx":13844,"count":2989842,"meanings":[{"definitions":[{"definition":"Not comfortable; causing discomfort.","example":"The class squirmed and fidgeted in the uncomfortable new chairs."},{"definition":"Experiencing discomfort."},{"definition":"Uneasy or anxious.","example":"Sharing a house with them made me uncomfortable."},{"definition":"Put off or disgusted."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"uncomfortable-us","text":"/ʌnˈkʌm.fɚ.tə.bəl/"}]},{"word":"FURNACE","idx":13846,"count":2989498,"meanings":[{"definitions":[{"definition":"An industrial heating device, e.g. for smelting metal or baking ceramics."},{"definition":"A device that provides heat for a building; a space heater."},{"definition":"Any area that is excessively hot."},{"definition":"A place or time of punishment, affliction, or great trial; severe experience or discipline."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To heat in a furnace."},{"definition":"To exhale like a furnace."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"furnace-us","text":"/ˈfɝnɪs/"}]},{"word":"SPONSORING","idx":13847,"count":2989475,"meanings":[{"definitions":[{"definition":"To be a sponsor for."}],"partOfSpeech":"ve"}]},{"word":"POISONING","idx":13848,"count":2989025,"meanings":[{"definitions":[{"definition":"To use poison to kill or paralyse (somebody).","example":"The assassin poisoned the king."},{"definition":"To pollute; to cause to become poisonous.","example":"That factory is poisoning the river."},{"definition":"To cause to become much worse.","example":"He poisoned the mood in the room with his non-stop criticism."},{"definition":"To cause (someone) to hate or to have unfair negative opinions.","example":"She's poisoned him against all his old friends."},{"definition":"To inhibit the catalytic activity of."},{"definition":"To place false information into (a cache) as part of an exploit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The administration of a poison."},{"definition":"The state of being poisoned."}],"partOfSpeech":"n"}]},{"word":"DOUBLED","idx":13849,"count":2988769,"meanings":[{"definitions":[{"definition":"To multiply by two.","example":"The company doubled their earnings per share over last quarter."},{"definition":"To fold over so as to make two folds.","example":"To make a pleat, double the material at the waist."},{"definition":"To be the double of; to exceed by twofold; to contain or be worth twice as much as."},{"definition":"To increase by 100%, to become twice as large in size.","example":"Our earnings have doubled in the last year."},{"definition":"To get a two-base hit.","example":"The batter doubled into the corner."},{"definition":"(sometimes followed by up) To clench (a fist)."},{"definition":"(often followed by together or up) To join or couple."},{"definition":"To repeat exactly; copy."},{"definition":"(often followed by as) To play a second part or serve a second role.","example":"A spork is a kind of fork that doubles as a spoon."},{"definition":"To turn sharply, following a winding course."},{"definition":"To sail around (a headland or other point)."},{"definition":"To duplicate (a part) either in unison or at the octave above or below it."},{"definition":"(usually followed by \"on\") To be capable of performing (upon an additional instrument)."},{"definition":"To make a call that will double certain scoring points if the preceding bid becomes the contract."},{"definition":"To double down."},{"definition":"To cause (a ball) to rebound from a cushion before entering the pocket."},{"definition":"(followed by for) To act as substitute."},{"definition":"To go or march at twice the normal speed."},{"definition":"To multiply the strength or effect of by two.","example":"Sorry, this store does not double coupons."},{"definition":"To unite, as ranks or files, so as to form one from each two."},{"definition":"(of a station) To transmit simultaneously on the same channel as another station, either unintentionally or deliberately, causing interference.","example":"Could you please repeat your last transmission? Another station was doubling with you."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdʌbl̩d/"}]},{"word":"CLUES","idx":13851,"count":2988321,"meanings":[{"definitions":[{"definition":"A strand of yarn etc. as used to guide one through a labyrinth; something which points the way, a guide."},{"definition":"Information which may lead one to a certain point or conclusion."},{"definition":"An object or a kind of indication which may be used as evidence."},{"definition":"Insight or understanding (\"to have a clue [about]\" or \"to have clue\". See have a clue, clue stick)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide with a clue.","example":"The crossword compiler wasn't sure how to clue the word \"should\"."},{"definition":"To provide someone with information which he or she lacks (often used with \"in\" or \"up\").","example":"Smith, clue Jones in on what's been happening."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kluːz/"}]},{"word":"INFLAMMATION","idx":13852,"count":2988315,"meanings":[{"definitions":[{"definition":"The act of inflaming, kindling, or setting on fire."},{"definition":"The state of being inflamed"},{"definition":"A condition of any part of the body, consisting of congestion of the blood vessels, with obstruction of the blood current, and growth of morbid tissue. It is manifested outwardly by redness and swelling, attended with heat and pain."},{"definition":"Violent excitement","example":"an inflammation of the mind, of the body politic, or of parties"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"inflammation-us","text":"/ɪnfləˈmeɪʃən/"}]},{"word":"RABBITS","idx":13853,"count":2987721,"meanings":[{"definitions":[{"definition":"A mammal of the family Leporidae, with long ears, long hind legs and a short, fluffy tail.","example":"The pioneers survived by eating the small game they could get: rabbits, squirrels and occasionally a raccoon."},{"definition":"The meat from this animal."},{"definition":"The fur of a rabbit typically used to imitate another animal's fur."},{"definition":"A runner in a distance race whose goal is mainly to set the pace, either to tire a specific rival so that a teammate can win or to help another break a record; a pacesetter."},{"definition":"A very poor batsman; selected as a bowler or wicket-keeper."},{"definition":"A large element at the beginning of a list of items to be bubble sorted, and thus tending to be quickly swapped into its correct position. Compare turtle."},{"definition":"Rarebit; Welsh rabbit or a similar dish: melted cheese served atop toast."}],"partOfSpeech":"n"}]},{"word":"TRANSPORTED","idx":13855,"count":2986479,"meanings":[{"definitions":[{"definition":"To carry or bear from one place to another; to remove; to convey.","example":"to transport goods; to transport troops"},{"definition":"To deport to a penal colony."},{"definition":"To move (someone) to strong emotion; to carry away.","example":"Music transports the soul."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"transported-us","text":"/tɹænzˈpɔɹtɪd/"}]},{"word":"CREWS","idx":13856,"count":2986282,"meanings":[{"definitions":[{"definition":"A pen for livestock such as chickens or pigs"},{"definition":"The Manx shearwater."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɹuːz/"}]},{"word":"GOODWILL","idx":13858,"count":2985605,"meanings":[{"definitions":[{"definition":"A favorably disposed attitude toward someone or something."},{"definition":"The value of a business entity not directly attributable to its tangible assets and liabilities. This value derives from factors such as consumer loyalty to the brand."},{"definition":"A concept used to refer to the ability of an individual or business to exert influence within a community, club, market or another type of group, without having to resort to the use of an asset (such as money or property), either directly or by the creation of a lien."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡʊdˈwɪl/"}]},{"word":"SENTENCING","idx":13859,"count":2985420,"meanings":[{"definitions":[{"definition":"To declare a sentence on a convicted person; to doom; to condemn to punishment.","example":"The judge sentenced the embezzler to ten years in prison, along with a hefty fine."},{"definition":"To decree or announce as a sentence."},{"definition":"To utter sententiously."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of pronouncing a judicial sentence on someone convicted of a crime.","example":"After the verdict, the sentencing was not delayed."},{"definition":"The act of creating one or more complete sentences from fragmented thoughts and phrases.","example":"He struggled with sentencing his frayed and angry verses from poem to prose."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to a judicial sentence.","example":"There were no sentencing guidelines for this crime."}],"partOfSpeech":"j"}]},{"word":"BULLDOGS","idx":13860,"count":2985164,"meanings":[{"definitions":[{"definition":"A breed of dog developed in England by the crossing of the bullbaiting dog and the Pug to produce a ladies companion dog. Having a very smooth coat, a flattened face, wrinkly cheeks, powerful front legs and smaller hind legs."},{"definition":"British bulldog"},{"definition":"A stubborn person."},{"definition":"A refractory material used as a furnace lining, obtained by calcining the cinder or slag from the puddling furnace of a rolling mill."},{"definition":"(Oxford University slang) One of the proctors' officers."},{"definition":"(pro wrestling) Any move in which the wrestler grabs an opponent's head and jumps forward, so that the wrestler lands, often in a sitting position, and drives the opponent's face into the mat."},{"definition":"A bulldog edition."}],"partOfSpeech":"n"}]},{"word":"WORTHWHILE","idx":13861,"count":2984982,"meanings":[{"definitions":[{"definition":"Good and important enough to spend time, effort, or money on.","example":"Doing volunteer work to help others is truly worthwhile."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/wɜː(ɹ)θˈwaɪl/"}]},{"word":"IDEOLOGY","idx":13862,"count":2984596,"meanings":[{"definitions":[{"definition":"Doctrine, philosophy, body of beliefs or principles belonging to an individual or group.","example":"A dictatorship, in order to secure its reign, bans things that do not conform to its ideology."},{"definition":"The study of the origin and nature of ideas."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ideology-us","text":"/aɪ.di.ˈɑl.ə.d͡ʒi/"}]},{"word":"ANXIOUS","idx":13863,"count":2984563,"meanings":[{"definitions":[{"definition":"Nervous and worried."},{"definition":"Having a feeling of anxiety or disquietude; extremely concerned, especially about something that will happen in the future or that is unknown.","example":"I could tell she was anxious as she was biting her nails."},{"definition":"(of things) Accompanied with, or causing, anxiety; worrying.","example":"There was an anxious wait before the results were revealed."},{"definition":"Earnestly desirous.","example":"All the voters were anxious to hear the election result."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"anxious-us","text":"/ˈæŋ(k).ʃəs/"}]},{"word":"TARIFFS","idx":13864,"count":2983891,"meanings":[{"definitions":[{"definition":"A system of government-imposed duties levied on imported or exported goods; a list of such duties, or the duties themselves."},{"definition":"A schedule of rates, fees or prices."},{"definition":"A sentence determined according to a scale of standard penalties for certain categories of crime."}],"partOfSpeech":"n"}]},{"word":"LY","idx":13866,"count":2982836,"meanings":[{"definitions":[{"definition":"A unit of length (abbreviation ly; equal to just under 10 trillion kilometres (1016 metres)) equal to the distance light travels in one Julian year; used to measure extremely large distances."},{"definition":"(only in plural) A very long way.","example":"The marathon runner in the lead is light years ahead of the one at the back."},{"definition":"(only in plural) A very long time.","example":"Some of Leonardo da Vinci’s inventions were light years ahead of their time."}],"partOfSpeech":"n"}]},{"word":"CERVICAL","idx":13867,"count":2982755,"meanings":[{"definitions":[{"definition":"A cervical vertebra"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of the neck","example":"cervical pain"},{"definition":"Of the cervix","example":"cervical cancer"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɝːvɨkl̩/"}]},{"word":"BAPTISM","idx":13868,"count":2982668,"meanings":[{"definitions":[{"definition":"A Christian sacrament, by which one is received into a church and sometimes given a name, generally involving the candidate to be anointed with or submerged in water."},{"definition":"A similar ceremony of initiation, purification or naming."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"baptism-us","text":"/ˈbæptɪzəm/"}]},{"word":"CUTLERY","idx":13869,"count":2982254,"meanings":[{"definitions":[{"definition":"A collective ensemble of eating and serving utensils such as knives, forks and spoons."},{"definition":"The business of a cutler."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkʌt.lə.ɹi/"}]},{"word":"OVERLOOKING","idx":13870,"count":2981818,"meanings":[{"definitions":[{"definition":"To offer a view (of something) from a higher position.","example":"Our hotel room overlooks the lake."},{"definition":"To fail to notice; to look over and beyond (anything) without seeing it.","example":"These errors were overlooked by the proofreaders."},{"definition":"To pretend not to have noticed (something, especially a mistake or flaw); to pass over (something) without censure or punishment.","example":"I’m not willing to overlook such bad behaviour."},{"definition":"To look down upon (something) from a place that is over or above.","example":"to overlook a valley from a hill"},{"definition":"To supervise, oversee; to watch over.","example":"to overlook a gang of laborers"},{"definition":"To observe or watch (someone or something) surreptitiously or secretly."},{"definition":"To inspect (something); to examine; to look over carefully or repeatedly."},{"definition":"To look upon with an evil eye; to bewitch by looking upon; to fascinate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"overlooking-us"}]},{"word":"KNOT","idx":13873,"count":2980542,"meanings":[{"definitions":[{"definition":"A looping of a piece of string or of any other long, flexible material that cannot be untangled without passing one or both ends of the material through its loops.","example":"Climbers must make sure that all knots are both secure and of types that will not weaken the rope."},{"definition":"(of hair, etc) A tangled clump.","example":"The nurse was brushing knots from the protesting child's hair."},{"definition":"A maze-like pattern."},{"definition":"A non-self-intersecting closed curve in (e.g., three-dimensional) space that is an abstraction of a knot (in sense 1 above).","example":"A knot can be defined as a non-self-intersecting broken line whose endpoints coincide: when such a knot is constrained to lie in a plane, then it is simply a polygon."},{"definition":"A difficult situation.","example":"I got into a knot when I inadvertently insulted a policeman."},{"definition":"The whorl left in lumber by the base of a branch growing out of the tree's trunk.","example":"When preparing to tell stories at a campfire, I like to set aside a pile of pine logs with lots of knots, since they burn brighter and make dramatic pops and cracks."},{"definition":"Local swelling in a tissue area, especially skin, often due to injury.","example":"Jeremy had a knot on his head where he had bumped it on the bedframe."},{"definition":"A protuberant joint in a plant."},{"definition":"Any knob, lump, swelling, or protuberance."},{"definition":"The swelling of the bulbus glandis in members of the dog family, Canidae"},{"definition":"The point on which the action of a story depends; the gist of a matter.","example":"the knot of the tale"},{"definition":"A node."},{"definition":"A kind of epaulet; a shoulder knot."},{"definition":"A group of people or things."},{"definition":"A bond of union; a connection; a tie."},{"definition":"A unit of speed, equal to one nautical mile per hour. (From the practice of counting the number of knots in the log-line (as it is paid out) in a standard time. Traditionally spaced at one every 1/120 of a mile.)","example":"Cedric claimed his old yacht could make 12 knots."},{"definition":"A nautical mile"},{"definition":"The bulbus glandis"},{"definition":"In omegaverse fiction, a bulbus glandis-like structure on the penis of a male alpha, which ties him to an omega during intercourse."},{"definition":"One of a variety of shore birds; the red-breasted sandpiper (variously Calidris canutus or Tringa canutus)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into a knot; to tie with a knot or knots.","example":"We knotted the ends of the rope to keep it from unravelling."},{"definition":"To form wrinkles in the forehead, as a sign of concentration, concern, surprise, etc.","example":"She knotted her brow in concentration while attempting to unravel the tangled strands."},{"definition":"To unite closely; to knit together."},{"definition":"To entangle or perplex; to puzzle."},{"definition":"To form knots."},{"definition":"To knit knots for a fringe."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"knot-us","text":"/nɑt/"}]},{"word":"ATTRIBUTION","idx":13874,"count":2980395,"meanings":[{"definitions":[{"definition":"The act of attributing something."},{"definition":"An explicit or formal acknowledgment of ownership or authorship.","example":"The attribution of the quote is widely regarded as dubious."},{"definition":"A legal doctrine by which liability is extended to a defendant who did not actually commit the tortious or criminal act."}],"partOfSpeech":"n"}]},{"word":"RAD","idx":13875,"count":2980258,"meanings":[{"definitions":[{"definition":"A non-SI unit of absorbed dose of radiation, equal to 0.01 gray."},{"definition":"In the International System of Units, the derived unit of plane angular measure of angle equal to the angle subtended at the centre of a circle by an arc of its circumference equal in length to the radius of the circle. Symbol: rad"},{"definition":"Anything which radiates or emits rays."},{"definition":"A device that lowers engine coolant temperature by conducting heat to the air, through metal fins."},{"definition":"(of buildings) A finned metal fixture that carries hot water or steam in order to heat a room."},{"definition":"A type of antenna."},{"definition":"The distance between the front and rear sights of a firearm."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Favoring fundamental change, or change at the root cause of a matter.","example":"His beliefs are radical."},{"definition":"Pertaining to a root (of a plant)."},{"definition":"Pertaining to the basic or intrinsic nature of something."},{"definition":"Thoroughgoing; far-reaching.","example":"The spread of the cancer required radical surgery, and the entire organ was removed."},{"definition":"Of or pertaining to the root of a word."},{"definition":"(of a sound) Produced using the root of the tongue."},{"definition":"Involving free radicals."},{"definition":"Relating to a radix or mathematical root.","example":"a radical quantity; a radical sign"},{"definition":"(1980s & 1990s) Excellent; awesome.","example":"That was a radical jump!"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹæd/"},{"audio":"rad-au"}]},{"word":"GUT","idx":13876,"count":2979963,"meanings":[{"definitions":[{"definition":"The alimentary canal, especially the intestine."},{"definition":"The abdomen of a person, especially one that is enlarged","example":"beer gut"},{"definition":"The intestines of an animal used to make strings of a tennis racket or violin, etc."},{"definition":"A person's emotional, visceral self.","example":"I have a funny feeling in my gut."},{"definition":"A class that is not demanding or challenging.","example":"You should take Intro Astronomy: it's a gut."},{"definition":"A narrow passage of water.","example":"the Gut of Canso"},{"definition":"The sac of silk taken from a silkworm when ready to spin its cocoon, for the purpose of drawing it out into a thread. When dry, it is exceedingly strong, and is used as the snood of a fishing line."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eviscerate.","example":"The fisherman guts the fish before cooking them."},{"definition":"To remove or destroy the most important parts of.","example":"Congress gutted the welfare bill."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made of gut.","example":"a violin with gut strings"},{"definition":"Instinctive.","example":"gut reaction"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gut","text":"/ɡʌt/"}]},{"word":"FACTORIES","idx":13878,"count":2979486,"meanings":[{"definitions":[{"definition":"A trading establishment, especially set up by merchants working in a foreign country."},{"definition":"The position or state of being a factor."},{"definition":"A building or other place where manufacturing takes place."},{"definition":"A device which produces or manufactures something."},{"definition":"A factory farm.","example":"chicken factory; pig factory"},{"definition":"In a computer program or library, a function, method, etc. which creates an object."},{"definition":"A police station."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"factories-us"}]},{"word":"SWORDS","idx":13880,"count":2979433,"meanings":[{"definitions":[{"definition":"A long-bladed weapon with a hilt, and usually a pommel and cross-guard, which is designed to stab, slash, and/or hack."},{"definition":"A suit in the minor arcana in tarot."},{"definition":"A card of this suit."},{"definition":"One of the end bars by which the lay of a hand loom is suspended."},{"definition":"The weapon, often used as a heraldic charge."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"swords-us","text":"/sɔɹdz/"}]},{"word":"ADVANCING","idx":13881,"count":2978593,"meanings":[{"definitions":[{"definition":"To promote or advantage."},{"definition":"To move forward in space or time."},{"definition":"To raise, be raised."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of proceeding forward; an advance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"advancing-us","text":"/ədˈvænsɪŋ/"}]},{"word":"YEP","idx":13882,"count":2978207,"meanings":[{"definitions":[{"definition":"Yes.","example":"I'll take that as a yep, then."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Yes."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/jɛp/"}]},{"word":"TIMED","idx":13883,"count":2978189,"meanings":[{"definitions":[{"definition":"To measure or record the time, duration, or rate of.","example":"I used a stopwatch to time myself running around the block."},{"definition":"To choose when something begins or how long it lasts.","example":"The President timed his speech badly, coinciding with the Super Bowl."},{"definition":"To keep or beat time; to proceed or move in time."},{"definition":"To pass time; to delay."},{"definition":"To regulate as to time; to accompany, or agree with, in time of movement."},{"definition":"To measure, as in music or harmony."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Happening at a certain time."},{"definition":"Regulated by time."}],"partOfSpeech":"j"}]},{"word":"EVOLVE","idx":13884,"count":2978181,"meanings":[{"definitions":[{"definition":"To move in regular procession through a system."},{"definition":"To change; transform."},{"definition":"To come into being; develop."},{"definition":"Of a population, to change genetic composition over successive generations through the process of evolution."},{"definition":"To give off (gas, such as oxygen or carbon dioxide during a reaction).","example":"to evolve odours"},{"definition":"To cause something to change or transform."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"evolve-uk","text":"/ɪˈvɒlv/"}]},{"word":"YUAN","idx":13885,"count":2977890,"meanings":[{"definitions":[{"definition":"The basic unit of money in China."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈjuən/"},{"text":"/jʊˈɑːn/"}]},{"word":"DIFFERS","idx":13887,"count":2977596,"meanings":[{"definitions":[{"definition":"Not to have the same traits or characteristics; to be unalike or distinct.","example":"These shoes only differ from those ones in having slightly longer laces."},{"definition":"(people, groups, etc.) To have diverging opinions, disagree."},{"definition":"To be separated in quantity.","example":"The numbers 3 and 21 differ by 18."}],"partOfSpeech":"ve"}]},{"word":"ESA","idx":13888,"count":2975827,"meanings":[{"definitions":[{"definition":"Initialism of European Space Agency."},{"definition":"Initialism of Entertainment Software Association."},{"definition":"Initialism of Ecological Society of America."}],"partOfSpeech":"pn"}]},{"word":"SUSPICIOUS","idx":13889,"count":2975648,"meanings":[{"definitions":[{"definition":"Arousing suspicion.","example":"His suspicious behaviour brought him to the attention of the police."},{"definition":"Distrustful or tending to suspect.","example":"I have a suspicious attitude to get-rich-quick schemes."},{"definition":"Expressing suspicion","example":"She gave me a suspicious look."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"suspicious-us","text":"/səˈspɪ.ʃəs/"}]},{"word":"LEASED","idx":13890,"count":2975373,"meanings":[{"definitions":[{"definition":"(chiefly dialectal) To gather."},{"definition":"(chiefly dialectal) To pick, select, pick out; to pick up."},{"definition":"(chiefly dialectal) To glean."},{"definition":"(chiefly dialectal) To glean, gather up leavings."},{"definition":"To tell lies; tell lies about; slander; calumniate."},{"definition":"To release; let go; unloose."},{"definition":"To operate or live in some property or land through purchasing a long-term contract (or leasehold) from the owner (or freeholder)."},{"definition":"To take or hold by lease."},{"definition":"To grant a lease; to let or rent."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Transferred under the terms of a lease."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/list/"}]},{"word":"SUBSCRIBED","idx":13891,"count":2975066,"meanings":[{"definitions":[{"definition":"To sign up to have copies of a publication, such as a newspaper or a magazine, delivered for a period of time.","example":"Would you like to subscribe or subscribe a friend to our new magazine, Lexicography Illustrated?"},{"definition":"To pay for the provision of a service, such as Internet access or a cell phone plan."},{"definition":"To believe or agree with a theory or an idea (used with to).","example":"I don’t subscribe to that theory."},{"definition":"To pay money to be a member of an organization."},{"definition":"To contribute or promise to contribute money to a common fund."},{"definition":"To promise to give, by writing one's name with the amount.","example":"Each man subscribed ten dollars."},{"definition":"To agree to buy shares in a company."},{"definition":"To sign; to mark with one's signature as a token of consent or attestation.","example":"Officers subscribe their official acts, and secretaries and clerks subscribe copies or records."},{"definition":"To write (one’s name) at the bottom of a document; to sign (one's name)."},{"definition":"To sign away; to yield; to surrender."},{"definition":"To yield; to admit to being inferior or in the wrong."},{"definition":"To declare over one's signature; to publish."},{"definition":"To indicate interest in the communications made by a person or organization.","example":"My YouTube channel has reached 100,000 subscribers."}],"partOfSpeech":"ve"}]},{"word":"STARTERS","idx":13893,"count":2974525,"meanings":[{"definitions":[{"definition":"Someone who starts something.","example":"a starter on a journey"},{"definition":"Something that starts something.","example":"It's small, but it's a good starter house."},{"definition":"The first course of a meal, consisting of a small, usually savoury, dish."},{"definition":"(team sports) A player in the lineup of players that a team fields at the beginning of a game."},{"definition":"A dog that rouses game."},{"definition":"A short length of rope formerly used for casual chastisement in the Navy."},{"definition":"A railway signal controlling the starting of trains from a station or some other location, more fully called a starter signal or starting signal."}],"partOfSpeech":"n"}]},{"word":"BREWING","idx":13895,"count":2974086,"meanings":[{"definitions":[{"definition":"To make tea or coffee by mixing tea leaves or coffee beans with hot water."},{"definition":"To heat wine, infusing it with spices; to mull."},{"definition":"To make a hot soup by combining ingredients and boiling them in water."},{"definition":"To make beer by steeping a starch source in water and fermenting the resulting sweet liquid with yeast."},{"definition":"To foment or prepare, as by brewing"},{"definition":"To attend to the business, or go through the processes, of brewing or making beer."},{"definition":"(of an unwelcome event) To be in a state of preparation; to be mixing, forming, or gathering."},{"definition":"To boil or seethe; to cook."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The production of alcoholic beverages, such as beer, by fermentation; the process of being brewed."},{"definition":"The business or occupation of a brewer."},{"definition":"The quantity of a brew made in a single batch."},{"definition":"The forming of a storm or the gathering of clouds."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɹuːɪŋ/"}]},{"word":"COOP","idx":13896,"count":2973997,"meanings":[{"definitions":[{"definition":"A basket, pen or enclosure for birds or small animals."},{"definition":"A wickerwork basket (kipe) or other enclosure for catching fish."},{"definition":"A narrow place of confinement, a cage; a jail, a prison."},{"definition":"A barrel or cask for holding liquids."},{"definition":"A cart with sides and ends made from boards, enabling it to carry manure, etc."},{"definition":"A cart which opens at the back to release its load; a tumbril."},{"definition":"A small heap."},{"definition":"A unit of a housing co-operative; a purchased apartment where the apartment owners collectively are responsible for maintenance of common areas and upkeep."},{"definition":"Any co-operative, including housing, retail, utility, agricultural, banking or worker cooperatives."},{"definition":"Any shop owned by a co-operative."},{"definition":"A co-operative game, as opposed to a competitive game or deathmatch."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To keep in a coop."},{"definition":"To shut up or confine in a narrow space; to cramp."},{"definition":"To unlawfully confine one or more voters to prevent them from casting their ballots in an election."},{"definition":"(law enforcement) Of a police officer: to sleep or relax while on duty."},{"definition":"To make or repair barrels, casks and other wooden vessels; to work upon in the manner of a cooper."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kuːp/"},{"audio":"coop-1-au"}]},{"word":"BUR","idx":13898,"count":2973485,"meanings":[{"definitions":[{"definition":"A rough, prickly husk around the seeds or fruit of some plants."},{"definition":"Any of several plants having such husks."},{"definition":"A rotary cutting implement having a selection of variously shaped heads."},{"definition":"A tree growth in which the grain has grown in a deformed manner."},{"definition":"Wood of a mottled veneer, usually cut from such a growth."},{"definition":"A knot or lump in thread or cloth."},{"definition":"A sharp, pointy object, such as a sliver or splinter."},{"definition":"A bur; a seed pod with sharp features that stick in fur or clothing."},{"definition":"A small piece of material left on an edge after a cutting operation."},{"definition":"A thin flat piece of metal, formed from a sheet by punching; a small washer put on the end of a rivet before it is swaged down."},{"definition":"A broad iron ring on a tilting lance just below the grip, to prevent the hand from slipping."},{"definition":"The ear lobe."},{"definition":"The knot at the bottom of an antler."},{"definition":"A rough humming sound."},{"definition":"A uvular \"r\"."},{"definition":"A metal ring at the top of the hand-rest on a spear."}],"partOfSpeech":"n"}]},{"word":"BLOSSOM","idx":13899,"count":2972811,"meanings":[{"definitions":[{"definition":"A flower, especially one indicating that a fruit tree is fruiting; a mass of such flowers.","example":"The blossom has come early this year."},{"definition":"The state or season of producing such flowers.","example":"The orchard is in blossom."},{"definition":"A blooming period or stage of development; something lovely that gives rich promise."},{"definition":"The colour of a horse that has white hairs intermixed with sorrel and bay hairs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have, or open into, blossoms; to bloom."},{"definition":"To begin to thrive or flourish."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"blossom-us","text":"/ˈblɑ.səm/"}]},{"word":"SCARE","idx":13900,"count":2972708,"meanings":[{"definitions":[{"definition":"A minor fright.","example":"Johnny had a bad scare last night."},{"definition":"A cause of slight terror; something that inspires fear or dread.","example":"a food-poisoning scare"},{"definition":"A device or object used to frighten."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To frighten, terrify, startle, especially in a minor way.","example":"Did it scare you when I said \"Boo!\"?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lean; scanty"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"scare-us","text":"/skɛɚ/"}]},{"word":"CONFESSIONS","idx":13901,"count":2971262,"meanings":[{"definitions":[{"definition":"The open admittance of having done something (especially something bad).","example":"Without the real murderer's confession, an innocent person will go to jail."},{"definition":"A formal document providing such an admission.","example":"He forced me to sign a confession!"},{"definition":"The disclosure of one's sins to a priest for absolution. In the Roman Catholic Church, it is now termed the sacrament of reconciliation.","example":"I went to confession and now I feel much better about what I had done."},{"definition":"Acknowledgment of belief; profession of one's faith."},{"definition":"A formula in which the articles of faith are comprised; a creed to be assented to or signed, as a preliminary to admission to membership of a church; a confession of faith."}],"partOfSpeech":"n"}]},{"word":"BERGEN","idx":13902,"count":2971198,"meanings":[{"definitions":[{"definition":"A large rucksack."}],"partOfSpeech":"n"}]},{"word":"LOWERED","idx":13903,"count":2971192,"meanings":[{"definitions":[{"definition":"To frown; to look sullen."},{"definition":"To be dark, gloomy, and threatening, as clouds; of the sky: to be covered with dark and threatening clouds; to show threatening signs of approach, as a tempest."},{"definition":"To let descend by its own weight, as something suspended; to let down","example":"lower a bucket into a well"},{"definition":"To pull down","example":"to lower a flag"},{"definition":"To reduce the height of","example":"lower a chimney or turret"},{"definition":"To depress as to direction","example":"lower the aim of a gun"},{"definition":"To make less elevated","example":"to lower one's ambition, aspirations, or hopes"},{"definition":"To reduce the degree, intensity, strength, etc., of","example":"lower distilled liquors"},{"definition":"To bring down; to humble","example":"lower one's pride"},{"definition":"(lower oneself) To humble oneself; to do something one considers to be beneath one's dignity.","example":"I could never lower myself enough to buy second-hand clothes."},{"definition":"To reduce (something) in value, amount, etc.","example":"lower the interest rate"},{"definition":"To fall; to sink; to grow less; to diminish; to decrease","example":"The river lowered as rapidly as it rose."},{"definition":"To decrease in value, amount, etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lowered-us","text":"/ˈloʊɚd/"}]},{"word":"KRIS","idx":13904,"count":2970945,"meanings":[{"definitions":[{"definition":"An Indonesian or Malay dagger with a wavy, or rigid serpentine blade."},{"definition":"A Moro sword with an asymmetrical blade."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stab with a kris."}],"partOfSpeech":"ve"}]},{"word":"THIEF","idx":13905,"count":2970770,"meanings":[{"definitions":[{"definition":"One who carries out a theft."},{"definition":"One who steals another person's property, especially by stealth and without using force or violence."},{"definition":"A waster in the snuff of a candle."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"thief-us","text":"/θif/"}]},{"word":"PRISONS","idx":13906,"count":2970138,"meanings":[{"definitions":[{"definition":"A place or institution of confinement, especially of long-term confinement for those convicted of serious crimes or otherwise considered undesirable by the government.","example":"The cold stone walls of the prison had stood for over a century."},{"definition":"Confinement in prison.","example":"Prison was a harrowing experience for him."},{"definition":"Any restrictive environment, such as a harsh academy or home.","example":"The academy was a prison for many of its students because of its strict teachers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To imprison."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɹɪzənz/"}]},{"word":"PICTURED","idx":13907,"count":2969267,"meanings":[{"definitions":[{"definition":"To represent in or with a picture."},{"definition":"To imagine or envision."},{"definition":"To depict or describe vividly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Furnished with pictures"},{"definition":"Represented by a picture"}],"partOfSpeech":"j"}]},{"word":"FEMININE","idx":13908,"count":2969201,"meanings":[{"definitions":[{"definition":"That which is feminine."},{"definition":"(possibly obsolete) A woman."},{"definition":"(grammar) The feminine gender."},{"definition":"(grammar) A word of the feminine gender."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the female gender; womanly."},{"definition":"Of or pertaining to the female sex; biologically female, not male."},{"definition":"Belonging to females; typically used by females.","example":"Mary, Elizabeth, and Edith are feminine names."},{"definition":"Having the qualities stereotypically associated with women: nurturing, not aggressive."},{"definition":"(grammar) Of, pertaining or belonging to the female grammatical gender, in languages that have gender distinctions."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"feminine-us","text":"/ˈfɛmənɪn/"}]},{"word":"GRABBED","idx":13910,"count":2968771,"meanings":[{"definitions":[{"definition":"To grip suddenly; to seize; to clutch.","example":"I grabbed her hand to pull her back from the cliff edge."},{"definition":"To make a sudden grasping or clutching motion (at something).","example":"The suspect suddenly broke free and grabbed at the policeman's gun."},{"definition":"To restrain someone; to arrest."},{"definition":"To grip the attention of; to enthrall or interest.","example":"How does that idea grab you?"},{"definition":"To quickly collect or retrieve."},{"definition":"To consume something quickly.","example":"Is there time to grab a coffee?"},{"definition":"To take the opportunity of."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɹæbd/"}]},{"word":"ROCKING","idx":13911,"count":2968423,"meanings":[{"definitions":[{"definition":"To move gently back and forth.","example":"Rock the baby to sleep."},{"definition":"To cause to shake or sway violently.","example":"Don't rock the boat."},{"definition":"To sway or tilt violently back and forth.","example":"The boat rocked at anchor."},{"definition":"(of ore etc.) To be washed and panned in a cradle or in a rocker.","example":"The ores had been rocked and laid out for inspection."},{"definition":"To disturb the emotional equilibrium of; to distress; to greatly impact (most often positively).","example":"Downing Street has been rocked by yet another sex scandal."},{"definition":"To do well or to be operating at high efficiency."},{"definition":"To make love to or have sex with."},{"definition":"To play, perform, or enjoy rock music, especially with a lot of skill or energy.","example":"Let’s rock!"},{"definition":"To be very favourable or skilful; excel; be fantastic.","example":"Chocolate rocks."},{"definition":"To thrill or excite, especially with rock music","example":"Let's rock this joint!"},{"definition":"To do something with excitement yet skillfully","example":"I need to rock a piss."},{"definition":"To wear (a piece of clothing, outfit etc.) successfully or with style; to carry off (a particular look, style)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The motion of something that rocks."},{"definition":"The abrading of a copper plate with a rocker, preparatory to mezzotinting."},{"definition":"The motion by which the design on a steel mill is transferred to a copper cylinder."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Shaking, swaying or moving back and forth."},{"definition":"Excellent; great."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rocking-us"}]},{"word":"REGS","idx":13914,"count":2967064,"meanings":[{"definitions":[{"definition":"A regular.","example":"I've been going to that chat room for months, and I know most of the regs by now."},{"definition":"A regulation."},{"definition":"Registrar"},{"definition":"Registration"},{"definition":"Registry"},{"definition":"A hard surface of rock fragments set in a sandy matrix, found in some hot deserts; regolith, stony desert."},{"definition":"Low-grade or commercial-grade marijuana."}],"partOfSpeech":"n"}]},{"word":"FULFILLED","idx":13916,"count":2964755,"meanings":[{"definitions":[{"definition":"To satisfy, carry out, bring to completion (an obligation, a requirement, etc.).","example":"You made a promise, son, and now you must fulfill it."},{"definition":"To emotionally or artistically satisfy; to develop one's gifts to the fullest.","example":"This is the most fulfilling work I've ever done."},{"definition":"To obey, follow, comply with (a rule, requirement etc.).","example":"Unfortunately, you don't fulfill the criteria for extra grants at the present time."},{"definition":"To package, distribute, or ship goods."},{"definition":"To fill full; fill to the utmost capacity; fill up.","example":"My lady is positively fulfilled of grace."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Emotionally satisfied; feeling a sense of fulfilment."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fulfilled-us","text":"/fəˈfɪld/"}]},{"word":"SWEETS","idx":13917,"count":2964693,"meanings":[{"definitions":[{"definition":"The basic taste sensation induced by sugar."},{"definition":"A confection made from sugar, or high in sugar content; a candy."},{"definition":"A food eaten for dessert.","example":"Can we see the sweet menu, please?"},{"definition":"Sweetheart; darling."},{"definition":"That which is sweet or pleasant in odour; a perfume."},{"definition":"Sweetness, delight; something pleasant to the mind or senses."},{"definition":"A term of endearment; sweetheart.","example":"I miss you, sweets."},{"definition":"Confectionery, candy."},{"definition":"Drugs"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sweeten."}],"partOfSpeech":"ve"}]},{"word":"NAUTICAL","idx":13918,"count":2964256,"meanings":[{"definitions":[{"definition":"Relating to or involving ships or shipping or navigation or seamen.","example":"nautical charts"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"nautical-us","text":"/ˈnɔːtɪkl̩/"}]},{"word":"IMPRISONMENT","idx":13919,"count":2964248,"meanings":[{"definitions":[{"definition":"A confinement in a place, especially a prison or a jail, as punishment for a crime."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"imprisonment-us"},{"text":"/ɪmˈpɹɪzn̩.mənt/"}]}]