[{"word":"BEARDS","idx":47701,"count":360739,"meanings":[{"definitions":[{"definition":"Facial hair on the chin, cheeks, jaw and neck."},{"definition":"The cluster of small feathers at the base of the beak in some birds."},{"definition":"The appendages to the jaw in some cetaceans, and to the mouth or jaws of some fishes."},{"definition":"The byssus of certain shellfish."},{"definition":"The gills of some bivalves, such as the oyster."},{"definition":"In insects, the hairs of the labial palpi of moths and butterflies."},{"definition":"Long or stiff hairs on a plant; the awn.","example":"the beard of grain"},{"definition":"A barb or sharp point of an arrow or other instrument, projecting backward to prevent the head from being easily drawn out."},{"definition":"The curved underside of an axehead, extending from the lower end of the cutting edge to the axehandle."},{"definition":"That part of the underside of a horse's lower jaw which is above the chin, and bears the curb of a bridle."},{"definition":"That part of a type which is between the shoulder of the shank and the face."},{"definition":"A fake customer or companion, especially a woman who accompanies a gay man in order to give the impression that he is heterosexual."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grow hair on the chin and jaw."},{"definition":"To boldly and bravely oppose or confront, often to the chagrin of the one being bearded.","example":"Robin Hood is always shown as bearding the Sheriff of Nottingham."},{"definition":"To take by the beard; to seize, pluck, or pull the beard of (a man), in anger or contempt."},{"definition":"To deprive (an oyster or similar shellfish) of the gills."},{"definition":"Of a gay man or woman: to accompany a gay person of the opposite sex in order to give the impression that they are heterosexual."}],"partOfSpeech":"ve"}]},{"word":"CHURCHYARD","idx":47702,"count":360729,"meanings":[{"definitions":[{"definition":"A patch of land adjoining a church, often used as a graveyard."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈt͡ʃɝt͡ʃ.jɑɹd/"},{"text":"/ˈt͡ʃɜːt͡ʃ.jɑːd/"}]},{"word":"TADPOLE","idx":47704,"count":360723,"meanings":[{"definitions":[{"definition":"A young toad or frog in its larval stage of development that lives in water, has a tail and no legs, and, like a fish, breathes through gills."},{"definition":"(by extension) The aquatic larva of any amphibian.","example":"salamander tadpole"},{"definition":"A type of cargo bike that has two wheels in front and one in back."},{"definition":"A child's basic drawing of a human being, having a detailed head but only sticks for the body and limbs."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtædpoʊl/"}]},{"word":"DESPICABLE","idx":47705,"count":360684,"meanings":[{"definitions":[{"definition":"A wretched or wicked person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Fit or deserving to be despised; contemptible; mean"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈspɪkəbəl/"}]},{"word":"CANTER","idx":47706,"count":360684,"meanings":[{"definitions":[{"definition":"A gait of a horse between a trot and a gallop, consisting of three beats and a \"suspension\" phase, where there are no feet on the ground. Also describing this gait on other four legged animals."},{"definition":"A ride on a horse at such speed."},{"definition":"One who cants or whines; a beggar."},{"definition":"One who makes hypocritical pretensions to goodness; one who uses canting language."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move at such pace."},{"definition":"To cause to move at a canter; to ride (a horse) at a canter."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkæntə(ɹ)/"}]},{"word":"REMINISCENCES","idx":47708,"count":360673,"meanings":[{"definitions":[{"definition":"An act of remembering long-past experiences, often fondly."},{"definition":"A mental image thus remembered."}],"partOfSpeech":"n"}]},{"word":"STORYTIME","idx":47709,"count":360647,"meanings":[{"definitions":[{"definition":"The time at which a story is told."}],"partOfSpeech":"n"}]},{"word":"BERSERK","idx":47710,"count":360627,"meanings":[{"definitions":[{"definition":"A crazed Norse warrior who fought in a frenzy; a berserker."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Injuriously, maniacally, or furiously violent or out of control.","example":"After seeing his sister stabbed to death, he went berserk and attacked the killer like a wild animal."},{"definition":"Weird; bizarre."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"berserk-uk","text":"/bə(ɹ)ˈzɜː(ɹ)k/"}]},{"word":"CARDIOLOGIST","idx":47712,"count":360596,"meanings":[{"definitions":[{"definition":"A physician who specializes in medical problems related to the heart."}],"partOfSpeech":"n"}]},{"word":"LEIS","idx":47714,"count":360584,"meanings":[{"definitions":[{"definition":"A garland of flowers in Hawaii."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/leɪz/"}]},{"word":"FELLATIO","idx":47716,"count":360557,"meanings":[{"definitions":[{"definition":"(sex) The stimulation of the penis (or testicles) using the mouth."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fellatio-us","text":"/fəˈleɪ.ʃi.oʊ/"}]},{"word":"RACY","idx":47718,"count":360461,"meanings":[{"definitions":[{"definition":"Mildly risqué.","example":"She wore a racy dress that was just barely appropriate for the occasion."},{"definition":"Having a strong flavor indicating origin; of distinct characteristic taste; tasting of the soil.","example":"a racy wine"},{"definition":"(by extension) Exciting to the mind by a strong or distinctive character of thought or language; peculiar and piquant; fresh and lively."},{"definition":"Involving a data race or a race condition."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹeɪsi/"}]},{"word":"TERRAN","idx":47719,"count":360447,"meanings":[{"definitions":[{"definition":"Of Earth; of terrestrial origin."}],"partOfSpeech":"j"}]},{"word":"STOOP","idx":47720,"count":360440,"meanings":[{"definitions":[{"definition":"The staircase and landing or porch leading to the entrance of a residence."},{"definition":"The threshold of a doorway, a doorstep."},{"definition":"A stooping, bent position of the body.","example":"The old man walked with a stoop."},{"definition":"An accelerated descent in flight, as that for an attack."},{"definition":"A post or pillar, especially a gatepost or a support in a mine."},{"definition":"A vessel for holding liquids; a flagon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bend the upper part of the body forward and downward to a half-squatting position; crouch.","example":"He stooped to tie his shoe-laces."},{"definition":"To lower oneself; to demean or do something below one's status, standards, or morals.","example":"Can you believe that a salesman would stoop so low as to hide his customers' car keys until they agreed to the purchase?"},{"definition":"Of a bird of prey: to swoop down on its prey."},{"definition":"To cause to incline downward; to slant.","example":"to stoop a cask of liquor"},{"definition":"To cause to submit; to prostrate."},{"definition":"To yield; to submit; to bend, as by compulsion; to assume a position of humility or subjection."},{"definition":"To descend from rank or dignity; to condescend."},{"definition":"To degrade."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/stuːp/"}]},{"word":"BREADCRUMBS","idx":47721,"count":360436,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) A tiny piece of bread, either one that falls from bread as it is cut or eaten, or one made deliberately by crumbling bread."},{"definition":"(chiefly in the plural) A single link in a chain indicating the hierarchical location of a web page or similar, used as a navigation aid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sprinkle breadcrumbs on to food, normally before cooking."},{"definition":"To add navigational breadcrumbs to (a web page or user interface)."},{"definition":"To use clues or enticements to lead someone in the desired direction."}],"partOfSpeech":"ve"}]},{"word":"REMASTER","idx":47723,"count":360386,"meanings":[{"definitions":[{"definition":"To produce a new version of a recording by remixing the original master recordings."},{"definition":"To create a new master copy by enhancing sound or picture quality of an older recording."},{"definition":"To produce a new version of a video game with updated graphics, often re-recorded music, and added features and content."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The production of a new version of a recording by remixing the original master recordings."},{"definition":"The new version so produced."}],"partOfSpeech":"n"}]},{"word":"CURVY","idx":47728,"count":360365,"meanings":[{"definitions":[{"definition":"Having curves."},{"definition":"Buxom or curvaceous.","example":"I love this woman and her curvy body."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɝvi/"},{"text":"/ˈkɜːvi/"}]},{"word":"ENVISAGE","idx":47729,"count":360359,"meanings":[{"definitions":[{"definition":"To conceive or see something within one's mind; to imagine or envision."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"envisage-us","text":"/ɛnˈvɪzɪdʒ/"}]},{"word":"BASEMENTS","idx":47731,"count":360342,"meanings":[{"definitions":[{"definition":"A floor of a building below ground level."},{"definition":"A mass of igneous or metamorphic rock forming the foundation over which a platform of sedimentary rocks is laid."},{"definition":"Last place in a sports conference standings."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/beɪsmənts/"}]},{"word":"CRUCIALLY","idx":47733,"count":360321,"meanings":[{"definitions":[{"definition":"In a crucial manner."}],"partOfSpeech":"v"}]},{"word":"FACILE","idx":47734,"count":360297,"meanings":[{"definitions":[{"definition":"Easy, now especially in a disparaging sense; contemptibly easy."},{"definition":"Amiable, flexible, easy to get along with.","example":"His facile disposition made him many friends."},{"definition":"Effortless, fluent (of work, abilities etc.)."},{"definition":"Lazy, simplistic (especially of explanations, discussions etc.)."},{"definition":"Of a reaction or other process, taking place readily.","example":"Decarboxylation of beta-keto acids is facile..."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfæs.əl/"},{"text":"/ˈfa.sʌɪl/"}]},{"word":"COERCED","idx":47742,"count":360223,"meanings":[{"definitions":[{"definition":"To restrain by force, especially by law or authority; to repress; to curb."},{"definition":"To use force, threat, fraud, or intimidation in an attempt to compel one to act against their will."},{"definition":"To force an attribute, normally of a data type, to take on the attribute of another data type."}],"partOfSpeech":"ve"}]},{"word":"DECOUPLING","idx":47743,"count":360202,"meanings":[{"definitions":[{"definition":"To unlink; to take or come apart.","example":"radiation decoupled from matter"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process by which something is decoupled."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[diːˈkʊpəlɪŋɡ]"}]},{"word":"BILLETS","idx":47744,"count":360198,"meanings":[{"definitions":[{"definition":"An English fish, allied to the cod; the coalfish."},{"definition":"A short informal letter."},{"definition":"A written order to quarter soldiers."},{"definition":"A place where a soldier is assigned to lodge."},{"definition":"An allocated space or berth in a boat or ship."},{"definition":"Berth; position."},{"definition":"A semi-finished length of metal."},{"definition":"A short piece of wood, especially one used as firewood."},{"definition":"A short cutting of sugar cane produced by a harvester or used for planting."},{"definition":"A rectangle used as a charge on an escutcheon."},{"definition":"An ornament in Norman work, resembling a billet of wood, either square or round."},{"definition":"(saddlery) A strap that enters a buckle."},{"definition":"A loop that receives the end of a buckled strap."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a householder etc.) To lodge soldiers, or guests, usually by order."},{"definition":"(of a soldier) To lodge, or be quartered, in a private house."},{"definition":"To direct, by a ticket or note, where to lodge."}],"partOfSpeech":"ve"}]},{"word":"ENVIRONMENTALIST","idx":47746,"count":360182,"meanings":[{"definitions":[{"definition":"One who holds the view that environment, rather than heredity or culture, is the primary factor in the development of an individual or group."},{"definition":"One who advocates for the protection of the biosphere from misuse from human activity through such measures as ecosystem protection, waste reduction and pollution prevention"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to environmentalism."}],"partOfSpeech":"j"}]},{"word":"SNEEZE","idx":47753,"count":360023,"meanings":[{"definitions":[{"definition":"An act of sneezing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To expel air as a reflex induced by an irritation in the nose."},{"definition":"To expel air as if the nose were irritated."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sneeze-us","text":"/sniːz/"}]},{"word":"DIGNITARIES","idx":47755,"count":360017,"meanings":[{"definitions":[{"definition":"An important or influential person, or one of high rank or position."}],"partOfSpeech":"n"}]},{"word":"MISTREATMENT","idx":47756,"count":360002,"meanings":[{"definitions":[{"definition":"Cruel, abusive , bad, unfair, or thoughtless treatment of a person or animal (only rarely of an object or a machine; usually: mishandle).","example":"There were allegations of mistreatment at the prison."}],"partOfSpeech":"n"}]},{"word":"SOMBER","idx":47761,"count":359970,"meanings":[{"definitions":[{"definition":"To make sombre or dark; to make shady."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Dark; gloomy; shadowy, dimly lit."},{"definition":"Dull or dark in colour or brightness."},{"definition":"Melancholic, gloomy, dreary, dismal; grim."},{"definition":"Grave; extremely serious.","example":"a sombre situation"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"somber-us","text":"/ˈsɑmbɚ/"}]},{"word":"INFECTIVE","idx":47763,"count":359955,"meanings":[{"definitions":[{"definition":"A person who is capable of spreading a disease by infecting others."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Able to cause infection; infectious"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈfɛktɪv/"}]},{"word":"SHARDS","idx":47766,"count":359933,"meanings":[{"definitions":[{"definition":"A piece of broken glass or pottery, especially one found in an archaeological dig."},{"definition":"(by extension) A piece of material, especially rock and similar materials, reminding of a broken piece of glass or pottery."},{"definition":"A tough scale, sheath, or shell; especially an elytron of a beetle."},{"definition":"An instance of an MMORPG that is one of several independent and structurally identical virtual worlds, none of which has so many players as to exhaust a system's resources."},{"definition":"A component of a sharded distributed database."},{"definition":"(singular or plural) A piece of crystal methamphetamine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fall apart into shards, usually as the result of impact or explosion."},{"definition":"To break (something) into shards."},{"definition":"To divide (an MMORPG) into several shards, or to establish a shard of one."}],"partOfSpeech":"ve"}]},{"word":"OVERGROWN","idx":47770,"count":359873,"meanings":[{"definitions":[{"definition":"To grow beyond one's boundaries or containment, or beyond the proper size."},{"definition":"To grow over; (of one thing) to cause (a second thing) to become overgrown (with or by the first thing)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having large numbers of plants which have become too big, and are hence spoiling the picturesqueness of a garden."},{"definition":"Having grown bigger without developing maturity or changing character.","example":"He spends so much money on new technology: he's like an overgrown schoolboy buying toys."}],"partOfSpeech":"j"}]},{"word":"PHONETICS","idx":47771,"count":359870,"meanings":[{"definitions":[{"definition":"The study of the physical sounds of human speech, concerned with the physical properties of speech sounds (phones), and the processes of their physiological production, auditory reception, and neurophysiological perception, and their representation by written symbols."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fəˈnɛtɪks/"}]},{"word":"STATESMEN","idx":47772,"count":359866,"meanings":[{"definitions":[{"definition":"A man who is a leader in national or international affairs."},{"definition":"A male political leader who promotes the public good or who is recognized for probity, leadership, or the qualities necessary to govern a state."},{"definition":"In the dialect of the English Lake District and nearby, a man who lives on a landed estate; a small landholder."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-mɛn/"}]},{"word":"ADVICES","idx":47777,"count":359771,"meanings":[{"definitions":[{"definition":"An opinion offered in an effort to be helpful.","example":"She was offered various piece of advice on what to do with her new-found wealth."},{"definition":"Deliberate consideration; knowledge."},{"definition":"(commonly in plural) Information or news given; intelligence","example":"late advices from France"},{"definition":"In language about financial transactions executed by formal documents, an advisory document.","example":"An advice of an incoming settlement payment order may be given to an off-line receiving bank."},{"definition":"In commercial language, information communicated by letter; used chiefly in reference to drafts or bills of exchange","example":"a letter of advice"},{"definition":"A communication providing information, such as how an uncertain area of law might apply to possible future actions","example":"An advice issued by a Monitoring Committee could be applicable in a Dutch court"},{"definition":"Counseling to perform a specific legal act."},{"definition":"Counseling to perform a specific illegal act."},{"definition":"In aspect-oriented programming, the code whose execution is triggered when a join point is reached."}],"partOfSpeech":"n"}]},{"word":"WHIMSY","idx":47778,"count":359758,"meanings":[{"definitions":[{"definition":"A quaint and fanciful idea; a whim; playfully odd behaviour."},{"definition":"An impulsive, illogical or capricious character."},{"definition":"A whim (capstan or vertical drum)."},{"definition":"A jigsaw puzzle piece that has been cut into a recognizable shape, as if on a whim; often the shape is representative of the theme of the image used for the puzzle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fill with whimsies or whims; to make fantastic; to craze."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"whimsy-uk","text":"/ˈwɪmzi/"}]},{"word":"COFFERS","idx":47779,"count":359758,"meanings":[{"definitions":[{"definition":"A strong chest or box used for keeping money or valuables safe."},{"definition":"An ornamental sunken panel in a ceiling or dome."},{"definition":"A cofferdam."},{"definition":"A supply or store of money, often belonging to an organization."},{"definition":"A trench dug in the bottom of a dry moat, and extending across it, to enable the besieged to defend it with raking fire."}],"partOfSpeech":"n"}]},{"word":"FRAMESET","idx":47780,"count":359735,"meanings":[{"definitions":[{"definition":"A bicycle's frame plus the front fork."},{"definition":"The set of frames that constitute the layout of a webpage.","example":"The reloading of the frameset is obviously less attractive than simply changing the location of one frame."}],"partOfSpeech":"n"}]},{"word":"MICRODERMABRASION","idx":47790,"count":359669,"meanings":[{"definitions":[{"definition":"Any of several related procedures in which the outermost surface of the skin is removed for cosmetic purposes"}],"partOfSpeech":"n"}]},{"word":"WATERBODY","idx":47791,"count":359636,"meanings":[{"definitions":[{"definition":"Any significant accumulation of water, usually covering the Earth or another planet, such as a river, lake or a bay."}],"partOfSpeech":"n"}]},{"word":"JEEPS","idx":47792,"count":359631,"meanings":[{"definitions":[{"definition":"A small, blocky, military-style vehicle with four-wheel drive, suited to rough terrain."},{"definition":"A light utility truck from WWII used by the U.S. Army, and subsequently turned into the trademark Jeep when civilianized by originating manufacturer Willys-Overland."},{"definition":"(genericized trademark) A sport utility vehicle or similar four-wheel-drive vehicle."},{"definition":"(corrosion) A device for detecting discontinuity in a protective coating, also called a \"holiday detector\""},{"definition":"A covered shopping cart, also called a \"shopping stroller\"."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dʒiːps/"}]},{"word":"AWRY","idx":47793,"count":359631,"meanings":[{"definitions":[{"definition":"Turned or twisted toward one side; crooked, distorted, out of place; wry.","example":"The frame was awry."},{"definition":"Wrong or distorted; perverse, amiss.","example":"There is something awry with this story."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Obliquely, crookedly; askew."},{"definition":"Perversely, improperly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"awry-us","text":"/əˈɹaɪ/"},{"audio":"awry-au","text":"/ˈɔ.ɹi/"}]},{"word":"CELT","idx":47794,"count":359610,"meanings":[{"definitions":[{"definition":"A prehistoric chisel-bladed tool."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɛlt/"}]},{"word":"LODE","idx":47796,"count":359547,"meanings":[{"definitions":[{"definition":"A way or path; a road."},{"definition":"A watercourse."},{"definition":"A vein of metallic ore that lies within definite boundaries, or within a fissure."},{"definition":"(by extension) A rich source of supply."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lode-us","text":"/loʊd/"}]},{"word":"SPAY","idx":47798,"count":359534,"meanings":[{"definitions":[{"definition":"To remove or destroy the ovaries (of an animal) so that it cannot become pregnant."},{"definition":"To divine; foretell"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The hart in its third year; a young deer"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/speɪ/"}]},{"word":"FOLLOWUPS","idx":47802,"count":359439,"meanings":[{"definitions":[{"definition":"A subsidiary action taken in response to an event."},{"definition":"A posted message on a newsgroup, etc. in reply to a previous one."},{"definition":"A shot on goal directly following another that has been saved."},{"definition":"The revisiting of a patient in ambulatory care."}],"partOfSpeech":"n"}]},{"word":"RAGES","idx":47809,"count":359354,"meanings":[{"definitions":[{"definition":"Violent uncontrolled anger."},{"definition":"A current fashion or fad.","example":"Miniskirts were all the rage back then."},{"definition":"Any vehement passion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act or speak in heightened anger."},{"definition":"(sometimes figurative) To move with great violence, as a storm etc."},{"definition":"To enrage."}],"partOfSpeech":"ve"}]},{"word":"ICEMAN","idx":47810,"count":359331,"meanings":[{"definitions":[{"definition":"A person who trades in ice."},{"definition":"A man who is skilled in travelling upon ice, as among glaciers."},{"definition":"An assassin."},{"definition":"One who is cool under pressure."},{"definition":"A man in attendance at a frozen pond where skating etc. is going on."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"iceman-au"}]},{"word":"CLUMPS","idx":47811,"count":359320,"meanings":[{"definitions":[{"definition":"A cluster or lump; an unshaped piece or mass."},{"definition":"A thick group or bunch, especially of bushes or hair."},{"definition":"A dull thud."},{"definition":"The compressed clay of coal strata."},{"definition":"A small group of trees or plants."},{"definition":"A thick addition to the sole of a shoe."},{"definition":"A game in which questions are asked for the purpose of enabling the questioners to discover a word or thing previously selected by two persons who answer the questions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form clusters or lumps."},{"definition":"To gather in dense groups."},{"definition":"To walk with heavy footfalls."},{"definition":"To strike; to beat."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/klʌmps/"}]},{"word":"PEGGED","idx":47812,"count":359296,"meanings":[{"definitions":[{"definition":"To fasten using a peg.","example":"Let's peg the rug to the floor."},{"definition":"To affix or pin.","example":"I found a tack and pegged your picture to the bulletin board."},{"definition":"To fix a value or price.","example":"China's currency is no longer pegged to the American dollar."},{"definition":"To narrow the cuff openings of a pair of pants so that the legs take on a peg shape."},{"definition":"To throw."},{"definition":"To indicate or ascribe an attribute to. (Assumed to originate from the use of pegs or pins as markers on a bulletin board or a list.)","example":"He's been pegged as a suspect."},{"definition":"To move one's pegs to indicate points scored; to score with a peg.","example":"She pegged twelve points."},{"definition":"To reach or exceed the maximum value on (a scale or gauge).","example":"We pegged the speedometer across the flats."},{"definition":"(typically in heterosexual contexts) To engage in anal sex by penetrating (one's male partner) with a dildo."},{"definition":"To keep working hard at something; to peg away."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɛɡd/"}]},{"word":"TITHE","idx":47813,"count":359291,"meanings":[{"definitions":[{"definition":"A tenth."},{"definition":"The tenth part of the increase arising from the profits of land and stock, allotted to the clergy for their support, as in England, or devoted to religious or charitable uses."},{"definition":"A contribution to one's religious community or congregation of worship (notably to the LDS church)"},{"definition":"A small part or proportion."},{"definition":"A boon (a grant or concession)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give one-tenth or a tithe of something, particularly:"},{"definition":"To take one-tenth or a tithe of something, particularly:"},{"definition":"To compose the tenth part of something."},{"definition":"To grant, concede."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Tenth."},{"definition":"Receiving a concession or grant; successful in prayer or request."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/taɪð/"}]},{"word":"LIBERATOR","idx":47814,"count":359290,"meanings":[{"definitions":[{"definition":"A person who frees or liberates."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɪbəɹeɪtə(ɹ)/"}]},{"word":"REDISCOVER","idx":47815,"count":359243,"meanings":[{"definitions":[{"definition":"To discover again; especially something previously lost or forgotten.","example":"She rediscovered her faith in religion."}],"partOfSpeech":"ve"}]},{"word":"SUBORDINATION","idx":47816,"count":359226,"meanings":[{"definitions":[{"definition":"The process of making something subordinate."},{"definition":"The process of subordinating."},{"definition":"The property of being subordinate; inferiority of rank or position."},{"definition":"The quality of being properly obedient to a superior (as a superior officer)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˌbɔɹɾn̩ˈeɪʃn̩/"},{"text":"/səˌbɔːdɪˈneɪʃn̩/"}]},{"word":"WAVEFRONT","idx":47818,"count":359216,"meanings":[{"definitions":[{"definition":"An imaginary surface passing through points of a medium oscillating in phase."}],"partOfSpeech":"n"}]},{"word":"FICTIONS","idx":47819,"count":359209,"meanings":[{"definitions":[{"definition":"Literary type using invented or imaginative writing, instead of real facts, usually written as prose.","example":"I am a great reader of fiction."},{"definition":"A verbal or written account that is not based on actual events (often intended to mislead).","example":"The butler’s account of the crime was pure fiction."},{"definition":"A legal fiction."}],"partOfSpeech":"n"}]},{"word":"BHANGRA","idx":47820,"count":359201,"meanings":[{"definitions":[{"definition":"A lively style of music originating from India."},{"definition":"A traditional Punjabi folk dance, originally a celebration of the harvest."},{"definition":"Any of various modern Punjabi dance styles of the 1950s and 1990s."},{"definition":"Any style of electronic dance music (EDM) influenced by the musics of the Indian subcontinent."}],"partOfSpeech":"n"}]},{"word":"DEPOSED","idx":47821,"count":359186,"meanings":[{"definitions":[{"definition":"To put down; to lay down; to deposit; to lay aside; to put away."},{"definition":"To remove (a leader) from (high) office, without killing the incumbent.","example":"A deposed monarch may go into exile as pretender to the lost throne, hoping to be restored in a subsequent revolution."},{"definition":"To give evidence or testimony, especially in response to interrogation during a deposition"},{"definition":"To interrogate and elicit testimony from during a deposition; typically done by a lawyer.","example":"After we deposed the claimant we had enough evidence to avoid a trial."},{"definition":"To take or swear an oath."},{"definition":"To testify; to bear witness; to claim; to assert; to affirm."}],"partOfSpeech":"ve"}]},{"word":"KETONE","idx":47825,"count":359153,"meanings":[{"definitions":[{"definition":"A homologous series of organic molecules whose functional group is an oxygen atom joined to a carbon atom—by a double bond—in a carbon-hydrogen based molecule."}],"partOfSpeech":"n"}]},{"word":"TRENDING","idx":47828,"count":359144,"meanings":[{"definitions":[{"definition":"To have a particular direction; to run; to stretch; to tend.","example":"The shore of the sea trends to the southwest."},{"definition":"To cause to turn; to bend."},{"definition":"To be the subject of a trend; to be currently popular, relevant or interesting.","example":"What topics have been trending on social networks this week?"},{"definition":"To cleanse or clean (something, usually wool)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A trend, or inclination in a particular direction.","example":"the trendings of the coast"}],"partOfSpeech":"n"}]},{"word":"GEODESIC","idx":47829,"count":359144,"meanings":[{"definitions":[{"definition":"The shortest line between two points on a specific surface."},{"definition":"(spherical geometry) A segment of a great circle."},{"definition":"A course allowing the parallel-transport of vectors along a course that causes tangent vectors to remain tangent vectors throughout that course (a straight curve, a line that is straight)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to geodesy."},{"definition":"Of or relating to a geodesic dome."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌd͡ʒiːəˈdiːsɪk/"}]},{"word":"DISINTERESTED","idx":47830,"count":359124,"meanings":[{"definitions":[{"definition":"Having no stake or interest in the outcome; free of bias, impartial."},{"definition":"Uninterested, lacking interest."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disinterested-uk","text":"/dɪˈsɪnt(ə)ɹɛstɪd/"}]},{"word":"FORSAKE","idx":47831,"count":359114,"meanings":[{"definitions":[{"definition":"To abandon, to give up, to leave (permanently), to renounce."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɔɹˈseɪk/"}]},{"word":"CONGRUENCE","idx":47832,"count":359112,"meanings":[{"definitions":[{"definition":"The quality of agreeing or corresponding; being suitable and appropriate."},{"definition":"A relation between two numbers indicating they give the same remainder when divided by some given number."},{"definition":"The quality of being isometric — roughly, the same measure and shape."},{"definition":"More generally: any equivalence relation defined on an algebraic structure which is preserved by operations defined by the structure."}],"partOfSpeech":"n"}]},{"word":"CONSPIRATORS","idx":47833,"count":359104,"meanings":[{"definitions":[{"definition":"One of a group that acts in harmony; a person who is part of a conspiracy."},{"definition":"Part of a group that agree to do an unlawful or unethical act.","example":"The conspirators were rounded up by the police and arrested."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"conspirators-us"}]},{"word":"UNRESPONSIVE","idx":47835,"count":359092,"meanings":[{"definitions":[{"definition":"Not responsive; unreactive."},{"definition":"Indifferent or apathetic; emotionless."}],"partOfSpeech":"j"}]},{"word":"BABOON","idx":47836,"count":359080,"meanings":[{"definitions":[{"definition":"An Old World monkey of the genus Papio, having dog-like muzzles and large canine teeth, cheek pouches, a short tail, and naked callosities on the buttocks."},{"definition":"A foolish or boorish person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"baboon-us","text":"/ˌbæˈbuːn/"}]},{"word":"SWAMPED","idx":47839,"count":359056,"meanings":[{"definitions":[{"definition":"To drench or fill with water.","example":"The boat was swamped in the storm."},{"definition":"To overwhelm; to make too busy, or overrun the capacity of.","example":"I have been swamped with paperwork ever since they started using the new system."},{"definition":"To plunge into difficulties and perils; to overwhelm; to ruin; to wreck."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Very busy; having too much to do","example":"They have been swamped ever since they started advertising."}],"partOfSpeech":"j"}]},{"word":"ENSUES","idx":47840,"count":359038,"meanings":[{"definitions":[{"definition":"To follow (a leader, inclination etc.)."},{"definition":"To follow (in time), to be subsequent to."},{"definition":"To occur afterwards, as a result or effect.","example":"Give three freshmen six bottles of wine, and hilarity will ensue."}],"partOfSpeech":"ve"}]},{"word":"TENUOUS","idx":47842,"count":359011,"meanings":[{"definitions":[{"definition":"Thin in substance or consistency.","example":"Far from being amicable, the numbers seemed to turn their backs on each other, and I couldn't find a pair with even the most tenuous connection."},{"definition":"Insubstantial.","example":"His argument was not convincing in the debate, considering how tenuous it was."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɛn.ju.əs/"}]},{"word":"SURFACTANTS","idx":47845,"count":358996,"meanings":[{"definitions":[{"definition":"A surface active agent, or wetting agent, capable of reducing the surface tension of a liquid; typically organic compounds having a hydrophilic \"head\" and a hydrophobic \"tail\"."},{"definition":"A lipoprotein in the tissues of the lung that reduces surface tension and permits more efficient gas transport."}],"partOfSpeech":"n"}]},{"word":"EPICENTER","idx":47847,"count":358978,"meanings":[{"definitions":[{"definition":"The point on the land or water surface directly above the focus, or hypocentre, of an earthquake."},{"definition":"The point on the surface of the earth directly above an underground explosion."},{"definition":"The focal point of any activity, especially if dangerous or destructive."},{"definition":"The geographical area in which an ongoing disaster, illness, crisis, or other destructive event is currently most severe."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of an earthquake: to have its epicentre (at a specified location)."}],"partOfSpeech":"ve"}]},{"word":"TOKE","idx":47848,"count":358951,"meanings":[{"definitions":[{"definition":"(casinos) A gratuity.","example":"I gave the maitre d’ a $10 toke and he just laughed."},{"definition":"A puff of marijuana."},{"definition":"A piece of bread."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a gratuity to.","example":"You have to toke the maitre d’ at least $50 if you want a really good table."},{"definition":"To smoke marijuana."},{"definition":"To inhale a puff of marijuana"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/toʊk/"},{"text":"/təʊk/"},{"audio":"toke-au"}]},{"word":"ELATED","idx":47854,"count":358902,"meanings":[{"definitions":[{"definition":"To make joyful or proud."},{"definition":"To lift up; raise; elevate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Extremely happy and excited; delighted; pleased, euphoric.","example":"She was elated with her new car."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"elated-us"}]},{"word":"PHENOMENOLOGICAL","idx":47856,"count":358895,"meanings":[{"definitions":[{"definition":"Of or relating to phenomenology, or consistent with the principles of phenomenology."},{"definition":"Using the method of phenomenology, by which the observer examines the data without trying to provide an explanation of them."}],"partOfSpeech":"j"}]},{"word":"DEBRIEFING","idx":47857,"count":358885,"meanings":[{"definitions":[{"definition":"To question someone after a military mission in order to obtain intelligence."},{"definition":"To question someone, or a group of people, after the implementation of a project in order to learn from mistakes etc."},{"definition":"To inform subjects of an experiment about what has happened in a complete and accurate manner."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of debriefing, or the state of being debriefed."},{"definition":"The report of a mission or project, or the information so obtained."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/diːˈbɹiːfɪŋ/"}]},{"word":"MINISKIRTS","idx":47858,"count":358881,"meanings":[{"definitions":[{"definition":"A short skirt with its hemline well above the knees, generally at mid-thigh level."}],"partOfSpeech":"n"}]},{"word":"BUTTERED","idx":47859,"count":358866,"meanings":[{"definitions":[{"definition":"To spread butter on.","example":"Butter the toast."},{"definition":"To move one's weight backwards or forwards onto the tips or tails of one's skis or snowboard so only the tip or tail is in contact with the snow."},{"definition":"To increase (stakes) at every throw of dice, or every game."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Spread with butter.","example":"hot buttered toast"}],"partOfSpeech":"j"}]},{"word":"LENTIL","idx":47862,"count":358846,"meanings":[{"definitions":[{"definition":"Any of several plants of the genus Lens, especially Lens culinaris, from southwest Asia, that have edible, lens-shaped seeds within flattened pods."},{"definition":"The seed of these plants, used as food."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɛntəl/"}]},{"word":"BACKER","idx":47865,"count":358798,"meanings":[{"definitions":[{"definition":"One who, or that which, backs; especially one who backs an entrant in a contest, or who supports an enterprise by funding it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbækə(ɹ)/"}]},{"word":"ALBEDO","idx":47866,"count":358798,"meanings":[{"definitions":[{"definition":"The fraction of incident light or radiation reflected by a surface or body, commonly expressed as a percentage."},{"definition":"The whitish inner portion of the rind of citrus fruits that is a source of pectin, commonly referred to as the pith."},{"definition":"One of the four major stages of the magnum opus, involving purification of the prima materia."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"albedo-us","text":"/ælˈbi.doʊ/"}]},{"word":"ANGORA","idx":47871,"count":358752,"meanings":[{"definitions":[{"definition":"An angora cat."},{"definition":"A goat of a domesticated breed that produces mohair."},{"definition":"A rabbit belonging to the Angora rabbit breed, one of the oldest domestic breeds of rabbits in the world, raised chiefly in Europe for its silky and long hair (a subspecies of the European rabbit, Oryctolagus cuniculus)"},{"definition":"The hair of angora rabbits or angora goats, used to make textiles."},{"definition":"The fabric made from the hair of angora rabbits or angora goats."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æŋˈɡɔːɹə/"}]},{"word":"STUFFY","idx":47875,"count":358727,"meanings":[{"definitions":[{"definition":"A toy made of a soft material, usually stuffed with cotton, straw, beans, or other materials, and typically intended as a plaything for children."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Poorly ventilated; partially plugged.","example":"I can’t smell very well today – I have a stuffy nose."},{"definition":"Stout; mettlesome; resolute."},{"definition":"Angry and obstinate; sulky."},{"definition":"Boring, uninteresting, over-formal, pompous, very conventional.","example":"The stuffy professor droned on as the class lost interest."},{"definition":"Stout; sturdy."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stuffy-uk","text":"/ˈstʌfi/"}]},{"word":"COCKY","idx":47880,"count":358614,"meanings":[{"definitions":[{"definition":"Overly confident; arrogant and boastful."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Used as a term of endearment, originally for a person of either sex, but later primarily for a man."},{"definition":"A (familiar name for a) cockatoo."},{"definition":"Short for cockatoo farmer; (by extension) any farmer or owner of rural land."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To operate a small-scale farm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cocky-au.oga","text":"/ˈkɔki/"}]},{"word":"PITCHFORK","idx":47881,"count":358591,"meanings":[{"definitions":[{"definition":"An agricultural tool comprising a fork attached to a long handle used for pitching hay or bales of hay high up onto a haystack."},{"definition":"A tuning fork."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To toss or carry with a pitchfork.","example":"The hay was soon pitchforked onto the wagon."},{"definition":"To throw suddenly."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɪtʃˌfɔɹk/"}]},{"word":"DEPRESS","idx":47883,"count":358559,"meanings":[{"definitions":[{"definition":"To press down.","example":"Depress the upper lever to start the machine."},{"definition":"To make depressed, sad or bored.","example":"Winter depresses me."},{"definition":"To cause a depression or a decrease in parts of the economy.","example":"Lower productivity will eventually depress wages."},{"definition":"To bring down or humble; to abase (pride, etc.)."},{"definition":"To reduce (an equation) in a lower degree."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪˈpɹɛs/"}]},{"word":"ECCENTRICITY","idx":47887,"count":358507,"meanings":[{"definitions":[{"definition":"The quality of being eccentric or odd; any eccentric behaviour."},{"definition":"The ratio, constant for any particular conic section, of the distance of a point from the focus to its distance from the directrix.","example":"For an ellipse, the eccentricity is the ratio of the distance from the center to a focus divided by the length of the semi-major axis."},{"definition":"The eccentricity of the conic section (usually an ellipse) defined by the orbit of a given object around a reference object (such as that of a planet around the sun)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"eccentricity-us","text":"/ˌɛk.sɛnˈtɹɪs.ɪ.ti/"}]},{"word":"BEANO","idx":47888,"count":358497,"meanings":[{"definitions":[{"definition":"A beanfeast; any noisy celebration, a party."},{"definition":"Any home-made gas or indigestion remedy."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbiːnəʊ/"}]},{"word":"INTERCONNECTIONS","idx":47889,"count":358476,"meanings":[{"definitions":[{"definition":"A connection (physical or logical) between multiple things"},{"definition":"Connecting renewable-energy systems to the power grid","example":"A dozen states have implemented policies for interconnection."}],"partOfSpeech":"n"}]},{"word":"TOILETRY","idx":47891,"count":358473,"meanings":[{"definitions":[{"definition":"Any item used for personal hygiene or grooming."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"toiletry-us","text":"/ˈtɔɪlɪtɹi/"}]},{"word":"SATS","idx":47892,"count":358460,"meanings":[{"definitions":[{"definition":"A moon or other smaller body orbiting a larger one.","example":"A spent upper stage is a derelict satellite."},{"definition":"A man-made apparatus designed to be placed in orbit around a celestial body, generally to relay information, data etc. to Earth.","example":"Many telecommunication satellites orbit at 36000km above the equator."},{"definition":"A country, state, office, building etc. which is under the jurisdiction, influence, or domination of another body."},{"definition":"An attendant on an important person; a member of someone's retinue, often in a somewhat derogatory sense; a henchman."},{"definition":"Satellite TV; reception of television broadcasts via services that utilize man-made satellite technology.","example":"Do you have satellite at your house?"},{"definition":"(grammar) A grammatical construct that takes various forms and may encode a path of movement, a change of state, or the grammatical aspect. Examples: \"a bird flew past\"; \"she turned on the light\"."}],"partOfSpeech":"n"}]},{"word":"TRANSGRESSION","idx":47894,"count":358442,"meanings":[{"definitions":[{"definition":"A violation of a law, duty or commandment."},{"definition":"An act that goes beyond generally accepted boundaries."},{"definition":"A relative rise in sea level resulting in deposition of marine strata over terrestrial strata."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tɹænsˈɡɹɛʃən/"}]},{"word":"IDEALIZED","idx":47895,"count":358433,"meanings":[{"definitions":[{"definition":"To regard something as ideal."},{"definition":"To conceive or form an ideal."},{"definition":"To portray using idealization."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Regarded as ideal."},{"definition":"Considered as an ideal form of something."}],"partOfSpeech":"j"}]},{"word":"CLINGS","idx":47896,"count":358431,"meanings":[{"definitions":[{"definition":"Fruit (especially peach) whose flesh adheres strongly to the pit."},{"definition":"Adherence; attachment; devotion"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hold very tightly, as to not fall off.","example":"Seaweed clung to the anchor."},{"definition":"To adhere to an object, without being affixed, in such a way as to follow its contours. Used especially of fabrics and films."},{"definition":"To cause to adhere to, especially by twining round or embracing."},{"definition":"To cause to dry up or wither."},{"definition":"To dry up or wither.","example":"Wood clings."},{"definition":"(with preposition to) to be fond of, to feel strongly about and dependent on"},{"definition":"To produce a high-pitched ringing sound, like a small bell."}],"partOfSpeech":"ve"}]},{"word":"FLAMBOYANT","idx":47897,"count":358410,"meanings":[{"definitions":[{"definition":"The royal poinciana (Delonix regia), a showy tropical tree."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Showy, bold or audacious in behaviour, appearance, etc."},{"definition":"Referring to the final stage of French Gothic architecture from the 14th to the 16th centuries."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"flamboyant-us","text":"/flæmˈbɔɪ(j)ənt/"}]},{"word":"STRETCHY","idx":47902,"count":358378,"meanings":[{"definitions":[{"definition":"Capable of stretching; elastic."},{"definition":"Inclined to stretch, as from weariness."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈstɹɛtʃi/"}]},{"word":"STARBURST","idx":47904,"count":358363,"meanings":[{"definitions":[{"definition":"A violent explosion, or the pattern (likened to the shape of a star) supposed to be made by such an explosion."},{"definition":"A symbol similar to an asterisk, but with additional rays: ✺."},{"definition":"A region of space with an unusually high rate of star formation."},{"definition":"A period in time during which a region of space experiences an unusually high rate of star formation.","example":"The Milky Way will see a starburst in approximately 200,000,000 years."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a region of space) To experience an unusually high rate of star formation."},{"definition":"To explode; to burst out violently via, or in such a manner as to cause, an explosion."},{"definition":"To make a starburst pattern."},{"definition":"To refract and sparkle."}],"partOfSpeech":"ve"}]},{"word":"NEUROLOGIST","idx":47906,"count":358315,"meanings":[{"definitions":[{"definition":"A doctor or scientist who practices or specializes in neurology."}],"partOfSpeech":"n"}]},{"word":"KITTIES","idx":47910,"count":358285,"meanings":[{"definitions":[{"definition":"A kitten or young cat."},{"definition":"(sometimes capitalized) A pet name for a cat.","example":"Aw, look at the kitty!"},{"definition":"A money pool, as for a card game, or for shared expenses."},{"definition":"In a home game, a small, specified amount taken from each pot to pay the host's expenses."},{"definition":"Female genitals. (Euphemistic form of pussy.)"},{"definition":"A set of additional cards dealt face down in some games."}],"partOfSpeech":"n"}]},{"word":"CLERGYMAN","idx":47911,"count":358278,"meanings":[{"definitions":[{"definition":"An ordained (male) Christian minister, a male member of the clergy."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈklɝdʒimən/"},{"text":"/ˈklɜːdʒimən/"}]},{"word":"SCAPE","idx":47915,"count":358228,"meanings":[{"definitions":[{"definition":"A leafless stalk growing directly out of a root."},{"definition":"The basal segment of an insect's antenna (i.e. the part closest to the body)."},{"definition":"The basal part of the ovipositor of an insect, more specifically known as the oviscape."},{"definition":"The shaft of a column."},{"definition":"The apophyge of a shaft."},{"definition":"Escape"},{"definition":"A means of escape; evasion."},{"definition":"A freak; a slip; a fault; an escapade."},{"definition":"A loose act of vice or lewdness."},{"definition":"The cry of the snipe when flushed."},{"definition":"The snipe itself."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To escape"}],"partOfSpeech":"ve"}]},{"word":"HOMICIDES","idx":47917,"count":358226,"meanings":[{"definitions":[{"definition":"The killing of one person by another, whether premeditated or unintentional."},{"definition":"A person who kills another."},{"definition":"(police jargon) A victim of homicide; a person who has been unlawfully killed by someone else."}],"partOfSpeech":"n"}]},{"word":"PLEDGING","idx":47924,"count":358099,"meanings":[{"definitions":[{"definition":"To make a solemn promise (to do something)."},{"definition":"To deposit something as a security; to pawn."},{"definition":"To give assurance of friendship by the act of drinking; to drink to one's health."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The making of a pledge."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈplɛdʒɪŋ/"}]},{"word":"DEPENDANTS","idx":47925,"count":358088,"meanings":[{"definitions":[{"definition":"A person who depends on another for support, particularly financial support (= US dependent)."}],"partOfSpeech":"n"}]},{"word":"HUBRIS","idx":47927,"count":358069,"meanings":[{"definitions":[{"definition":"Excessive pride, presumption or arrogance (originally toward the gods)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hubris-us","text":"/ˈhjuːbɹɪs/"}]},{"word":"PUDDINGS","idx":47931,"count":358043,"meanings":[{"definitions":[{"definition":"Any of various dishes, sweet or savoury, prepared by boiling or steaming, or from batter."},{"definition":"A type of cake or dessert cooked usually by boiling or steaming."},{"definition":"A type of dessert that has a texture similar to custard or mousse but using some kind of starch as the thickening agent."},{"definition":"Dessert; the dessert course of a meal.","example":"We have apple pie for pudding today."},{"definition":"A sausage made primarily from blood."},{"definition":"An overweight person."},{"definition":"Entrails."},{"definition":"Any food or victuals."},{"definition":"A piece of good fortune."}],"partOfSpeech":"n"}]},{"word":"PARTISANS","idx":47932,"count":358043,"meanings":[{"definitions":[{"definition":"An adherent to a party or faction."},{"definition":"A fervent, sometimes militant, supporter or proponent of a party, cause, faction, person, or idea."},{"definition":"A member of a band of detached light, irregular troops acting behind occupying enemy lines in the ways of harassment or sabotage; a guerrilla fighter."},{"definition":"The commander of a body of detached light troops engaged in making forays and harassing an enemy."},{"definition":"A long-handled spear with a triangular, double-edged blade having lateral projections, in some forms also used in boar hunting."},{"definition":"A soldier armed with such a weapon."}],"partOfSpeech":"n"}]},{"word":"GENITALIA","idx":47933,"count":358041,"meanings":[{"definitions":[{"definition":"External sex organs."},{"definition":"A collection of external sex organs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"genitalia-us","text":"/ˈdʒɛnɪˈteɪli.ə/"}]},{"word":"MAUSOLEUM","idx":47934,"count":358031,"meanings":[{"definitions":[{"definition":"A large stately tomb or a building housing such a tomb or several tombs."},{"definition":"(by extension) A gloomy, usually large room or building."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌmɔ.səˈli.əm/"},{"text":"/ˌmɔː.zəˈliː.əm/"}]},{"word":"IDLER","idx":47935,"count":358013,"meanings":[{"definitions":[{"definition":"One who idles; one who spends his or her time in inaction."},{"definition":"One who idles; a lazy person; a sluggard."},{"definition":"Any member of a ship's crew who is not required to keep the night-watch"},{"definition":"A mechanical device such as a pulley or wheel that does not transmit power, but supports a moving belt etc."}],"partOfSpeech":"n"}]},{"word":"WAIVING","idx":47936,"count":358002,"meanings":[{"definitions":[{"definition":"To relinquish (a right etc.); to give up claim to; to forego.","example":"If you waive the right to be silent, anything you say can be used against you in a court of law."},{"definition":"To put aside, avoid."},{"definition":"To outlaw (someone)."},{"definition":"To abandon, give up (someone or something)."},{"definition":"To move from side to side; to sway."},{"definition":"To stray, wander."}],"partOfSpeech":"ve"}]},{"word":"SWIRLS","idx":47937,"count":357995,"meanings":[{"definitions":[{"definition":"A whirling eddy."},{"definition":"A twist or coil of something."},{"definition":"The upward rushing of a fish through the water to take the bait."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To twist or whirl, as an eddy.","example":"I swirled my brush around in the paint."},{"definition":"To be arranged in a twist, spiral or whorl."},{"definition":"To circulate."}],"partOfSpeech":"ve"}]},{"word":"DAMPERS","idx":47938,"count":357988,"meanings":[{"definitions":[{"definition":"Something that damps or checks:"},{"definition":"Bread made from a basic recipe of flour, water, milk, and salt, but without yeast."}],"partOfSpeech":"n"}]},{"word":"DAWNED","idx":47940,"count":357979,"meanings":[{"definitions":[{"definition":"To begin to brighten with daylight.","example":"A new day dawns."},{"definition":"To start to appear or be realized.","example":"I don’t want to be there when the truth dawns on him."},{"definition":"To begin to give promise; to begin to appear or to expand."}],"partOfSpeech":"ve"}]},{"word":"EIGENVECTORS","idx":47942,"count":357943,"meanings":[{"definitions":[{"definition":"Given a linear transformation T, a vector x such that Ax=\\lambda x for some scalar \\lambda"},{"definition":"Specifically, given a matrix A, the eigenvector of the transformation \"leftside multiplication by A\""}],"partOfSpeech":"n"}]},{"word":"EXTRAPOLATED","idx":47944,"count":357922,"meanings":[{"definitions":[{"definition":"To infer by extending known information."},{"definition":"To estimate the value of a variable outside a known range from values within that range by assuming that the estimated value follows logically from the known ones"}],"partOfSpeech":"ve"}]},{"word":"CHAINING","idx":47945,"count":357872,"meanings":[{"definitions":[{"definition":"To fasten something with a chain."},{"definition":"To link multiple items together."},{"definition":"To secure someone with fetters."},{"definition":"To obstruct the mouth of a river etc with a chain."},{"definition":"To obligate."},{"definition":"To relate data items with a chain of pointers."},{"definition":"To be chained to another data item."},{"definition":"To measure a distance using a 66-foot long chain, as in land surveying."},{"definition":"(associated with Acorn Computers) To load and automatically run (a program)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process by which something is chained."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʃeɪnɪŋ/"}]},{"word":"CARELESSLY","idx":47946,"count":357864,"meanings":[{"definitions":[{"definition":"Giving the appearance of carelessness; relaxedly.","example":"The papers were carelessly strewn on the table."},{"definition":"Done without care or attention; inattentively.","example":"Distracted by the salesperson, he carelessly read the contract."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈkɛɹləsli/"},{"text":"/ˈkɛələsli/"}]},{"word":"DEFECTED","idx":47947,"count":357838,"meanings":[{"definitions":[{"definition":"To abandon or turn against; to cease or change one's loyalty, especially from a military organisation or political party."},{"definition":"To desert one's army, to flee from combat."},{"definition":"To join the enemy army."},{"definition":"To flee one's country and seek asylum."}],"partOfSpeech":"ve"}]},{"word":"CAMPYLOBACTER","idx":47951,"count":357814,"meanings":[{"definitions":[{"definition":"Any bacteria of the genus Campylobacter; a principal cause of food poisoning"}],"partOfSpeech":"n"}]},{"word":"SEIDEL","idx":47953,"count":357802,"meanings":[{"definitions":[{"definition":"A large beer mug or tankard, especially one with a lid."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsaɪdl̩/"},{"text":"/ˈzaɪd(ə)l/"}]}]