[{"word":"READERSHIP","idx":22495,"count":1304887,"meanings":[{"definitions":[{"definition":"The collected readers of a publication.","example":"The village newspaper has a readership of only 200 people."},{"definition":"The role or office of a reader.","example":"the Nora Chadwick Readership in Celtic Studies"}],"partOfSpeech":"n"}]},{"word":"HOAX","idx":22496,"count":1304864,"meanings":[{"definitions":[{"definition":"Anything deliberately intended to deceive or trick."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deceive (someone) by making them believe something that has been maliciously or mischievously fabricated."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hoax-us","text":"/hoʊks/"},{"audio":"hoax-uk","text":"/həʊks/"}]},{"word":"COHESION","idx":22498,"count":1304739,"meanings":[{"definitions":[{"definition":"State of cohering, or of working together.","example":"Unit cohesion is important in the military."},{"definition":"Various intermolecular forces that hold solids and liquids together."},{"definition":"Growing together of normally distinct parts of a plant."},{"definition":"Degree to which functionally related elements in a computing system belong together."},{"definition":"Grammatical or lexical relationship between different parts of the same text."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/koʊˈhiʒən/"},{"audio":"cohesion-uk"}]},{"word":"DIF","idx":22499,"count":1304707,"meanings":[{"definitions":[{"definition":"Difference"}],"partOfSpeech":"n"}]},{"word":"RECONNAISSANCE","idx":22501,"count":1304699,"meanings":[{"definitions":[{"definition":"The act of scouting or exploring (especially military or medical) to gain information."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"reconnaissance-ca","text":"/ɹɪˈkɒnəsəns/"}]},{"word":"GROUNDBREAKING","idx":22502,"count":1304637,"meanings":[{"definitions":[{"definition":"A ceremony to mark the beginning of construction."},{"definition":"The point at which construction begins."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Innovative; new, different; doing something that has never been done before.","example":"The latest model includes several groundbreaking features and improvements."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"groundbreaking-us","text":"/ˈɡɹaʊndbɹeɪkɪŋ/"}]},{"word":"ANTAGONISTS","idx":22503,"count":1304448,"meanings":[{"definitions":[{"definition":"An opponent or enemy."},{"definition":"One who antagonizes or stirs."},{"definition":"A chemical that binds to a receptor but does not produce a physiological response, blocking the action of agonist chemicals.","example":"2001: The calcium antagonists represent one of the top ten classes of prescription drugs in terms of commercial value, with worldwide sales of nearly $10 billion in 1999. — Leslie Iversen, Drugs: A Very Short Introduction (Oxford 2001, p. 41)"},{"definition":"(authorship) The main character or force opposing the protagonist in a literary work or drama."},{"definition":"A muscle that acts in opposition to another.","example":"A flexor, which bends a part, is the antagonist of an extensor, which extends it."}],"partOfSpeech":"n"}]},{"word":"TRANSDUCER","idx":22504,"count":1304419,"meanings":[{"definitions":[{"definition":"A device that converts energy from one form into another."},{"definition":"A state machine that generates output based on a given input."}],"partOfSpeech":"n"}]},{"word":"BACHELORS","idx":22505,"count":1304345,"meanings":[{"definitions":[{"definition":"A person, especially a man, who is socially regarded as able to marry, but has not yet."},{"definition":"The first or lowest academical degree conferred by universities and colleges; a bachelor's degree."},{"definition":"Someone who has achieved a bachelor's degree."},{"definition":"A bachelor apartment."},{"definition":"An unmarried woman."},{"definition":"A knight who had no standard of his own, but fought under the standard of another in the field."},{"definition":"Among London tradesmen, a junior member not yet admitted to wear the livery."},{"definition":"A kind of bass, an edible freshwater fish (Pomoxis annularis) of the southern United States."}],"partOfSpeech":"n"}]},{"word":"SEROTONIN","idx":22506,"count":1304253,"meanings":[{"definitions":[{"definition":"An indoleamine neurotransmitter, 5-hydroxytryptamine, that is involved in depression, appetite, etc., and is crucial in maintaining a sense of well-being, security, etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"serotonin-uk","text":"/ˌsɛɹəˈtəʊnɪn/"}]},{"word":"COMPLEMENTS","idx":22507,"count":1304168,"meanings":[{"definitions":[{"definition":"A protective substance that exists in the serum or other bodily fluid and is capable of killing microorganisms; complement."},{"definition":"Something (or someone) that completes; the consummation."},{"definition":"The act of completing something, or the fact of being complete; completion, completeness, fulfilment."},{"definition":"The totality, the full amount or number which completes something."},{"definition":"Something which completes one's equipment, dress etc.; an accessory."},{"definition":"The whole working force of a vessel."},{"definition":"Fullness (of the moon)."},{"definition":"An angle which, together with a given angle, makes a right angle."},{"definition":"Something which completes, something which combines with something else to make up a complete whole; loosely, something perceived to be a harmonious or desirable partner or addition."},{"definition":"(grammar) A word or group of words that completes a grammatical construction in the predicate and that describes or is identified with the subject or object."},{"definition":"An interval which, together with the given interval, makes an octave."},{"definition":"The color which, when mixed with the given color, gives black (for mixing pigments) or white (for mixing light).","example":"The complement of blue is orange."},{"definition":"Given two sets, the set containing one set's elements that are not members of the other set (whether a relative complement or an absolute complement).","example":"The complement of the odd numbers is the even numbers, relative to the natural numbers."},{"definition":"One of several blood proteins that work with antibodies during an immune response."},{"definition":"An expression related to some other expression such that it is true under the same conditions that make other false, and vice versa."},{"definition":"A voltage level with the opposite logical sense to the given one."},{"definition":"A bit with the opposite value to the given one; the logical complement of a number."},{"definition":"The diminished radix complement of a number; the nines' complement of a decimal number; the ones' complement of a binary number.","example":"The complement of 01100101_2 is 10011010_2."},{"definition":"The radix complement of a number; the two's complement of a binary number.","example":"The complement of 01100101_2 is 10011011_2."},{"definition":"The numeric complement of a number.","example":"The complement of −123 is 123."},{"definition":"A nucleotide sequence in which each base is replaced by the complementary base of the given sequence: adenine (A) by thymine (T) or uracil (U), cytosine (C) by guanine (G), and vice versa.","example":"A DNA molecule is formed from two strands, each of which is the complement of the other."},{"definition":"Old spelling of compliment"},{"definition":"A good whose appeal increases with the popularity of its complement"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To complete, to bring to perfection, to make whole.","example":"We believe your addition will complement the team."},{"definition":"To provide what the partner lacks and lack what the partner provides, thus forming part of a whole.","example":"I believe our talents really complement each other."},{"definition":"To change a voltage, number, color, etc. to its complement."},{"definition":"Old form of compliment"}],"partOfSpeech":"ve"}]},{"word":"OBSERVES","idx":22509,"count":1303947,"meanings":[{"definitions":[{"definition":"To notice or view, especially carefully or with attention to detail.","example":"From this vantage point we can observe the behavior of the animals in their natural habitat."},{"definition":"To follow or obey the custom, practice, or rules (especially of a religion).","example":"Please observe all posted speed limits."},{"definition":"To take note of and celebrate (a holiday or similar occurrence)."},{"definition":"To comment on something; to make an observation.","example":"The senator observed that the bill would be detrimental to his constituents."}],"partOfSpeech":"ve"}]},{"word":"RADIATORS","idx":22511,"count":1303928,"meanings":[{"definitions":[{"definition":"Anything which radiates or emits rays."},{"definition":"A device that lowers engine coolant temperature by conducting heat to the air, through metal fins."},{"definition":"(of buildings) A finned metal fixture that carries hot water or steam in order to heat a room."},{"definition":"A type of antenna."}],"partOfSpeech":"n"}]},{"word":"CORPORAL","idx":22512,"count":1303585,"meanings":[{"definitions":[{"definition":"Having a physical, tangible body; material, corporeal."},{"definition":"Of or pertaining to the body, especially the human body; bodily.","example":"corporal punishment"},{"definition":"Pertaining to the body (the thorax and abdomen), as distinguished from the head, limbs and wings, etc."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A non-commissioned officer army rank with NATO code OR-4. The rank below a sergeant but above a lance corporal and private."},{"definition":"A non-commissioned officer rank in the police force, below a sergeant but above a private or patrolman."},{"definition":"A worker in charge of the wagonway, reporting to the deputy."},{"definition":"The white linen cloth on which the elements of the Eucharist are placed; a communion cloth."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɔɹ.pɝ.əl/"},{"text":"/ˈkɔː.pɜ.ɹəl/"},{"audio":"corporal-ca"}]},{"word":"BEAGLE","idx":22514,"count":1303392,"meanings":[{"definitions":[{"definition":"A small short-legged smooth-coated scenthound, often tricolored and sometimes used for hunting hares. Its friendly disposition makes it suitable as a family pet."},{"definition":"A person who snoops on others; a detective."},{"definition":"A bailiff."},{"definition":"A small kind of shark."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hunt with beagles."},{"definition":"To search."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"[biːɡəɫ]"}]},{"word":"WARY","idx":22515,"count":1303191,"meanings":[{"definitions":[{"definition":"Cautious of danger; carefully watching and guarding against deception, trickery, and dangers; suspiciously prudent","example":"He is wary of dogs."},{"definition":"Characterized by caution; guarded; careful; on one's guard"},{"definition":"Thrifty, provident"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈwɛəɹi/"},{"text":"/ˈwɛəɹ.i/"}]},{"word":"CADMIUM","idx":22516,"count":1303073,"meanings":[{"definitions":[{"definition":"A chemical element (symbol Cd) with an atomic number of 48: a soft, silvery-white metal."},{"definition":"A single atom of this element."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkædmiəm/"}]},{"word":"SPEEDO","idx":22518,"count":1302913,"meanings":[{"definitions":[{"definition":"A speedometer, particularly one in a race car or other automobile."},{"definition":"A tight-fitting swimsuit, especially commonly worn by competitive swimmers and divers. Usually implies a brief or bikini style swimsuit.","example":"You can tell the serious swimmers: they're the guys wearing the Speedos."}],"partOfSpeech":"n"}]},{"word":"LOCUST","idx":22519,"count":1302839,"meanings":[{"definitions":[{"definition":"Any of the grasshoppers, often polyphenic and usually swarming, in the family Acrididae that are very destructive to crops and other vegetation, (especially) the migratory locust (Locusta migratoria)."},{"definition":"A fruit or pod of the carob tree."},{"definition":"Any of various often leguminous trees and shrubs, especially of the genera Robinia and Gleditsia; the locust tree."},{"definition":"A cicada."},{"definition":"A Mainlander."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To come in a swarm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"locust-us","text":"/ˈloʊ.kəst/"}]},{"word":"DETACHABLE","idx":22520,"count":1302471,"meanings":[{"definitions":[{"definition":"Any device that is designed so that it can be detached from something else."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Designed to be unfastened or disconnected without damage."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/diːtætʃəbl̩/"}]},{"word":"CONDENSER","idx":22521,"count":1302457,"meanings":[{"definitions":[{"definition":"A device designed to condense a gas into a liquid, either as part of a still, steam engine, refrigerator or similar machine."},{"definition":"A capacitor."},{"definition":"A lens (or combination of lenses) designed to gather light and focus it onto a specimen or part of a mechanism."},{"definition":"A dental instrument used to pack filling into a cavity in a tooth."}],"partOfSpeech":"n"}]},{"word":"ARTICULATION","idx":22522,"count":1302431,"meanings":[{"definitions":[{"definition":"A joint or the collection of joints at which something is articulated, or hinged, for bending.","example":"The articulation allowed the robot to move around corners."},{"definition":"A manner or method by which elements of a system are connected."},{"definition":"The quality, clarity or sharpness of speech.","example":"His volume is reasonable, but his articulation could use work."},{"definition":"The manner in which a phoneme is pronounced."},{"definition":"The manner in which something is articulated (tongued, slurred or bowed).","example":"The articulation in this piece is tricky because it alternates between legato and staccato."},{"definition":"The interrelation and congruence of the flow of data between financial statements of an entity, especially between the income statement and balance sheet."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"articulation-us","text":"/ɑɹˌtɪk.jəˈleɪ.ʃən/"}]},{"word":"SIMPLIFIES","idx":22523,"count":1302397,"meanings":[{"definitions":[{"definition":"To make simpler, either by reducing in complexity, reducing to component parts, or making easier to understand."},{"definition":"To become simpler."}],"partOfSpeech":"ve"}]},{"word":"SLEEVELESS","idx":22524,"count":1302246,"meanings":[{"definitions":[{"definition":"Of a garment, having no sleeves."},{"definition":"Wanting a cover, pretext, or palliation; unreasonable; profitless; useless.","example":"The vexation of a sleeveless errand. — Bishop Warburton."}],"partOfSpeech":"j"}]},{"word":"MOTORISTS","idx":22525,"count":1302021,"meanings":[{"definitions":[{"definition":"One who drives a motor vehicle."}],"partOfSpeech":"n"}]},{"word":"VILLAIN","idx":22526,"count":1301918,"meanings":[{"definitions":[{"definition":"A vile, wicked person."},{"definition":"In fiction, a character who has the role of being bad, especially antagonizing the hero."},{"definition":"Any opponent player, especially a hypothetical player for example and didactic purposes. Compare: hero.","example":"Let's discuss how to play if you are the chip leader (that is, if you have more chips than all the villains)."},{"definition":"A feudal tenant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To debase; to degrade."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"villain-us","text":"/ˈvɪlən/"}]},{"word":"TBSP","idx":22527,"count":1301901,"meanings":[{"definitions":[{"definition":"A large spoon, used for eating food from a bowl."},{"definition":"A spoon too large for eating, usually used for cooking or serving."},{"definition":"A unit of volume, the value of which varies regionally; in the US: three teaspoons or roughly 15 ml; in Britain and Canada: exactly 15 ml; in Australia: four teaspoons or 20 ml."}],"partOfSpeech":"n"}]},{"word":"WAIVERS","idx":22528,"count":1301886,"meanings":[{"definitions":[{"definition":"The act of waiving, or not insisting on, some right, claim, or privilege."},{"definition":"A legal document removing some requirement, such as waiving a right (giving it up) or a waiver of liability (agreeing to hold someone blameless).","example":"I had to sign a waiver when I went skydiving, agreeing not to sue even if something went wrong."},{"definition":"Something that releases a person from a requirement.","example":"I needed a waiver from the department head to take the course because I didn't technically have the prerequisite courses."},{"definition":"The process of waiving or outlawing a person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To waive (to relinquish, to forego)."}],"partOfSpeech":"ve"}]},{"word":"OFT","idx":22531,"count":1301717,"meanings":[{"definitions":[{"definition":"(and in combination) often; frequently; not rarely","example":"An oft-told tale"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"oft-us","text":"/ɔft/"}]},{"word":"SECURES","idx":22533,"count":1301645,"meanings":[{"definitions":[{"definition":"To make safe; to relieve from apprehensions of, or exposure to, danger; to guard; to protect."},{"definition":"To put beyond hazard of losing or of not receiving; to make certain; to assure; frequently with against or from, or formerly with of.","example":"to secure a creditor against loss; to secure a debt by a mortgage"},{"definition":"To make fast; to close or confine effectually; to render incapable of getting loose or escaping.","example":"to secure a prisoner; to secure a door, or the hatches of a ship"},{"definition":"To get possession of; to make oneself secure of; to acquire certainly.","example":"to secure an estate"},{"definition":"To plight or pledge."}],"partOfSpeech":"ve"}]},{"word":"IMPENDING","idx":22536,"count":1301330,"meanings":[{"definitions":[{"definition":"To hang or be suspended over (something); to overhang."},{"definition":"Figuratively to hang over (someone) as a threat or danger."},{"definition":"To threaten to happen; to be about to happen, to be imminent."},{"definition":"To pay."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something that impends or threatens; an expected event."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Approaching; drawing near; about to happen or expected to happen.","example":"I have no time right now because of an impending paper submission deadline."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪmˈpɛndɪŋ/"}]},{"word":"REJOICE","idx":22537,"count":1301321,"meanings":[{"definitions":[{"definition":"To be very happy, be delighted, exult; to feel joy."},{"definition":"To have (someone) as a lover or spouse; to enjoy sexually."},{"definition":"To make happy, exhilarate."},{"definition":"To enjoy."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rejoice-us","text":"/ɹɪˈd͡ʒɔɪs/"}]},{"word":"PLUMPER","idx":22539,"count":1300925,"meanings":[{"definitions":[{"definition":"Having a full and rounded shape; chubby, somewhat overweight.","example":"a plump baby;  plump cheeks"},{"definition":"Fat."},{"definition":"Sudden and without reservation; blunt; direct; downright."}],"partOfSpeech":"j"},{"definitions":[{"definition":"One who plumps or swells out something else."},{"definition":"That which plumps or swells out something else."},{"definition":"Hence, something carried in the mouth to distend the cheeks."},{"definition":"In elections, a vote given to one candidate only, when two or more are to be elected, thus giving him or her the advantage over the others; a person who gives his or her vote thus is said to plump, or to plump his or her vote."},{"definition":"A voter who plumps his or her vote."},{"definition":"A downright, unqualified lie."},{"definition":"An obese woman, especially in pornography."}],"partOfSpeech":"n"}]},{"word":"UTERINE","idx":22541,"count":1300507,"meanings":[{"definitions":[{"definition":"A uterine sibling."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the uterus."},{"definition":"Born of the same mother but of a different father.","example":"uterine siblings"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈjutəɹaɪn/"}]},{"word":"BURSTS","idx":22542,"count":1300477,"meanings":[{"definitions":[{"definition":"An act or instance of bursting.","example":"The bursts of the bombs could be heard miles away."},{"definition":"A sudden, often intense, expression, manifestation or display."},{"definition":"A series of shots fired from an automatic firearm."},{"definition":"A drinking spree."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To break from internal pressure.","example":"I blew the balloon up too much, and it burst."},{"definition":"To cause to break from internal pressure.","example":"I burst the balloon when I blew it up too much."},{"definition":"To cause to break by any means."},{"definition":"To separate (printer paper) at perforation lines.","example":"I printed the report on form-feed paper, then burst the sheets."},{"definition":"To enter or exit hurriedly and unexpectedly."},{"definition":"To erupt; to change state suddenly as if bursting.","example":"The flowers burst into bloom on the first day of spring."},{"definition":"To produce as an effect of bursting.","example":"to burst a hole through the wall"},{"definition":"To interrupt suddenly in a violent or explosive manner; to shatter."}],"partOfSpeech":"ve"}]},{"word":"APARTHEID","idx":22543,"count":1300164,"meanings":[{"definitions":[{"definition":"The policy of racial separation used by South Africa from 1948 to 1990."},{"definition":"(by extension) Any similar policy of racial separation/segregation and discrimination."},{"definition":"(by extension) A policy or situation of segregation based on some specified attribute."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To impose a policy of segregation of groups of people, especially one based on race."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"apartheid-us","text":"/əˈpɑɹ.taɪd/"}]},{"word":"MORPHOLOGICAL","idx":22547,"count":1299968,"meanings":[{"definitions":[{"definition":"Of, or pertaining to, morphology."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌmɔːfəˈlɒd͡ʒɪkəl/"}]},{"word":"HURDLES","idx":22548,"count":1299924,"meanings":[{"definitions":[{"definition":"An artificial barrier, variously constructed, over which athletes or horses jump in a race.","example":"He ran in the 100 metres hurdles."},{"definition":"A perceived obstacle."},{"definition":"A movable frame of wattled twigs, osiers, or withes and stakes, or sometimes of iron, used for enclosing land, for folding sheep and cattle, for gates, etc.; also, in fortification, used as revetments, and for other purposes."},{"definition":"A sled or crate on which criminals were formerly drawn to the place of execution."},{"definition":"A sport where athletes or animals run along a track obstructed by regularly placed hurdles that must be leapt over."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To jump over something while running.","example":"He hurdled the bench in his rush to get away."},{"definition":"To compete in the track and field events of hurdles (e.g. high hurdles)."},{"definition":"To overcome an obstacle."},{"definition":"To hedge, cover, make, or enclose with hurdles."}],"partOfSpeech":"ve"}]},{"word":"RIA","idx":22552,"count":1299359,"meanings":[{"definitions":[{"definition":"A submergent coastal landform, often known as a drowned river valley"}],"partOfSpeech":"n"}]},{"word":"GEESE","idx":22554,"count":1299115,"meanings":[{"definitions":[{"definition":"Any of various grazing waterfowl of the family Anatidae, which have feathers and webbed feet and are capable of flying, swimming, and walking on land, and which are bigger than ducks.","example":"There is a flock of geese on the pond."},{"definition":"A female goose (sense 1)."},{"definition":"The flesh of the goose used as food."},{"definition":"A silly person."},{"definition":"A tailor's iron, heated in live coals or embers, used to press fabrics."},{"definition":"A young woman or girlfriend."},{"definition":"An old English board game in which players moved counters along a board, earning a double move when they reached the picture of a goose."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"geese-us","text":"/ˈɡiːs/"}]},{"word":"CONDEMNATION","idx":22555,"count":1299011,"meanings":[{"definitions":[{"definition":"The act of condemning or pronouncing to be wrong"},{"definition":"The act of judicially condemning, or adjudging guilty, unfit for use, or forfeited; the act of dooming to punishment or forfeiture."},{"definition":"The state of being condemned."},{"definition":"The ground or reason of condemning."},{"definition":"The process by which a public entity exercises its powers of eminent domain."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌkɑndəmˈneɪʃən/"},{"text":"/ˌkɒndəmˈneɪʃən/"}]},{"word":"CANDIES","idx":22556,"count":1298890,"meanings":[{"definitions":[{"definition":"Edible, sweet-tasting confectionery containing sugar, or sometimes artificial sweeteners, and often flavored with fruit, chocolate, nuts, herbs and spices, or artificial flavors."},{"definition":"A piece of confectionery of this kind."},{"definition":"(slang, chiefly US) crack cocaine."},{"definition":"A unit of mass used in southern India, equal to twenty maunds, roughly equal to 500 pounds avoirdupois but varying locally."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook in, or coat with, sugar syrup."},{"definition":"To have sugar crystals form in or on.","example":"Fruits preserved in sugar candy after a time."},{"definition":"To be formed into candy; to solidify in a candylike form or mass."}],"partOfSpeech":"ve"}]},{"word":"POLIO","idx":22557,"count":1298845,"meanings":[{"definitions":[{"definition":"A sufferer from poliomyelitis."},{"definition":"Acute infection by the poliovirus, especially of the motor neurons in the spinal cord and brainstem, leading to muscle weakness, paralysis and sometimes deformity."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-ljoʊ/"},{"text":"/ˈpəʊljəʊ/"}]},{"word":"SIDEWALKS","idx":22558,"count":1298816,"meanings":[{"definitions":[{"definition":"A footpath, usually paved, at the side of a road for the use of pedestrians; a pavement (UK) or footpath (Australia, New Zealand)"},{"definition":"(by extension) any paved footpath, even if not located at the side of a road"}],"partOfSpeech":"n"}]},{"word":"FORMIDABLE","idx":22560,"count":1298736,"meanings":[{"definitions":[{"definition":"Causing fear, dread, awe, or discouragement as a result of size, strength, or some other impressive feature; commanding respect; causing wonder or astonishment."},{"definition":"Difficult to defeat or overcome.","example":"a formidable opponent"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"formidable-us","text":"/fɔːɹˈmɪdəbəl/"}]},{"word":"PUN","idx":22561,"count":1298700,"meanings":[{"definitions":[{"definition":"A joke or type of wordplay in which similar definitions or sounds of two words or phrases, or different definitions of the same word, are deliberately confused.","example":"The pun is the lowest form of wit."},{"definition":"A Korean unit of length equivalent to about 0.3 cm."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To beat; strike with force; to ram; to pound, as in a mortar; reduce to powder, to pulverize."},{"definition":"To make or tell a pun; to make a play on words.","example":"We punned about the topic until all around us groaned."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pun-uk","text":"/pʌn/"}]},{"word":"REGATTA","idx":22566,"count":1298113,"meanings":[{"definitions":[{"definition":"A series of boat races, or sometimes a single race."},{"definition":"A striped cotton fabric."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪˈɡætə/"}]},{"word":"RESTED","idx":22567,"count":1297976,"meanings":[{"definitions":[{"definition":"To cease from action, motion, work, or performance of any kind; stop; desist; be without motion."},{"definition":"To come to a pause or an end; end."},{"definition":"To be free from that which harasses or disturbs; be quiet or still; be undisturbed."},{"definition":"To be or to put into a state of rest.","example":"I shall not rest until I have uncovered the truth."},{"definition":"To stay, remain, be situated.","example":"The blame seems to rest with your father."},{"definition":"To lean, lie, or lay.","example":"A column rests on its pedestal."},{"definition":"To complete one's active advocacy in a trial or other proceeding, and thus to wait for the outcome (however, one is still generally available to answer questions, etc.)","example":"I rest my case."},{"definition":"To sleep; slumber."},{"definition":"To lie dormant."},{"definition":"To sleep the final sleep; sleep in death; die; be dead."},{"definition":"To rely or depend on.","example":"The decision rests on getting a bank loan."},{"definition":"To be satisfied; to acquiesce."},{"definition":"To remain."},{"definition":"To arrest."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(usually with \"well\") recovered"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rested-us","text":"/ˈɹɛstəd/"}]},{"word":"CHATROOM","idx":22568,"count":1297966,"meanings":[{"definitions":[{"definition":"Part of a website where visitors can converse in typed messages."}],"partOfSpeech":"n"}]},{"word":"PAUSED","idx":22569,"count":1297918,"meanings":[{"definitions":[{"definition":"To take a temporary rest, take a break for a short period after an effort."},{"definition":"To interrupt an activity and wait.","example":"When telling the scary story, he paused for effect."},{"definition":"To hesitate; to hold back; to delay."},{"definition":"To halt the play or playback of, temporarily, so that it can be resumed from the same point.","example":"to pause a song, a video, or a computer game"},{"definition":"To consider; to reflect."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"paused-us","text":"/pɔzd/"}]},{"word":"POLARITY","idx":22571,"count":1297690,"meanings":[{"definitions":[{"definition":"The state of being a north pole or south pole; the magnetic equivalent of electric charge"},{"definition":"The separation, alignment or orientation of something into two opposed poles."},{"definition":"Either of the two extremes of such attributes."},{"definition":"The dipole-dipole intermolecular forces between the slightly positively-charged end of one molecule to the negative end of another or the same molecule. Wp"},{"definition":"The division of an embryo into an animal pole and a vegetal pole within a blastula. Wp"},{"definition":"Spatial differences in shape, structure, and function within a cell. Wp"},{"definition":"A measure of the electrical potential at the ends of a circuit. Wp"},{"definition":"The direction of a wave's amplitude or its being in phase or antiphase."},{"definition":"(grammar) The grammatical category of the affirmative and the negative. Wp"},{"definition":"A duality that is an involution, i.e. has order two. Wp"},{"definition":"An indicator of the positivity or negativity of a literal. Wp"},{"definition":"Any of the various ways in which power is distributed within the international system. Wp"},{"definition":"(gender) The concept of dualism between masculine and feminine. Wp"},{"definition":"A correspondence between the points in the plane of a triangle not lying on the sides of the triangle and lines in the plane of the triangle not passing through the vertices of the triangle."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pəˈlærɪti/"}]},{"word":"OVERRIDES","idx":22572,"count":1297543,"meanings":[{"definitions":[{"definition":"A mechanism, device or procedure used to counteract an automatic control."},{"definition":"A royalty."},{"definition":"A device for prioritizing audio signals, such that certain signals receive priority over others."},{"definition":"A method with the same name and signature as a method in a superclass, which runs instead of that method, when an object of the subclass is involved."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride across or beyond something."},{"definition":"To ride a horse too hard."},{"definition":"To counteract the normal operation of something; to countermand with orders of higher priority.","example":"The Congress promptly overrode the president's veto, passing the bill into law."},{"definition":"To define a new behaviour of a method by creating the same method of the superclass with the same name and signature."}],"partOfSpeech":"ve"}]},{"word":"ABANDONMENT","idx":22573,"count":1297503,"meanings":[{"definitions":[{"definition":"The act of abandoning, or the state of being abandoned; total desertion; relinquishment."},{"definition":"The voluntary leaving of a person to whom one is bound by a special relation, as a wife, husband or child; desertion.","example":"Since he left her, she's suing him for divorce on grounds of abandonment."},{"definition":"An abandoned building or structure.","example":"High-profile abandonments are harder to infiltrate for urban explorers due to their heightened security."},{"definition":"The relinquishment of a right, claim, or privilege; relinquishment of right to secure a patent by an inventor; relinquishment of copyright by an author."},{"definition":"The relinquishment by the insured to the underwriters of what may remain of the property insured after a loss or damage by a peril insured against."},{"definition":"The cessation of service on a particular segment of the lines of a common carrier, as granted by a government agency."},{"definition":"A refusal to receive freight so damaged in transit as to be worthless and render carrier liable for its value."},{"definition":"The self-surrender to an outside influence."},{"definition":"Abandon; careless freedom or ease; surrender to one's emotions."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"abandonment-us","text":"/əˈbæn.dn̩.mn̩t/"}]},{"word":"RIFF","idx":22574,"count":1297450,"meanings":[{"definitions":[{"definition":"A repeated instrumental melody line in a song.","example":"Listen to one of the greatest guitar riffs of all time!"},{"definition":"A clever or witty remark."},{"definition":"A variation on something."},{"definition":"A spoof."},{"definition":"The belly; the bowels."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To improvise in the performance or practice of an art, especially by expanding on or making novel use of traditional themes."},{"definition":"To riffle."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹɪf/"}]},{"word":"WIDTHS","idx":22575,"count":1297416,"meanings":[{"definitions":[{"definition":"The state of being wide."},{"definition":"The measurement of the extent of something from side to side."},{"definition":"A piece of material measured along its smaller dimension, especially fabric."},{"definition":"The horizontal distance between a batsman and the ball as it passes him."},{"definition":"The use of all the width of the pitch, from one side to the other.","example":"Manchester United like to play with width."}],"partOfSpeech":"n"}]},{"word":"ATTENUATION","idx":22577,"count":1297336,"meanings":[{"definitions":[{"definition":"A gradual diminishing of strength."},{"definition":"A reduction in the level of some property with distance, especially the amplitude of a wave or the strength of a signal."},{"definition":"A weakening in the virulence of a pathogen or other microorganism."},{"definition":"The tapering of a leaf etc to a fine point."},{"definition":"A fabrication process in which a material is stretched out into a thin shape."},{"definition":"The reduction of the active principles of medicines to minute doses."},{"definition":"The proportion of sugar that is converted to ethanol by a yeast."}],"partOfSpeech":"n"}]},{"word":"NADA","idx":22578,"count":1297254,"meanings":[{"definitions":[{"definition":"Nothing."}],"partOfSpeech":"p"}],"phonetics":[{"audio":"nada-us"}]},{"word":"BROTH","idx":22580,"count":1297117,"meanings":[{"definitions":[{"definition":"Water in which food (meat or vegetable etc) has been boiled."},{"definition":"A soup made from broth and other ingredients such as vegetables, herbs or diced meat."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"broth-us","text":"/bɹɔθ/"}]},{"word":"MARTINS","idx":22582,"count":1296812,"meanings":[{"definitions":[{"definition":"Any of various passerine birds of the family Hirundinidae, which also includes swallows, that catch insects whilst flying."},{"definition":"A perforated stone-faced runner for grinding."}],"partOfSpeech":"n"}]},{"word":"SEDUCTION","idx":22586,"count":1296699,"meanings":[{"definitions":[{"definition":"The act of seducing.","example":"Seduction is the fine art of manipulating people based on physical attraction and desire."},{"definition":"(in English common law) The felony of, as a man, inducing a previously chaste unmarried female to engage in sexual intercourse on a promise of marriage."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɪˈdʌk.ʃn̩/"}]},{"word":"FERTILIZERS","idx":22587,"count":1296340,"meanings":[{"definitions":[{"definition":"A natural substance that is used to make the ground more suitable for growing plants."},{"definition":"A chemical compound created to have the same effect."}],"partOfSpeech":"n"}]},{"word":"GRAPEVINE","idx":22589,"count":1296319,"meanings":[{"definitions":[{"definition":"The plant, a vine of genus Vitis, on which grapes grow.","example":"Although many grape vines have geographical names, those rarely reflect their real origin, if known at all."},{"definition":"A rumor."},{"definition":"An informal person-to-person means of circulating information or gossip.","example":"I heard through the grapevine that Jim will be leaving soon."},{"definition":"A move in which the feet are alternately placed in front of each other, while both remaining on the ice or ground, incorporating half-turns."},{"definition":"A leglock."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To restrain in a leglock."}],"partOfSpeech":"ve"}]},{"word":"CONTRASTS","idx":22591,"count":1295820,"meanings":[{"definitions":[{"definition":"To set in opposition in order to show the difference or differences between."},{"definition":"To form a contrast.","example":"Foreground and background strongly contrast."}],"partOfSpeech":"ve"}]},{"word":"DAUNTING","idx":22593,"count":1295706,"meanings":[{"definitions":[{"definition":"To discourage, intimidate."},{"definition":"To overwhelm."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Present participle of daunt."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Discouraging; inspiring fear."},{"definition":"Intimidatingly impressive; awe-inspiring, overwhelming."},{"definition":"Appearing to be difficult; challenging.","example":"It was a daunting task, but it was accomplished with some forward planning."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"daunting-uk","text":"/ˈdɔːntɪŋ/"}]},{"word":"TOPPLES","idx":22594,"count":1295649,"meanings":[{"definitions":[{"definition":"To push, throw over, overturn or overthrow something","example":"The massed crowds toppled the statue of the former dictator."},{"definition":"To totter and fall, or to lean as if about to do so","example":"The pile of pennies began to topple."}],"partOfSpeech":"ve"}]},{"word":"IMPROPERLY","idx":22597,"count":1295182,"meanings":[{"definitions":[{"definition":"In an improper manner; not properly"}],"partOfSpeech":"v"}]},{"word":"FUTURISTIC","idx":22598,"count":1294993,"meanings":[{"definitions":[{"definition":"Of technology, a concept, etc, so far advanced as to appear to be from the future."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfjuːt͡ʃɚɪstɪk/"}]},{"word":"NEBULA","idx":22599,"count":1294884,"meanings":[{"definitions":[{"definition":"A cloud in outer space consisting of gas or dust (e.g. a cloud formed after a star explodes)."},{"definition":"A white spot or slight opacity of the cornea."},{"definition":"A cloudy appearance in the urine"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nebula-us","text":"/ˈnɛbjʊlə/"}]},{"word":"AUTOFOCUS","idx":22600,"count":1294850,"meanings":[{"definitions":[{"definition":"A feature of some cameras and other optical systems that allows a correct focus on the subject to be obtained automatically","example":"This camera has autofocus, so it's more expensive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To focus automatically.","example":"My camera makes a funny sound when it autofocuses."}],"partOfSpeech":"ve"}]},{"word":"CHAI","idx":22601,"count":1294847,"meanings":[{"definitions":[{"definition":"A female gypsy."},{"definition":"Short for masala chai, a beverage made with black teas, steamed milk and sweet spices, based loosely on Indian recipes."}],"partOfSpeech":"n"}]},{"word":"OBSESSIVE","idx":22602,"count":1294838,"meanings":[{"definitions":[{"definition":"A person who is obsessed, who has an obsession."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Prone to cause obsession.","example":"The idea is too tempting, it's obsessive."},{"definition":"Having one thought or pursuing one activity to the absolute or nearly absolute exclusion of all others.","example":"Hardcore fans' obsessive behavior may take over their lives."},{"definition":"Excessive, as results from obsession.","example":"A workaholic's obsessive zeal may lead to success or burnout."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əbˈsɛsɪv/"}]},{"word":"CROWS","idx":22603,"count":1294733,"meanings":[{"definitions":[{"definition":"A bird, usually black, of the genus Corvus, having a strong conical beak, with projecting bristles; it has a harsh, croaking call."},{"definition":"The cry of the rooster."},{"definition":"Any of various dark-coloured nymphalid butterflies of the genus Euploea."},{"definition":"A bar of iron with a beak, crook, or claw; a bar of iron used as a lever; a crowbar."},{"definition":"A gangplank (corvus) used by the Ancient Roman navy to board enemy ships."},{"definition":"(among butchers) The mesentery of an animal."},{"definition":"A black person."},{"definition":"The emblem of an eagle, a sign of military rank."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make the shrill sound characteristic of a rooster; to make a sound in this manner, either in gaiety, joy, pleasure, or defiance."},{"definition":"To shout in exultation or defiance; to brag.","example":"He’s been crowing all day about winning the game of cards."},{"definition":"To test the reed of a double reed instrument by placing the reed alone in the mouth and blowing it."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɹoʊz/"},{"text":"/kɹəʊz/"}]},{"word":"TRANSPLANTS","idx":22604,"count":1294723,"meanings":[{"definitions":[{"definition":"An act of uprooting and moving (something)."},{"definition":"Anything that is transplanted."},{"definition":"An operation in which tissue or an organ is transplanted."},{"definition":"A transplanted organ or tissue."},{"definition":"Someone who is not native to their area of residence."}],"partOfSpeech":"n"}]},{"word":"REFERRERS","idx":22605,"count":1294626,"meanings":[{"definitions":[{"definition":"A person who refers another."},{"definition":"The URL from which a user agent was referred to another URL."}],"partOfSpeech":"n"}]},{"word":"JUNKIE","idx":22606,"count":1294569,"meanings":[{"definitions":[{"definition":"A narcotics addict, especially a heroin user."},{"definition":"(by extension) An enthusiast of something.","example":"English people are travel junkies, but Americans hardly ever leave their state."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"junkie-au","text":"/ˈdʒʌŋki/"}]},{"word":"ADMITTING","idx":22607,"count":1294545,"meanings":[{"definitions":[{"definition":"To allow to enter; to grant entrance (to), whether into a place, into the mind, or into consideration","example":"A ticket admits one into a playhouse."},{"definition":"To allow (someone) to enter a profession or to enjoy a privilege; to recognize as qualified for a franchise.","example":"the prisoner was admitted to bail"},{"definition":"To concede as true; to acknowledge or assent to, as an allegation which it is impossible to deny","example":"he admitted his guilt"},{"definition":"To be capable of; to permit. In this sense, \"of\" may be used after the verb, or may be omitted.","example":"the words do not admit such a construction."},{"definition":"To give warrant or allowance, to grant opportunity or permission (+ of).","example":"circumstances do not admit of this"},{"definition":"To allow to enter a hospital or similar facility for treatment."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of admission; an allowing to enter."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ədˈmɪtɪŋ/"}]},{"word":"BLOOMING","idx":22610,"count":1294311,"meanings":[{"definitions":[{"definition":"To cause to blossom; to make flourish."},{"definition":"To bestow a bloom upon; to make blooming or radiant."},{"definition":"Of a plant, to produce blooms; to open its blooms."},{"definition":"Of a person, business, etc, to flourish; to be in a state of healthful, growing youth and vigour; to show beauty and freshness."},{"definition":"(Cooking) To bring out the flavor of a spice by cooking it in oil."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something blooms."},{"definition":"The process of making blooms from the ore or from cast iron."},{"definition":"A phenomenon where excessive light causes bright patches in a picture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Opening in blossoms; flowering."},{"definition":"Thriving in health, beauty, and vigor, vigour; indicating the freshness and beauties of youth or health."},{"definition":"Bloody; bleeding; extremely."}],"partOfSpeech":"j"},{"definitions":[{"definition":"(often followed by well) Bloody; bleeding; extremely.","example":"My train's late again. Blooming typical."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"blooming-us"},{"text":"/ˈbluː.mɪŋ/"}]},{"word":"MACE","idx":22611,"count":1294167,"meanings":[{"definitions":[{"definition":"A heavy fighting club.","example":"1786, The Mace is an ancient weapon, formerly much used by cavalry of all nations, and likewise by ecclesiastics, who in consequence of their tenures, frequently took the field, but were by a canon of the church forbidden to wield the sword. — Francis Grose, A Treatise on Ancient Armour and Weapons, page 51."},{"definition":"A ceremonial form of this weapon.","example":"1598, I am a king that find thee; and I know 'Tis not the balm, the sceptre, and the ball, The sword, the mace, the crown imperial, The intertissued robe of gold and pearl... — William Shakespeare, Henvry V, Act IV, Scene I, line 259."},{"definition":"A long baton used by some drum majors to keep time and lead a marching band. If this baton is referred to as a mace, by convention it has a ceremonial often decorative head, which, if of metal, usually is hollow and sometimes intricately worked."},{"definition":"An officer who carries a mace as an emblem of authority."},{"definition":"A knobbed mallet used by curriers in dressing leather to make it supple."},{"definition":"A billiard cue."},{"definition":"An old money of account in China equal to one tenth of a tael."},{"definition":"An old weight of 57.98 grains."},{"definition":"A spice obtained from the outer layer of the kernel of the fruit of the nutmeg."},{"definition":"Tear gas or pepper spray, especially for personal use."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit someone or something with a mace."},{"definition":"To spray in defense or attack with mace (pepper spray or tear gas) using a hand-held device."},{"definition":"To spray a similar noxious chemical in defense or attack using an available hand-held device such as an aerosol spray can."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mace-us"},{"text":"/meɪs/"}]},{"word":"TAPER","idx":22614,"count":1294069,"meanings":[{"definitions":[{"definition":"A slender wax candle; a small lighted wax candle"},{"definition":"(by extension) a small light."},{"definition":"A tapering form; gradual diminution of thickness and/or cross section in an elongated object","example":"The legs of the table had a slight taper to them."},{"definition":"A thin stick used for lighting candles, either a wax-coated wick or a slow-burning wooden rod."},{"definition":"One who operates a tape machine."},{"definition":"Someone who works with tape or tapes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make thinner or narrower at one end."},{"definition":"To diminish gradually."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Tapered; narrowing to a point."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"taper-us","text":"/ˈteɪpɚ/"}]},{"word":"ROTATIONAL","idx":22615,"count":1293795,"meanings":[{"definitions":[{"definition":"An employee in a job rotation scheme."},{"definition":"Something, such as a joint, that moves by rotating."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, pertaining to or caused by rotation.","example":"A steam turbine converts heat into rotational motion."}],"partOfSpeech":"j"}]},{"word":"WITHDRAWALS","idx":22616,"count":1293348,"meanings":[{"definitions":[{"definition":"Receiving from someone's care what one has earlier entrusted to them. Usually refers to money."},{"definition":"A method of birth control which consists of removing the penis from the vagina before ejaculation."},{"definition":"A type of metabolic shock the body undergoes when a substance, usually a toxin such as heroin, to which a patient is dependent is withheld. Sometimes used with the substance as modifier.","example":"caffeine withdrawal"},{"definition":"An act of withdrawing."},{"definition":"The sum of money taken from a bank account."}],"partOfSpeech":"n"}]},{"word":"PAGEVIEWS","idx":22617,"count":1293267,"meanings":[{"definitions":[{"definition":"An individual viewing of a web page by a user, often counted when measuring a web site's popularity."}],"partOfSpeech":"n"}]},{"word":"SYNAGOGUE","idx":22619,"count":1292897,"meanings":[{"definitions":[{"definition":"A place of worship for Jews."},{"definition":"A congregation of Jews for the purpose of worship or religious study."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"synagogue-us","text":"/ˈsɪ.nəˌɡɑɡ/"}]},{"word":"FINALIST","idx":22620,"count":1292891,"meanings":[{"definitions":[{"definition":"Somebody or something that appears in the final stage of a competition."},{"definition":"A university student in his/her final year of study."}],"partOfSpeech":"n"}]},{"word":"PORNOGRAPHIC","idx":22621,"count":1292757,"meanings":[{"definitions":[{"definition":"Containing an explicit depiction of sexual activity."}],"partOfSpeech":"j"}]},{"word":"SUGARS","idx":22622,"count":1292666,"meanings":[{"definitions":[{"definition":"Sucrose in the form of small crystals, obtained from sugar cane or sugar beet and used to sweeten food and drink."},{"definition":"A specific variety of sugar."},{"definition":"Any of various small carbohydrates that are used by organisms to store energy."},{"definition":"A small serving of this substance (typically about one teaspoon), used to sweeten a drink.","example":"He usually has his coffee white with one sugar."},{"definition":"A term of endearment.","example":"I'll be with you in a moment, sugar."},{"definition":"A kiss."},{"definition":"Effeminacy in a male, often implying homosexuality.","example":"I think John has a little bit of sugar in him."},{"definition":"Diabetes."},{"definition":"Anything resembling sugar in taste or appearance, especially in chemistry.","example":"Sugar of lead (lead acetate) is a poisonous white crystalline substance with a sweet taste."},{"definition":"Compliment or flattery used to disguise or render acceptable something obnoxious; honeyed or soothing words."},{"definition":"Heroin."},{"definition":"Money."},{"definition":"Syntactic sugar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add sugar to; to sweeten with sugar.","example":"John heavily sugars his coffee."},{"definition":"To make (something unpleasant) seem less so.","example":"She has a gift for sugaring what would otherwise be harsh words."},{"definition":"In making maple sugar, to complete the process of boiling down the syrup till it is thick enough to crystallize; to approach or reach the state of granulation; with the preposition off."},{"definition":"To apply sugar to trees or plants in order to catch moths."},{"definition":"To rewrite (source code) using syntactic sugar."},{"definition":"To compliment (a person)."}],"partOfSpeech":"ve"}]},{"word":"ARMAGEDDON","idx":22624,"count":1292606,"meanings":[{"definitions":[{"definition":"The scene of a decisive conflict on a great scale."},{"definition":"Any great and crucial conflict."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-ˈɡɛ.dən/"}]},{"word":"SELECTIVELY","idx":22626,"count":1292565,"meanings":[{"definitions":[{"definition":"In a selective manner, only affecting or applying to some selected cases."}],"partOfSpeech":"v"}]},{"word":"FALLOUT","idx":22628,"count":1292211,"meanings":[{"definitions":[{"definition":"The event of small airborne particles falling to the ground in significant quantities as a result of major industrial activity, volcano eruption, sandstorm, nuclear explosion, etc."},{"definition":"The particles themselves.","example":"On 26 April 1986 the reactor number four at the Chernobyl Nuclear Power Plant located in the Soviet Union near Pripyat in Ukraine exploded. Further explosions and the resulting fire sent a plume of highly radioactive fallout into the atmosphere and over an extensive geographical area."},{"definition":"A negative side effect; an undesirable or unexpected consequence.","example":"Psychological fallout in the shadow of terrorism, title of an article by Dr. Abraham Twerski, M.D. in http//www.jewishworldreview.com."},{"definition":"A declined offer in a sales transaction when acceptance was presumed."},{"definition":"The person who declines such an offer."},{"definition":"An impromptu guest used to fill in for another guest spot who is a no show or who has cancelled last minute"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɔlˌaʊt/"},{"text":"/ˈfɔːlaʊt/"}]},{"word":"ALLURE","idx":22629,"count":1292131,"meanings":[{"definitions":[{"definition":"The power to attract, entice; the quality causing attraction."},{"definition":"Gait; bearing"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To entice; to attract."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈl(j)ʊɚ/"}]},{"word":"INTESTINE","idx":22631,"count":1292080,"meanings":[{"definitions":[{"definition":"(often pluralized) The alimentary canal of an animal through which food passes after having passed all stomachs."},{"definition":"One of certain subdivisions of this part of the alimentary canal, such as the small or large intestine in human beings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Domestic; taking place within a given country or region."},{"definition":"Internal."},{"definition":"Depending upon the internal constitution of a body or entity; subjective."},{"definition":"Shut up; enclosed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"intestine-uk","text":"/ɪnˈtɛstɪn/"}]},{"word":"AMBASSADORS","idx":22632,"count":1292040,"meanings":[{"definitions":[{"definition":"A minister of the highest rank sent to a foreign court to represent there his sovereign or country. (Sometimes called ambassador-in-residence)"},{"definition":"An official messenger and representative."},{"definition":"A corporate representative, often the public face of the company.","example":"As front hall porter, you are an ambassador for the hotel."}],"partOfSpeech":"n"}]},{"word":"STALKER","idx":22634,"count":1291772,"meanings":[{"definitions":[{"definition":"A person who engages in stalking, i.e. quietly approaching animals to be hunted; a tracker or guide in hunting game."},{"definition":"A person who secretly follows someone, sometimes with unlawful intentions."},{"definition":"Any of various devices for removing the stalk from plants during harvesting."},{"definition":"Any bird that walks with a stalking motion."},{"definition":"A kind of fishing net."}],"partOfSpeech":"n"}]},{"word":"RECLAIM","idx":22635,"count":1291641,"meanings":[{"definitions":[{"definition":"The calling back of a hawk."},{"definition":"The bringing back or recalling of a person; the fetching of someone back."},{"definition":"An effort to take something back, to reclaim something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To return land to a suitable condition for use."},{"definition":"To obtain useful products from waste; to recycle."},{"definition":"To claim something back; to repossess."},{"definition":"To return someone to a proper course of action, or correct an error; to reform."},{"definition":"To tame or domesticate a wild animal."},{"definition":"To call back from flight or disorderly action; to call to, for the purpose of subduing or quieting."},{"definition":"To cry out in opposition or contradiction; to exclaim against anything; to contradict; to take exceptions."},{"definition":"To draw back; to give way."},{"definition":"To appeal from the Lord Ordinary to the inner house of the Court of Session."}],"partOfSpeech":"ve"}]},{"word":"KINGDOMS","idx":22639,"count":1291134,"meanings":[{"definitions":[{"definition":"A realm having a king and/or queen as its actual or nominal sovereign."},{"definition":"A realm, region, or conceptual space where something is dominant.","example":"the kingdom of the dead"},{"definition":"A rank in the classification of organisms, below domain and above phylum; a taxon at that rank (e.g. the plant kingdom, the animal kingdom)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"kingdoms-us"}]},{"word":"RICHNESS","idx":22641,"count":1291074,"meanings":[{"definitions":[{"definition":"The state or quality of being rich; richdom; wealth."},{"definition":"The state of having many examples or cases; abundance; profusion."},{"definition":"The number of types in a community."},{"definition":"The result or product of being rich."}],"partOfSpeech":"n"}]},{"word":"CONVERGE","idx":22642,"count":1291053,"meanings":[{"definitions":[{"definition":"Of two or more entities, to approach each other; to get closer and closer."},{"definition":"Of a sequence, to have a limit."},{"definition":"Of an iterative process, to reach a stable end point."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kən.ˈvɜːdʒ/"}]},{"word":"PIANOS","idx":22645,"count":1290758,"meanings":[{"definitions":[{"definition":"A percussive keyboard musical instrument, usually ranging over seven octaves, with white and black colored keys, played by pressing these keys, causing hammers to strike strings","example":"He can play \"Happy Birthday\" on the piano."}],"partOfSpeech":"n"}]},{"word":"DOL","idx":22646,"count":1290674,"meanings":[{"definitions":[{"definition":"The unit of measurement for pain."}],"partOfSpeech":"n"}]},{"word":"WORKINGS","idx":22647,"count":1290621,"meanings":[{"definitions":[{"definition":"(usually in the plural) Operation; action."},{"definition":"Method of operation."},{"definition":"The incidental or subsidiary calculations performed in solving an overall problem.","example":"Be sure to check your working."},{"definition":"Fermentation."},{"definition":"(of bodies of water) Becoming full of a vegetable substance."},{"definition":"A place where work is carried on.","example":"the abandoned mine workings"},{"definition":"The internal mechanism of some device or system."},{"definition":"The parts of a quarry or mine that are being (or has been) worked."}],"partOfSpeech":"n"}]},{"word":"SOPHISTICATION","idx":22649,"count":1290552,"meanings":[{"definitions":[{"definition":"Enlightenment or education."},{"definition":"Cultivated intellectual worldliness; savoir-faire."},{"definition":"Deceptive logic; sophistry."},{"definition":"Falsification or contamination."},{"definition":"Complexity."},{"definition":"Ability to deal with complexity."},{"definition":"The act of sophisticating; adulteration.","example":"the sophistication of drugs"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˌfɪs.tɪˈkeɪ.ʃən/"}]},{"word":"EXTINCT","idx":22650,"count":1290530,"meanings":[{"definitions":[{"definition":"To make extinct; to extinguish or annihilate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Extinguished, no longer alight (of fire, candles etc.)","example":"Poor Edward's cigarillo was already extinct."},{"definition":"No longer used; obsolete, discontinued.","example":"Luckily, such ideas about race are extinct in current sociological theory."},{"definition":"(of a group of organisms, as a species) No longer in existence; having died out.","example":"The dinosaurs have been extinct for millions of years."},{"definition":"No longer active.","example":"Most of the volcanos on this island are now extinct."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"extinct-uk","text":"/ɛkˈstɪŋkt/"}]},{"word":"PONDER","idx":22651,"count":1290410,"meanings":[{"definitions":[{"definition":"A period of deep thought.","example":"I lit my pipe and had a ponder about it, but reached no definite conclusion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wonder, think of deeply"},{"definition":"To consider (something) carefully and thoroughly; to chew over, mull over","example":"I have spent days pondering the meaning of life."},{"definition":"To weigh"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ponder-us","text":"/ˈpɑn.dɚ/"}]},{"word":"WRT","idx":22652,"count":1290357,"meanings":[{"definitions":[{"definition":"Initialism of with reference to."},{"definition":"Concerning; about.","example":"I am writing with regard to the advertisement that you placed in last week's Daily News."},{"definition":"Regarding; concerning; pertaining to."},{"definition":"Taking as the independent variable.","example":"To calculate acceleration, you need to differentiate velocity with respect to time."}],"partOfSpeech":"pr"}]},{"word":"MESSED","idx":22653,"count":1290228,"meanings":[{"definitions":[{"definition":"(transitive, often used with \"up\") To make untidy or dirty."},{"definition":"(transitive, often used with \"up\") To throw into disorder or to ruin."},{"definition":"To interfere.","example":"This doesn't concern you. Don't mess."},{"definition":"(used with \"with\") To screw around with, to bother, to be annoying to.","example":"Stop messing with me!"},{"definition":"To take meals with a mess."},{"definition":"To belong to a mess."},{"definition":"To eat (with others).","example":"I mess with the wardroom officers."},{"definition":"To supply with a mess."}],"partOfSpeech":"ve"}]},{"word":"OCEANSIDE","idx":22654,"count":1290126,"meanings":[{"definitions":[{"definition":"Located on the coast of an ocean."}],"partOfSpeech":"j"}]},{"word":"REVUE","idx":22655,"count":1290094,"meanings":[{"definitions":[{"definition":"A form of theatrical entertainment in which recent events, popular fads, etc., are parodied. Any entertainment featuring skits, dances, and songs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"revue-us","text":"/ɹəˈvjuː/"},{"audio":"revue-uk","text":"/ɹəˈvjuː/"}]},{"word":"LUNCHES","idx":22656,"count":1290036,"meanings":[{"definitions":[{"definition":"A light meal usually eaten around midday, notably when not as main meal of the day."},{"definition":"A break in play between the first and second sessions."},{"definition":"(Minnesota) Any small meal, especially one eaten at a social gathering.","example":"After the funeral there was a lunch for those who didn't go to the cemetery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat lunch.","example":"I like to lunch in Italian restaurants."},{"definition":"To treat to lunch."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈlʌntʃɪz/"}]},{"word":"FOOLED","idx":22660,"count":1289616,"meanings":[{"definitions":[{"definition":"To trick; to deceive"},{"definition":"To act in an idiotic manner; to act foolishly"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fuːld/"}]},{"word":"SMEAR","idx":22662,"count":1289528,"meanings":[{"definitions":[{"definition":"A mark made by smearing.","example":"This detergent cleans windows without leaving smears."},{"definition":"Any of various forms of distortion that make a signal harder to see or hear."},{"definition":"A Pap smear.","example":"I'm going to the doctor's this afternoon for a smear."},{"definition":"A false attack."},{"definition":"A maneuver in which the shoe is placed onto the holdless rock, and the friction from the shoe keeps it in contact"},{"definition":"A rough glissando in jazz music."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To spread (a substance, especially one that colours or is dirty) across a surface by rubbing.","example":"The artist smeared paint over the canvas in broad strokes."},{"definition":"To have a substance smeared on (a surface).","example":"She smeared her lips with lipstick."},{"definition":"To damage someone's reputation by slandering, misrepresenting, or otherwise making false accusations about an individual, their statements, or their actions.","example":"The opposition party attempted to smear the candidate by spreading incorrect and unverifiable rumors about their personal behavior."},{"definition":"To become spread by smearing.","example":"The paint is still wet — don't touch it or it will smear."},{"definition":"To climb without using footholds, using the friction from the shoe to stay on the wall."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"smear-uk","text":"/smɪə/"}]},{"word":"RIGGING","idx":22663,"count":1289503,"meanings":[{"definitions":[{"definition":"To fit out with a harness or other equipment."},{"definition":"To equip and fit (a ship) with sails, shrouds, and yards."},{"definition":"To dress or clothe in some costume."},{"definition":"To make or construct something in haste or in a makeshift manner.","example":"rig up a makeshift shelter"},{"definition":"To manipulate something dishonestly for personal gain or discriminatory purposes.","example":"to rig an election"},{"definition":"To make free with; hence, to steal; to pilfer."},{"definition":"To outfit a model with controls for animation."},{"definition":"To play the wanton; to act in an unbecoming manner; to play tricks."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Dress; tackle; especially , the ropes, chains, etc., that support the masts and spars of a sailing vessel, and serve as purchases for adjusting the sails, etc."},{"definition":"Similar supporting material used for construction work, or in film, theater, etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹɪɡɪŋ/"}]},{"word":"DERIVES","idx":22664,"count":1289433,"meanings":[{"definitions":[{"definition":"To obtain or receive (something) from something else."},{"definition":"To deduce (a conclusion) by reasoning."},{"definition":"To find the derivation of (a word or phrase)."},{"definition":"To create (a compound) from another by means of a reaction."},{"definition":"To originate or stem (from)."},{"definition":"To turn the course of (water, etc.); to divert and distribute into subordinate channels."}],"partOfSpeech":"ve"}]},{"word":"PRAISES","idx":22665,"count":1289337,"meanings":[{"definitions":[{"definition":"Commendation; favourable representation in words"},{"definition":"Worship"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give praise to; to commend, glorify, or worship.","example":"Be sure to praise Bobby for his excellent work at school this week."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"praises-us","text":"/ˈpɹeɪzɪz/"}]},{"word":"DETACHMENT","idx":22668,"count":1289268,"meanings":[{"definitions":[{"definition":"The action of detaching; separation."},{"definition":"The state of being detached or disconnected; insulation."},{"definition":"Indifference to the concerns of others; disregard; nonchalance; aloofness."},{"definition":"Absence of bias; impartiality; objectivity."},{"definition":"The separation of a military unit from the main body for a particular purpose or special mission."},{"definition":"The unit so dispatched."},{"definition":"A permanent unit organized for special duties."},{"definition":"Any smaller portion of a main body separately employed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"detachment-us","text":"/dɪˈtæt͡ʃmənt/"}]},{"word":"COMBOS","idx":22670,"count":1289126,"meanings":[{"definitions":[{"definition":"A small musical group.","example":"The jazz combo played nightly at the little restaurant."},{"definition":"A combination.","example":"I need to open the safe but I forgot the combo."},{"definition":"An action composed of a sequence of simpler actions, especially a composite attacking move in a fighting game."},{"definition":"A Caucasian man who marries or has a sexual relationship with an Aboriginal woman; a Caucasian man who lives among Aboriginal people and adopts Aboriginal culture"},{"definition":"A combo box."}],"partOfSpeech":"n"}]},{"word":"CLONED","idx":22671,"count":1288962,"meanings":[{"definitions":[{"definition":"To create a clone of.","example":"The scientists were able to clone a sheep."}],"partOfSpeech":"ve"}]},{"word":"BESTSELLER","idx":22678,"count":1288316,"meanings":[{"definitions":[{"definition":"A book or other product that has sold in large numbers."}],"partOfSpeech":"n"}]},{"word":"LIDS","idx":22679,"count":1288238,"meanings":[{"definitions":[{"definition":"A thin skin membrane that covers and moves over an eye."},{"definition":"The top or cover of a container."},{"definition":"A cap or hat."},{"definition":"One ounce of cannabis."},{"definition":"A bodyboard or bodyboarder."},{"definition":"A motorcyclist's crash helmet."},{"definition":"In amateur radio, an incompetent operator."},{"definition":"A hermetically sealed top piece on a microchip such as the integrated heat spreader on a CPU."},{"definition":"A restraint or control, as when \"putting a lid\" on something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put a lid on (something)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/lɪdz/"}]},{"word":"PORE","idx":22681,"count":1288093,"meanings":[{"definitions":[{"definition":"A tiny opening in the skin."},{"definition":"By extension any small opening or interstice, especially one of many, or one allowing the passage of a fluid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To study meticulously; to go over again and again."},{"definition":"To meditate or reflect in a steady way."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pore-us","text":"/pɔɹ/"}]},{"word":"MINIDISC","idx":22682,"count":1287945,"meanings":[{"definitions":[{"definition":"A disc/disk in MiniDisc format"},{"definition":"A minidisc player or recorder."}],"partOfSpeech":"n"}]},{"word":"EY","idx":22683,"count":1287922,"meanings":[{"definitions":[{"definition":"An egg."},{"definition":"An island."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(epicene) A gender-neutral third-person singular subject pronoun, one of the so-called Spivak pronouns, equivalent to the singular they and coordinate with gendered pronouns he and she."}],"partOfSpeech":"p"}]},{"word":"RADIANCE","idx":22684,"count":1287790,"meanings":[{"definitions":[{"definition":"The quality of being radiant, shining, bright or splendid."},{"definition":"The flux of radiation emitted per unit solid angle in a given direction by a unit area of a source."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"radiance-uk","text":"/ˈɹeɪdi.əns/"}]},{"word":"DOWNSIDE","idx":22685,"count":1287746,"meanings":[{"definitions":[{"definition":"A disadvantageous aspect of something that is normally advantageous.","example":"The downside of obtaining a higher rank is that far more work is expected."},{"definition":"A downward tendency, especially in the price of shares etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"downside-us","text":"/ˈdaʊnˌsaɪd/"}]},{"word":"REISSUE","idx":22688,"count":1287311,"meanings":[{"definitions":[{"definition":"Something that has issued, or been issued again.","example":"Copies of the original comic are valued by collectors, but the reissues are worthless."},{"definition":"A second or subsequent printing of postage stamps from old plates."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To issue again."},{"definition":"To reprint a series of postage stamps from old plates."},{"definition":"In patent law: to permit a patent with ministerial errors to be corrected and enforced for the remainder of the original term of the patent."}],"partOfSpeech":"ve"}]},{"word":"OILY","idx":22689,"count":1286829,"meanings":[{"definitions":[{"definition":"A marble with an oily lustre."},{"definition":"(in the plural) Oilskins. (waterproof garment)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to or resembling oil."},{"definition":"Covered with or containing oil."},{"definition":"Excessively friendly or polite but insincere."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"oily-uk","text":"/ˈɔɪli/"}]},{"word":"QUITTING","idx":22690,"count":1286725,"meanings":[{"definitions":[{"definition":"To pay (a debt, fine etc.)."},{"definition":"To repay (someone) for (something)."},{"definition":"To repay, pay back (a good deed, injury etc.)."},{"definition":"To conduct or acquit (oneself); to behave (in a specified way)."},{"definition":"To carry through; to go through to the end."},{"definition":"To set at rest; to free, as from anything harmful or oppressive; to relieve; to clear; to liberate."},{"definition":"To release from obligation, accusation, penalty, etc.; to absolve; to acquit."},{"definition":"To abandon, renounce (a thing)."},{"definition":"To leave (a place)."},{"definition":"To resign from (a job, office, position, etc.).","example":"After having to work overtime without being paid, I quit my job."},{"definition":"To stop, give up (an activity) (usually + gerund or verbal noun).","example":"John is planning to quit smoking."},{"definition":"To close (an application)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The deliberate ending of something."},{"definition":"The ceasing of a habit, especially smoking cigarettes or other addictive behaviors."},{"definition":"The termination of employment, initiated by the employee."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"quitting-us"}]},{"word":"STRIKER","idx":22692,"count":1286700,"meanings":[{"definitions":[{"definition":"An individual who is on strike."},{"definition":"Someone or something that hits someone or something else."},{"definition":"One of the players on a team in football (soccer) in the row nearest to the opposing team's goal, who are therefore principally responsible for scoring goals."},{"definition":"An officer's servant or orderly."},{"definition":"(1800s) The batter."},{"definition":"The batsman who is currently facing the bowler and defending his wicket."},{"definition":"A harpoon."},{"definition":"A harpooner."},{"definition":"An inexperienced member of a ship's crew."},{"definition":"A wencher; a lewd man."},{"definition":"A blackmailer in politics."},{"definition":"One whose political influence can be bought."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"striker-au","text":"/ˈstɹaɪkə(ɹ)/"}]},{"word":"MEMOS","idx":22693,"count":1286640,"meanings":[{"definitions":[{"definition":"A short note; a memorandum."},{"definition":"A record of partial results that can be reused later without recomputation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To record something; to make a note of something."},{"definition":"To send someone a note about something, for the record.","example":"I made sure to memo him about the client's complaints."}],"partOfSpeech":"ve"}]},{"word":"SCREAMS","idx":22695,"count":1286631,"meanings":[{"definitions":[{"definition":"A loud, emphatic, exclamation of extreme emotion, especially horror, fear, excitement, or anger; it may comprise a word or a sustained, high-pitched vowel sound."},{"definition":"A form of singing associated with the metal and screamo styles of music. It is a loud, rough, distorted version of the voice; rather than the normal voice of the singer."},{"definition":"Used as an intensifier","example":"We had a real scream of a time at the beach."},{"definition":"(printers' slang) exclamation mark"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cry out with a shrill voice; to utter a sudden, sharp outcry, or shrill, loud cry, as in fright or extreme pain; to shriek; to screech."},{"definition":"To move quickly; to race.","example":"He almost hit a pole, the way he came screaming down the hill."},{"definition":"To be very indicative of; clearly having the characteristics of.","example":"Do you know what screams \"I'm obnoxious\"? People who feel the need to comment on every little thing they notice."}],"partOfSpeech":"ve"}]},{"word":"MASKING","idx":22696,"count":1286584,"meanings":[{"definitions":[{"definition":"To cover (the face or something else), in order to conceal the identity or protect against injury; to cover with a mask or visor."},{"definition":"To disguise; to cover; to hide."},{"definition":"To conceal; also, to intervene in the line of."},{"definition":"To cover or keep in check.","example":"to mask a body of troops or a fortess by a superior force, while some hostile evolution is being carried out"},{"definition":"To take part as a masker in a masquerade"},{"definition":"To wear a mask; to be disguised in any way"},{"definition":"To cover or shield a part of a design or picture in order to prevent reproduction or to safeguard the surface from the colors used when working with an air brush or painting"},{"definition":"To set or unset (certain bits, or binary digits, within a value) by means of a bitmask."},{"definition":"To disable (an interrupt, etc.) by setting or unsetting the associated bit."},{"definition":"To mash."},{"definition":"To mix malt with hot water to yield wort."},{"definition":"To be infused or steeped."},{"definition":"To prepare tea in a teapot; alternative to brew."},{"definition":"To bewilder; confuse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is masked."},{"definition":"An entertainment at which the guests conceal their faces with masks."},{"definition":"The practice of wearing safety masks."}],"partOfSpeech":"n"}]},{"word":"TENSOR","idx":22697,"count":1286574,"meanings":[{"definitions":[{"definition":"A muscle that stretches a part, or renders it tense."},{"definition":"A mathematical object that describes linear relations on scalars, vectors, matrices and other tensors, and is represented as a multidimensional array."},{"definition":"A norm operation on the quaternion algebra."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To compute the tensor product of two tensors."}],"partOfSpeech":"ve"}]},{"word":"WHITEHEAD","idx":22698,"count":1286485,"meanings":[{"definitions":[{"definition":"A pimple formed by a clogged sebaceous gland, usually with a milky-white cap.","example":"Ruth knew that the whiteheads of her teenage acne were a temporary state of affairs, but that did nothing to quell her distress when an eruption hit just before prom."},{"definition":"A species of passerine bird, endemic to New Zealand (Mohoua albicilla)"},{"definition":"The blue-winged snow goose, Anser caerulescens caerulescens."},{"definition":"The surf scoter duck."},{"definition":"A domestic pigeon of a particular breed; a white-tailed monk."}],"partOfSpeech":"n"}]},{"word":"WHOA","idx":22699,"count":1286431,"meanings":[{"definitions":[{"definition":"To attempt to slow (an animal) by crying \"whoa\"."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Stop (especially when commanding a horse or imitative thereof); calm down; slow down.","example":"Whoa, Nelly!"},{"definition":"An expression of surprise.","example":"Whoa, are you serious?"},{"definition":"Used as a meaningless filler in song lyrics."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"whoa-us","text":"/woʊ/"}]},{"word":"PATCHWORK","idx":22703,"count":1285768,"meanings":[{"definitions":[{"definition":"A work, such as a blanket, composed of many different colors and shapes, sewn together to make an interesting whole."},{"definition":"Any kind of creation that utilizes many different aspects to create one whole piece."},{"definition":"A state of regulations whose constituents have an opaque scope of application because of their questionable delimitation with regard to each other."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create a patchwork from pieces of fabric."},{"definition":"To assemble from a variety of sources; to cobble together."}],"partOfSpeech":"ve"}]},{"word":"JAGUARS","idx":22709,"count":1285032,"meanings":[{"definitions":[{"definition":"A carnivorous spotted large cat native to South and Central America, Panthera onca."}],"partOfSpeech":"n"}]},{"word":"ASSURES","idx":22710,"count":1284980,"meanings":[{"definitions":[{"definition":"To make sure and secure."},{"definition":"(followed by that or of) To give (someone) confidence in the trustworthiness of (something).","example":"He assured of his commitment to her happiness."},{"definition":"To guarantee, promise (to do something)."},{"definition":"To reassure."}],"partOfSpeech":"ve"}]},{"word":"JOYS","idx":22712,"count":1284745,"meanings":[{"definitions":[{"definition":"A feeling of extreme happiness or cheerfulness, especially related to the acquisition or expectation of something good.","example":"They will be a source of strength and joy in your life."},{"definition":"Anything that causes such a feeling.","example":"the joys and demands of parenthood"},{"definition":"Luck or success; a positive outcome."},{"definition":"The sign or exhibition of joy; gaiety; merriment; festivity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feel joy, to rejoice."},{"definition":"To enjoy."},{"definition":"To give joy to; to congratulate."},{"definition":"To gladden; to make joyful; to exhilarate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"joys-uk","text":"/dʒɔɪz/"}]},{"word":"TRACER","idx":22713,"count":1284708,"meanings":[{"definitions":[{"definition":"A compound, element, or isotope used to track the progress or history of a natural process."},{"definition":"A round of ammunition for a firearm that contains magnesium or another flammable substance arranged such that it will burn and produce a visible trail when fired in the dark."},{"definition":"The act or state of tracking or investigating something."},{"definition":"A request to trace the movements of a person or an object, such as a shipment."},{"definition":"A person who traces something."},{"definition":"A device or instrument used to assist in making tracings."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɹeɪsɚ/"},{"text":"/ˈtɹeɪsə(ɹ)/"}]},{"word":"INVOLUNTARY","idx":22715,"count":1284621,"meanings":[{"definitions":[{"definition":"Without intention; unintentional."},{"definition":"Not voluntary or willing; contrary or opposed to explicit will or desire; unwilling.","example":"He found himself the involuntary witness in the trial."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈvɑl.ənˌtɛ.ɹi/"},{"text":"/ɪnˈvɒl.ən.tɹi/"}]},{"word":"ALLEGATION","idx":22716,"count":1284509,"meanings":[{"definitions":[{"definition":"An assertion, especially an accusation, not necessarily based on facts.","example":"She put forth several allegations regarding her partner in hopes of discrediting his actions."},{"definition":"The act of alleging."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"allegation-us","text":"/ˌæl.əˈɡeɪ.ʃən/"}]},{"word":"INFINITELY","idx":22718,"count":1284436,"meanings":[{"definitions":[{"definition":"In an infinite manner; as of anything growing without bounds; endlessly."},{"definition":"To a surpassingly large extent.","example":"He is infinitely more capable than John."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"infinitely-us","text":"/ˈɪnfɪnɪtli/"}]},{"word":"SYNTHESIZER","idx":22719,"count":1284428,"meanings":[{"definitions":[{"definition":"An electronic instrument that creates its sounds with electronics and has a keyboard."},{"definition":"An electronic instrument module that creates its sounds with electronics and does not have any keyboard."},{"definition":"An electronic circuit that generates an electronic signal oscillation with accurate timing from a reference oscillator."},{"definition":"An electronic device that generates electronic signal patterns to test an electronic circuit."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɪn.θəˌsaɪ.zɚ/"},{"text":"/ˈsɪn.θəˌsaɪ.zə(ɹ)/"}]},{"word":"EJACULATING","idx":22720,"count":1284226,"meanings":[{"definitions":[{"definition":"To eject abruptly; to throw out suddenly and swiftly."},{"definition":"To say abruptly."},{"definition":"To eject or suddenly throw fluid or some other substance from a duct or other body structure."},{"definition":"(specifically) Of a human being or other mammal: to forcibly eject from the urethra in response to sexual stimulation, in a male, semen; and, in a female, vaginal fluid.","example":"Men can ejaculate between 0.1 and 10 milliliters of semen on average."}],"partOfSpeech":"ve"}]},{"word":"BIODIESEL","idx":22721,"count":1284181,"meanings":[{"definitions":[{"definition":"Fuel for diesel engines made of renewable organic raw materials as opposed to fossil hydrocarbons"}],"partOfSpeech":"n"}]},{"word":"SERGE","idx":22724,"count":1283914,"meanings":[{"definitions":[{"definition":"A type of worsted cloth."},{"definition":"(by metonymy) A garment made of this fabric."},{"definition":"A large wax candle used in some church ceremonies."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To overlock."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sɝdʒ/"},{"text":"/sɜːdʒ/"}]},{"word":"MORPHINE","idx":22725,"count":1283748,"meanings":[{"definitions":[{"definition":"A crystalline alkaloid (7,8-didehydro-4,5-epoxy-17-methyl-morphinan-3,6-diol), extracted from opium, the salts of which are soluble in water and are used as analgesics, anaesthetics and sedatives; it is one of a group of morphine alkaloids."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɔɹˌfiːn/"},{"text":"/ˈmɔː.fiːn/"}]},{"word":"GYMNASIUM","idx":22727,"count":1283632,"meanings":[{"definitions":[{"definition":"A large room or building for indoor sports."},{"definition":"A type of secondary school in some European countries which typically prepares students for university."},{"definition":"A public place or building where Ancient Greek youths took exercise, with running and wrestling grounds, baths, and halls for conversation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gymnasium-us","text":"/dʒɪmˈneɪ.zi.əm/"}]},{"word":"MICROFILM","idx":22728,"count":1283628,"meanings":[{"definitions":[{"definition":"A continuous roll of film containing photographs of documents at a greatly reduced size"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reproduce documents on such film"}],"partOfSpeech":"ve"}]},{"word":"WALDO","idx":22729,"count":1283521,"meanings":[{"definitions":[{"definition":"A remote manipulation system in which a slave device mimics the motions of a master device manipulated directly by the operator."}],"partOfSpeech":"n"}]},{"word":"SUBSIDIZED","idx":22732,"count":1283216,"meanings":[{"definitions":[{"definition":"To assist (someone or something) by granting a subsidy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That receives a subsidy"}],"partOfSpeech":"j"}]},{"word":"CHIEFLY","idx":22733,"count":1283186,"meanings":[{"definitions":[{"definition":"Of or relating to a chief"}],"partOfSpeech":"j"},{"definitions":[{"definition":"(focus) Especially or primarily; above all."},{"definition":"(focus) Mainly or principally; almost entirely."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"chiefly-us"},{"text":"/ˈtʃiːf.li/"}]},{"word":"CONJECTURE","idx":22735,"count":1283018,"meanings":[{"definitions":[{"definition":"A statement or an idea which is unproven, but is thought to be true; a guess.","example":"I explained it, but it is pure conjecture whether he understood, or not."},{"definition":"A supposition based upon incomplete evidence; a hypothesis.","example":"The physicist used his conjecture about subatomic particles to design an experiment."},{"definition":"(philology) A statement likely to be true based on available evidence, but which has not been formally proven."},{"definition":"Interpretation of signs and omens."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To guess; to venture an unproven idea.","example":"I do not know if it is true; I am simply conjecturing here."},{"definition":"To infer on slight evidence; to guess at."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"conjecture-us","text":"/kənˈd͡ʒɛk.t͡ʃɚ/"}]},{"word":"MICH","idx":22736,"count":1283008,"meanings":[{"definitions":[{"definition":"To pilfer; filch; steal."},{"definition":"To shrink or retire from view; lurk out of sight; skulk."},{"definition":"To be absent from school without a valid excuse; to play truant.","example":"John said he was going to mitch the last lesson today."},{"definition":"To grumble secretly."},{"definition":"To pretend poverty."}],"partOfSpeech":"ve"}]},{"word":"RESTITUTION","idx":22739,"count":1282669,"meanings":[{"definitions":[{"definition":"A process of compensation for losses."},{"definition":"The act of making good or compensating for loss or injury."},{"definition":"A return or restoration to a previous condition or position.","example":"the restitution of an elastic body"},{"definition":"That which is offered or given in return for what has been lost, injured, or destroyed; compensation."},{"definition":"The movement of rotation which usually occurs in childbirth after the head has been delivered, and which causes the latter to point towards the side to which it was directed at the beginning of labour."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɹɛstɪˈtuʃən/"},{"text":"/ˌɹɛstɪˈtjuʃən/"},{"audio":"restitution-au"}]},{"word":"INDICTED","idx":22740,"count":1282603,"meanings":[{"definitions":[{"definition":"To accuse of wrongdoing; charge.","example":"a book that indicts modern values"},{"definition":"To make a formal accusation or indictment for a crime against (a party) by the findings of a jury, especially a grand jury.","example":"his former manager was indicted for fraud"}],"partOfSpeech":"ve"}]},{"word":"BLASTING","idx":22741,"count":1282601,"meanings":[{"definitions":[{"definition":"To make an impression on, by making a loud blast or din."},{"definition":"To make a loud noise."},{"definition":"To shatter, as if by an explosion."},{"definition":"To open up a hole in, usually by means of a sudden and imprecise method (such as an explosion).","example":"Blast right through it."},{"definition":"To curse; to damn.","example":"Blast it! Foiled again."},{"definition":"(sci-fi) To shoot, especially with an energy weapon (as opposed to one which fires projectiles).","example":"Chewbacca blasted the Stormtroopers with his laser rifle."},{"definition":"To shoot; kick the ball in hope of scoring a goal."},{"definition":"To criticize or reprimand severely; to verbally discipline or punish.","example":"My manager suddenly blasted me yesterday for being a little late to work for five days in a row, because I was never getting myself up on time."},{"definition":"To blight or wither.","example":"A cold wind blasted the rose plants."},{"definition":"To be blighted or withered.","example":"The bud blasted in the blossom."},{"definition":"To blow, for example on a trumpet."},{"definition":"To run a nucleotide sequence (for nucleic acids) or an amino acid sequence (for proteins) through a BLAST (Basic Local Alignment Search Tool)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A planned explosion, as in mining."},{"definition":"The act by which something is blasted, or blighted."}],"partOfSpeech":"n"}]},{"word":"CONFRONTING","idx":22743,"count":1282338,"meanings":[{"definitions":[{"definition":"To stand or meet facing, especially in competition, hostility or defiance; to come face to face with","example":"We should confront him about the missing money."},{"definition":"To deal with."},{"definition":"To something bring face to face with."},{"definition":"To come up against; to encounter."},{"definition":"To engage in confrontation."},{"definition":"To set a thing side by side with; to compare."},{"definition":"To put a thing facing to; to set in contrast to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Causing distress; upsetting."}],"partOfSpeech":"j"}]},{"word":"PITUITARY","idx":22744,"count":1282102,"meanings":[{"definitions":[{"definition":"The pituitary gland."},{"definition":"The pituitary gland together with the pituitary stalk."},{"definition":"An extract from the pituitary gland."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to the pituitary gland."},{"definition":"Mucous."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɪˈtuːɪˌtɛɹi/"},{"text":"/pɪˈtjuːɪt(ə)ɹi/"}]},{"word":"SOW","idx":22745,"count":1282086,"meanings":[{"definitions":[{"definition":"A female pig."},{"definition":"A female bear, she-bear."},{"definition":"A female guinea pig."},{"definition":"A channel that conducts molten metal to molds."},{"definition":"A mass of metal solidified in a mold."},{"definition":"A contemptible, often fat woman."},{"definition":"A sowbug."},{"definition":"A kind of covered shed, formerly used by besiegers in filling up and passing the ditch of a besieged place, sapping and mining the wall, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To scatter, disperse, or plant (seeds).","example":"As you sow, so shall you reap."},{"definition":"To spread abroad; to propagate."},{"definition":"To scatter over; to besprinkle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sow-1-us","text":"/saʊ/"}]},{"word":"REPEATER","idx":22746,"count":1282082,"meanings":[{"definitions":[{"definition":"One who or that which repeats."},{"definition":"A student repeating a course or class."},{"definition":"A patient who repeatedly presents with the same symptoms."},{"definition":"A consumer who repeatedly purchases the same goods or services."},{"definition":"One who votes more than once at an election."},{"definition":"In ufology and similar studies, a person who regularly sees unexplained sightings of paranormal phenomena."},{"definition":"A gun that has a store of cartridges and does not need reloading after each shot."},{"definition":"A telegraphic instrument for automatically retransmitting a message."},{"definition":"An electronic device that receives a weak or low-level signal and retransmits it at a higher level or higher power."},{"definition":"A watch with a striking apparatus which, upon pressure of a spring, will indicate the time, usually in hours and quarters."},{"definition":"A frigate appointed to attend an admiral in a fleet, and to repeat the admiral's signals."},{"definition":"A pennant used to indicate that a certain flag in a hoist of signal is duplicated."},{"definition":"A repeating decimal."},{"definition":"In calico printing, a design repeated at equal intervals in a pattern."}],"partOfSpeech":"n"}]},{"word":"WIZ","idx":22750,"count":1281900,"meanings":[{"definitions":[{"definition":"A person who is exceptionally clever, gifted or skilled in a particular area.","example":"a maths wiz"},{"definition":"A wizard; an administrator of a multi-user dungeon."},{"definition":"A whirring or hissing sound (as above)."},{"definition":"Someone who is remarkably skilled at something."},{"definition":"(especially with the verb \"take\") An act of urination.","example":"I have to take a whiz."},{"definition":"Amphetamine."},{"definition":"(with \"the\") Pickpocketing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Against.","example":"He picked a fight with the class bully."},{"definition":"In the company of; alongside, close to; near to.","example":"He went with his friends."},{"definition":"In addition to; as an accessory to.","example":"She owns a motorcycle with a sidecar."},{"definition":"Used to indicate simultaneous happening, or immediate succession or consequence.","example":"Jim was listening to Bach with his eyes closed."},{"definition":"In support of.","example":"We are with you all the way."},{"definition":"In regard to.","example":"He was pleased with the outcome."},{"definition":"To denote the accomplishment of cause, means, instrument, etc; – sometimes equivalent to by.","example":"slain with robbers"},{"definition":"Using as an instrument; by means of.","example":"Find what you want instantly with our search engine."},{"definition":"Using as nourishment; more recently replaced by on."},{"definition":"Having, owning.","example":"It was small and bumpy, with a tinge of orange."},{"definition":"Affected by (a certain emotion or condition).","example":"He spoke with sadness in his voice."},{"definition":"Prompted by (a certain emotion).","example":"green with envy; flushed with success"}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"wiz-au","text":"/wɪz/"}]},{"word":"AUTOPSY","idx":22751,"count":1281821,"meanings":[{"definitions":[{"definition":"A dissection performed on a cadaver to find possible cause(s) of death."},{"definition":"An after-the-fact examination, especially of the causes of a failure."},{"definition":"(rare) An eyewitness observation, the presentation of an event as witnessed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform an autopsy on."},{"definition":"To perform an after-the-fact analysis of, especially of a failure."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɔtɑpsi/"},{"text":"/ˈɔːtɒpsiː/"}]},{"word":"MASTERED","idx":22752,"count":1281794,"meanings":[{"definitions":[{"definition":"To be a master."},{"definition":"To become the master of; to subject to one's will, control, or authority; to conquer; to overpower; to subdue."},{"definition":"To learn to a high degree of proficiency.","example":"It took her years to master the art of needlecraft."},{"definition":"To own; to possess."},{"definition":"(especially of a musical performance) To make a master copy of."},{"definition":"(usually with in) To earn a Master's degree.","example":"He mastered in English at the state college."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mastered-us"}]},{"word":"POWDERS","idx":22753,"count":1281550,"meanings":[{"definitions":[{"definition":"The fine particles which are the result of reducing dry substance by pounding, grinding, or triturating, or the result of decay; dust."},{"definition":"A mixture of fine dry, sweet-smelling particles applied to the face or other body parts, to reduce shine or to alleviate chaffing."},{"definition":"An explosive mixture used in gunnery, blasting, etc.; gunpowder."},{"definition":"A very pale blue colour."},{"definition":"Freshly fallen, uncompacted snow, especially in the context of Alpine skiing","example":"Expert skiers love skiing on powder snow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reduce to fine particles; to pound, grind, or rub into a powder."},{"definition":"To sprinkle with powder, or as if with powder.","example":"to powder one's hair"},{"definition":"To use powder on the hair or skin."},{"definition":"To turn into powder; to become powdery."},{"definition":"To sprinkle with salt; to corn, as meat."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"powders-us","text":"/ˈpaʊ.dɚz/"}]},{"word":"DEBTORS","idx":22755,"count":1281454,"meanings":[{"definitions":[{"definition":"A person or firm that owes money; one in debt; one who owes a debt"},{"definition":"One who owes another anything, or is under obligation, arising from express agreement, implication of law, or principles of natural justice, to pay money or to fulfill some other obligation; in bankruptcy or similar proceedings, the person who is the subject of the proceeding."}],"partOfSpeech":"n"}]},{"word":"GRIT","idx":22756,"count":1281375,"meanings":[{"definitions":[{"definition":"A collection of hard small materials, such as dirt, ground stone, debris from sandblasting or other such grinding, or swarf from metalworking.","example":"The flower beds were white with grit from sand blasting the flagstone walkways."},{"definition":"Inedible particles in food.","example":"These cookies seem to have grit from nutshells in them."},{"definition":"A measure of the relative coarseness of an abrasive material such as sandpaper, the smaller the number the coarser the abrasive.","example":"I need a sheet of 100 grit sandpaper."},{"definition":"A hard, coarse-grained siliceous sandstone; gritstone. Also, a finer sharp-grained sandstone, e.g., grindstone grit."},{"definition":"Strength of mind; great courage or fearlessness; fortitude.","example":"That kid with the cast on his arm has the grit to play dodgeball."},{"definition":"(usually in the plural) Husked but unground oats."},{"definition":"(usually in the plural) Coarsely ground corn or hominy used as porridge."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Apparently only in grit one's teeth: to clench, particularly in reaction to pain or anger.","example":"He has a sleeping disorder and grits his teeth."},{"definition":"To cover with grit."},{"definition":"To give forth a grating sound, like sand under the feet; to grate; to grind."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"grit-au","text":"/ˈɡɹɪt/"}]},{"word":"SLAIN","idx":22759,"count":1281084,"meanings":[{"definitions":[{"definition":"(with \"the\") Those who have been killed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To kill, murder.","example":"Our foes must all be slain."},{"definition":"To eradicate or stamp out.","example":"You must slay these thoughts."},{"definition":"(by extension) To defeat, overcome (in a competition or contest).","example":"1956, “Giants Slay Bears in Pro Title Battle”, in Lodi News-Sentinel, 1956 December 31, page 8."},{"definition":"To delight or overwhelm, especially with laughter.","example":"Ha ha! You slay me!"},{"definition":"To amaze, stun or otherwise incapacitate by awesomeness; to be awesome at something; to kill (slang sense)."},{"definition":"To have sex with"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slain-us","text":"/sleɪn/"}]},{"word":"COLO","idx":22760,"count":1280975,"meanings":[{"definitions":[{"definition":"Co-location","example":"One was a mistake in the colo, where there was a mislabeled circuit, so they cut power to 1/3 of one of our racks."}],"partOfSpeech":"n"}]},{"word":"HORTICULTURAL","idx":22766,"count":1280262,"meanings":[{"definitions":[{"definition":"Of or pertaining to horticulture; connected with gardening."}],"partOfSpeech":"j"}]},{"word":"SPAMMING","idx":22768,"count":1280034,"meanings":[{"definitions":[{"definition":"To send spam (i.e. unsolicited electronic messages.)"},{"definition":"To send spam (i.e. unsolicited electronic messages) to a person or entity."},{"definition":"(by extension) To use (a spell or ability) rapidly and repeatedly.","example":"Stop spamming that special attack!"},{"definition":"To post the same text repeatedly with disruptive effect; to flood."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of sending unwanted electronic mail."}],"partOfSpeech":"n"}]},{"word":"NEARER","idx":22769,"count":1280000,"meanings":[{"definitions":[{"definition":"Physically close.","example":"I can't see near objects very clearly without my glasses."},{"definition":"Close in time.","example":"The end is near."},{"definition":"Closely connected or related.","example":"The deceased man had no near relatives."},{"definition":"Close to one's interests, affection, etc.; intimate; dear.","example":"a near friend"},{"definition":"Close to anything followed or imitated; not free, loose, or rambling.","example":"a version near to the original"},{"definition":"So as barely to avoid or pass injury or loss; close; narrow.","example":"a near escape"},{"definition":"Approximate, almost.","example":"The two words are near synonyms."},{"definition":"(in relation to a vehicle) On the side nearest to the kerb (the left-hand side if one drives on the left).","example":"The near front wheel came loose."},{"definition":"Next to the driver, when he is on foot; on the left of an animal or a team.","example":"the near ox; the near leg"},{"definition":"Immediate; direct; close; short."},{"definition":"Stingy; parsimonious."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Closer to.","example":"I'd like to live nearer the office."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"nearer-us","text":"/ˈnɪɹɚ/"}]},{"word":"ANCESTRAL","idx":22770,"count":1279982,"meanings":[{"definitions":[{"definition":"Of, pertaining to, derived from, or possessed by, an ancestor or ancestors","example":"an ancestral estate"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ænˈsɛs.təɹ.əl/"}]},{"word":"WARTIME","idx":22773,"count":1279693,"meanings":[{"definitions":[{"definition":"A period during which a war is in progress in a particular place."}],"partOfSpeech":"n"}]},{"word":"FAITHFULLY","idx":22775,"count":1279442,"meanings":[{"definitions":[{"definition":"In a faithful manner.","example":"I have been faithfully married for the past twenty years."},{"definition":"A conventional formula for ending a letter, used when the salutation addresses the person for whom the letter is intended using an honorific."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈfeɪθfəli/"}]},{"word":"REVOLUTIONS","idx":22778,"count":1279333,"meanings":[{"definitions":[{"definition":"A political upheaval in a government or nation state characterized by great change."},{"definition":"The removal and replacement of a government, especially by sudden violent action."},{"definition":"Rotation: the turning of an object around an axis."},{"definition":"A rotation: one complete turn of an object during rotation."},{"definition":"In the case of celestial bodies - the traversal of one body through an orbit around another body."},{"definition":"A sudden, vast change in a situation, a discipline, or the way of thinking and behaving."},{"definition":"A round of periodic changes, such as between the seasons of the year."},{"definition":"Consideration of an idea; the act of revolving something in the mind."}],"partOfSpeech":"n"}]},{"word":"SEI","idx":22779,"count":1279042,"meanings":[{"definitions":[{"definition":"A sei whale."}],"partOfSpeech":"n"}]},{"word":"GERIATRIC","idx":22780,"count":1279000,"meanings":[{"definitions":[{"definition":"An old person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to the elderly"},{"definition":"Elderly, old"},{"definition":"Relating to geriatrics"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"geriatric-au"}]},{"word":"QUAIL","idx":22781,"count":1278967,"meanings":[{"definitions":[{"definition":"To waste away; to fade, to wither"},{"definition":"To daunt or frighten (someone)"},{"definition":"To lose heart or courage; to be daunted or fearful."},{"definition":"Of courage, faith, etc.: to slacken, to give way."},{"definition":"To curdle or coagulate, as milk does."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Any of various small game birds of the genera Coturnix, Anurophasis or Perdicula in the Old World family Phasianidae or of the New World family Odontophoridae."},{"definition":"The meat from this bird eaten as food."},{"definition":"A prostitute, so called because the quail was thought to be a very amorous bird."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"quail-us","text":"/ˈkweɪl/"},{"audio":"quail-au","text":"/ˈkweɪl/"}]},{"word":"TANKER","idx":22782,"count":1278916,"meanings":[{"definitions":[{"definition":"A tank ship, a vessel used to transport large quantities of liquid."},{"definition":"A tank truck."},{"definition":"A fuel tanker, petrol tanker, road tanker."},{"definition":"A tank car"},{"definition":"Member of a tank crew, or of an armoured unit."},{"definition":"A longboard.","example":"I swung the tanker around just in time to take off with the lip"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transport (oil, etc.) in a tanker."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tanker-au"}]},{"word":"ADMINISTRATIONS","idx":22785,"count":1278511,"meanings":[{"definitions":[{"definition":"The act of administering; government of public affairs; the service rendered, or duties assumed, in conducting affairs; the conducting of any office or employment; direction."},{"definition":"A body that administers; the executive part of government; the persons collectively who are entrusted with the execution of laws and the superintendence of public affairs; the chief magistrate and his cabinet or council; or the council, or ministry, alone, as in Great Britain.","example":"Successive US administrations have had similar Middle East policies."},{"definition":"The act of administering, or tendering something to another; dispensation.","example":"oral administration of insulin"},{"definition":"Management."},{"definition":"An arrangement whereby an insolvent company can continue trading under supervision.","example":"The company went into voluntary administration last week."}],"partOfSpeech":"n"}]},{"word":"FUTON","idx":22786,"count":1278430,"meanings":[{"definitions":[{"definition":"A thin mattress of tufted cotton or similar material, placed on a floor or on a raised, foldable frame as a bed."},{"definition":"A round cushion used for Zen meditation, traditionally made of woven bulrush leaves."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfutɑn/"},{"text":"/ˈfuːtɒn/"}]},{"word":"GRANNIES","idx":22787,"count":1278265,"meanings":[{"definitions":[{"definition":"A grandmother.","example":"I'm going to be a granny."},{"definition":"An elderly woman.","example":"There are too many grannies around here getting in the way."},{"definition":"(knots) A granny knot."},{"definition":"(farming) An older ewe that may lure a lamb away from its mother."}],"partOfSpeech":"n"}]},{"word":"HAIRSTYLES","idx":22788,"count":1278230,"meanings":[{"definitions":[{"definition":"The style in which someone's hair has been cut and arranged."}],"partOfSpeech":"n"}]},{"word":"SHO","idx":22789,"count":1278114,"meanings":[{"definitions":[{"definition":"To the (explicitly stated) extent that.","example":"It was so hot outside that all the plants died.  He was so good, they hired him on the spot."},{"definition":"To the (implied) extent.","example":"I need a piece of cloth so long. [= this long]"},{"definition":"In a particular manner.","example":"Place the napkin on the table just so. If that's what you mean, then say so; (or do so)."},{"definition":"In the same manner or to the same extent as aforementioned; also.","example":"Just as you have the right to your free speech, so I have the right to mine.  Many people say she's the world's greatest athlete, but I don't think so.  \"I can count backwards from one hundred.\" \"So can I.\""},{"definition":"With as To such an extent or degree; as.","example":"so far as;  so long as;  so much as"},{"definition":"(modal adverb) Without doubt, certainly.","example":"\"Did you kill that bear yourself?\" ―\"I sure did!\""}],"partOfSpeech":"v"},{"definitions":[{"definition":"A Japanese free reed musical instrument similar to the sheng."},{"definition":"A letter of the Greek alphabet used to write the Bactrian language: uppercase Ϸ, lowercase ϸ."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ʃoʊ/"},{"text":"/ʃəʊ/"}]},{"word":"RECTOR","idx":22790,"count":1278087,"meanings":[{"definitions":[{"definition":"In the Anglican Church, a cleric in charge of a parish and who owns the tithes of it."},{"definition":"In the Roman Catholic Church, a cleric with managerial as well as spiritual responsibility for a church or other institution."},{"definition":"A priest or bishop who is in charge of a parish or in an administrative leadership position in a theological seminary or academy."},{"definition":"In a Protestant church, a pastor in charge of a church with administrative and pastoral leadership combined."},{"definition":"A headmaster in various educational institutions, e.g. a university."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rector-us","text":"/ˈɹɛktɚ/"}]},{"word":"NAYS","idx":22791,"count":1278006,"meanings":[{"definitions":[{"definition":"A vote against.","example":"I vote nay, even though the motion is popular, because I would rather be right than popular."},{"definition":"A person who voted against.","example":"The vote is 4 in favor and 20 opposed; the nays have it."},{"definition":"A denial; a refusal. https//books.google.com/books?id=uysQzJy9IwMC&pg=PA818&dq=%22word+nay+a+denial+refusal%22&hl=en&sa=X&ved=0ahUKEwij_5CHi-3cAhWJ2FMKHWjCDdMQ6AEIJzAA#v=onepage&q=%22word%20nay%20a%20denial%20refusal%22&f=false"}],"partOfSpeech":"n"}]},{"word":"BALLAST","idx":22792,"count":1277921,"meanings":[{"definitions":[{"definition":"Heavy material that is placed in the hold of a ship (or in the gondola of a balloon), to provide stability."},{"definition":"Anything that steadies emotion or the mind."},{"definition":"Coarse gravel or similar material laid to form a bed for roads or railroads, or in making concrete."},{"definition":"A material, such as aggregate or precast concrete pavers, which employs its mass and the force of gravity to hold single-ply roof membranes in place."},{"definition":"Device used for stabilizing current in an electric circuit (e.g. in a tube lamp supply circuit)"},{"definition":"That which gives, or helps to maintain, uprightness, steadiness, and security."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stabilize or load a ship with ballast."},{"definition":"To lay ballast on the bed of a railroad track."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ballast-us","text":"/ˈbæl.əst/"}]},{"word":"IMMATURE","idx":22793,"count":1277806,"meanings":[{"definitions":[{"definition":"An immature member of a species."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Occurring before the proper time; untimely, premature (especially of death)."},{"definition":"Not fully formed or developed; not grown."},{"definition":"Childish in behavior; juvenile.","example":"The man was immature for throwing a tantrum."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪməˈtjʊə(ɹ)/"}]},{"word":"WEBSPACE","idx":22794,"count":1277762,"meanings":[{"definitions":[{"definition":"Disk space used to store web pages and other content that can be accessed through the Web.","example":"Some Internet providers offer free webspace to subscribers."}],"partOfSpeech":"n"}]},{"word":"RECOGNISES","idx":22795,"count":1277746,"meanings":[{"definitions":[{"definition":"To match (something or someone which one currently perceives) to a memory of some previous encounter with the same person or thing.","example":"I recognised his face immediately."},{"definition":"To acknowledge the existence or legality of; to treat as valid or worthy of consideration.","example":"The US and a number of EU countries are expected to recognize Kosovo on Monday."},{"definition":"(or with clause) To acknowledge or consider (as being a certain thing or having a certain quality or property).","example":"I recognize that my behaviour has been unacceptable."},{"definition":"To realize or discover the nature of something; apprehend quality in."},{"definition":"To show formal appreciation of, as with an award, commendation etc.","example":"His services were recognized in a testimonial."},{"definition":"To review; to examine again."},{"definition":"To reconnoiter."},{"definition":"To have the property to bind to specific antigens."}],"partOfSpeech":"ve"}]},{"word":"TAXING","idx":22796,"count":1277669,"meanings":[{"definitions":[{"definition":"To impose and collect a tax from (a person or company).","example":"Some think to tax the wealthy is the fairest."},{"definition":"To impose and collect a tax on (something).","example":"Some think to tax wealth is destructive of a private sector."},{"definition":"To make excessive demands on.","example":"Do not tax my patience."},{"definition":"To accuse."},{"definition":"To examine accounts in order to allow or disallow items."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of imposing a tax."}],"partOfSpeech":"n"},{"definitions":[{"definition":"With respect to an experience: exhausting; draining."},{"definition":"Burdensome, difficult.","example":"a taxing problem"}],"partOfSpeech":"j"}]},{"word":"ICING","idx":22797,"count":1277602,"meanings":[{"definitions":[{"definition":"A sweet glaze made primarily of sugar and often flavored, typically used for baked goods; frosting."},{"definition":"A minor violation of ice hockey rules, occurring when a player shoots the puck from his/her side of the red line so that it crosses the goal line on the opponent's side. A team playing short-handed is not penalized for this."},{"definition":"The process of forming a layer of ice on a surface."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cool with ice, as a beverage."},{"definition":"To become ice; to freeze."},{"definition":"To make icy; to freeze."},{"definition":"To murder."},{"definition":"To cover with icing (frosting made of sugar and milk or white of egg); to frost; as cakes, tarts, etc."},{"definition":"To put out a team for a match.","example":"Milton Keynes have yet to ice a team this season"},{"definition":"To shoot the puck the length of the playing surface, causing a stoppage in play called icing.","example":"If the Bruins ice the puck, the faceoff will be in their own zone."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈaɪsɪŋ/"}]},{"word":"SUBSTITUTING","idx":22799,"count":1277543,"meanings":[{"definitions":[{"definition":"To use in place of something else, with the same function.","example":"I had no shallots so I substituted onion."},{"definition":"(in the phrase \"substitute X for Y\") To use X in place of Y.","example":"I had to substitute new parts for the old ones."},{"definition":"(in the phrase \"substitute X with/by Y\") To use Y in place of X; to replace X with Y.","example":"I had to substitute old parts with the new ones."},{"definition":"To remove (a player) from the field of play and bring on another in his place.","example":"He was playing poorly and was substituted after twenty minutes"},{"definition":"To serve as a replacement (for someone or something)."}],"partOfSpeech":"ve"}]},{"word":"MULTIPLES","idx":22801,"count":1277478,"meanings":[{"definitions":[{"definition":"A whole number that can be divided by another number with no remainder.","example":"14, 21 and 70 are multiples of 7"},{"definition":"Price-earnings ratio."},{"definition":"One of a set of the same thing; a duplicate."},{"definition":"A single individual who has multiple personalities."},{"definition":"One of a set of siblings produced by a multiple birth."},{"definition":"A chain store."},{"definition":"A discovery resulting from the work of many people throughout history, not merely the work of the person who makes the final connection."}],"partOfSpeech":"n"}]},{"word":"EXECUTES","idx":22802,"count":1277454,"meanings":[{"definitions":[{"definition":"To kill as punishment for capital crimes.","example":"There are certain states where it is lawful to execute prisoners convicted of certain crimes."},{"definition":"To carry out; to put into effect.","example":"I'll execute your orders as soon as this meeting is adjourned."},{"definition":"To perform.","example":"to execute a difficult piece of music brilliantly"},{"definition":"To carry out, to perform an act; to put into effect or cause to become legally binding or valid (as a contract) by so doing.","example":"to execute a contract"},{"definition":"To start, launch or run","example":"to execute a program"},{"definition":"To run, usually successfully.","example":"The program executed, but data problems were discovered."}],"partOfSpeech":"ve"}]},{"word":"ORIGINALITY","idx":22803,"count":1276869,"meanings":[{"definitions":[{"definition":"The quality of being original or novel."},{"definition":"The capacity to think independently or be inventive."},{"definition":"Something original."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˌɹɪdʒɪˈnælɪti/"}]},{"word":"PINNED","idx":22804,"count":1276850,"meanings":[{"definitions":[{"definition":"To shape metal by striking it, especially with a peen."},{"definition":"(often followed by a preposition such as \"to\" or \"on\") To fasten or attach (something) with a pin."},{"definition":"(usually in the passive) To cause (a piece) to be in a pin."},{"definition":"To pin down (someone)."},{"definition":"To enclose; to confine; to pen; to pound."},{"definition":"To attach (an icon, application, etc.) to another item.","example":"to pin a window to the Taskbar"},{"definition":"To fix (an array in memory, a security certificate, etc.) so that it cannot be modified.","example":"When marshaling data, the interop marshaler can copy or pin the data being marshaled."},{"definition":"To cause an analog gauge to reach the stop pin at the high end of the range."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having (a specified kind or number of) pins.","example":"a three-pinned arch"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɪnd/"}]},{"word":"GABLES","idx":22806,"count":1276634,"meanings":[{"definitions":[{"definition":"The triangular area at the peak of an external wall adjacent to, and terminating, two sloped roof surfaces (pitches)."},{"definition":"A cable."}],"partOfSpeech":"n"}]},{"word":"DISCONTINUE","idx":22807,"count":1276606,"meanings":[{"definitions":[{"definition":"To interrupt the continuance of; to put an end to, especially as regards commercial productions; to stop producing, making, or supplying something.","example":"They plan to discontinue that design."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"discontinue-us","text":"/dɪskənˈtɪnju/"}]},{"word":"DISPARATE","idx":22808,"count":1276596,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) Any of a group of unequal or dissimilar things."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Composed of inherently different or distinct elements; incongruous.","example":"The board of the company was decidedly disparate, with no two members from the same social or economic background."},{"definition":"Essentially different; of different species, unlike but not opposed in pairs; also, less properly, utterly unlike; incapable of being compared; having no common genus."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disparate-us","text":"/dɪˈspæɹət/"}]},{"word":"BANTAM","idx":22809,"count":1276580,"meanings":[{"definitions":[{"definition":"Any of several small chickens, especially of a breed that is a miniature version of another breed."},{"definition":"A competitor in an age division between peewee and midget."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Small or miniature."},{"definition":"Spirited or aggressive."}],"partOfSpeech":"j"}]},{"word":"BOARDWALK","idx":22810,"count":1276569,"meanings":[{"definitions":[{"definition":"A slightly elevated path for pedestrians over sandy or swampy ground, typically made out of wood; specifically one running alongside a body of water or beach."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To install a boardwalk over."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɔɹdˌwɑk/"},{"text":"/ˈbɔːdwɔːk/"},{"audio":"boardwalk-au"}]},{"word":"INELIGIBLE","idx":22811,"count":1276417,"meanings":[{"definitions":[{"definition":"One who is not eligible."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not eligible; forbidden to do something.","example":"Employees of the promoter are ineligible to enter the competition."}],"partOfSpeech":"j"}]},{"word":"HOMEOPATHY","idx":22812,"count":1276327,"meanings":[{"definitions":[{"definition":"A system of treating diseases with small amounts of substances which, in larger amounts, would produce the observed symptoms."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"homeopathy-uk","text":"/ˌhɒmɪˈɒpəθi/"}]},{"word":"ENTRANTS","idx":22813,"count":1276155,"meanings":[{"definitions":[{"definition":"A participant who enters something, such as a contest."},{"definition":"A newcomer."}],"partOfSpeech":"n"}]},{"word":"RALLIES","idx":22814,"count":1276149,"meanings":[{"definitions":[{"definition":"A public gathering or mass meeting that is not mainly a protest and is organized to inspire enthusiasm for a cause.","example":"a campaign rally"},{"definition":"A protest or demonstration for or against something, but often with speeches and often without marching, especially in North America.","example":"a political rally"},{"definition":"A sequence of strokes between serving and scoring a point."},{"definition":"An event in which competitors drive through a series of timed special stages at intervals. The winner is the driver who completes all stages with the shortest cumulative time."},{"definition":"A recovery after a decline in prices (said of the market, stocks, etc.)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To collect, and reduce to order, as troops dispersed or thrown into confusion; to gather again; to reunite."},{"definition":"To come into orderly arrangement; to renew order, or united effort, as troops scattered or put to flight; to assemble; to unite."},{"definition":"To collect one's vital powers or forces; to regain health or consciousness; to recuperate."},{"definition":"To recover strength after a decline in prices; -- said of the market, stocks, etc."},{"definition":"To tease; to chaff good-humouredly."}],"partOfSpeech":"ve"}]},{"word":"SIMPLIFICATION","idx":22815,"count":1276047,"meanings":[{"definitions":[{"definition":"The act of simplifying or something that has been simplified"},{"definition":"A valid simple argument"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌsɪmpləfəˈkeɪʃən/"}]},{"word":"INSOLVENCY","idx":22817,"count":1275891,"meanings":[{"definitions":[{"definition":"The condition of being insolvent; the state or condition of a person who is insolvent; the condition of one who is unable to pay his debts as they fall due, or in the usual course of trade and business.","example":"The company faces insolvency."},{"definition":"Insufficiency to discharge all debts of the owner.","example":"the insolvency of an estate"},{"definition":"The condition of having more debts than assets."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[ɪnˈsɒlvn̩si]"}]},{"word":"EARTHLY","idx":22820,"count":1275576,"meanings":[{"definitions":[{"definition":"(collective or in the plural) That which is of the earth or earthly; a terrestrial being."},{"definition":"A slightest chance (of success etc.) or idea (about something)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to the earth or this world, as opposed to heaven; terrestrial.","example":"earthly joys"},{"definition":"(negative) Used for emphasis"},{"definition":"Made of earth; earthy."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In an earthly manner"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"earthly-us"},{"text":"/ˈəːθli/"}]},{"word":"ROLEPLAYING","idx":22821,"count":1275469,"meanings":[{"definitions":[{"definition":"To act out a fantasy, especially with a group."},{"definition":"To act as a character as part of a fantasy, especially with a group.","example":"He likes to roleplay a vampire."}],"partOfSpeech":"ve"}]},{"word":"AFFECTIVE","idx":22822,"count":1275468,"meanings":[{"definitions":[{"definition":"Relating to, resulting from, or influenced by the emotions."},{"definition":"Emotional; emotionally charged."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈfɛktɪv/"}]},{"word":"HISTOGRAM","idx":22825,"count":1275220,"meanings":[{"definitions":[{"definition":"A graphical display of numerical data in the form of upright bars, with the area of each bar representing frequency."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To represent (data) as a histogram."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhɪstəˌɡɹæm/"}]},{"word":"CONCEIVE","idx":22826,"count":1275176,"meanings":[{"definitions":[{"definition":"To develop an idea; to form in the mind; to plan; to devise; to originate."},{"definition":"To understand (someone)."},{"definition":"To become pregnant (with).","example":"Assisted procreation can help those trying to conceive."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"conceive-us","text":"/kənˈsiːv/"}]},{"word":"WHEELCHAIRS","idx":22827,"count":1275168,"meanings":[{"definitions":[{"definition":"A chair mounted on large wheels for the transportation or use of a sick or disabled person."},{"definition":"Designed for use by wheelchairbound people."},{"definition":"(by extension) Any device involving wheels designed to assist a non-human animal with locomotion."}],"partOfSpeech":"n"}]},{"word":"LIBERALIZATION","idx":22831,"count":1274688,"meanings":[{"definitions":[{"definition":"The process or act of making more liberal."},{"definition":"The lessening of government regulations and restrictions in an economy in exchange for greater participation by private entitiesWp"}],"partOfSpeech":"n"}]},{"word":"INSENSITIVE","idx":22832,"count":1274594,"meanings":[{"definitions":[{"definition":"Not expressing normal physical feeling"},{"definition":"Not expressing normal emotional feelings; cold; tactless; undiplomatic"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈsɛnsɪtɪv/"}]},{"word":"FORFEITURE","idx":22833,"count":1274559,"meanings":[{"definitions":[{"definition":"A legal action whereby a person loses all interest in the forfeit property."},{"definition":"The loss of forfeit property."},{"definition":"The property lost as a forfeit."},{"definition":"Any loss occasioned by one's own actions."}],"partOfSpeech":"n"}]},{"word":"GENOTYPE","idx":22835,"count":1274508,"meanings":[{"definitions":[{"definition":"The part (DNA sequence) of the genetic makeup of an organism which determines a specific characteristic (phenotype) of that organism."},{"definition":"A group of organisms having the same genetic constitution."},{"definition":"The type species of a genus; generitype."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To determine the genotype of."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdʒiːn.oʊ.taɪp/"},{"text":"/ˈdʒɛn.əʊ.taɪp/"}]},{"word":"CONTAMINANT","idx":22836,"count":1274269,"meanings":[{"definitions":[{"definition":"That which contaminates; an impurity; foreign matter.","example":"Put the lid on the jar to keep contaminants out."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"contaminant-us"}]},{"word":"DISASTROUS","idx":22838,"count":1274124,"meanings":[{"definitions":[{"definition":"Of the nature of a disaster; calamitous."},{"definition":"Foreboding disaster; ill-omened."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disastrous-uk","text":"/dɪˈzɑːstɹəs/"}]},{"word":"COLLABORATORS","idx":22839,"count":1274121,"meanings":[{"definitions":[{"definition":"A person who works with others towards a common goal."},{"definition":"A person who cooperates traitorously with an enemy."}],"partOfSpeech":"n"}]},{"word":"PROXIES","idx":22841,"count":1274057,"meanings":[{"definitions":[{"definition":"An agent or substitute authorized to act for another person."},{"definition":"The authority to act for another, especially when written."},{"definition":"The written appointment of a proctor in suits in the ecclesiastical courts."},{"definition":"A measurement of one physical quantity that is used as an indicator of the value of another"},{"definition":"An interface for a service, especially for one that is remote, resource-intensive, or otherwise difficult to use directly."},{"definition":"A proximity mine; a mine that explodes when something approaches within a certain distance."}],"partOfSpeech":"n"}]},{"word":"REWIND","idx":22842,"count":1274043,"meanings":[{"definitions":[{"definition":"The act of rewinding."},{"definition":"A button or other mechanism for rewinding.","example":"I meant to pause the picture, but hit the rewind by mistake."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wind (something) again."},{"definition":"To wind (something) back, now especially of cassette or video tape, CD, DVD etc.; to go back on a video or audio recording."},{"definition":"To go back or think back to a previous moment or place, or a previous point in a discourse."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːˈwaɪnd/"}]},{"word":"GLADIATOR","idx":22843,"count":1273979,"meanings":[{"definitions":[{"definition":"(in ancient Rome) A person (professional or slave) who entertained the public by engaging in mortal combat with another, or with a wild animal."},{"definition":"(by extension) A disputant in a public controversy or debate."},{"definition":"A professional boxer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fight as entertainment for others."},{"definition":"To compete in a public contest."},{"definition":"To debate or argue."},{"definition":"To act aggressively toward others."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡlædiˌeɪtɚ/"}]},{"word":"POPLAR","idx":22844,"count":1273824,"meanings":[{"definitions":[{"definition":"Any of various deciduous trees of the genus Populus."},{"definition":"Wood from the poplar tree."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"poplar-us","text":"/ˈpɒplə(ɹ)/"}]},{"word":"ISSUERS","idx":22845,"count":1273782,"meanings":[{"definitions":[{"definition":"One who issues, emits, or publishes."}],"partOfSpeech":"n"}]},{"word":"SINH","idx":22847,"count":1273535,"meanings":[{"definitions":[{"definition":"A traditional tube skirt worn by Lao and Thai women, particularly northern Thai and northeastern Thai women."}],"partOfSpeech":"n"}]},{"word":"RECOURSE","idx":22848,"count":1273523,"meanings":[{"definitions":[{"definition":"The act of seeking assistance or advice."},{"definition":"A coursing back, or coursing again; renewed course; return; retreat; recurrence."},{"definition":"Access; admittance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To return; to recur."},{"definition":"To have recourse; to resort."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"recourse-uk","text":"/ɹɪˈkɔːs/"}]},{"word":"MARTIAN","idx":22849,"count":1273255,"meanings":[{"definitions":[{"definition":"Of or relating to the planet Mars, or its imagined inhabitants."},{"definition":"Pertaining to the astrological influence of the planet Mars; aggressive, bellicose."},{"definition":"Pertaining to battle or war; martial, military."}],"partOfSpeech":"j"}]},{"word":"EQUINOX","idx":22850,"count":1273041,"meanings":[{"definitions":[{"definition":"The intersection of the apparent path of the sun in the sky (the ecliptic) with the celestial equator."},{"definition":"One of the two days on which this intersection occurs each year: (for the Northern hemisphere) March 20 or 21 in the spring and September 22 or 23 in the autumn."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"equinox-us","text":"/ˈiːkwəˌnɑːks/"}]},{"word":"SCHOOLGIRLS","idx":22852,"count":1272781,"meanings":[{"definitions":[{"definition":"A girl attending school."}],"partOfSpeech":"n"}]},{"word":"HINDER","idx":22853,"count":1272772,"meanings":[{"definitions":[{"definition":"To make difficult to accomplish; to act as an obstacle; to frustrate.","example":"A drought hinders the growth of plants."},{"definition":"To delay or impede; to keep back, to prevent.","example":"She hindered a man from committing suicide."},{"definition":"To cause harm."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Located at the rear (most often said of animals' body parts)."},{"definition":"Of or belonging to that part or end which is in the rear or hind, or which follows.","example":"the hinder end of a wagon"}],"partOfSpeech":"j"},{"definitions":[{"definition":"The buttocks."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hinder-1-us","text":"/ˈhɪndɚ/"}]},{"word":"PRESUME","idx":22856,"count":1272666,"meanings":[{"definitions":[{"definition":"With infinitive object: to be so presumptuous as (to do something) without proper authority or permission.","example":"I wouldn't presume to tell him how to do his job."},{"definition":"To perform, do (something) without authority; to lay claim to without permission.","example":"Don't make the decision yourself and presume too much."},{"definition":"To assume or suggest to be true (without proof); to take for granted, to suppose.","example":"Dr. Livingstone, I presume?"},{"definition":"To be presumptuous; with on, upon, to take advantage (of), to take liberties (with)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"presume-us","text":"/pɹiˈz(j)um/"},{"audio":"presume-uk","text":"/pɹɪˈzjuːm/"}]},{"word":"ASTRONAUT","idx":22859,"count":1272333,"meanings":[{"definitions":[{"definition":"A member of the crew of a spaceship or other spacecraft that travels beyond Earth's atmosphere, or someone trained to serve that purpose."},{"definition":"A returnee who frequently flies back and forth between Hong Kong and his/her adopted home country."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"astronaut-ca","text":"/ˈæstɹəˌnɒt/"}]},{"word":"ARMCHAIR","idx":22861,"count":1272149,"meanings":[{"definitions":[{"definition":"A chair with supports for the arms or elbows."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create based on theory or general knowledge rather than data."},{"definition":"To theorize based on analysis of data that was gathered previously; to reflect."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Remote from actual involvement, including a person retired from previously active involvement.","example":"These days I'm an armchair detective."},{"definition":"Unqualified or uninformed but yet giving advice, especially on technical issues, such as law, architecture, medicine, military theory, or sports.","example":"After the American football game, the armchair quarterbacks talked about what they would have done differently to win, if they had been star athletes instead of out-of-shape old men."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"armchair-us","text":"/ˈɑɹmtʃɛɚ/"}]},{"word":"CONSTIPATION","idx":22865,"count":1271923,"meanings":[{"definitions":[{"definition":"Act of crowding anything into a lesser compass, or the state of being crowded or pressed together; condensation."},{"definition":"A state of the bowels in which the evacuations are infrequent and difficult, or the intestines become filled with hardened faeces; costiveness."}],"partOfSpeech":"n"}]},{"word":"STRUT","idx":22869,"count":1271153,"meanings":[{"definitions":[{"definition":"Protuberance, air pressure"},{"definition":"A proud step or walk, with the head erect; affected dignity in walking."},{"definition":"A support rod."},{"definition":"An instrument for adjusting the pleats of a ruff."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To swell; protuberate; bulge or spread out."},{"definition":"(originally said of fowl) To stand or walk stiffly, with the tail erect and spread out."},{"definition":"To walk proudly or haughtily.","example":"He strutted about the yard, thinking himself master of all he surveyed."},{"definition":"To cause to swell; enlarge; give more importance to."},{"definition":"To protrude; cause to bulge."},{"definition":"To brace or support by a strut or struts; hold in place or strengthen by an upright, diagonal, or transverse support."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Swelling out; protuberant; bulging."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"strut-uk","text":"/stɹʌt/"}]},{"word":"APPROPRIATENESS","idx":22875,"count":1270661,"meanings":[{"definitions":[{"definition":"The quality or condition of being appropriate"}],"partOfSpeech":"n"}]},{"word":"KOI","idx":22876,"count":1270462,"meanings":[{"definitions":[{"definition":"Ornamental domesticated varieties of the common carp (Cyprinus carpio), of Japan and eastern Asia with red-gold or white coloring."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɔɪ/"}]},{"word":"SUES","idx":22877,"count":1270296,"meanings":[{"definitions":[{"definition":"To file a legal action against someone, generally a non-criminal action."},{"definition":"To seek by request; to make application; to petition; to entreat; to plead."},{"definition":"(of a hawk) To clean (the beak, etc.)."},{"definition":"To leave high and dry on shore.","example":"to sue a ship"},{"definition":"To court."},{"definition":"To follow."}],"partOfSpeech":"ve"}]},{"word":"TAME","idx":22878,"count":1270260,"meanings":[{"definitions":[{"definition":"To make (an animal) tame; to domesticate.","example":"He tamed the wild horse."},{"definition":"To become tame or domesticated."},{"definition":"To make gentle or meek.","example":"to tame a rebellion"},{"definition":"To broach or enter upon; to taste, as a liquor; to divide; to distribute; to deal out."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not or no longer wild; domesticated","example":"They have a tame wildcat."},{"definition":"(chiefly of animals) Mild and well-behaved; accustomed to human contact","example":"The lion was quite tame."},{"definition":"Not exciting.","example":"For a thriller, that film was really tame."},{"definition":"Crushed; subdued; depressed; spiritless."},{"definition":"(of a knot) Capable of being represented as a finite closed polygonal chain."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tame-us","text":"/teɪm/"}]},{"word":"SOLSTICE","idx":22880,"count":1270139,"meanings":[{"definitions":[{"definition":"One of the two points in the ecliptic at which the sun is furthest from the celestial equator. This corresponds to one of two days in the year when the day is either longest or shortest."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɑl.stɪs/"},{"text":"/ˈsɒl.stɪs/"}]},{"word":"OATS","idx":22881,"count":1270000,"meanings":[{"definitions":[{"definition":"Widely cultivated cereal grass, typically Avena sativa.","example":"The main forms of oat are meal and bran."},{"definition":"Any of the numerous species, varieties, or cultivars of any of several similar grain plants in genus Avena.","example":"The wild red oat is thought to be the ancestor of modern food oats."},{"definition":"(usually as plural) The seeds of the oat, a grain, harvested as a food crop."},{"definition":"A simple musical pipe made of oat-straw."},{"definition":"A mass of oat plants (genus Avena, especially Avena sativa).","example":"Oats are in the north corner of the farm."},{"definition":"Seeds of an oat plant, especially prepared as food.","example":"Oats are good for you."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"oats-uk","text":"/ˈəʊts/"}]},{"word":"CANDIDA","idx":22885,"count":1269644,"meanings":[{"definitions":[{"definition":"A yeast of the genus Candida, usually specifically Candida albicans"}],"partOfSpeech":"n"}]},{"word":"SILDENAFIL","idx":22887,"count":1269245,"meanings":[{"definitions":[{"definition":"A drug that is used in the form of its citrate C22H30N6O4S·C6H8O7 to treat erectile dysfunction in males, that by suppressing a phosphodiesterase enzyme also suppresses the enzyme's inhibitory effect on the hormone cyclic GMP, and that enables the cyclic GMP produced during sexual arousal to initiate the muscular and vascular changes which produce an erection. It is marketed under the trademarks Revatio and Viagra."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɪlˈdɛn.əf.ɪl/"}]},{"word":"ADJUSTS","idx":22888,"count":1269156,"meanings":[{"definitions":[{"definition":"To modify.","example":"Morimoto's recipes are adjusted to suit the American palate."},{"definition":"To improve or rectify.","example":"He adjusted his initial conclusion to reflect the new data."},{"definition":"To settle an insurance claim."},{"definition":"To change to fit circumstances.","example":"Most immigrants adjust quickly to a new community.   She waited for her eyes to adjust to the darkness."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈdʒʌsts/"}]},{"word":"PLUME","idx":22889,"count":1269109,"meanings":[{"definitions":[{"definition":"A feather of a bird, especially a large or showy one used as a decoration."},{"definition":"A cluster of feathers worn as an ornament, especially on a helmet; a hackle."},{"definition":"A token of honour or prowess; that on which one prides oneself; a prize or reward."},{"definition":"The vane of a feather, especially when on a quill pen or the fletching of an arrow."},{"definition":"Short for plume moth."},{"definition":"Things resembling a feather."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To adorn, cover, or furnish with feathers or plumes, or as if with feathers or plumes."},{"definition":"Chiefly of a bird: to arrange and preen the feathers of, specifically in preparation for flight; hence , to prepare for (something)."},{"definition":"(by extension) To congratulate (oneself) proudly, especially concerning something unimportant or when taking credit for another person's effort; to self-congratulate.","example":"He plumes himself on his skill."},{"definition":"To strip (a bird) of feathers; to pluck."},{"definition":"Of a dispersed substance such as dust or smoke: to fan out or spread in a cloud.","example":"Smoke plumed from his pipe, then slowly settled towards the floor."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plume-us","text":"/ˈplum/"}]},{"word":"PICKUPS","idx":22891,"count":1268677,"meanings":[{"definitions":[{"definition":"An electronic device for detecting sound, vibration, etc., such as one fitted to an electric guitar or record player."},{"definition":"A pickup truck."},{"definition":"(usually attributive) Impromptu or ad hoc, especially of sports games and teams made up of randomly selected players.","example":"At lunch we had a game of pickup hockey."},{"definition":"An instance of approaching someone and engaging in romantic flirtation and courting with the intent to pursue romance, a date, or a sexual encounter. See also pick-up line, pick-up joint, pickup artist.","example":"Hey, thanks for the drink, but if this is a pickup, I'm not interested."},{"definition":"A person successfully approached in this manner for romance or sex."},{"definition":"In various games, the fielding or hitting of a ball just after it strikes the ground."},{"definition":"An item that can be picked up by the player, conferring some benefit or effect; a power-up."},{"definition":"The act of a challenging party or candidate winning an electoral district held by an incumbent party or candidate. See also gain","example":"The returns from the election show Apple Party candidate Jane Doe has made a pickup in the district of City West defeating Orange Party Incumbent Joe Smith"},{"definition":"The act of answering a telephone."},{"definition":"A relatively minor shot filmed or recorded after the fact to augment previous footage."},{"definition":"The act of collecting and taking away something or someone, usually in a vehicle."}],"partOfSpeech":"n"}]},{"word":"CALYPSO","idx":22895,"count":1268267,"meanings":[{"definitions":[{"definition":"A type of music and dance that originated in the West Indies (perhaps Trinidad), characterized by improvised lyrics on topical or broadly humorous subjects, often creating satire of current events."},{"definition":"A bulbous bog orchid of the genus Calypso, Calypso bulbosa"},{"definition":"A light blue color."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform calypso."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəˈlɪp.soʊ/"},{"text":"/kəˈlɪp.səʊ/"}]},{"word":"CHEESECAKE","idx":22896,"count":1268229,"meanings":[{"definitions":[{"definition":"A pie made of sweetened and flavoured cottage cheese or cream cheese, eggs and milk on a crunchy base.","example":"Cheesecake is an especially delicious dessert."},{"definition":"Imagery of one or more scantily clad, sexually attractive young women; pin-ups.","example":"Company policy forbids displaying cheesecake in the locker rooms."}],"partOfSpeech":"n"}]},{"word":"PANTRY","idx":22897,"count":1268228,"meanings":[{"definitions":[{"definition":"A small room, closet, or cabinet usually located in or near the kitchen, dedicated to shelf-stable food storage and/or storing kitchenware, like a larder, but smaller."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpæntɹi/"},{"text":"/ˈpantɹi/"}]},{"word":"ITALICS","idx":22899,"count":1268200,"meanings":[{"definitions":[{"definition":"A typeface in which the letters slant to the right."},{"definition":"An oblique handwriting style, such as used by Italian calligraphers of the Renaissance."},{"definition":"Letters in an italic typeface.","example":"There is no need to put the whole paragraph in italics."}],"partOfSpeech":"n"}]},{"word":"REVERSING","idx":22900,"count":1268143,"meanings":[{"definitions":[{"definition":"To turn something around so that it faces the opposite direction or runs in the opposite sequence.","example":"to reverse a portion of video footage"},{"definition":"To turn something inside out or upside down."},{"definition":"To transpose the positions of two things."},{"definition":"To change totally; to alter to the opposite."},{"definition":"To return, come back."},{"definition":"To turn away; to cause to depart."},{"definition":"To cause to return; to recall."},{"definition":"To revoke a law, or to change a decision into its opposite.","example":"to reverse a judgment, sentence, or decree"},{"definition":"To cause a mechanism or a vehicle to operate or move in the opposite direction to normal."},{"definition":"To change the direction of a reaction such that the products become the reactants and vice-versa."},{"definition":"To place a set of points in the reverse position"},{"definition":"(of points) to move from the normal position to the reverse position"},{"definition":"To overthrow; to subvert."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of reversal."}],"partOfSpeech":"n"}]},{"word":"MURDERER","idx":22901,"count":1268134,"meanings":[{"definitions":[{"definition":"A person who commits murder."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"murderer-us","text":"/ˈmɝdəɹɚ/"}]},{"word":"COURTEOUS","idx":22903,"count":1267713,"meanings":[{"definitions":[{"definition":"Showing regard or thought for others; especially, displaying good manners or etiquette.","example":"a courteous gentleman   a courteous gesture"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"courteous-us","text":"/ˈkɝti.əs/"}]},{"word":"WILT","idx":22904,"count":1267600,"meanings":[{"definitions":[{"definition":"The act of wilting or the state of being wilted."},{"definition":"Any of various plant diseases characterized by wilting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To droop or become limp and flaccid (as a dying leaf or flower)."},{"definition":"To fatigue; to lose strength."},{"definition":"To cause to droop or become limp and flaccid (as a flower)."},{"definition":"To cause to fatigue; to exhaust."},{"definition":"(now uncommon or literary) To wish, desire (something).","example":"Do what you will."},{"definition":"(nowadays rare) To wish or desire (that something happen); to intend (that)."},{"definition":"(auxiliary) To habitually do (a given action)."},{"definition":"(auxiliary) To choose to (do something); used to express intention but without any temporal connotations (+ bare infinitive), often in negation.","example":"I’ve told him three times, but he won’t take his medicine."},{"definition":"(auxiliary) Used to express the future tense, sometimes with some implication of volition when used in the first person. Compare shall."},{"definition":"(auxiliary) To be able to, to have the capacity to.","example":"Unfortunately, only one of these gloves will actually fit over my hand."},{"definition":"(auxiliary) Expressing a present tense with some conditional or subjective weakening: \"will turn out to\", \"must by inference\"."},{"definition":"To wish, desire."},{"definition":"To instruct (that something be done) in one's will."},{"definition":"To try to make (something) happen by using one's will (intention).","example":"All the fans were willing their team to win the game."},{"definition":"To bequeath (something) to someone in one's will (legal document).","example":"He willed his stamp collection to the local museum."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wilt-us","text":"/wɪlt/"}]},{"word":"SMOOTHING","idx":22905,"count":1267558,"meanings":[{"definitions":[{"definition":"To make smooth or even."},{"definition":"To make straightforward or easy."},{"definition":"To calm or palliate.","example":"to smooth a person's temper"},{"definition":"(image processing, digital audio) To capture important patterns in the data, while leaving out noise."},{"definition":"To stroke; especially to stroke an animal's fur.","example":"Can I smooth your cat?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is made smooth."},{"definition":"Monophthongization."}],"partOfSpeech":"n"}]},{"word":"BILLET","idx":22906,"count":1267502,"meanings":[{"definitions":[{"definition":"A short informal letter."},{"definition":"A written order to quarter soldiers."},{"definition":"A place where a soldier is assigned to lodge."},{"definition":"An allocated space or berth in a boat or ship."},{"definition":"Berth; position."},{"definition":"A semi-finished length of metal."},{"definition":"A short piece of wood, especially one used as firewood."},{"definition":"A short cutting of sugar cane produced by a harvester or used for planting."},{"definition":"A rectangle used as a charge on an escutcheon."},{"definition":"An ornament in Norman work, resembling a billet of wood, either square or round."},{"definition":"(saddlery) A strap that enters a buckle."},{"definition":"A loop that receives the end of a buckled strap."},{"definition":"An English fish, allied to the cod; the coalfish."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a householder etc.) To lodge soldiers, or guests, usually by order."},{"definition":"(of a soldier) To lodge, or be quartered, in a private house."},{"definition":"To direct, by a ticket or note, where to lodge."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɪlɪt/"}]},{"word":"PORTING","idx":22907,"count":1267433,"meanings":[{"definitions":[{"definition":"To turn or put to the left or larboard side of a ship; said of the helm.","example":"Port your helm!"},{"definition":"To carry, bear, or transport. See porter."},{"definition":"To hold or carry (a weapon) with both hands so that it lays diagonally across the front of the body, with the barrel or similar part near the left shoulder and the right hand grasping the small of the stock; or, to throw (the weapon) into this position on command.","example":"Port arms!"},{"definition":"To adapt, modify, or create a new version of, a program so that it works on a different platform. Porting"},{"definition":"To carry or transfer an existing telephone number from one telephone service provider to another."},{"definition":"To transfer a voucher or subsidy from one jurisdiction to another."}],"partOfSpeech":"ve"}]},{"word":"LUBRICATION","idx":22908,"count":1267423,"meanings":[{"definitions":[{"definition":"The application of a substance (a lubricant), between moving surfaces in contact in order to reduce friction and minimize heating."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/lubɹɪˈkeɪʃən/"}]},{"word":"PRETENDING","idx":22909,"count":1267391,"meanings":[{"definitions":[{"definition":"To claim, to allege, especially when falsely or as a form of deliberate deception."},{"definition":"To feign, affect (a state, quality, etc.)."},{"definition":"To lay claim to (an ability, status, advantage, etc.). (originally used without to)"},{"definition":"To make oneself appear to do or be doing something; to engage in make-believe."},{"definition":"To hold before, or put forward, as a cloak or disguise for something else; to exhibit as a veil for something hidden."},{"definition":"To intend; to design, to plot; to attempt."},{"definition":"To hold before one; to extend."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of imagining; make-believe"}],"partOfSpeech":"n"}]},{"word":"HAMMOCK","idx":22910,"count":1267376,"meanings":[{"definitions":[{"definition":"A swinging couch or bed, usually made of netting or canvas about six feet wide, suspended by clews or cords at the ends."},{"definition":"(obsolete outside dialectal) A piece of land thickly wooded, and usually covered with bushes and vines."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lie in a hammock."},{"definition":"(of a cloth) To hang in a way that resembles a hammock."},{"definition":"To make something be wrapped tight, like in a hammock."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hammock-uk","text":"/ˈhæmək/"}]},{"word":"SHOOTOUT","idx":22911,"count":1267279,"meanings":[{"definitions":[{"definition":"A decisive battle, especially a gunfight."},{"definition":"A penalty shootout."},{"definition":"A series of penalty shots during which a tied game is resolved."},{"definition":"A multitable poker tournament in which only the last player on a table goes on to the next.","example":"64 players entered the shooutout tournament, and were divided into eight tables of eight players each. The winner in each table went on to the final table, also consisting of eight players."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʃuːtaʊt/"}]},{"word":"RECEPTIONS","idx":22912,"count":1267234,"meanings":[{"definitions":[{"definition":"The act of receiving."},{"definition":"The act or ability to receive radio or similar signals.","example":"The new system provides exceptional quality of the reception signal."},{"definition":"A social engagement, usually to formally welcome someone.","example":"After the wedding we proceeded to the reception."},{"definition":"A reaction; the treatment received on first talking to a person, arriving at a place, etc.","example":"The ambassador's jokes met a cold reception."},{"definition":"The desk of a hotel or office where guests are received."},{"definition":"The school year, or part thereof, between preschool and Year 1, when children are introduced to formal education."},{"definition":"The conscious adoption or transplantation of legal phenomena from a different culture."}],"partOfSpeech":"n"}]},{"word":"FRAGMENTED","idx":22916,"count":1266674,"meanings":[{"definitions":[{"definition":"To break apart."},{"definition":"To cause to be broken into pieces."},{"definition":"To break up and disperse (a file) into non-contiguous areas of a disk."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Broken into fragments"},{"definition":"Composed of fragments"}],"partOfSpeech":"j"}]},{"word":"REVOKE","idx":22917,"count":1266673,"meanings":[{"definitions":[{"definition":"The act of revoking in a game of cards."},{"definition":"A renege; a violation of important rules regarding the play of tricks in trick-taking card games serious enough to render the round invalid."},{"definition":"A violation ranked in seriousness somewhat below overt cheating, with the status of a more minor offense only because, when it happens, it is usually accidental."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cancel or invalidate by withdrawing or reversing.","example":"I hereby revoke all former wills."},{"definition":"To fail to follow suit in a game of cards when holding a card in that suit."},{"definition":"To call or bring back."},{"definition":"To hold back."},{"definition":"To move (something) back or away."},{"definition":"To call back to mind."}],"partOfSpeech":"ve"}]},{"word":"INTRUDER","idx":22918,"count":1266644,"meanings":[{"definitions":[{"definition":"Someone who intrudes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈtɹuː.də(ɹ)/"},{"text":"/ənˈtɹudɚ/"}]},{"word":"CHEVRON","idx":22919,"count":1266619,"meanings":[{"definitions":[{"definition":"A V-shaped pattern; used in architecture, and as an insignia of military or police rank, on the sleeve"},{"definition":"A wide inverted V placed on a shield."},{"definition":"One of the V-shaped markings on the surface of roads used to indicate minimum distances between vehicles."},{"definition":"A guillemet, either of the punctuation marks “«” or “»”, used in several languages to indicate passages of speech. Similar to typical quotation marks used in the English language such as ““” and “””."},{"definition":"An angle bracket, either used as a typographic or a scientific symbol."},{"definition":"A háček, a diacritical mark that may resemble an inverted circumflex."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form or be formed into chevrons"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈʃɛvɹən/"}]},{"word":"SLATED","idx":22921,"count":1266404,"meanings":[{"definitions":[{"definition":"To cover with slate.","example":"The old church ledgers show that the roof was slated in 1775."},{"definition":"To criticise harshly.","example":"The play was slated by the critics."},{"definition":"To schedule.","example":"The election was slated for November 2nd."},{"definition":"To anticipate or strongly expect.","example":"The next version of our software is slated to be the best release ever."},{"definition":"To set a dog upon (a person)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Scheduled"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"slated-us","text":"/ˈsleɪ.tɪd/"}]},{"word":"WAGONS","idx":22922,"count":1266327,"meanings":[{"definitions":[{"definition":"A four-wheeled cart for hauling loads."},{"definition":"A four-wheeled child's riding toy, pulled or steered by a long handle attached to the front."},{"definition":"An enclosed vehicle for carrying goods or people; (by extension) a lorry, a truck."},{"definition":"An enclosed vehicle used as a movable dwelling; a caravan."},{"definition":"Short for dinner wagon."},{"definition":"Short for paddy wagon."},{"definition":"A freight car on a railway."},{"definition":"Short for station wagon; (by extension) a sport utility vehicle (SUV); any car."},{"definition":"A woman of loose morals, a promiscuous woman, a slapper; (by extension) a woman regarded as obnoxious; a bitch, a cow."},{"definition":"A kind of prefix used in de Bruijn notation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wagons-us"}]},{"word":"VANDALISM","idx":22930,"count":1265676,"meanings":[{"definitions":[{"definition":"Willful damage to or destruction of any property, such as graffiti or defacement.","example":"As we turned down the street I was appalled by the vandalism: spray paint and smashed windows that were everywhere."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈvændəlɪzm̩/"}]},{"word":"PLANK","idx":22932,"count":1265284,"meanings":[{"definitions":[{"definition":"A long, broad and thick piece of timber, as opposed to a board which is less thick."},{"definition":"A political issue that is of concern to a faction or a party of the people and the political position that is taken on that issue.","example":"Germanization was a central plank of German conservative thinking in the 19th and 20th centuries."},{"definition":"Physical exercise in which one holds a pushup position for a measured length of time."},{"definition":"A stupid person, idiot."},{"definition":"That which supports or upholds."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover something with planking.","example":"to plank a floor or a ship"},{"definition":"To bake (fish, etc.) on a piece of cedar lumber."},{"definition":"To lay down, as on a plank or table; to stake or pay cash.","example":"to plank money in a wager"},{"definition":"To harden, as hat bodies, by felting."},{"definition":"To splice together the ends of slivers of wool, for subsequent drawing."},{"definition":"To pose for a photograph while lying rigid, face down, arms at side, in an unusual place."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plank-us","text":"/plæŋk/"}]},{"word":"ACETAMINOPHEN","idx":22933,"count":1265258,"meanings":[{"definitions":[{"definition":"A white crystalline compound used in medicine as an anodyne to relieve pain and reduce fever."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"acetaminophen","text":"/əˌsitəˈmɪnəfən/"}]},{"word":"PADDLING","idx":22934,"count":1265200,"meanings":[{"definitions":[{"definition":"To propel something through water with a paddle, oar, hands, etc."},{"definition":"To row a boat with less than one's full capacity."},{"definition":"To spank with a paddle."},{"definition":"To pat or stroke amorously or gently."},{"definition":"To tread upon; to trample."},{"definition":"To walk or dabble playfully in shallow water, especially at the seaside."},{"definition":"To toddle."},{"definition":"To toy or caress using hands or fingers."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of using a paddle."},{"definition":"An act of corporal punishment consisting of spanking the buttocks with a paddle."},{"definition":"A collective noun for ducks when they are on water."}],"partOfSpeech":"n"}]},{"word":"WOLFRAM","idx":22935,"count":1265149,"meanings":[{"definitions":[{"definition":"Wolframite"},{"definition":"Tungsten"}],"partOfSpeech":"n"}]},{"word":"CONTRACEPTIVE","idx":22937,"count":1264966,"meanings":[{"definitions":[{"definition":"A mechanism or means by which conception as a result of sexual intercourse can be prevented or made less likely.","example":"Putting a pig's bladder over one's penis during intercourse is not a good contraceptive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That acts to prevent conception as a result of sexual intercourse.","example":"She was careful to take her contraceptive pill at the same time every day."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɒn.tɹəˌsɛp.tɪv/"}]},{"word":"NECROSIS","idx":22938,"count":1264854,"meanings":[{"definitions":[{"definition":"The localized death of cells or tissues through injury, disease, or the interruption of blood supply."}],"partOfSpeech":"n"}]},{"word":"TING","idx":22939,"count":1264826,"meanings":[{"definitions":[{"definition":"The sound made when a small bell is struck."},{"definition":"An ancient Chinese vessel with legs and a lid."},{"definition":"The apartment in a Chinese temple where the idol is kept."},{"definition":"(Caribbean creoles) Thing, person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a high sharp sound like a small bell being struck.","example":"When the microwaved food was ready, the bell tinged."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Used to represent the sound of a small bell."}],"partOfSpeech":"i"}],"phonetics":[{"text":"/tɪŋ/"}]},{"word":"INTERROGATION","idx":22941,"count":1264580,"meanings":[{"definitions":[{"definition":"The act of interrogating or questioning; examination by questions; inquiry."},{"definition":"A question put; an inquiry."},{"definition":"A question mark."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"interrogation-us","text":"/ɪnˌteɹ.əˈɡeɪ.ʃən/"}]},{"word":"BONANZA","idx":22943,"count":1264434,"meanings":[{"definitions":[{"definition":"A rich mine or vein of silver or gold."},{"definition":"The point at which two mother lodes intersect."},{"definition":"(by extension) Anything which is a mine of wealth or yields a large income or return.","example":"The popular show quickly became a ratings bonanza for the network."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bonanza-us","text":"/bəˈnænzə/"}]},{"word":"LUMBAR","idx":22944,"count":1264361,"meanings":[{"definitions":[{"definition":"The lumbar region."},{"definition":"A lumbar vertebra."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Related to the lower back or loin, specifically the five vertebrae between the rib cage and the pelvis."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lumbar-us","text":"/ˈlʌm.bɑɹ/"}]}]