[{"word":"SANCTIONS","idx":10320,"count":4805431,"meanings":[{"definitions":[{"definition":"An approval, by an authority, generally one that makes something valid.","example":"The whalers had been operating in the contested waters off the island with sanction from the Japanese government."},{"definition":"A penalty, punishment, or some coercive measure, intended to ensure compliance; especially one adopted by several nations, or by an international body.","example":"The United States enacted a new round of sanctions against the apartheid regime of South Africa."},{"definition":"A law, treaty, or contract, or a clause within a law, treaty, or contract, specifying any of the above."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ratify; to make valid."},{"definition":"To give official authorization or approval to; to countenance."},{"definition":"To penalize (a State etc.) with sanctions."}],"partOfSpeech":"ve"}]},{"word":"GOODBYE","idx":10322,"count":4803952,"meanings":[{"definitions":[{"definition":"An utterance of goodbye, the wishing of farewell to someone.","example":"They made their good-byes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To say goodbye; to wish somebody farewell on parting."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Farewell; a formula used to another person or persons when the speaker, writer, or person addressed is departing."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"goodbye-us","text":"/ɡədˈbaɪ/"}]},{"word":"VIABLE","idx":10323,"count":4802961,"meanings":[{"definitions":[{"definition":"An organism that is able to live and develop."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Able to live on its own (as for a newborn)."},{"definition":"Able to be done, possible."},{"definition":"Able to live and develop."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"viable-uk","text":"/ˈvaɪəbəl/"}]},{"word":"EMERGED","idx":10324,"count":4802573,"meanings":[{"definitions":[{"definition":"To come into view."},{"definition":"To come out of a situation, object or a liquid.","example":"He emerged unscathed from the accident."},{"definition":"To become known.","example":"Gradually the truth emerged."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/iˈmɝd͡ʒd/"},{"text":"/iˈmɜːd͡ʒd/"}]},{"word":"DEFECT","idx":10326,"count":4801184,"meanings":[{"definitions":[{"definition":"A fault or malfunction.","example":"a defect in the ear or eye; a defect in timber or iron; a defect of memory or judgment"},{"definition":"The quantity or amount by which anything falls short."},{"definition":"A part by which a figure or quantity is wanting or deficient."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To abandon or turn against; to cease or change one's loyalty, especially from a military organisation or political party."},{"definition":"To desert one's army, to flee from combat."},{"definition":"To join the enemy army."},{"definition":"To flee one's country and seek asylum."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"defect-us"},{"audio":"defect-uk"}]},{"word":"POORLY","idx":10328,"count":4799466,"meanings":[{"definitions":[{"definition":"In a poor manner or condition; without plenty, or sufficiency, or suitable provision for comfort.","example":"to live poorly"},{"definition":"With little or no success; indifferently; with little profit or advantage.","example":"to do poorly in business"},{"definition":"Meanly; without spirit."},{"definition":"Without skill or merit.","example":"He plays tennis poorly."},{"definition":"In a negative manner; with disapproval.","example":"I think poorly of them."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Ill, unwell, sick"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"poorly-us","text":"/ˈpɔː(r)li/"}]},{"word":"GODDESS","idx":10329,"count":4797599,"meanings":[{"definitions":[{"definition":"A female deity."},{"definition":"A woman honored or adored as physically attractive or of superior charm and intelligence."},{"definition":"A woman of substantial authority or influence."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"goddess-us","text":"/ˈɡɑdəs/"}]},{"word":"BACKS","idx":10330,"count":4797208,"meanings":[{"definitions":[{"definition":"The rear of the body, especially the part between the neck and the end of the spine and opposite the chest and belly.","example":"Could you please scratch my back?"},{"definition":"That which is farthest away from the front.","example":"He sat in the back of the room."},{"definition":"Upper part of a natural object which is considered to resemble an animal's back.","example":"The small boat raced over the backs of the waves."},{"definition":"A support or resource in reserve."},{"definition":"The keel and keelson of a ship.","example":"The ship's back broke in the pounding surf."},{"definition":"The roof of a horizontal underground passage."},{"definition":"Effort, usually physical.","example":"Put some back into it!"},{"definition":"A non-alcoholic drink (often water or a soft drink), to go with hard liquor or a cocktail.","example":"Could I get a martini with a water back?"},{"definition":"Among leather dealers, one of the thickest and stoutest tanned hides."},{"definition":"A large shallow vat; a cistern, tub, or trough, used by brewers, distillers, dyers, picklers, gluemakers, and others, for mixing or cooling wort, holding water, hot glue, etc."},{"definition":"A ferryboat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go in the reverse direction.","example":"the train backed into the station;  the horse refuses to back"},{"definition":"To support.","example":"I back you all the way;  which horse are you backing in this race?"},{"definition":"(of the wind) To change direction contrary to the normal pattern; that is, to shift anticlockwise in the northern hemisphere, or clockwise in the southern hemisphere."},{"definition":"(of a square sail) To brace the yards so that the wind presses on the front of the sail, to slow the ship."},{"definition":"(of an anchor) To lay out a second, smaller anchor to provide additional holding power."},{"definition":"(of a hunting dog) To stand still behind another dog which has pointed."},{"definition":"To push or force backwards.","example":"The mugger backed her into a corner and demanded her wallet."},{"definition":"To get upon the back of; to mount."},{"definition":"To place or seat upon the back."},{"definition":"To make a back for; to furnish with a back.","example":"to back books"},{"definition":"To adjoin behind; to be at the back of."},{"definition":"To write upon the back of, possibly as an endorsement.","example":"to back a letter;  to back a note or legal document"},{"definition":"(of a justice of the peace) To sign or endorse (a warrant, issued in another county, to apprehend an offender)."},{"definition":"To row backward with (oars).","example":"to back the oars"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"backs-us","text":"/bæks/"}]},{"word":"OBSERVERS","idx":10331,"count":4796192,"meanings":[{"definitions":[{"definition":"One who makes observations, monitors or takes notice","example":"Most impartial observers agreed that Sampras had not served well."},{"definition":"One who adheres or follows laws, guidelines, etc.","example":"I shall be an observer of the local customs."},{"definition":"A person sent as a representative, to a meeting or other function to monitor but not to participate","example":"The UN sent many observers to the country's first elections."},{"definition":"A country or other entity which has limited participation rights within an organization.","example":"The Vatican and Palestine have observer status at the UN."},{"definition":"A crew member on an aircraft who makes observations of enemy positions or aircraft","example":"The only crew-member to survive the crash was the Canadian observer."},{"definition":"A sentry etc. manning an observation post","example":"We waited till dusk when the observers' vision was poorest."}],"partOfSpeech":"n"}]},{"word":"MAGNETS","idx":10332,"count":4795273,"meanings":[{"definitions":[{"definition":"A piece of material that attracts some metals by magnetism."},{"definition":"(preceded by a noun) A person or thing that attracts what is denoted by the preceding noun.","example":"He always had a girl on his arm – he's a bit of a babe magnet."}],"partOfSpeech":"n"}]},{"word":"FORMULAS","idx":10333,"count":4794394,"meanings":[{"definitions":[{"definition":"Any mathematical rule expressed symbolically."},{"definition":"A symbolic expression of the structure of a compound.","example":"H2O is the formula for water."},{"definition":"A plan or method for dealing with a problem or for achieving a result.","example":"The company's winning formula includes excellent service and quality products."},{"definition":"A formulation; a prescription; a mixture or solution made in a prescribed manner; the identity and quantities of ingredients of such a mixture.","example":"The formula of the rocket fuel has not been revealed."},{"definition":"A formal statement of doctrine, as in religion."},{"definition":"A syntactic expression of a proposition, built up from quantifiers, logical connectives, variables, relation and operation symbols, and, depending on the type of logic, possibly other operators such as modal, temporal, deontic or epistemic ones."},{"definition":"A manufactured food simulating human breast milk, designed to be fed to babies and infants under 12 months of age."}],"partOfSpeech":"n"}]},{"word":"SPACIOUS","idx":10334,"count":4793663,"meanings":[{"definitions":[{"definition":"Having plenty of space; roomy.","example":"The apartment has a spacious bedroom."},{"definition":"Large in expanse.","example":"The cabin offers a lovely spacious view of the mountain meadows."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"spacious-us","text":"/ˈspeɪʃəs/"}]},{"word":"SHOULDERS","idx":10335,"count":4793494,"meanings":[{"definitions":[{"definition":"The part of an animal's body between the base of the neck and forearm socket."},{"definition":"Anything forming a shape resembling a human shoulder."},{"definition":"(topography) A shelf between two levels."},{"definition":"The flat portion of type that is below the bevelled portion that joins up with the face."},{"definition":"(of an object) The portion between the neck and the body."},{"definition":"That which supports or sustains; support."},{"definition":"The part of a key between the cuts and the bow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To push (a person or thing) using one's shoulder."},{"definition":"To put (something) on one's shoulders."},{"definition":"To place (something) against one's shoulders."},{"definition":"To bear a burden, as a financial obligation."},{"definition":"To accept responsibility for.","example":"shoulder the blame"},{"definition":"To form a shape resembling a shoulder."},{"definition":"To move by or as if by using one's shoulders."},{"definition":"To round and slightly raise the top edges of slate shingles so that they form a tighter fit at the lower edge and can be swung aside to expose the nail."},{"definition":"To slope downwards from the crest and whitewater portion of a wave."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shoulders-us","text":"/ˈʃoʊldɚz/"}]},{"word":"ARGUES","idx":10337,"count":4792469,"meanings":[{"definitions":[{"definition":"To show grounds for concluding (that); to indicate, imply."},{"definition":"To debate, disagree or discuss opposing or differing viewpoints.","example":"He also argued for stronger methods to be used against China."},{"definition":"To have an argument, a quarrel."},{"definition":"To present (a viewpoint or an argument therefor).","example":"He argued his point."},{"definition":"To prove."},{"definition":"To accuse."}],"partOfSpeech":"ve"}]},{"word":"WADE","idx":10338,"count":4791878,"meanings":[{"definitions":[{"definition":"An act of wading.","example":"We had to be careful during our dangerous wade across the river.}}"},{"definition":"A ford; a place to cross a river."},{"definition":"The plant Isatis tinctoria."},{"definition":"The blue dye made from the leaves of the plant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To walk through water or something that impedes progress."},{"definition":"To progress with difficulty","example":"to wade through a dull book"},{"definition":"To walk through (water or similar impediment); to pass through by wading","example":"wading swamps and rivers"},{"definition":"To enter recklessly.","example":"to wade into a fight or a debate"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wade-us","text":"/weɪd/"}]},{"word":"SOILS","idx":10339,"count":4789565,"meanings":[{"definitions":[{"definition":"A mixture of mineral particles and organic material, used to support plant growth."},{"definition":"The unconsolidated mineral or organic material on the immediate surface of the earth that serves as a natural medium for the growth of land plants."},{"definition":"The unconsolidated mineral or organic matter on the surface of the earth that has been subjected to and shows effects of genetic and environmental factors of: climate (including water and temperature effects), and macro- and microorganisms, conditioned by relief, acting on parent material over a period of time. A product-soil differs from the material from which it is derived in many physical, chemical, biological, and morphological properties and characteristics."},{"definition":"Country or territory.","example":"Kenyan soil"},{"definition":"That which soils or pollutes; a stain."},{"definition":"A marshy or miry place to which a hunted boar resorts for refuge; hence, a wet place, stream, or tract of water, sought for by other game, as deer."},{"definition":"Dung; compost; manure.","example":"night soil"},{"definition":"Faeces or urine etc. when found on clothes."},{"definition":"A bag containing soiled items."},{"definition":"A wet or marshy place in which a boar or other such game seeks refuge when hunted."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make dirty."},{"definition":"To become dirty or soiled.","example":"Light colours soil sooner than dark ones."},{"definition":"To stain or mar, as with infamy or disgrace; to tarnish; to sully."},{"definition":"To dirty one's clothing by accidentally defecating while clothed."},{"definition":"To make invalid, to ruin."},{"definition":"To enrich with soil or muck; to manure."},{"definition":"To feed, as cattle or horses, in the barn or an enclosure, with fresh grass or green food cut for them, instead of sending them out to pasture; hence (such food having the effect of purging them), to purge by feeding on green food.","example":"to soil a horse"}],"partOfSpeech":"ve"}]},{"word":"CHAPMAN","idx":10340,"count":4787251,"meanings":[{"definitions":[{"definition":"A dealer or merchant, especially an itinerant one."},{"definition":"A purchaser."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʃæpmən/"}]},{"word":"ORGANS","idx":10341,"count":4787006,"meanings":[{"definitions":[{"definition":"A larger part of an organism, composed of tissues that perform similar functions.","example":"bodily organs"},{"definition":"(by extension) A body of an organization dedicated to the performing of certain functions."},{"definition":"A musical instrument that has multiple pipes which play when a key is pressed (the pipe organ), or an electronic instrument designed to replicate such."},{"definition":"An official magazine, newsletter, or similar publication of an organization."},{"definition":"Short for organ pipe cactus."},{"definition":"The penis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply with an organ or organs; to fit with organs."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"organs-us","text":"/ˈɔɹ.ɡənz/"},{"audio":"organs-uk","text":"/ˈɔː.ɡənz/"}]},{"word":"LOYALTY","idx":10343,"count":4785195,"meanings":[{"definitions":[{"definition":"The state of being loyal; fidelity."},{"definition":"Faithfulness or devotion to some person, cause or nation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"loyalty-us","text":"/ˈlɔɪəlti/"}]},{"word":"BELOVED","idx":10344,"count":4781714,"meanings":[{"definitions":[{"definition":"To please."},{"definition":"To be pleased with; like."},{"definition":"To love."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Someone who is loved; something that is loved."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Much loved, dearly loved."}],"partOfSpeech":"j"}]},{"word":"SOMETIME","idx":10345,"count":4781394,"meanings":[{"definitions":[{"definition":"Former, erstwhile; at some previous time.","example":"my sometime friend and mentor"},{"definition":"Occasional.","example":"an author and sometime lecturer"}],"partOfSpeech":"j"},{"definitions":[{"definition":"At an indefinite but stated time in the past or future.","example":"I'll see you at the pub sometime this evening."},{"definition":"Sometimes."},{"definition":"At an unstated past or future time; once; formerly."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈsʌmˌtaɪm/"}]},{"word":"BEATING","idx":10347,"count":4778020,"meanings":[{"definitions":[{"definition":"To hit; strike","example":"As soon as she heard that her father had died, she went into a rage and beat the wall with her fists until her knuckles bled."},{"definition":"To strike or pound repeatedly, usually in some sort of rhythm.","example":"He danced hypnotically while she beat the atabaque."},{"definition":"To strike repeatedly; to inflict repeated blows; to knock vigorously or loudly."},{"definition":"To move with pulsation or throbbing."},{"definition":"To win against; to defeat or overcome; to do better than, outdo, or excel (someone) in a particular, competitive event.","example":"I just can't seem to beat the last level of this video game."},{"definition":"To sail to windward using a series of alternate tacks across the wind."},{"definition":"To strike (water, foliage etc.) in order to drive out game; to travel through (a forest etc.) for hunting."},{"definition":"To mix food in a rapid fashion. Compare whip.","example":"Beat the eggs and whip the cream."},{"definition":"(In haggling for a price) of a buyer, to persuade the seller to reduce a price","example":"He wanted $50 for it, but I managed to beat him down to $35."},{"definition":"To indicate by beating or drumming.","example":"to beat a retreat; to beat to quarters"},{"definition":"To tread, as a path."},{"definition":"To exercise severely; to perplex; to trouble."},{"definition":"To be in agitation or doubt."},{"definition":"To make a sound when struck.","example":"The drums beat."},{"definition":"To make a succession of strokes on a drum.","example":"The drummers beat to call soldiers to their quarters."},{"definition":"To sound with more or less rapid alternations of greater and less intensity, so as to produce a pulsating effect; said of instruments, tones, or vibrations, not perfectly in unison."},{"definition":"To arrive at a place before someone.","example":"He beat me there."},{"definition":"To have sexual intercourse.","example":"Bruv, she came in just as we started to beat."},{"definition":"To rob.","example":"He beat me out of 12 bucks last night."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action by which someone or something is beaten.","example":"secret beatings of prisoners"},{"definition":"A heavy defeat or setback."},{"definition":"The pulsation of the heart."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"beating-us","text":"/ˈbiːtɪŋ/"}]},{"word":"FAITHFUL","idx":10348,"count":4777949,"meanings":[{"definitions":[{"definition":"(in the plural) The practicing members of a religion or followers of a cause.","example":"The faithful pray five times a day."},{"definition":"Someone or something that is faithful or reliable."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Loyal; adhering firmly to person or cause.","example":"My dog is a very faithful dog: he doesn't like to be petted by anybody else."},{"definition":"Having faith."},{"definition":"Reliable; worthy of trust.","example":"My servant is very faithful."},{"definition":"Consistent with reality.","example":"I would consider that a very faithful reproduction."},{"definition":"Engaging in sexual relations only with one's spouse or long-term sexual partner.","example":"They had been faithful to each other all of their married life."},{"definition":"(mathematics) Injective in specific contexts, e.g. of representations in representation or functors in category theory."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"faithful-us","text":"/ˈfeɪθ.fəl/"}]},{"word":"HUNKS","idx":10349,"count":4776866,"meanings":[{"definitions":[{"definition":"A crotchety or surly person."},{"definition":"A stingy man; a miser."},{"definition":"A large or dense piece of something.","example":"a hunk of metal"},{"definition":"A sexually attractive boy or man, especially one who is muscular."},{"definition":"A record of differences between almost contiguous portions of two files (or other sources of information). Differences that are widely separated by areas which are identical in both files would not be part of a single hunk. Differences that are separated by small regions which are identical in both files may comprise a single hunk. Patches are made up of hunks."},{"definition":"A honyock."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hunks-au","text":"/hʌŋks/"}]},{"word":"APPELLANT","idx":10350,"count":4776547,"meanings":[{"definitions":[{"definition":"A litigant or party that is making an appeal in court","example":"The appellant made her submissions to the court."},{"definition":"One who makes an earnest entreaty of any kind."},{"definition":"One who challenges another to single combat."},{"definition":"One of the clergy in the Jansenist controversy who rejected the bull Unigenitus issued in 1713, appealing to a pope \"better informed\", or to a general council."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to appeals; appellate"},{"definition":"In the process of appealing"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈpɛln̩t/"}]},{"word":"OFFENCE","idx":10352,"count":4775626,"meanings":[{"definitions":[{"definition":"The act of offending:"},{"definition":"The state of being offended or displeased; anger; displeasure."},{"definition":"A strategy and tactics employed when in position to score; contrasted with defense."},{"definition":"The portion of a team dedicated to scoring when in position to do so; contrasted with defense."}],"partOfSpeech":"n"}]},{"word":"INVESTED","idx":10354,"count":4774630,"meanings":[{"definitions":[{"definition":"To spend money, time, or energy on something, especially for some benefit or purpose; used with in.","example":"We'd like to thank all the contributors who have invested countless hours into this event."},{"definition":"To clothe or wrap (with garments)."},{"definition":"To put on (clothing)."},{"definition":"To envelop, wrap, cover."},{"definition":"To commit money or capital in the hope of financial gain."},{"definition":"To ceremonially install someone in some office."},{"definition":"To formally give (someone) some power or authority."},{"definition":"To formally give (power or authority)."},{"definition":"To surround, accompany, or attend."},{"definition":"To lay siege to.","example":"to invest a town"},{"definition":"To make investments."},{"definition":"To prepare for lost wax casting by creating an investment mold (a mixture of a silica sand and plaster)."},{"definition":"To be involved in; to form strong attachments to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"invested-us","text":"/ɪnˈvɛstɪd/"}]},{"word":"WHATSOEVER","idx":10355,"count":4774578,"meanings":[{"definitions":[{"definition":"Whatever."},{"definition":"In any way; at all.","example":"He gave me no answer whatsoever."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Whatever"}],"partOfSpeech":"p"}],"phonetics":[{"audio":"whatsoever-us","text":"/ˌ(h)wʌtsoʊˈɛvɚ/"}]},{"word":"NUMBERED","idx":10356,"count":4773804,"meanings":[{"definitions":[{"definition":"To label (items) with numbers; to assign numbers to (items).","example":"Number the baskets so that we can find them easily."},{"definition":"To total or count; to amount to.","example":"I don’t know how many books are in the library, but they must number in the thousands."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"numbered-us","text":"/ˈnʌmbɚd/"}]},{"word":"TERMINATED","idx":10357,"count":4771526,"meanings":[{"definitions":[{"definition":"To end, especially in an incomplete state.","example":"to terminate a surface by a line"},{"definition":"To set or be a limit or boundary to."},{"definition":"To kill."},{"definition":"To end the employment contract of an employee; to fire, lay off."},{"definition":"Of a mode of transport, to end its journey; or of a railway line, to reach its terminus."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been the subject of termination; killed, ended or destroyed."},{"definition":"Having lost a job or assignment."},{"definition":"Having an end or a boundary."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɝmɪneɪtɪd/"},{"text":"/ˈtɜːmɪneɪtɪd/"}]},{"word":"EXPANDS","idx":10358,"count":4770776,"meanings":[{"definitions":[{"definition":"To change (something) from a smaller form and/or size to a larger one; to spread out or lay open.","example":"You can expand this compact umbrella to cover a large table."},{"definition":"To increase the extent, number, volume or scope of (something).","example":"A flower expands its leaves."},{"definition":"To express (something) at length and/or in detail."},{"definition":"To rewrite (an expression) as a longer, yet equivalent sum of terms.","example":"Use the binomial theorem to expand {(x+1)}^4."},{"definition":"(of an expression) To become, by rewriting, a longer, yet equivalent sum of terms.","example":"The expression {(x+1)}^4 expands to x^4 + 4x^3 + 6x^2 + 4x + 1."},{"definition":"To multiply both the numerator and the denominator of a fraction by the same natural number yielding a fraction of equal value"},{"definition":"To change from a smaller form/size to a larger one.","example":"Many materials expand when heated."},{"definition":"To increase in extent, number, volume or scope."},{"definition":"To speak or write at length or in detail.","example":"He expanded on his plans for the business."},{"definition":"To feel generous or optimistic."}],"partOfSpeech":"ve"}]},{"word":"LITHIUM","idx":10359,"count":4769453,"meanings":[{"definitions":[{"definition":"The simplest alkali metal, the lightest solid element, and the third lightest chemical element (symbol Li) with an atomic number of 3. It is a soft, silvery metal."},{"definition":"A single atom of this element."},{"definition":"Lithium carbonate or other preparations of lithium metal used to treat manic depression and bipolar disorders."},{"definition":"A lithium battery."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lithium-us","text":"/ˈlɪθi.əm/"}]},{"word":"SEDAN","idx":10360,"count":4769270,"meanings":[{"definitions":[{"definition":"An enclosed windowed chair suitable for a single occupant, carried by at least two porters, in equal numbers in front and behind, using wooden rails that passed through metal brackets on the sides of the chair."},{"definition":"An automobile designed in a configuration with separate compartments for engine space, driver/passenger space and luggage space."},{"definition":"A handbarrow for transporting fish."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˈdæn/"},{"audio":"sedan-1-au"}]},{"word":"PONY","idx":10361,"count":4769062,"meanings":[{"definitions":[{"definition":"A small horse; specifically, any of several small breeds of horse under 14.2 hands at the withers."},{"definition":"A small serving of an alcoholic beverage, especially beer.","example":"1879, “Some Queer Interviews: Interview with a Pony of Beer”, Puck, Vol. 5–6, p. 435"},{"definition":"(New South Wales, Victoria) A serving of 140 millilitres of beer (formerly 5 fl oz); a quarter pint."},{"definition":"Twenty-five pounds sterling."},{"definition":"A translation used as a study aid; loosely, a crib, a cheat-sheet."},{"definition":"A ponytail hairstyle."},{"definition":"Crap; rubbish, nonsense."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lead (a horse) from another horse."},{"definition":"To use a crib or cheat-sheet in translating."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of little worth."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpoʊni/"},{"text":"/ˈpəʊni/"},{"audio":"pony-au"}]},{"word":"COMPRISES","idx":10363,"count":4767943,"meanings":[{"definitions":[{"definition":"To be made up of; to consist of (especially a comprehensive list of parts).","example":"The parts are comprised by the whole."},{"definition":"To contain or embrace.","example":"Our committee comprises a president, secretary, treasurer and five other members."},{"definition":"(sometimes proscribed, usually in the passive) To compose, to constitute. See usage note below.","example":"A team is comprised of its members."},{"definition":"To include, contain, or be made up of, defining the minimum elements, whether essential or inessential, to define an invention. (\"Open-ended\", doesn't limit to the items listed; cf. compose, which is \"closed\" and limits to the items listed.)"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəmˈpɹaɪzɪz/"}]},{"word":"LEAP","idx":10364,"count":4767538,"meanings":[{"definitions":[{"definition":"The act of leaping or jumping."},{"definition":"The distance traversed by a leap or jump."},{"definition":"A group of leopards."},{"definition":"A significant move forward."},{"definition":"A large step in reasoning, often one that is not justified by the facts.","example":"It's quite a leap to claim that those cloud formations are evidence of UFOs."},{"definition":"A fault."},{"definition":"Copulation with, or coverture of, a female beast."},{"definition":"A passing from one note to another by an interval, especially by a long one, or by one including several other intermediate intervals."},{"definition":"A salmon ladder."},{"definition":"A basket."},{"definition":"A trap or snare for fish, made from twigs; a weely."},{"definition":"Half a bushel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To jump."},{"definition":"To pass over by a leap or jump.","example":"to leap a wall or a ditch"},{"definition":"To copulate with (a female beast); to cover."},{"definition":"To cause to leap.","example":"to leap a horse across a ditch"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(calendar) Intercalary, bissextile."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"leap-us","text":"/liːp/"}]},{"word":"FOUNDING","idx":10366,"count":4765875,"meanings":[{"definitions":[{"definition":"To start (an institution or organization)."},{"definition":"To begin building."},{"definition":"To melt, especially of metal in an industrial setting."},{"definition":"To form by melting a metal and pouring it into a mould; to cast."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The establishment of something.","example":"the founding of the republic"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Who or that founds or found.","example":"The founding fathers of our country."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfaʊndɪŋ/"}]},{"word":"SWAN","idx":10367,"count":4765643,"meanings":[{"definitions":[{"definition":"Any of various species of large, long-necked waterfowl, of genus Cygnus (bird family: Anatidae), most of which have white plumage."},{"definition":"One whose grace etc. suggests a swan."},{"definition":"This bird used as a heraldic charge, sometimes with a crown around its neck (e. g. the arms of Buckinghamshire)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel or move about in an aimless, idle, or pretentiously casual way."},{"definition":"To declare (chiefly in first-person present constructions)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"swan-us","text":"/swɑn/"}]},{"word":"PLANTING","idx":10368,"count":4765349,"meanings":[{"definitions":[{"definition":"To place (a seed or plant) in soil or other substrate in order that it may live and grow."},{"definition":"To place (an object, or sometimes a person), often with the implication of intending deceit.","example":"That gun's not mine! It was planted there by the real murderer!"},{"definition":"To place or set something firmly or with conviction.","example":"Plant your feet firmly and give the rope a good tug."},{"definition":"To place in the ground."},{"definition":"To furnish or supply with plants.","example":"to plant a garden, an orchard, or a forest"},{"definition":"To engender; to generate; to set the germ of."},{"definition":"To furnish with a fixed and organized population; to settle; to establish.","example":"to plant a colony"},{"definition":"To introduce and establish the principles or seeds of.","example":"to plant Christianity among the heathen"},{"definition":"To set up; to install; to instate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A plant (or clipping) that has been freshly planted.","example":"Take one of the plantings over as a house-warming gift."},{"definition":"The act of setting a plant in the ground for growth."},{"definition":"A plantation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈplæntɪŋ/"},{"text":"/ˈplɑːntɪŋ/"}]},{"word":"ALPHABETICALLY","idx":10369,"count":4764324,"meanings":[{"definitions":[{"definition":"(manner) In an alphabetical manner."},{"definition":"(sequence) Arranged in the order of the alphabet."}],"partOfSpeech":"v"}]},{"word":"FACIALS","idx":10370,"count":4764295,"meanings":[{"definitions":[{"definition":"A personal care beauty treatment which involves cleansing and moisturizing of the human face."},{"definition":"A kind of early silent film focusing on the facial expressions of the actor."},{"definition":"(in some contact sports) A foul play which involves one player hitting another in the face."},{"definition":"A sex act of male ejaculation onto another person's face.","example":"He gave his wife a creamy facial."}],"partOfSpeech":"n"}]},{"word":"COVENANT","idx":10371,"count":4763666,"meanings":[{"definitions":[{"definition":"An agreement to do or not do a particular thing."},{"definition":"A promise, incidental to a deed or contract, either express or implied."},{"definition":"A pact or binding agreement between two or more parties."},{"definition":"An incidental clause in an agreement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enter into, or promise something by, a covenant."},{"definition":"To enter a formal agreement."},{"definition":"To bind oneself in contract."},{"definition":"To make a stipulation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"covenant-us","text":"/ˈkʌv.nənt/"}]},{"word":"DROPPING","idx":10372,"count":4761980,"meanings":[{"definitions":[{"definition":"To fall in droplets (of a liquid)."},{"definition":"To drip (a liquid).","example":"The equipment shows how much the glacier has moved and the amount it dropped in height over the summer."},{"definition":"Generally, to fall (straight down).","example":"A single shot was fired and the bird dropped from the sky."},{"definition":"To let fall; to allow to fall (either by releasing hold of, or losing one's grip on).","example":"Don't drop that plate!   The police ordered the men to drop their weapons."},{"definition":"To let drops fall; to discharge itself in drops."},{"definition":"To lower; to move to a lower position."},{"definition":"To set down from a vehicle; to deliver or deposit by stopping.","example":"Could you drop me at the airport on your way to work tomorrow?"},{"definition":"To sink quickly to the ground.","example":"Drop and give me thirty push-ups, private!"},{"definition":"To fall dead, or to fall in death."},{"definition":"To come to an end (by not being kept up); to stop."},{"definition":"To mention casually or incidentally, usually in conversation.","example":"The moderator would drop hints whenever the students struggled."},{"definition":"To part with or spend (money)."},{"definition":"To cease concerning oneself over; to have nothing more to do with (a subject, discussion etc.).","example":"I'm tired of this subject. Will you just drop it?"},{"definition":"To lessen, decrease, or diminish in value, condition, degree, etc.","example":"The stock dropped 1.5% yesterday.   We can take our vacation when the price of fuel drops.   Watch for the temperature to drop sharply, then you'll know the reaction is complete."},{"definition":"To let (a letter etc.) fall into a postbox; to send (a letter or message) in an offhand manner.","example":"Drop me a note when you get to the city."},{"definition":"To make (someone or something) fall to the ground from a blow, gunshot etc.; to bring down, to shoot down.","example":"Make any sudden movements and I will drop you!"},{"definition":"To fail to write, or (especially) to pronounce (a syllable, letter etc.).","example":"Cockneys drop their aitches."},{"definition":"(of a fielder) To fail to make a catch from a batted ball that would have led to the batsman being out.","example":"Warne dropped Tendulkar on 99. Tendulkar went on to get a century next ball"},{"definition":"To swallow (a drug), particularly LSD.","example":"They had never dropped acid."},{"definition":"To dispose (of); get rid of; to remove; to lose.","example":"I dropped ten pounds and an obnoxious fiancée."},{"definition":"To eject; to dismiss; to cease to include, as if on a list.","example":"I've been dropped from the football team."},{"definition":"To drop out of the betting."},{"definition":"(rugby football) To score (a goal) by means of a drop kick."},{"definition":"To impart.","example":"I drop knowledge wherever I go."},{"definition":"To release to the public.","example":"That hacker has been threatening to drop my docs [i.e. publish my personal information]."},{"definition":"To play a portion of music in the manner of a disc jockey.","example":"I love it when he drops his funky beats."},{"definition":"To enter public distribution.","example":"\"Hip-Hop Xmas\" dropped in time for the holidays."},{"definition":"To tune (a guitar string, etc.) to a lower note."},{"definition":"To cancel or end a scheduled event, project or course.","example":"I had to drop calculus because it was taking up too much of my time and I couldn't go anymore."},{"definition":"(fast food) To cook, especially by deep-frying or grilling.","example":"Drop a basket of fries."},{"definition":"(of a voice) To lower in timbre, often relating to puberty.","example":"Billy's voice dropped suddenly when he turned 12."},{"definition":"(of a sound or song) To lower in pitch, tempo, key, or other quality.","example":"My synthesizer makes the notes sound funny when they drop below C2."},{"definition":"(of people) To visit informally; used with in or by.","example":"Do drop by soon and I'll lend you that book."},{"definition":"To give birth to.","example":"to drop a lamb"},{"definition":"To cover with drops; to variegate; to bedrop."},{"definition":"(of the testicles) To hang lower and begin producing sperm due to puberty."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something dropped."},{"definition":"(usually in the plural) A piece of animal excrement; dung.","example":"a rabbit dropping"},{"definition":"The act of something that drops or falls."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dropping-us","text":"/ˈdɹɑpɪŋ/"}]},{"word":"CALORIES","idx":10373,"count":4761564,"meanings":[{"definitions":[{"definition":"(nutrition) Kilogram calorie or large calorie. A unit of energy 1000 times larger than the gram calorie. It is equivalent to the gram kilocalorie, approximately 4.2 kilojoules."},{"definition":"The gram calorie or small calorie, a non-SI unit of energy, equivalent to approximately 4.2 joules. This unit was widely used in chemistry and physics, being the amount of energy needed to raise the temperature of 1 gram of water by 1 °C."}],"partOfSpeech":"n"}]},{"word":"AIRWAYS","idx":10374,"count":4760691,"meanings":[{"definitions":[{"definition":"The trachea."},{"definition":"A flight path used by aeroplanes."}],"partOfSpeech":"n"}]},{"word":"ARCHAEOLOGY","idx":10375,"count":4760584,"meanings":[{"definitions":[{"definition":"The study of the past by excavation and analysis of its material remains:"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"archaeology-us","text":"/ˌɑɹ.kiˈɑ.lə.dʒi/"}]},{"word":"REFILL","idx":10376,"count":4759900,"meanings":[{"definitions":[{"definition":"A filling after the first.","example":"Today it is $2 for a coffee, with free refills throughout the day."},{"definition":"A repeat of a prescription."},{"definition":"A product containing materials to replace those used up by a piece of equipment.","example":"We're cutting back. No new printers or pens, just refills."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fill up once again.","example":"Can you refill my cup please? I've finished my coffee."},{"definition":"To repeat a prescription."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"refill-1-uk","text":"/ˈɹiː.fɪl/"}]},{"word":"SAILOR","idx":10378,"count":4759044,"meanings":[{"definitions":[{"definition":"A person in the business of navigating ships or other vessels"},{"definition":"Someone knowledgeable in the practical management of ships.","example":"He's a talented sailor and has spent many years at sea."},{"definition":"A member of the crew of a vessel; a mariner; a common seaman."},{"definition":"A person who sails sailing boats as a sport or recreation."},{"definition":"Any of various nymphalid butterflies of the genera Neptis, Pseudoneptis and Phaedyma, having white markings on a dark base and commonly flying by gliding."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sailor-us","text":"/ˈseɪlɚ/"},{"audio":"sailor-uk","text":"/ˈseɪlə/"}]},{"word":"FITTINGS","idx":10379,"count":4758873,"meanings":[{"definitions":[{"definition":"A small part, especially a standardized or detachable part of a device or machine."},{"definition":"A tube connector; a standardized connecting part of a piping system to attach sections of pipe together, such as a coupling"},{"definition":"The act of trying on clothes to inspect or adjust the fit."},{"definition":"The process of fitting up; especially of applying craft methods such as skilled filing to the making and assembling of machines or other products."},{"definition":"(often plural) A removable item in a house or other building, which can be taken with one when one moves out, such as a moveable piece of furniture, a carpet, picture, etc.; US furnishing; compare fixture.","example":"the fittings of a church or study"},{"definition":"The action or condition of having fits in the sense of seizures or convulsions.","example":"Since her medication was changed, her fitting has got worse."}],"partOfSpeech":"n"}]},{"word":"LINING","idx":10380,"count":4758401,"meanings":[{"definitions":[{"definition":"To place (objects) into a line (usually used with \"up\"); to form into a line; to align.","example":"to line troops"},{"definition":"To place persons or things along the side of for security or defense; to strengthen by adding; to fortify.","example":"to line works with soldiers"},{"definition":"To form a line along."},{"definition":"To mark with a line or lines, to cover with lines.","example":"to line a copy book"},{"definition":"To represent by lines; to delineate; to portray."},{"definition":"To read or repeat line by line.","example":"to line out a hymn"},{"definition":"To hit a line drive; to hit a line drive which is caught for an out. Compare fly and ground.","example":"Jones lined to left in his last at-bat."},{"definition":"To track (wild bees) to their nest by following their line of flight."},{"definition":"To measure."},{"definition":"To cover the inner surface of (something), originally especially with linen.","example":"The bird lines its nest with soft grass."},{"definition":"To reinforce (the back of a book) with glue and glued scrap material such as fabric or paper."},{"definition":"To fill or supply (something), as a purse with money.","example":"to line the shelves"},{"definition":"(of a dog) To copulate with, to impregnate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A covering for the inside surface of something."},{"definition":"The material used for such a covering."},{"definition":"The act of attaching such a covering."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlaɪnɪŋ/"}]},{"word":"BANQUET","idx":10381,"count":4757535,"meanings":[{"definitions":[{"definition":"A large celebratory meal; a feast."},{"definition":"A dessert; a course of sweetmeats."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To participate in a banquet; to feast."},{"definition":"To have dessert after a feast."},{"definition":"To treat with a banquet or sumptuous entertainment of food; to feast."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"banquet-us","text":"/ˈbæŋkwɪt/"}]},{"word":"CARES","idx":10382,"count":4757269,"meanings":[{"definitions":[{"definition":"Grief, sorrow."},{"definition":"Close attention; concern; responsibility.","example":"Care should be taken when holding babies."},{"definition":"Worry.","example":"I don't have a care in the world."},{"definition":"Maintenance, upkeep.","example":"dental care"},{"definition":"The treatment of those in need (especially as a profession)."},{"definition":"The state of being cared for by others.","example":"in care"},{"definition":"The object of watchful attention or anxiety."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be concerned (about), to have an interest (in); to feel concern (about).","example":"\"She doesn't care what you think.\" \"I don't care, I'm still going.\""},{"definition":"(polite) To want, to desire; to like; to be inclined towards.","example":"I don't care to hear your opinion."},{"definition":"(with for) To look after or look out for.","example":"He cared for his mother while she was sick."},{"definition":"To mind; to object."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cares-us","text":"/kɛɹz/"}]},{"word":"SANCTUARY","idx":10383,"count":4757139,"meanings":[{"definitions":[{"definition":"A place of safety, refuge or protection.","example":"My car is a sanctuary, where none can disturb me except for people who cut me off."},{"definition":"An area set aside for protection.","example":"The bird sanctuary has strict restrictions on visitors so the birds aren't disturbed."},{"definition":"A state of being protected, asylum.","example":"The government granted sanctuary to the defector, protecting him from his former government."},{"definition":"The consecrated (or sacred) area of a church or temple around its tabernacle or altar."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsæŋkt͡ʃuˌɛɹi/"},{"text":"/ˈsæŋktjʊəɹi/"}]},{"word":"FLORA","idx":10384,"count":4756211,"meanings":[{"definitions":[{"definition":"Plants considered as a group, especially those of a particular country, region, time, etc."},{"definition":"A book describing the plants of a country, region, time, etc."},{"definition":"The microorganisms that inhabit some part of the body"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"flora-us","text":"/ˈflɔː.ɹə/"}]},{"word":"STATUE","idx":10388,"count":4753368,"meanings":[{"definitions":[{"definition":"A three-dimensional work of art, usually representing a person or animal, usually created by sculpting, carving, molding, or casting."},{"definition":"A portrait."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a statue of; to make into a statue."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"statue-us","text":"/ˈstætʃu/"}]},{"word":"QUOTATION","idx":10390,"count":4750453,"meanings":[{"definitions":[{"definition":"A fragment of a human expression that is repeated by somebody else. Most often a quotation is taken from literature or speech, but also scenes from a movie, elements of a painting, a passage of music, etc., may be quoted.","example":"\"Where they burn books, they will also burn people\" is a famous quotation from Heinrich Heine."},{"definition":"A price that has been quoted for buying or selling.","example":"Let's get a quotation for repairing the roof before we decide whether it's worth doing."},{"definition":"The act of setting a price."},{"definition":"A quota, a share."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"quotation-us","text":"/kwoʊˈteɪʃən/"}]},{"word":"EQUALS","idx":10391,"count":4749787,"meanings":[{"definitions":[{"definition":"A person or thing of equal status to others.","example":"This beer has no equal."},{"definition":"State of being equal; equality."},{"definition":"The symbol ="}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be equal to, to have the same value as; to correspond to.","example":"Two plus two equals four."},{"definition":"To make equivalent to; to cause to match.","example":"David equaled the water levels of the bottles, so they now both contain exactly 1 liter."},{"definition":"To have as its consequence.","example":"Losing this deal equals losing your job."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"equals-us","text":"/ˈiːkwəlz/"}]},{"word":"HARDY","idx":10392,"count":4748572,"meanings":[{"definitions":[{"definition":"(usually in the plural) Anything, especially a plant, that is hardy."},{"definition":"A blacksmith's fuller or chisel, having a square shank for insertion into a square hole in an anvil, called the hardy hole."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having rugged physical strength; inured to fatigue or hardships."},{"definition":"Able to survive adverse growing conditions.","example":"A hardy plant is one that can withstand the extremes of climate, such as frost."},{"definition":"Brave and resolute."},{"definition":"Impudent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hardy-us","text":"/ˈhɑɹdi/"}]},{"word":"JUMPER","idx":10394,"count":4746695,"meanings":[{"definitions":[{"definition":"Someone or something that jumps, e.g. a participant in a jumping event in track or skiing."},{"definition":"A person who attempts suicide by jumping from a great height."},{"definition":"A short length of electrical conductor, to make a temporary connection. Also jump wire."},{"definition":"A removable connecting pin on an electronic circuit board."},{"definition":"A long drilling tool used by masons and quarry workers, consisting of an iron bar with a chisel-edged steel tip at one or both ends, operated by striking it against the rock, turning it slightly with each blow."},{"definition":"A crude kind of sleigh, usually a simple box on runners which are in one piece with the poles that form the thills."},{"definition":"A jumping spider"},{"definition":"The larva of the cheese fly."},{"definition":"(18th century) One of certain Calvinistic Methodists in Wales whose worship was characterized by violent convulsions."},{"definition":"A spring to impel the star wheel, or a pawl to lock fast a wheel, in a repeating timepiece."},{"definition":"A shot in which the player releases the ball at the highest point of a jump; a jump shot."},{"definition":"A nuclear power plant worker who repairs equipment in areas with extremely high levels of radiation."},{"definition":"A woolen sweater or pullover."},{"definition":"A loose outer jacket, especially one worn by workers and sailors."},{"definition":"A one-piece, sleeveless dress, or a skirt with straps and a complete or partial bodice, usually worn over a blouse by women and children."},{"definition":"(usually as jumpers) Rompers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To connect with an electrical jumper."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jumper-us","text":"/dʒʌmpɚ/"}]},{"word":"CARAVAN","idx":10395,"count":4746134,"meanings":[{"definitions":[{"definition":"A convoy or procession of travelers, their vehicles and cargo, and any pack animals, especially camels crossing a desert."},{"definition":"A furnished vehicle towed behind a car, etc., and used as a dwelling when stationary."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel in a caravan (procession).","example":"The wedding party got in their cars and caravaned from the chapel to the reception hall."},{"definition":"To travel and/or live in a caravan (vehicle).","example":"When my parents retired they really got back into caravanning."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"caravan-us","text":"/ˈkæɹəvæn/"},{"audio":"caravan-au","text":"/ˈkæɹəvæn/"}]},{"word":"DIAGRAMS","idx":10396,"count":4745696,"meanings":[{"definitions":[{"definition":"A plan, drawing, sketch or outline to show how something works, or show the relationships between the parts of a whole.","example":"Electrical diagrams show device interconnections."},{"definition":"A graph or chart."},{"definition":"A functor from an index category to another category. The objects and morphisms of the index category need not have any internal substance, but rather merely outline the connective structure of at least some part of the diagram's codomain. If the index category is J and the codomain is C, then the diagram is said to be \"of type J in C\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To represent or indicate something using a diagram."},{"definition":"To schedule the operations of a locomotive or train according to a diagram."}],"partOfSpeech":"ve"}]},{"word":"HARNESS","idx":10397,"count":4745215,"meanings":[{"definitions":[{"definition":"A restraint or support, especially one consisting of a loop or network of rope or straps."},{"definition":"A collection of wires or cables bundled and routed according to their function."},{"definition":"The complete dress, especially in a military sense, of a man or a horse; armour in general."},{"definition":"The part of a loom comprising the heddles, with their means of support and motion, by which the threads of the warp are alternately raised and depressed for the passage of the shuttle."},{"definition":"Equipment for any kind of labour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place a harness on something; to tie up or restrain.","example":"They harnessed the horse to the post."},{"definition":"To capture, control or put to use.","example":"Imagine what might happen if it were possible to harness solar energy fully."},{"definition":"To equip with armour."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"harness-us"},{"text":"/ˈhɑː(ɹ).nəs/"}]},{"word":"MAJORS","idx":10398,"count":4745096,"meanings":[{"definitions":[{"definition":"A military rank between captain and lieutenant colonel.","example":"He used to be a major in the army."},{"definition":"The main area of study of a student working toward a degree at a college or university.","example":"Midway through his second year of college, he still hadn't chosen a major."},{"definition":"A student at a college or university concentrating on a given area of study.","example":"She is a math major."},{"definition":"A person of legal age."},{"definition":"The major premise."},{"definition":"A touchdown, or major score."},{"definition":"A large, commercially successful company, especially a record label that is bigger than an indie."},{"definition":"(British slang) An elder brother (especially at a public school)."},{"definition":"A large leaf-cutter ant that acts as a soldier, defending the nest."}],"partOfSpeech":"n"}]},{"word":"HEADSETS","idx":10399,"count":4745064,"meanings":[{"definitions":[{"definition":"A pair of headphones or earphones, or a singular headphone or earphone, typically with an attached microphone."},{"definition":"Any electronic device worn on the head."},{"definition":"On a bicycle, the system of bearings that connects the fork to the frame."}],"partOfSpeech":"n"}]},{"word":"MANIPULATION","idx":10400,"count":4744083,"meanings":[{"definitions":[{"definition":"The practice of manipulating or the state of being manipulated.","example":"The dealer's manipulations could have removed cards from the deck."},{"definition":"The skillful use of the hands in, for example, chiropractic.","example":"After a few minutes of manipulation each week, she obtained days of relief from her neck pain."},{"definition":"The usage of underhanded influence over a person, event, or situation to gain a desired outcome.","example":"The counselor was able to reach the disturbed teen through positive psychological manipulation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/məˌnɪp.juˈleɪ.ʃən/"}]},{"word":"BELLS","idx":10401,"count":4743841,"meanings":[{"definitions":[{"definition":"A percussive instrument made of metal or other hard material, typically but not always in the shape of an inverted cup with a flared rim, which resonates when struck."},{"definition":"The sounding of a bell as a signal."},{"definition":"A telephone call.","example":"I’ll give you a bell later."},{"definition":"A signal at a school that tells the students when a class is starting or ending."},{"definition":"The flared end of a brass or woodwind instrument."},{"definition":"Any of a series of strokes on a bell (or similar), struck every half hour to indicate the time (within a four hour watch)"},{"definition":"The flared end of a pipe, designed to mate with a narrow spigot."},{"definition":"A device control code that produces a beep (or rings a small electromechanical bell on older teleprinters etc.)."},{"definition":"Anything shaped like a bell, such as the cup or corolla of a flower."},{"definition":"The part of the capital of a column included between the abacus and neck molding; also used for the naked core of nearly cylindrical shape, assumed to exist within the leafage of a capital."},{"definition":"An instrument situated on a bicycle's handlebar, used by the cyclist to warn of his or her presence."},{"definition":"The bellow or bay of certain animals, such as a hound on the hunt or a stag in rut."},{"definition":"Ship's bells; the strokes on a ship's bell, every half hour, to mark the passage of time."},{"definition":"Short for bell-bottoms."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attach a bell to.","example":"Who will bell the cat?"},{"definition":"To shape so that it flares out like a bell.","example":"to bell a tube"},{"definition":"To telephone."},{"definition":"To develop bells or corollas; to take the form of a bell; to blossom.","example":"Hops bell."},{"definition":"To bellow or roar."},{"definition":"To utter in a loud manner; to thunder forth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bells-us","text":"/bɛlz/"}]},{"word":"VASCULAR","idx":10402,"count":4743792,"meanings":[{"definitions":[{"definition":"Relating to the flow of fluids, such as blood, lymph, or sap, through the body of an animal or plant, or to the vessels that carry such fluids"}],"partOfSpeech":"j"}]},{"word":"ALONGSIDE","idx":10403,"count":4743589,"meanings":[{"definitions":[{"definition":"Along the side; by the side; side by side with.","example":"Ahoy! Bring your boat alongside mine."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Together with or at the same time.","example":"The nurse worked alongside the doctor."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"alongside-us","text":"/ə.lɔŋˈsaɪd/"}]},{"word":"IMPRESSIONS","idx":10404,"count":4743278,"meanings":[{"definitions":[{"definition":"The indentation or depression made by the pressure of one object on or into another.","example":"His head made an impression on the pillow."},{"definition":"The overall effect of something, e.g., on a person.","example":"He tried to make a good impression on his parents."},{"definition":"A vague recalling of an event, a belief.","example":"I have the impression that he's already left for Paris."},{"definition":"An impersonation, an imitation of the mannerisms of another individual."},{"definition":"An outward appearance."},{"definition":"An online advertising performance metric representing an instance where an ad is shown once."},{"definition":"The first coat of colour, such as the priming in house-painting etc."},{"definition":"(engraving) A print on paper from a wood block, metal plate, etc."},{"definition":"The vivid perception of something as it is experienced, in contrast to ideas or thoughts drawn from memory or the imagination."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To manipulate a blank key within a lock so as to mark it with impressions of the shape of the lock, which facilitates creation of a duplicate key."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"impressions-us","text":"/ɪmˈpɹɛʃənz/"}]},{"word":"TOXICITY","idx":10406,"count":4741378,"meanings":[{"definitions":[{"definition":"The quality or degree of being toxic."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tɒkˈsɪsəti/"}]},{"word":"FORWARDED","idx":10407,"count":4741165,"meanings":[{"definitions":[{"definition":"To advance, promote."},{"definition":"To send (a letter, email etc.) to a third party.","example":"I'll be glad to forward your mail to you while you're gone."},{"definition":"To assemble (a book) by sewing sections, attaching cover boards, and so on."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"forwarded-us"}]},{"word":"GAL","idx":10409,"count":4740469,"meanings":[{"definitions":[{"definition":"A unit of volume, equivalent to eight pints"},{"definition":"Exactly 4.54609 liters; an imperial gallon"},{"definition":"231 cubic inches or approximately 3.785 liters for liquids (a \"U.S. liquid gallon\")"},{"definition":"One-eighth of a U.S. bushel or approximately 4.405 liters for dry goods (a \"U.S. dry gallon\")."},{"definition":"(in the plural) A large quantity (of any liquid).","example":"The pipe burst and gallons of water flooded into the kitchen."},{"definition":"A young woman."},{"definition":"A galileo (a unit of acceleration)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡæl/"}]},{"word":"TRANSMITTER","idx":10410,"count":4739143,"meanings":[{"definitions":[{"definition":"One who or that which transmits something (in all senses)."},{"definition":"An electronic device that generates and amplifies a carrier wave, modulates it with a meaningful signal derived from speech, music, TV or other sources, and broadcasts the resulting signal from an antenna."}],"partOfSpeech":"n"}]},{"word":"FREEMAN","idx":10412,"count":4737933,"meanings":[{"definitions":[{"definition":"A free person, particularly:"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"freeman-au"}]},{"word":"DENIM","idx":10413,"count":4737554,"meanings":[{"definitions":[{"definition":"A textile often made of cotton with a distinct diagonal pattern."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"denim-uk","text":"/ˈdɛnɪm/"}]},{"word":"SCAT","idx":10416,"count":4737410,"meanings":[{"definitions":[{"definition":"A tax; tribute."},{"definition":"A land-tax paid in the Shetland Islands."},{"definition":"Animal excrement; droppings, dung."},{"definition":"Heroin."},{"definition":"Whiskey."},{"definition":"Coprophilia."},{"definition":"A brisk shower of rain, driven by the wind."},{"definition":"Scat singing."},{"definition":"Any fish in the family Scatophagidae"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sing an improvised melodic solo using nonsense syllables, often onomatopoeic or imitative of musical instruments."},{"definition":"To leave quickly (often used in the imperative).","example":"Here comes the principal; we'd better scat."},{"definition":"An imperative demand, often understood by speaker and listener as impertinent.","example":"Scat! Go on! Get out of here!"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scat-au","text":"/skæt/"}]},{"word":"EMS","idx":10417,"count":4737189,"meanings":[{"definitions":[{"definition":"The name of the Latin-script letter M.","example":"The ems and ens at the beginnings and ends."},{"definition":"A unit of measurement equal to the height of the type in use."}],"partOfSpeech":"n"}]},{"word":"NEIGHBORHOODS","idx":10418,"count":4735936,"meanings":[{"definitions":[{"definition":"The quality of being a neighbor, of living nearby, next to each-other; proximity.","example":"Our neighborhood was our only reason to exchange hollow greetings."},{"definition":"Close proximity, nearby area; particularly, close proximity to one's home.","example":"He lives in my neighborhood."},{"definition":"The inhabitants of a residential area.","example":"The fire alarmed the neighborhood."},{"definition":"A formal or informal division of a municipality or region.","example":"We have just moved to a pleasant neighborhood."},{"definition":"An approximate amount.","example":"He must be making in the neighborhood of $200,000 per year."},{"definition":"The quality of physical proximity.","example":"The slums and the palace were in awful neighborhood."},{"definition":"The disposition becoming a neighbor; neighborly kindness or good will."},{"definition":"Within a topological space:"},{"definition":"Within a metric space:"},{"definition":"The infinitesimal open set of all points that may be reached directly from a given point."},{"definition":"The set of all the vertices adjacent to a given vertex."}],"partOfSpeech":"n"}]},{"word":"PUPPIES","idx":10419,"count":4733987,"meanings":[{"definitions":[{"definition":"A young dog, especially before sexual maturity (12-18 months)"},{"definition":"A young rat."},{"definition":"A young seal."},{"definition":"(usually in the plural) A woman’s breast."},{"definition":"A (generic) thing; particularly something that is a nuisance; a sucker.","example":"I have another two dozen of these puppies to finish before I can go home."},{"definition":"A conceited and impertinent person, especially a young man."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bring forth whelps or give birth to pups."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpʌpiz/"}]},{"word":"RELAXING","idx":10420,"count":4733863,"meanings":[{"definitions":[{"definition":"To calm down."},{"definition":"To make something loose.","example":"to relax a rope or cord"},{"definition":"To become loose."},{"definition":"To make something less severe or tense.","example":"to relax discipline"},{"definition":"To become less severe or tense."},{"definition":"To make something (such as codes and regulations) more lenient."},{"definition":"(of codes and regulations) To become more lenient."},{"definition":"To relieve (something) from stress.","example":"Amusement relaxes the mind."},{"definition":"To relieve from constipation; to loosen; to open.","example":"An aperient relaxes the bowels."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is relaxed.","example":"relaxings of the muscles"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Conducive to relaxation; helping one to relax.","example":"a relaxing piece of music"}],"partOfSpeech":"j"}]},{"word":"TROPHY","idx":10422,"count":4731863,"meanings":[{"definitions":[{"definition":"Tropæum."},{"definition":"An object, usually in the form of a statuette, cup, or shield, awarded for success in a competition or to mark a special achievement.","example":"He won the trophy in a running competition."},{"definition":"An object taken as a prize by a hunter or conqueror, especially one that is displayed.","example":"The set of antlers which hung on the wall was his prized trophy."},{"definition":"Any emblem of success; a status symbol.","example":"His trophies included his second wife, his successful children, the third and fourth homes in Palm Beach and Malibu, his three yachts (for the Pacific, the Atlantic, and the Mediterranean), his jet, and his mistresses."},{"definition":"(by extension) An object taken by a serial killer or rapist as a memento of the crime."},{"definition":"A display of weaponry and other militaria, often captured from a defeated enemy, as an ornament designed for the purpose of triumphalist display by a victor or as a show of military prowess by a monarch."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"trophy-uk","text":"/ˈtɹəʊfi/"}]},{"word":"EMOTION","idx":10423,"count":4731715,"meanings":[{"definitions":[{"definition":"A person's internal state of being and involuntary physiological response to an object or a situation, based on or tied to physical state and sensory data."},{"definition":"A reaction by a non-human organism with behavioral and physiological elements similar to a person's response."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"emotion-us","text":"/iˈmoʊʃən/"},{"audio":"emotion-ca","text":"/iˈmoʊʃən/"}]},{"word":"SLIPKNOT","idx":10425,"count":4731098,"meanings":[{"definitions":[{"definition":"A knot which attaches a line to an object and tightens when pressure is applied. Also called a running knot."},{"definition":"A knot which attaches a line to the middle of another, allowing it to slide"}],"partOfSpeech":"n"}]},{"word":"NETS","idx":10426,"count":4730591,"meanings":[{"definitions":[{"definition":"A mesh of string, cord or rope.","example":"a net for the hair; a mosquito net; a tennis net"},{"definition":"A device made from such mesh, used for catching fish, butterflies, etc."},{"definition":"A device made from such mesh, generally used for trapping something."},{"definition":"Anything that has the appearance of such a device.","example":"Petri net"},{"definition":"(by extension) A trap.","example":"caught in the prosecuting attorney's net"},{"definition":"Of a polyhedron, any set of polygons joined edge to edge that, when folded along the edges between adjoining polygons so that the outer edges touch, form the polyhedron."},{"definition":"A system that interconnects a number of users, locations etc. allowing transport or communication between them.","example":"a computer network; a road network; an electricity distribution network"},{"definition":"A framework backed by a mesh, serving as the goal in hockey, soccer, lacrosse, etc.","example":"The striker headed the ball into the net to make it 1-0."},{"definition":"A mesh stretched to divide the court in tennis, badminton, volleyball, etc."},{"definition":"(by extension) The area of the court close to the net (mesh stretched to divide the court)."},{"definition":"The amount remaining after expenses are deducted; profit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To catch by means of a net."},{"definition":"To catch in a trap, or by stratagem."},{"definition":"To enclose or cover with a net.","example":"to net a tree"},{"definition":"To score (a goal).","example":"Evans netted the winner in the 80th minute."},{"definition":"To hit the ball into the net."},{"definition":"To form network or netting; to knit."},{"definition":"To receive as profit.","example":"The company nets $30 on every sale."},{"definition":"To yield as profit for.","example":"The scam netted the criminals $30,000."},{"definition":"To fully hedge a position.","example":"Every party is netting their position with a counter-party"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"nets-us","text":"/nɛts/"}]},{"word":"SIGHTS","idx":10427,"count":4730414,"meanings":[{"definitions":[{"definition":"(in the singular) The ability to see.","example":"He is losing his sight and now can barely read."},{"definition":"The act of seeing; perception of objects by the eye; view.","example":"to gain sight of land"},{"definition":"Something seen."},{"definition":"Something worth seeing; a spectacle, either good or bad.","example":"We went to London and saw all the sights – Buckingham Palace, Tower Bridge, and so on."},{"definition":"A device used in aiming a projectile, through which the person aiming looks at the intended target."},{"definition":"A small aperture through which objects are to be seen, and by which their direction is settled or ascertained.","example":"the sight of a quadrant"},{"definition":"A great deal, a lot; frequently used to intensify a comparative.","example":"This is a darn sight better than what I'm used to at home!"},{"definition":"In a drawing, picture, etc., that part of the surface, as of paper or canvas, which is within the frame or the border or margin. In a frame, the open space, the opening."},{"definition":"The instrument of seeing; the eye."},{"definition":"Mental view; opinion; judgment.","example":"In their sight it was harmless."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To register visually."},{"definition":"To get sight of (something).","example":"to sight land from a ship"},{"definition":"To apply sights to; to adjust the sights of; also, to give the proper elevation and direction to by means of a sight.","example":"to sight a rifle or a cannon"},{"definition":"To take aim at."}],"partOfSpeech":"ve"}]},{"word":"UNIFORMS","idx":10428,"count":4730405,"meanings":[{"definitions":[{"definition":"A distinctive outfit that serves to identify members of a group."},{"definition":"Phonetic equivalent for the letter U in the ICAO spelling alphabet, informally known as the NATO phonetic alphabet."},{"definition":"A uniformed police officer (as opposed to a detective)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clothe in a uniform."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈjunɪfɔɹms/"},{"text":"/ˈjuːnɪfɔːms/"}]},{"word":"RESIDUAL","idx":10430,"count":4729381,"meanings":[{"definitions":[{"definition":"A remainder left over at the end of some process."},{"definition":"(in the plural) Payments made to performers, writers and directors when a recorded broadcast is repeated."},{"definition":"The difference between the observed value and the estimated value of the quantity of interest"},{"definition":"(paranormal) A spiritual presence left behind in a place as a result of a person's death or some other significant event."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or remaining as a residue; left over."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹə-/"},{"text":"/ɹɪˈzɪdjəl/"}]},{"word":"DISASTERS","idx":10431,"count":4729257,"meanings":[{"definitions":[{"definition":"An unexpected natural or man-made catastrophe of substantial extent causing significant physical damage or destruction, loss of life or sometimes permanent change to the natural environment.","example":"People would suffer disasters when society's morality degenerates."},{"definition":"An unforeseen event causing great loss, upset or unpleasantness of whatever kind."}],"partOfSpeech":"n"}]},{"word":"ASTERISK","idx":10432,"count":4728263,"meanings":[{"definitions":[{"definition":"The symbol *."},{"definition":"Something in the shape of or resembling the asterisk symbol."},{"definition":"A blemish in an otherwise outstanding achievement.","example":"They came into the tournament highly ranked, but with a little bit of an asterisk as their last two wins had been unconvincing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark or replace with an asterisk symbol (*); star."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"asterisk-us","text":"/ˈæstəɹɪsk/"}]},{"word":"VERSATILE","idx":10433,"count":4727772,"meanings":[{"definitions":[{"definition":"Capable of doing many things competently."},{"definition":"Having varied uses or many functions."},{"definition":"Changeable or inconstant."},{"definition":"Capable of moving freely in all directions."},{"definition":"(BDSM) Being a switch; capable of taking either a dominant or a submissive role.","example":"2004, \"queenchaser1158\", Horny Versatile TV/TS Wanted in Phoenix (on newsgroup alt.personals.gay)"},{"definition":"Capable of taking both a top and bottom role."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"versatile-uk","text":"/ˈvɜːsətaɪl/"}]},{"word":"LIQUOR","idx":10434,"count":4727484,"meanings":[{"definitions":[{"definition":"A liquid, a fluid."},{"definition":"A drinkable liquid."},{"definition":"A liquid obtained by cooking meat or vegetables (or both)."},{"definition":"A parsley sauce commonly served with traditional pies and mash."},{"definition":"Strong alcoholic drink derived from fermentation and distillation; more broadly, any alcoholic drink."},{"definition":"In process industry, a liquid in which a desired reaction takes place, e.g. pulping liquor is a mixture of chemicals and water which breaks wood into its components, thus facilitating the extraction of cellulose."},{"definition":"A liquid in which something has been steeped."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drink liquor, usually to excess."},{"definition":"To cause someone to drink liquor, usually to excess."},{"definition":"To grease."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"liquor-uk","text":"/ˈlɪk.ə(ɹ)/"}]},{"word":"KINDERGARTEN","idx":10435,"count":4726688,"meanings":[{"definitions":[{"definition":"An educational institution for young children, usually between ages 4 and 6; nursery school."},{"definition":"The elementary school grade before first grade."},{"definition":"The two levels between nursery and prep; the second and third years of preschool."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɪndəˌɡɑːt(ə)n/"},{"text":"/ˈkɪndəɹˌɡɑːɹd(ə)n/"}]},{"word":"PROFITABLE","idx":10436,"count":4725403,"meanings":[{"definitions":[{"definition":"Producing a profit."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"profitable-us","text":"/ˈpɹɑfɪtəbl̩/"}]},{"word":"WOUNDED","idx":10437,"count":4725318,"meanings":[{"definitions":[{"definition":"To hurt or injure (someone) by cutting, piercing, or tearing the skin.","example":"The police officer wounded the suspect during the fight that ensued."},{"definition":"To hurt (a person's feelings).","example":"The actor's pride was wounded when the leading role went to his rival."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Suffering from a wound, especially one acquired in battle from a weapon, such as a gun or a knife.","example":"A wounded soldier."},{"definition":"Suffering from an emotional injury.","example":"My wounded pride never recovered from her rejection."},{"definition":"Of a particle: having undergone an inelastic collision.","example":"a wounded nucleon"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"wounded-us","text":"/ˈwuːndɪd/"}]},{"word":"BF","idx":10439,"count":4724761,"meanings":[{"definitions":[{"definition":"An especially close and trusted friend."},{"definition":"An object or concept considered very useful or helpful."},{"definition":"A font that is dark, having a high ratio of ink to white space, written or drawn with thick strong lines."},{"definition":"A male partner in an unmarried romantic relationship."},{"definition":"A male friend."}],"partOfSpeech":"n"}]},{"word":"BASH","idx":10440,"count":4721893,"meanings":[{"definitions":[{"definition":"A large party; gala event.","example":"They had a big bash to celebrate their tenth anniversary."},{"definition":"An attack that consists of placing all one's weight into a downward attack with one's fists."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike heavily.","example":"He bashed himself against the door."},{"definition":"To collide.","example":"Don't bash into me with that shopping trolley."},{"definition":"To criticize harshly.","example":"He bashed my ideas."},{"definition":"To masturbate.","example":"He said that he bashes daily."},{"definition":"To abash; to disconcert or be disconcerted or put out of countenance."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bash-au","text":"/bæʃ/"}]},{"word":"DERIVATIVE","idx":10441,"count":4721844,"meanings":[{"definitions":[{"definition":"Something derived."},{"definition":"A word that derives from another one."},{"definition":"A financial instrument whose value depends on the valuation of an underlying asset; such as a warrant, an option etc."},{"definition":"A chemical derived from another."},{"definition":"The derived function of a function (the slope at a certain point on some curve f(x))"},{"definition":"The value of this function for a given value of its independent variable."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Obtained by derivation; not radical, original, or fundamental.","example":"a derivative conveyance; a derivative word"},{"definition":"Imitative of the work of someone else."},{"definition":"Referring to a work, such as a translation or adaptation, based on another work that may be subject to copyright restrictions."},{"definition":"Having a value that depends on an underlying asset of variable value."},{"definition":"Lacking originality."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"derivative-us"},{"text":"/dɪˈɹɪvətɪv/"}]},{"word":"NECKLACES","idx":10444,"count":4719123,"meanings":[{"definitions":[{"definition":"An article of jewelry that is worn around the neck, most often made of a string of precious metal, pearls, gems, beads or shells, and sometimes having a pendant attached."},{"definition":"Anything resembling a necklace in shape.","example":"a necklace of coral islands"},{"definition":"A device used in necklacing (an informal execution); a rubber tyre that is filled with petrol. It is placed around the victim's chest and arms, and set on fire."}],"partOfSpeech":"n"}]},{"word":"TOT","idx":10446,"count":4719021,"meanings":[{"definitions":[{"definition":"A small child.","example":"He learned to run when he was just a tot."},{"definition":"A measure of spirits, especially rum."},{"definition":"Tater tot."},{"definition":"A foolish fellow."},{"definition":"A total, an addition of a long column of figures."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sum or total."},{"definition":"To mark (a debt) with the word tot (Latin for \"so much\"), indicating that it was good or collectible for the amount specified.","example":"a totted debt"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tot-1-us"},{"audio":"tot-1-uk"}]},{"word":"OCCUPANCY","idx":10447,"count":4718502,"meanings":[{"definitions":[{"definition":"The act of occupying, the state of being occupied or the state of being an occupant or tenant."},{"definition":"The period of time during which someone rents or otherwise occupies certain land or premises.","example":"They had a five-year occupancy on the house."},{"definition":"The specific use to which something occupied is put.","example":"This building is for residential occupancy."}],"partOfSpeech":"n"}]},{"word":"POSTGRADUATE","idx":10448,"count":4718198,"meanings":[{"definitions":[{"definition":"A person continuing to study in a field after having successfully completed a degree course."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of studies which take place after having successfully completed a degree course."}],"partOfSpeech":"j"}]},{"word":"EDUCATE","idx":10450,"count":4716370,"meanings":[{"definitions":[{"definition":"To instruct or train","example":"Wang said such changes to the Baishui glacier provide the chance to educate visitors about global warming."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"educate-us","text":"/ˈɛdʒəkeɪt/"},{"audio":"educate-uk","text":"/ˈɛdjʊkeɪt/"}]},{"word":"BAKED","idx":10451,"count":4716100,"meanings":[{"definitions":[{"definition":"(with person as subject) To cook (something) in an oven.","example":"I baked a delicious cherry pie."},{"definition":"(with baked thing as subject) To be cooked in an oven.","example":"The cake baked at 350°F."},{"definition":"To be warmed to drying and hardening.","example":"The clay baked in the sun."},{"definition":"To dry by heat.","example":"They baked the electrical parts lightly to remove moisture."},{"definition":"To be hot.","example":"I'm baking after that workout in the gym."},{"definition":"To cause to be hot."},{"definition":"To smoke marijuana."},{"definition":"To harden by cold."},{"definition":"To fix (lighting, reflections, etc.) as part of the texture of an object to improve rendering performance."},{"definition":"(with \"in\" or \"into\") To incorporate into something greater."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been cooked by baking."},{"definition":"High on cannabis."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"baked-au","text":"/beɪkt/"}]},{"word":"GLOVE","idx":10452,"count":4714578,"meanings":[{"definitions":[{"definition":"An item of clothing other than a mitten, covering all or part of the hand and fingers, but usually allowing independent movement of the fingers.","example":"I wore gloves to keep my hands warm."},{"definition":"A baseball mitt."},{"definition":"The ability to catch a hit ball.","example":"Frederico had a great glove, but he couldn't hit a curveball, so he never broke into the pros."},{"definition":"A condom."},{"definition":"(with definite article) A challenge from one to another.","example":"to throw down the glove, i.e. to offer a challenge; to take up the glove, to accept it"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To catch the ball in a baseball mitt.","example":"He gloved the line drive for the third out."},{"definition":"To put a glove or gloves on.","example":"Maxwell gloved his hand so that he wouldn't leave fingerprints, then pulled the trigger."},{"definition":"To touch a delivery with one's glove while the gloved hand is on the bat. Under the rules of cricket, the batsman is deemed to have hit the ball."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"glove-us","text":"/ɡlʌv/"},{"audio":"glove-au","text":"/ɡlʌv/"}]},{"word":"WASTEWATER","idx":10454,"count":4714167,"meanings":[{"definitions":[{"definition":"Any water that has been used in some human domestic or industrial activity and, because of that, now contains waste products."}],"partOfSpeech":"n"}]},{"word":"PREJUDICE","idx":10455,"count":4713477,"meanings":[{"definitions":[{"definition":"An adverse judgment or opinion formed beforehand or without knowledge of the facts."},{"definition":"Any preconceived opinion or feeling, whether positive or negative."},{"definition":"An irrational hostile attitude, fear or hatred towards a particular group, race or religion.","example":"I am free of all prejudices. I hate everyone equally."},{"definition":"Knowledge formed in advance; foresight, presaging."},{"definition":"Mischief; hurt; damage; injury; detriment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have a negative impact on (someone's position, chances etc.)."},{"definition":"To cause prejudice in; to bias the mind of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prejudice-us","text":"/ˈpɹɛd͡ʒədɪs/"}]},{"word":"CONSTRUCTOR","idx":10457,"count":4711086,"meanings":[{"definitions":[{"definition":"A person who, or thing that, constructs."},{"definition":"A company or individual who builds racing vehicles. In Formula One, constructor status is strictly defined by the rules, but in other motorsports the term is merely a descriptor. Depending on the racing rules, some constructors (e.g. Cosworth) may provide vehicles to racing teams who are not themselves constructors, while others are both teams and constructors (Ducati Corse, Scuderia Ferrari)."},{"definition":"A class method that creates and initializes each instance of an object."}],"partOfSpeech":"n"}]},{"word":"TECHNICIANS","idx":10458,"count":4710299,"meanings":[{"definitions":[{"definition":"A person who studies or practises technology."}],"partOfSpeech":"n"}]},{"word":"PROBABLE","idx":10460,"count":4708443,"meanings":[{"definitions":[{"definition":"Something that is likely."},{"definition":"A person who is likely to appear or do a certain thing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Likely or most likely to be true.","example":"It's probable that it will rain tomorrow."},{"definition":"Likely to happen.","example":"With all the support we have, success is looking probable."},{"definition":"Supporting, or giving ground for, belief, but not demonstrating.","example":"probable evidence; probable presumption"},{"definition":"Capable of being proved."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"probable-us","text":"/ˈpɹɑbəbl̩/"}]},{"word":"ISSUANCE","idx":10461,"count":4708160,"meanings":[{"definitions":[{"definition":"The act of issuing, or giving out.","example":"the issuance of an order; the issuance of rations"}],"partOfSpeech":"n"}]},{"word":"INCORPORATION","idx":10465,"count":4707178,"meanings":[{"definitions":[{"definition":"The act of incorporating, or the state of being incorporated."},{"definition":"The union of different ingredients in one mass; mixture; combination; synthesis."},{"definition":"The union of something with a body already existing; association; intimate union; assimilation","example":"After the city's incorporation into the capital district, the population rose."},{"definition":"The act of creating a corporation."},{"definition":"A body incorporated; a corporation."},{"definition":"A phenomenon by which a grammatical category forms a compound with its direct object or adverbial modifier, while retaining its original syntactic function.","example":"Incorporation is central to many polysynthetic languages such as those found in North America, Siberia and northern Australia."},{"definition":"A doctrine of constitutional law according to which certain parts of the Bill of Rights are extended to bind individual American states. Wp"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"incorporation-uk","text":"/ɪŋ.kɔɹpəˈɹeɪʃən/"}]},{"word":"REM","idx":10466,"count":4706130,"meanings":[{"definitions":[{"definition":"Rapid movement of the eyes, characterising REM sleep"},{"definition":"A dose of absorbed radiation equivalent to one roentgen of X-rays or gamma rays"},{"definition":"A remark; a programming language statement used for documentation (in BASIC for example); also used in DOS batch files."},{"definition":"A unit relative to the declared font size of the root element in a HTML document."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Remaining"}],"partOfSpeech":"j"}]},{"word":"EVOLUTIONARY","idx":10467,"count":4704879,"meanings":[{"definitions":[{"definition":"Of or relating to the biological theory of evolution.","example":"The evolutionary history of marine mammals includes land-dwelling ancestors."},{"definition":"Having formal similarities to the biological theory of evolution."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"evolutionary-us","text":"/ˌevəˈluːʃəneɹi/"},{"audio":"evolutionary-uk","text":"/ˌevəˈl(j)uːʃənɹi/"}]},{"word":"ARRIVING","idx":10468,"count":4703021,"meanings":[{"definitions":[{"definition":"To reach; to get to a certain place.","example":"He arrived home for two days."},{"definition":"To obtain a level of success or fame; to succeed.","example":"He had finally arrived on Broadway."},{"definition":"To come; said of time.","example":"The time has arrived for us to depart."},{"definition":"To happen or occur."},{"definition":"To reach; to come to."},{"definition":"To bring to shore."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈɹaɪvɪŋ/"}]},{"word":"DECORATION","idx":10469,"count":4702490,"meanings":[{"definitions":[{"definition":"The act of adorning, embellishing, or honoring; ornamentation."},{"definition":"That which adorns, enriches, or beautifies; something added by way of embellishment; ornament."},{"definition":"Specifically, any mark of honor to be worn upon the person, as a medal, cross, or ribbon of an order of knighthood, bestowed for services in war, great achievements in literature, art, etc."},{"definition":"The use of exotic sugars as decoys to distract the immune system of a host"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"decoration-us","text":"/ˌdɛkəˈɹeɪʃən/"}]},{"word":"NATIONALS","idx":10470,"count":4701501,"meanings":[{"definitions":[{"definition":"A subject of a nation.","example":"The diplomats were advised not to interact with any foreign nationals except on official duty."},{"definition":"(usually in the plural) A tournament in which participants from all over the nation compete.","example":"After winning the regional tournament, the team advanced to the nationals."}],"partOfSpeech":"n"}]},{"word":"TROJAN","idx":10471,"count":4701127,"meanings":[{"definitions":[{"definition":"Malware that appears to perform or actually performs a desired task for a user while performing a harmful task without the user's knowledge or consent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To infect (a system) with a trojan."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Describing a satellite (moon or minor planet) that shares an orbit with another"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɹoʊdʒən/"},{"text":"/ˈtɹəʊdʒən/"}]},{"word":"ASSISTANTS","idx":10472,"count":4700926,"meanings":[{"definitions":[{"definition":"Someone who is present; a bystander, a witness."},{"definition":"A person who assists or helps someone else."},{"definition":"Sales assistant."},{"definition":"A software tool that provides assistance in some task, a wizard program."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"assistants-us"}]},{"word":"COUNSELOR","idx":10473,"count":4699959,"meanings":[{"definitions":[{"definition":"A professional who counsels people, especially on personal problems."},{"definition":"A school counselor, often in a specialty such as careers, education, or health."},{"definition":"An attorney."},{"definition":"A high ranking diplomat, usually just below an ambassador or minister."},{"definition":"A children’s supervisor, usually at camp."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"counselor-us","text":"/ˈkaʊnsələ(ɹ)/"}]},{"word":"SPINAL","idx":10474,"count":4699709,"meanings":[{"definitions":[{"definition":"A spinal anesthesia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to the spine."},{"definition":"(of a frog, or other experimental animal) Having a pithed brain, but an intact spinal cord."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/spaɪnəl/"}]},{"word":"ELIMINATED","idx":10476,"count":4696196,"meanings":[{"definitions":[{"definition":"To completely remove, get rid of, put an end to."},{"definition":"To kill (a person or animal).","example":"a ruthless mobster who eliminated his enemies"},{"definition":"To excrete (waste products)."},{"definition":"To exclude (from investigation or from further competition).","example":"Bill was eliminated as a suspect when the police interviewed witnesses."},{"definition":"To record amounts in a consolidation statement to remove the effects of inter-company transactions."}],"partOfSpeech":"ve"}]},{"word":"SOONER","idx":10478,"count":4695133,"meanings":[{"definitions":[{"definition":"Short in length of time from the present.","example":"I need the soonest date you have available."},{"definition":"Early"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Immediately, instantly."},{"definition":"Within a short time; quickly."},{"definition":"Early."},{"definition":"Readily; willingly; used with would, or some other word expressing will."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"sooner-us","text":"/ˈsunɚ/"}]},{"word":"STRUGGLING","idx":10479,"count":4694335,"meanings":[{"definitions":[{"definition":"To strive, to labour in difficulty, to fight (for or against), to contend.","example":"During the centuries, the people of Ireland struggled constantly to assert their right to govern themselves."},{"definition":"To strive, or to make efforts, with a twisting, or with contortions of the body.","example":"She struggled to escape from her assailant's grasp."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who struggles."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"struggling-us","text":"/ˈstɹʌɡlɪŋ/"},{"audio":"struggling-uk","text":"/ˈstɹʌɡlɪŋ/"}]},{"word":"ENACTED","idx":10480,"count":4693719,"meanings":[{"definitions":[{"definition":"To make (a bill) into law"},{"definition":"To act the part of; to play"},{"definition":"To do; to effect"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"enacted-us"}]},{"word":"WATERFRONT","idx":10481,"count":4693479,"meanings":[{"definitions":[{"definition":"The land alongside a body of water."},{"definition":"The dockland district of a town."}],"partOfSpeech":"n"}]},{"word":"TENURE","idx":10482,"count":4693409,"meanings":[{"definitions":[{"definition":"A status of possessing a thing or an office; an incumbency."},{"definition":"A period of time during which something is possessed."},{"definition":"A status of having a permanent post with enhanced job security within an academic institution."},{"definition":"A right to hold land under the feudal system."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grant tenure, the status of having a permanent academic position, to (someone)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tenure-uk","text":"/ˈtɛn.jə/"}]},{"word":"PLUSH","idx":10483,"count":4692870,"meanings":[{"definitions":[{"definition":"A textile fabric with a nap or shag on one side, longer and softer than the nap of velvet."},{"definition":"A plush toy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Very extravagant."},{"definition":"Very expensive, or appearing expensive.","example":"They lived in a plush apartment complex."},{"definition":"(of a man-made object) Having a soft, fluffy exterior.","example":"This plush toy is so cute and soft - I want it!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"plush-uk","text":"/plʌʃ/"}]},{"word":"WEBER","idx":10484,"count":4692730,"meanings":[{"definitions":[{"definition":"In the International System of Units, the derived unit of magnetic flux; the flux linking a circuit of one turn that produces an electromotive force of one volt when reduced uniformly to zero in one second. Symbol: Wb."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈveɪbɚ/"},{"text":"/ˈveɪbə/"}]},{"word":"DIAGNOSED","idx":10485,"count":4692575,"meanings":[{"definitions":[{"definition":"To determine which disease is causing a sick person's signs and symptoms; to find the diagnosis."},{"definition":"(by extension) To determine the cause of a problem."}],"partOfSpeech":"ve"}]},{"word":"BIOTECH","idx":10486,"count":4691289,"meanings":[{"definitions":[{"definition":"Biotechnology","example":"I'm planning to work in biotech after college."},{"definition":"A company specializing in biotechnology, or stock in such a company","example":"A lot of people invested in biotechs, back in the '90s."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to biotechnology"}],"partOfSpeech":"j"}]},{"word":"UNSTABLE","idx":10487,"count":4691072,"meanings":[{"definitions":[{"definition":"To release (an animal) from a stable."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a strong tendency to change."},{"definition":"Fluctuating; not constant."},{"definition":"Fickle."},{"definition":"Unpredictable."},{"definition":"Readily decomposable."},{"definition":"Radioactive, especially with a short half-life."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈsteɪbəɫ/"}]},{"word":"ELK","idx":10489,"count":4688629,"meanings":[{"definitions":[{"definition":"Any of various large species of deer such as the red deer, moose or wapiti (see usage notes)."},{"definition":"The European wild, whistling, or common swan (Cygnus cygnus, syn. Cygnus ferus)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"elk-us","text":"/ɛlk/"}]},{"word":"WOODLAND","idx":10490,"count":4688302,"meanings":[{"definitions":[{"definition":"Land covered with woody vegetation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a creature or object: growing, living, or existing in a woodland.","example":"The woodland creatures ran from the fire."},{"definition":"Having the character of a woodland."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"woodland-us","text":"/ˈwʊd.lənd/"}]},{"word":"NELLY","idx":10492,"count":4686900,"meanings":[{"definitions":[{"definition":"A person's life."},{"definition":"An effeminate homosexual man."},{"definition":"A silly person."},{"definition":"A giant petrel, Macronectes giganteus and Macronectes halli."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Unmanly; effeminate."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/nɛli/"},{"audio":"nelly-au"}]},{"word":"FULFILL","idx":10493,"count":4686761,"meanings":[{"definitions":[{"definition":"To satisfy, carry out, bring to completion (an obligation, a requirement, etc.).","example":"You made a promise, son, and now you must fulfill it."},{"definition":"To emotionally or artistically satisfy; to develop one's gifts to the fullest.","example":"This is the most fulfilling work I've ever done."},{"definition":"To obey, follow, comply with (a rule, requirement etc.).","example":"Unfortunately, you don't fulfill the criteria for extra grants at the present time."},{"definition":"To package, distribute, or ship goods."},{"definition":"To fill full; fill to the utmost capacity; fill up.","example":"My lady is positively fulfilled of grace."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fulfill-us","text":"/fəˈfɪl/"}]},{"word":"URGED","idx":10494,"count":4685830,"meanings":[{"definitions":[{"definition":"To press; to push; to drive; to impel; to force onward."},{"definition":"To press the mind or will of; to ply with motives, arguments, persuasion, or importunity."},{"definition":"To provoke; to exasperate."},{"definition":"To press hard upon; to follow closely."},{"definition":"To present in an urgent manner; to insist upon.","example":"to urge an argument; to urge the necessity of a case"},{"definition":"To treat with forcible means; to take severe or violent measures with.","example":"to urge an ore with intense heat"},{"definition":"To press onward or forward."},{"definition":"To be pressing in argument; to insist; to persist."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"urged-us","text":"/ɝdʒd/"}]},{"word":"REFLECTING","idx":10495,"count":4685463,"meanings":[{"definitions":[{"definition":"To bend back (light, etc.) from a surface.","example":"A mirror reflects the light that shines on it."},{"definition":"To be bent back (light, etc.) from a surface.","example":"The moonlight reflected from the surface of water."},{"definition":"To mirror, or show the image of something.","example":"The shop window reflected his image as he walked past."},{"definition":"To be mirrored.","example":"His image reflected from the shop window as he walked past."},{"definition":"To agree with; to closely follow.","example":"Entries in English dictionaries aim to reflect common usage."},{"definition":"To give evidence of someone's or something's character etc.","example":"The teacher's ability reflects well on the school."},{"definition":"To think seriously; to ponder or consider.","example":"People do that sort of thing every day, without ever stopping to reflect on the consequences."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An instance of reflection"}],"partOfSpeech":"n"},{"definitions":[{"definition":"That has been reflected (of light, sound etc.); undergoing reflection."},{"definition":"That reflects.","example":"a reflecting pool"},{"definition":"Having a component that reflects light.","example":"a reflecting telescope"},{"definition":"Given to introspection; thoughtful, reflective."},{"definition":"Insulting, disparaging."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈflɛktɪŋ/"}]},{"word":"UNSECURED","idx":10496,"count":4685442,"meanings":[{"definitions":[{"definition":"Not physically secured; not fastened; not attached."},{"definition":"Not made secure in any sense.","example":"an unsecured Internet connection"},{"definition":"Of a loan or guarantee, without collateral."}],"partOfSpeech":"j"}]},{"word":"GAINING","idx":10498,"count":4682505,"meanings":[{"definitions":[{"definition":"To acquire possession of.","example":"Looks like you've gained a new friend."},{"definition":"To have or receive advantage or profit; to acquire gain; to grow rich; to advance in interest, health, or happiness; to make progress.","example":"The sick man gains daily."},{"definition":"To come off winner or victor in; to be successful in; to obtain by competition.","example":"to gain a battle; to gain a case at law"},{"definition":"To increase."},{"definition":"To be more likely to catch or overtake an individual.","example":"I'm gaining (on you)."},{"definition":"To reach.","example":"to gain the top of a mountain"},{"definition":"To draw into any interest or party; to win to one's side; to conciliate."},{"definition":"To put on weight.","example":"I've been gaining."},{"definition":"(of a clock or watch) To run fast."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Gain; profit."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gaining-us","text":"/ˈɡeɪnɪŋ/"}]},{"word":"CIS","idx":10500,"count":4681533,"meanings":[{"definitions":[{"definition":"Having two mutations on two genes on the same chromosome of a homologous pair."},{"definition":"Of the side of the Golgi apparatus nearer to the endoplasmic reticulum."},{"definition":"In (or constituting, forming, or describing) a double bond in which the greater radical on both ends is on the same side of the bond."},{"definition":"Cisgender (or sometimes cissexual): not trans (transgender or transsexual) or non-binary."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/sɪs/"}]},{"word":"DEFINITIVE","idx":10501,"count":4680961,"meanings":[{"definitions":[{"definition":"(grammar) a word, such as a definite article or demonstrative pronoun, that defines or limits something"},{"definition":"An ordinary postage stamp that is part of a series of all denominations or is reprinted as needed to meet demand"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Explicitly defined"},{"definition":"Conclusive or decisive"},{"definition":"Definite, authoritative and complete"},{"definition":"Limiting; determining","example":"a definitive word"},{"definition":"General, not issued for commemorative purposes"},{"definition":"Determined; resolved."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈfɪn.ɪt.ɪv/"}]},{"word":"APPROPRIATELY","idx":10503,"count":4679967,"meanings":[{"definitions":[{"definition":"In an appropriate manner; properly; suitably."}],"partOfSpeech":"v"}]},{"word":"SHIFTS","idx":10504,"count":4678539,"meanings":[{"definitions":[{"definition":"A modifier key whose main function is shifting between two or more functions of any of certain other keys (usually by pressing Shift and the other button simultaneously)."},{"definition":"A type of women's undergarment, a slip.","example":"Just last week she bought a new shift at the market."},{"definition":"A change of workers, now specifically a set group of workers or period of working time.","example":"We'll work three shifts a day till the job's done."},{"definition":"An act of shifting; a slight movement or change.","example":"There was a shift in the political atmosphere."},{"definition":"The gear mechanism in a motor vehicle.","example":"Does it come with a stick-shift?"},{"definition":"A bit shift."},{"definition":"The infield shift.","example":"Teams often use the shift against this lefty."},{"definition":"(often with the definite article, usually uncountable) The act of kissing passionately."},{"definition":"A contrivance, a device to try when other methods fail."},{"definition":"A trick, an artifice."},{"definition":"The extent, or arrangement, of the overlapping of plank, brick, stones, etc., that are placed in courses so as to break joints."},{"definition":"A breaking off and dislocation of a seam; a fault."},{"definition":"A mutation in which the DNA or RNA from two different sources (such as viruses or bacteria) combine."},{"definition":"In violin-playing, any position of the left hand except that nearest the nut."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(sometimes figurative) To move from one place to another; to redistribute.","example":"We'll have to shift these boxes to the downtown office."},{"definition":"To change in form or character; swap."},{"definition":"To change position.","example":"His political stance shifted daily."},{"definition":"To change residence; to leave and live elsewhere.","example":"We are shifting to America next month."},{"definition":"To change (clothes, especially underwear)."},{"definition":"To change (someone's) clothes; sometimes specifically, to change underwear."},{"definition":"To change gears (in a car).","example":"I crested the hill and shifted into fifth."},{"definition":"(typewriters) To move the keys of a typewriter over in order to type capital letters and special characters."},{"definition":"(computer keyboards) To switch to a character entry mode for capital letters and special characters."},{"definition":"To manipulate a binary number by moving all of its digits left or right; compare rotate.","example":"Shifting 1001 to the left yields 10010; shifting it right yields 100."},{"definition":"To remove the first value from an array."},{"definition":"To dispose of.","example":"How can I shift a grass stain?"},{"definition":"To hurry.","example":"If you shift, you might make the 2:19."},{"definition":"To engage in sexual petting."},{"definition":"To resort to expedients for accomplishing a purpose; to contrive; to manage."},{"definition":"To practice indirect or evasive methods."},{"definition":"In violin-playing, to move the left hand from its original position next to the nut."}],"partOfSpeech":"ve"}]},{"word":"INACTIVE","idx":10505,"count":4677994,"meanings":[{"definitions":[{"definition":"Not active, temporarily or permanently.","example":"An inactive boy, he rarely exercised and preferred to stay indoors."},{"definition":"Not functioning or operating; broken down","example":"The photocopier is inactive pending repair."},{"definition":"Retired from duty or service.","example":"Admiral Jones is now on the inactive list."},{"definition":"Relatively inert.","example":"Aluminium is inactive towards water."},{"definition":"Showing no optical activity in polarized light.","example":"Synthetic glycine is optically inactive as it contains equal amounts of the d- and l- form."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"inactive-uk","text":"/ɪnˈæktɪv/"}]},{"word":"TRAVELED","idx":10507,"count":4677240,"meanings":[{"definitions":[{"definition":"To be on a journey, often for pleasure or business and with luggage; to go from one place to another."},{"definition":"To pass from here to there; to move or transmit; to go from one place to another.","example":"Soundwaves can travel through water."},{"definition":"To move illegally by walking or running without dribbling the ball."},{"definition":"To travel throughout (a place).","example":"I’ve travelled the world."},{"definition":"To force to journey."},{"definition":"To labour; to travail."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Frequented by travelers.","example":"We climbed up a well traveled path."},{"definition":"Experienced in travel.","example":"Our guide was a much traveled young man."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"traveled-us","text":"/ˈtɹævl̩d/"}]},{"word":"BARCODE","idx":10508,"count":4676162,"meanings":[{"definitions":[{"definition":"Any set of machine-readable parallel bars or concentric circles, varying in width, spacing, or height, encoding information according to a symbology"},{"definition":"A portion of a gene that identifies a particular species"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɑː(ɹ)kəʊd/"}]},{"word":"ADAPT","idx":10509,"count":4675567,"meanings":[{"definitions":[{"definition":"To make suitable; to make to correspond; to fit or suit"},{"definition":"To fit by alteration; to modify or remodel for a different purpose; to adjust","example":"to adapt a story for the stage"},{"definition":"To make by altering or fitting something else; to produce by change of form or character","example":"a word of an adapted form"},{"definition":"To make oneself comfortable to a new thing.","example":"They could not adapt to the new climate and so perished."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Adapted; fit; suited; suitable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"adapt-us","text":"/əˈdæpt/"}]},{"word":"EXTRACTED","idx":10510,"count":4674721,"meanings":[{"definitions":[{"definition":"To draw out; to pull out; to remove forcibly from a fixed position, as by traction or suction, etc.","example":"to extract a tooth from its socket, a stump from the earth, or a splinter from the finger"},{"definition":"To withdraw by expression, distillation, or other mechanical or chemical process. Compare abstract (transitive verb).","example":"to extract an essential oil from a plant"},{"definition":"To take by selection; to choose out; to cite or quote, as a passage from a book."},{"definition":"To select parts of a whole","example":"We need to try to extract the positives from the defeat."},{"definition":"To determine (a root of a number).","example":"Please extract the cube root of 27."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɛkˈstɹæktɪd/"}]},{"word":"ACCESSION","idx":10511,"count":4673797,"meanings":[{"definitions":[{"definition":"A coming to; the act of acceding and becoming joined","example":"a king's accession to a confederacy"},{"definition":"Increase by something added; that which is added; augmentation from without."},{"definition":"A mode of acquiring property, by which the owner of a corporeal substance which receives an addition by growth, or by labor, has a right to the part or thing added, or the improvement (provided the thing is not changed into a different species)."},{"definition":"The act by which one power becomes party to engagements already in force between other powers."},{"definition":"The act of coming to or reaching a throne, an office, or dignity."},{"definition":"The invasion, approach, or commencement of a disease; a fit or paroxysm."},{"definition":"Agreement."},{"definition":"Access; admittance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a record of (additions to a collection)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"accession-us","text":"/æk.ˈsɛ.ʃən/"}]},{"word":"XD","idx":10513,"count":4669137,"meanings":[{"definitions":[{"definition":"Of a declared dividend, belonging to the seller rather than the buyer."}],"partOfSpeech":"j"}]},{"word":"REGULATOR","idx":10514,"count":4668381,"meanings":[{"definitions":[{"definition":"A device that controls or limits something.","example":"The voltage regulator stopped working and the resulting overload destroyed the device."},{"definition":"A person or group that sets standards of practice, especially those established by law."},{"definition":"A very accurate clock, used by clockmakers to measure the timekeeping of each newly made clock."},{"definition":"A gene involved in controlling the expression of one or more other genes."},{"definition":"A device that controls the supply of steam to the cylinders of a steam locomotive."},{"definition":"A bulldozer (member of intimidating group of white US Southerners)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɛɡ.juː.leɪt.ə/"}]},{"word":"CARRIAGE","idx":10515,"count":4664470,"meanings":[{"definitions":[{"definition":"The act of conveying; carrying."},{"definition":"Means of conveyance."},{"definition":"A wheeled vehicle, generally drawn by horse power.","example":"The carriage ride was very romantic."},{"definition":"A rail car, especially one designed for the conveyance of passengers."},{"definition":"A manner of walking and moving in general; how one carries oneself, bearing, gait."},{"definition":"One's behaviour, or way of conducting oneself towards others."},{"definition":"The part of a typewriter supporting the paper."},{"definition":"A shopping cart."},{"definition":"A stroller; a baby carriage."},{"definition":"The charge made for conveying (especially in the phrases carriage forward, when the charge is to be paid by the receiver, and carriage paid)."},{"definition":"That which is carried, baggage"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"carriage-us","text":"/ˈkæɹɪdʒ/"}]},{"word":"THEREIN","idx":10516,"count":4663852,"meanings":[{"definitions":[{"definition":"(pronominal) in that; in him/her/it"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"therein-us","text":"/ˈðeəɹˈɪn/"}]},{"word":"TERMINATE","idx":10517,"count":4661569,"meanings":[{"definitions":[{"definition":"To end, especially in an incomplete state.","example":"to terminate a surface by a line"},{"definition":"To set or be a limit or boundary to."},{"definition":"To kill."},{"definition":"To end the employment contract of an employee; to fire, lay off."},{"definition":"Of a mode of transport, to end its journey; or of a railway line, to reach its terminus."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Terminated; limited; bounded; ended."},{"definition":"Having a definite and clear limit or boundary; having a determinate size, shape or magnitude.","example":"Mountains on the Moon cast shadows that are very dark, terminate and more distinct than those cast by mountains on the Earth."},{"definition":"Expressible in a finite number of terms; (of a decimal) not recurring or infinite.","example":"One third is a recurring decimal, but one half is a terminate decimal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"terminate-uk","text":"/ˈtɜːmɪneɪt/"}]},{"word":"REX","idx":10518,"count":4659516,"meanings":[{"definitions":[{"definition":"An animal which has a genetic recessive variation that causes the guard hairs to be very short or fully lacking."}],"partOfSpeech":"n"}]},{"word":"FUELS","idx":10519,"count":4657731,"meanings":[{"definitions":[{"definition":"Substance consumed to provide energy through combustion, or through chemical or nuclear reaction."},{"definition":"Substance that provides nourishment for a living organism; food."},{"definition":"Something that stimulates, encourages or maintains an action.","example":"His books were fuel for the revolution."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide with fuel."},{"definition":"To exacerbate, to cause to grow or become greater."}],"partOfSpeech":"ve"}]},{"word":"POSTCODE","idx":10521,"count":4656099,"meanings":[{"definitions":[{"definition":"A sequence of letters and numbers added to a postal address to aid the sorting and delivery of post / mail."},{"definition":"(by extension) The region denoted by a postcode."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a postcode to; to mark with a postcode."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpəʊs(t)kəʊd/"},{"audio":"postcode-au"}]},{"word":"TRADITIONALLY","idx":10522,"count":4654828,"meanings":[{"definitions":[{"definition":"In a traditional manner."},{"definition":"From the beginning."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"traditionally-us","text":"/tɹəˈdɪʃənli/"}]},{"word":"WITHDRAW","idx":10523,"count":4652948,"meanings":[{"definitions":[{"definition":"To pull (something) back, aside, or away."},{"definition":"To stop talking to, or interacting with, other people and start thinking thoughts that are not related to what is happening around."},{"definition":"To take back (a comment, etc); retract.","example":"to withdraw false charges"},{"definition":"To remove, to stop providing (one's support, etc); to take out of service."},{"definition":"To extract (money from an account)."},{"definition":"To retreat."},{"definition":"To be in withdrawal from an addictive drug etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"withdraw-us","text":"/wɪðˈdɹɔː/"}]},{"word":"SOY","idx":10524,"count":4652673,"meanings":[{"definitions":[{"definition":"A common East Asian liquid sauce, made by subjecting boiled beans to long fermentation and then long digestion in salt and water.","example":"I like a little soy with my rice."},{"definition":"Soybeans, or the protein derived from them.","example":"The soy crop is looking good this year."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"soy-us","text":"/sɔɪ/"}]},{"word":"ANCHORAGE","idx":10527,"count":4651277,"meanings":[{"definitions":[{"definition":"A harbor, river, or offshore area that can accommodate a ship at anchor, either for quarantine, queuing, or discharge.."},{"definition":"A fee charged for anchoring."},{"definition":"That into which something is anchored or fastened.","example":"the anchorages of the Brooklyn Bridge"},{"definition":"The surgical fixation of prolapsed organs."},{"definition":"The act of anchoring, or the condition of lying at anchor."},{"definition":"The set of anchors belonging to a ship."},{"definition":"The retreat of a hermit, or anchorite."},{"definition":"Something on which one may depend for security; ground of trust."}],"partOfSpeech":"n"}]},{"word":"LANDMARK","idx":10531,"count":4645821,"meanings":[{"definitions":[{"definition":"An object that marks the boundary of a piece of land (usually a stone, or a tree)."},{"definition":"A recognizable natural or man-made feature used for navigation."},{"definition":"A notable location with historical, cultural, or geographical significance."},{"definition":"A major event or discovery.","example":"a landmark paper in neurosurgery"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To officially designate a site or building as a landmark."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈlændmɑɹk/"},{"audio":"landmark-uk"}]},{"word":"GREENS","idx":10532,"count":4643986,"meanings":[{"definitions":[{"definition":"The colour of growing foliage, as well as other plant cells containing chlorophyll; the colour between yellow and blue in the visible spectrum; one of the primary additive colour for transmitted light; the colour obtained by subtracting red and blue from white light using cyan and yellow filters."},{"definition":"(sometimes capitalised) A member of a green party; an environmentalist."},{"definition":"A putting green, the part of a golf course near the hole."},{"definition":"(bowls) The surface upon which bowls is played."},{"definition":"One of the colour balls used in snooker, with a value of 3 points."},{"definition":"A public patch of land in the middle of a settlement."},{"definition":"A grassy plain; a piece of ground covered with verdant herbage."},{"definition":"(chiefly in plural) Fresh leaves or branches of trees or other plants; wreaths."},{"definition":"Any substance or pigment of a green colour."},{"definition":"Marijuana."},{"definition":"Money."},{"definition":"One of the three color charges for quarks."},{"definition":"Leaves and leaf-like parts of edible plants when eaten as vegetables or in salads."},{"definition":"Green vegetables; edible plants or plant parts that contain chlorophyll."},{"definition":"Leafy plants that are used for decoration."},{"definition":"The green uniform of the United States Marine Corps."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make (something) green, to turn (something) green."},{"definition":"To become or grow green in colour."},{"definition":"To add greenspaces to (a town, etc.)."},{"definition":"To become environmentally aware."},{"definition":"To make (something) environmentally friendly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"greens-us","text":"/ɡɹiːnz/"}]},{"word":"NEAT","idx":10533,"count":4643885,"meanings":[{"definitions":[{"definition":"An artificial intelligence researcher who believes that solutions should be elegant, clear and provably correct. Compare scruffy."},{"definition":"A bull or cow."},{"definition":"Cattle collectively."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Clean, tidy; free from dirt or impurities.","example":"My room is neat because I tidied it this morning.  She has very neat hair."},{"definition":"Free from contaminants; unadulterated, undiluted. Particularly of liquor and cocktails; see usage below.","example":"I like my whisky neat."},{"definition":"Conditions with a liquid reagent or gas performed with no standard solvent or cosolvent.","example":"The Arbuzov reaction is performed by adding the bromide to the phosphite, neat.  The molecular beam was neat acetylene."},{"definition":"With all deductions or allowances made; net."},{"definition":"Having a simple elegance or style; clean, trim, tidy, tasteful.","example":"The front room was neat and carefully arranged for the guests."},{"definition":"Well-executed or delivered; clever, skillful, precise.","example":"Having the two protagonists meet in the last act was a particularly neat touch."},{"definition":"Facile; missing complexity or details in the favor of convenience or simplicity.","example":"Courts should not reduce this case to a neat set of legal rules."},{"definition":"Good, excellent, desirable.","example":"Hey, neat convertible, man."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"neat-us","text":"/niːt/"}]},{"word":"NAMING","idx":10534,"count":4643682,"meanings":[{"definitions":[{"definition":"(ditransitive) To give a name to.","example":"One visitor named Hou Yugang said he was not too concerned about climate change and Baishui’s melting."},{"definition":"To mention, specify.","example":"He named his demands."},{"definition":"To identify as relevant or important","example":"naming the problem"},{"definition":"To publicly implicate.","example":"The painter was named as an accomplice."},{"definition":"To designate for a role.","example":"My neighbor was named to the steering committee."},{"definition":"(Westminster system politics) To initiate a process to temporarily remove a member of parliament who is breaking the rules of conduct."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of giving names to things."},{"definition":"A ritual or ceremony in which a person's name is given or announced."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Giving a name to a person or thing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈneɪmɪŋ/"}]},{"word":"STERN","idx":10535,"count":4643592,"meanings":[{"definitions":[{"definition":"Having a hardness and severity of nature or manner."},{"definition":"Grim and forbidding in appearance."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The rear part or after end of a ship or vessel."},{"definition":"The post of management or direction."},{"definition":"The hinder part of anything."},{"definition":"The tail of an animal; now used only of the tail of a dog."},{"definition":"A bird, the black tern."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"stern-us","text":"/stɝn/"}]},{"word":"LACROSSE","idx":10538,"count":4640046,"meanings":[{"definitions":[{"definition":"A sport played on a field between two opposing teams using sticks (crosses) and a ball, whereby one team defeats the other by achieving a higher score by scoring goals within the allotted time."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lacrosse-us","text":"/ləˈkɹɔs/"}]},{"word":"BUD","idx":10540,"count":4638865,"meanings":[{"definitions":[{"definition":"A newly sprouted leaf or blossom that has not yet unfolded.","example":"After a long, cold winter, the trees finally began to produce buds."},{"definition":"Something that has begun to develop.","example":"breast buds"},{"definition":"A small rounded body in the process of splitting from an organism, which may grow into a genetically identical new organism.","example":"In this slide, you can see a yeast cell forming buds."},{"definition":"(usually uncountable) Potent cannabis taken from the flowering part of the plant (the “bud”), or marijuana generally.","example":"Hey bro, want to smoke some bud?"},{"definition":"A weaned calf in its first year, so called because the horns are then beginning to bud."},{"definition":"(term of endearment) A pretty young girl."},{"definition":"Buddy, friend.","example":"I like to hang out with my buds on Saturday night."},{"definition":"Used to address a male"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form buds.","example":"The trees are finally starting to bud."},{"definition":"To reproduce by splitting off buds.","example":"Yeast reproduces by budding."},{"definition":"To begin to grow, or to issue from a stock in the manner of a bud, as a horn."},{"definition":"To be like a bud in respect to youth and freshness, or growth and promise."},{"definition":"To put forth as a bud."},{"definition":"To graft by inserting a bud under the bark of another tree."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bud-us","text":"/bʌd/"}]},{"word":"SLAVES","idx":10541,"count":4638584,"meanings":[{"definitions":[{"definition":"A person who is held in servitude as the property of another person, and whose labor (and often also whose body and life) is subject to the owner's volition and control."},{"definition":"A drudge; one who labors or is obliged (e.g. by prior contract) to labor like a slave with limited rights, e.g. an indentured servant."},{"definition":"An abject person."},{"definition":"One who has no power of resistance (to something), one who surrenders to or is under the domination (of something).","example":"a slave to passion, to strong drink, or to ambition"},{"definition":"(BDSM) A submissive partner in a BDSM relationship who (consensually) submits to (sexually and/or personally) serving one or more masters or mistresses."},{"definition":"A sex slave, a person who is forced against their will to perform, for another person or group, sexual acts on a regular or continuing basis."},{"definition":"A device (such as a secondary flash or hard drive) that is subject to the control of another (a master)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To work as a slaver, to enslave people."},{"definition":"To work hard.","example":"I was slaving all day over a hot stove."},{"definition":"To place a device under the control of another.","example":"to slave a hard disk"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slaves-us","text":"/sleɪvz/"}]},{"word":"DENTIST","idx":10542,"count":4638330,"meanings":[{"definitions":[{"definition":"A medical doctor who specializes in dentistry."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dentist-us"},{"text":"/ˈdɛntɪst/"}]},{"word":"UTILIZING","idx":10543,"count":4637939,"meanings":[{"definitions":[{"definition":"To make use of; to use."},{"definition":"To make useful; to find a practical use for."},{"definition":"To make best use of; to use to its fullest extent, potential, or ability."},{"definition":"To make do with; to use in manner different from that originally intended"}],"partOfSpeech":"ve"}]},{"word":"CRAFTED","idx":10545,"count":4637231,"meanings":[{"definitions":[{"definition":"To make by hand and with much skill."},{"definition":"To construct, develop something (like a skilled craftsman).","example":"state crafting; the process of crafting global policing"},{"definition":"To combine multiple items to form a new item, such as armour or medicine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Manufactured","example":"The well-crafted table lasted for many years of use and abuse."}],"partOfSpeech":"j"}]},{"word":"BBQ","idx":10548,"count":4636060,"meanings":[{"definitions":[{"definition":"Barbecue"}],"partOfSpeech":"n"}]},{"word":"TUTOR","idx":10549,"count":4635949,"meanings":[{"definitions":[{"definition":"One who teaches another (usually called a student, learner, or tutee) in a one-on-one or small-group interaction.","example":"He passed the difficult class with help from his tutor."},{"definition":"A university officer responsible for students in a particular hall."},{"definition":"One who has the charge of a child or pupil and his estate; a guardian."},{"definition":"(trading card games) A card that allows you to search your deck for one or more other cards."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To instruct or teach, especially an individual or small group.","example":"To help pay her tuition, the college student began to tutor high school students in calculus and physics."},{"definition":"To treat with authority or sternness."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tutor-us","text":"/ˈtutɚ/"},{"audio":"tutor-uk","text":"/ˈtjuːtə/"}]},{"word":"IDIOT","idx":10550,"count":4635830,"meanings":[{"definitions":[{"definition":"A person of low general intelligence."},{"definition":"A person who makes stupid decisions; a fool."},{"definition":"A person of the lowest intellectual standing, a person who lacks the capacity to develop beyond the mental age of a normal four-year-old; a person with an IQ below 30."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Idiotic, stupid"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"idiot-us","text":"/ˈɪd.i.(j)ɪt/"}]},{"word":"COMPRISED","idx":10551,"count":4635211,"meanings":[{"definitions":[{"definition":"To be made up of; to consist of (especially a comprehensive list of parts).","example":"The parts are comprised by the whole."},{"definition":"To contain or embrace.","example":"Our committee comprises a president, secretary, treasurer and five other members."},{"definition":"(sometimes proscribed, usually in the passive) To compose, to constitute. See usage note below.","example":"A team is comprised of its members."},{"definition":"To include, contain, or be made up of, defining the minimum elements, whether essential or inessential, to define an invention. (\"Open-ended\", doesn't limit to the items listed; cf. compose, which is \"closed\" and limits to the items listed.)"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəmˈpɹaɪzd/"}]},{"word":"CHARITIES","idx":10553,"count":4634152,"meanings":[{"definitions":[{"definition":"An organization, the objective of which is to carry out a charitable purpose."},{"definition":"The goods or money given to those in need."},{"definition":"Benevolence to others less fortunate than ourselves; the providing of goods or money to those in need."},{"definition":"In general, an attitude of kindness and understanding towards others, now especially suggesting generosity."},{"definition":"Christian love; representing God's love of man, man's love of God, or man's love of his fellow-men."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"charities-us","text":"/ˈtʃɛɹətiz/"}]},{"word":"MICKEY","idx":10554,"count":4634100,"meanings":[{"definitions":[{"definition":"A small bottle of liquor, holding 375 ml or 13 oz., typically shaped to fit in one's pocket."},{"definition":"A Mickey Finn; a beverage, usually alcoholic, that has been drugged."},{"definition":"American depression era term for a potato as in a \"roasted mickey\"."},{"definition":"The penis."},{"definition":"The vagina."},{"definition":"A well-known honeyeater, the Noisy Miner, Manorina melanocephala, of eastern Australia."},{"definition":"(rural Australia) A young bull, especially one that is unbranded and running wild."},{"definition":"Piss, shortened and more commonly used form of Mickey Bliss."},{"definition":"The resolution of a mouse, used as a unit of length."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To secretly slip drugs into somebody's drink."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmɪki/"},{"audio":"mickey-ca"}]},{"word":"DEBIT","idx":10556,"count":4633794,"meanings":[{"definitions":[{"definition":"In bookkeeping, an entry in the left hand column of an account.","example":"A cash sale is recorded as debit on the cash account and as credit on the sales account."},{"definition":"A sum of money taken out of a bank account. Thus called, because in bank's bookkeeping a cash withdrawal diminishes the amount of money held on the account, i.e. bank's debt to the customer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make an entry on the debit side of an account."},{"definition":"To record a receivable in the bookkeeping.","example":"We shall debit the amount of your purchase to your account."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to process of taking money from an account"},{"definition":"Of or relating to the debit card function of a debit card rather than its often available credit card function"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"debit-us","text":"/ˈdɛb.ɪt/"}]},{"word":"ALIENS","idx":10558,"count":4632962,"meanings":[{"definitions":[{"definition":"Any life form of extraterrestrial or extradimensional origin."},{"definition":"A person, animal, plant, or other thing which is from outside the family, group, organization, or territory under consideration."},{"definition":"A foreigner residing in a country."},{"definition":"One excluded from certain privileges; one alienated or estranged."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To estrange; to alienate."},{"definition":"To transfer the ownership of something."}],"partOfSpeech":"ve"}]},{"word":"DOMINO","idx":10559,"count":4631579,"meanings":[{"definitions":[{"definition":"A tile divided into two squares, each having 0 to 6 (or sometimes more) dots or pips (as in dice), used in the game of dominoes."},{"definition":"A country that is expected to react to events in a neighboring country, according to the domino effect."},{"definition":"A masquerade costume consisting of a hooded robe and a mask covering the upper part of the face."},{"definition":"The mask itself."},{"definition":"The person wearing the costume."},{"definition":"A polyomino made up of two squares."},{"definition":"A mistake in performing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To collapse in the manner of dominoes."},{"definition":"To cause to collapse in the manner of dominoes."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdɑmɪnoʊ/"},{"text":"/ˈdɒmɪnəʊ/"}]},{"word":"EDITS","idx":10561,"count":4631228,"meanings":[{"definitions":[{"definition":"A change to the text of a document."},{"definition":"A change in the text of a file, a website or the code of software."},{"definition":"An interruption or change to an improvised scene."},{"definition":"An alteration to the DNA sequence of a chromosome; an act of gene splicing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To change a text, or a document."},{"definition":"To be the editor of a publication.","example":"He edits the Chronicle."},{"definition":"To change the contents of a file, website, etc.","example":"Wikipedia is an interactive encyclopedia which allows anybody to edit and improve articles."},{"definition":"To alter the DNA sequence of a chromosome; to perform gene splicing."},{"definition":"To alter a film by cutting and splicing frames."},{"definition":"To cut short or otherwise alter an improvised scene."},{"definition":"To lend itself to editing in a certain way."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɛdɪts/"}]},{"word":"UNWANTED","idx":10562,"count":4630797,"meanings":[{"definitions":[{"definition":"One who or that which is not wanted; an undesirable."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not wanted; unwelcome."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈwɒntɪd/"}]},{"word":"RAVEN","idx":10563,"count":4630541,"meanings":[{"definitions":[{"definition":"Any of several, generally large and lustrous black species of birds in the genus Corvus, especially the common raven, Corvus corax."},{"definition":"A jet-black colour."},{"definition":"Rapine; rapacity."},{"definition":"Prey; plunder; food obtained by violence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of the color of the raven; jet-black","example":"She was a tall, sophisticated, raven-haired beauty."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To obtain or seize by violence."},{"definition":"To devour with great eagerness."},{"definition":"To prey on with rapacity."},{"definition":"To show rapacity; to be greedy (for something)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"raven-1-us","text":"/ˈɹeɪvən/"}]},{"word":"DEFEATED","idx":10564,"count":4629690,"meanings":[{"definitions":[{"definition":"To overcome in battle or contest.","example":"Wellington defeated Napoleon at Waterloo."},{"definition":"To reduce, to nothing, the strength of."},{"definition":"To nullify"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Subjugated, beaten, overcome."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"defeated-us"},{"text":"/dɪˈfiːtəd/"}]},{"word":"STRAINS","idx":10565,"count":4629474,"meanings":[{"definitions":[{"definition":"Treasure."},{"definition":"The blood-vessel in the yolk of an egg."},{"definition":"Race; lineage, pedigree."},{"definition":"Hereditary character, quality, or disposition.","example":"There is a strain of madness in her family."},{"definition":"A tendency or disposition."},{"definition":"Any sustained note or movement; a song; a distinct portion of an ode or other poem; also, the pervading note, or burden, of a song, poem, oration, book, etc.; theme; motive; manner; style"},{"definition":"A particular breed or race of animal, microbe etc.","example":"They say this year's flu virus is a particularly virulent strain."},{"definition":"A portion of music divided off by a double bar; a complete musical period or sentence; a movement, or any rounded subdivision of a movement."},{"definition":"A kind or sort (of person etc.)."},{"definition":"Language that is eloquent, poetic, or otherwise heightened."},{"definition":"The act of straining, or the state of being strained."},{"definition":"A violent effort; an excessive and hurtful exertion or tension, as of the muscles.","example":"he jumped up with a strain;   the strain upon the sailboat's rigging"},{"definition":"An injury resulting from violent effort; a sprain."},{"definition":"A dimensionless measure of object deformation either referring to engineering strain or true strain."},{"definition":"The track of a deer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hold tightly, to clasp."},{"definition":"To apply a force or forces to by stretching out.","example":"Relations between the United States and Guatemala traditionally have been close, although at times strained by human rights and civil/military issues."},{"definition":"To damage by drawing, stretching, or the exertion of force.","example":"The gale strained the timbers of the ship."},{"definition":"To act upon, in any way, so as to cause change of form or volume, as when bending a beam."},{"definition":"To exert or struggle (to do something), especially to stretch (one's senses, faculties etc.) beyond what is normal or comfortable.","example":"Sitting in back, I strained to hear the speaker."},{"definition":"To stretch beyond its proper limit; to do violence to, in terms of intent or meaning.","example":"to strain the law in order to convict an accused person"},{"definition":"To separate solid from liquid by passing through a strainer or colander"},{"definition":"To percolate; to be filtered.","example":"water straining through a sandy soil"},{"definition":"To make uneasy or unnatural; to produce with apparent effort; to force; to constrain."},{"definition":"To urge with importunity; to press.","example":"to strain a petition or invitation"},{"definition":"Hug somebody; to hold somebody tightly."},{"definition":"To beget, generate (of light), engender, copulate (both of animals and humans), lie with, be born, come into the world.","example":"A man straineth, liveth, then dieth."}],"partOfSpeech":"ve"}]},{"word":"DWELLING","idx":10566,"count":4629441,"meanings":[{"definitions":[{"definition":"A house or place in which a person lives; a habitation, a home.","example":"The old house served as a dwelling for Albert."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To live; to reside."},{"definition":"To linger (on) a particular thought, idea etc.; to remain fixated (on)."},{"definition":"To be in a given state."},{"definition":"To abide; to remain; to continue."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dwelling-us","text":"/ˈdwɛ.lɪŋ/"}]},{"word":"SLICE","idx":10567,"count":4628779,"meanings":[{"definitions":[{"definition":"That which is thin and broad."},{"definition":"A thin, broad piece cut off.","example":"Jim was munching on a slice of toast."},{"definition":"An amount of anything."},{"definition":"A piece of pizza."},{"definition":"A snack consisting of pastry with savoury filling.","example":"I bought a ham and cheese slice at the service station."},{"definition":"A broad, thin piece of plaster."},{"definition":"A knife with a thin, broad blade for taking up or serving fish; also, a spatula for spreading anything, as paint or ink."},{"definition":"A salver, platter, or tray."},{"definition":"A plate of iron with a handle, forming a kind of chisel, or a spadelike implement, variously proportioned, and used for various purposes, as for stripping the planking from a vessel's side, for cutting blubber from a whale, or for stirring a fire of coals; a slice bar; a peel; a fire shovel."},{"definition":"One of the wedges by which the cradle and the ship are lifted clear of the building blocks to prepare for launching."},{"definition":"A removable sliding bottom to a galley."},{"definition":"A shot that (for the right-handed player) curves unintentionally to the right. See fade, hook, draw"},{"definition":"Any of a class of heavy cakes or desserts made in a tray and cut out into squarish slices."},{"definition":"A section of image taken of an internal organ using MRI (magnetic resonance imaging), CT (computed tomography), or various forms of x-ray."},{"definition":"A hawk's or falcon's dropping which squirts at an angle other than vertical. (See mute.)"},{"definition":"A contiguous portion of an array."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut into slices.","example":"Slice the cheese thinly."},{"definition":"To cut with an edge utilizing a drawing motion.","example":"The knife left sliced his arm."},{"definition":"To clear (e.g. a fire, or the grate bars of a furnace) by means of a slice bar."},{"definition":"To hit the shuttlecock with the racket at an angle, causing it to move sideways and downwards."},{"definition":"To hit a shot that slices (travels from left to right for a right-handed player)."},{"definition":"To angle the blade so that it goes too deeply into the water when starting to take a stroke."},{"definition":"To kick the ball so that it goes in an unintended direction, at too great an angle or too high."},{"definition":"To hit the ball with a stroke that causes a spin, resulting in the ball swerving or staying low after a bounce."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having the properties of a slice knot."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"slice-us","text":"/slaɪs/"},{"audio":"slice-au","text":"/slaɪs/"}]},{"word":"TANNING","idx":10569,"count":4627015,"meanings":[{"definitions":[{"definition":"To change to a tan colour due to exposure to the sun.","example":"No matter how long I stay out in the sun, I never tan. though I do burn."},{"definition":"To change an animal hide into leather by soaking it in tannic acid. To work as a tanner."},{"definition":"To spank or beat."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of making leather, which does not easily decompose, from the skins of animals, which do."},{"definition":"The acquisition of a tan, either by exposure to the sun, or artificially."},{"definition":"A spanking."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtænɪŋ/"}]},{"word":"BN","idx":10570,"count":4626556,"meanings":[{"definitions":[{"definition":"(modern British & Australian, short scale) a thousand million (logic: 1,000 × 1,000^2): 1 followed by nine zeros, 109; a milliard"},{"definition":"(British & Australian, long scale) A million million (logic: 1,000,000^2): a 1 followed by twelve zeros; 1012"},{"definition":"An unspecified very large number.","example":"There were billions of people at the concert."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Utterly new, as new as possible."}],"partOfSpeech":"j"}]},{"word":"ASPEN","idx":10572,"count":4626441,"meanings":[{"definitions":[{"definition":"Pertaining to the asp or aspen tree."},{"definition":"Tremulous, trembling."},{"definition":"Of a woman's tongue: wagging, gossiping."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The asp tree; a kind of poplar tree (genus Populus sect. Populus). A medium-size tree with thin, straight trunks of a greenish-white color.","example":"Above a certain elevation, the aspens gave way to scrubby, gnarled pines."},{"definition":"The wood of such a tree; usually pale, lightweight and soft.","example":"She claimed that aspen was the only \"proper\" material from which make a wicker basket."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæspən/"}]},{"word":"LACKING","idx":10573,"count":4626224,"meanings":[{"definitions":[{"definition":"To be without, to need, to require.","example":"My life lacks excitement."},{"definition":"To be short (of or for something).","example":"He'll never lack for company while he's got all that money."},{"definition":"To be in want."},{"definition":"To see the deficiency in (someone or something); to find fault with, to malign, reproach."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The absence of something; a lack."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Missing or not having enough of (a good quality, etc).","example":"This cheese is lacking in pungency."},{"definition":"Not carrying a firearm.","example":"Are you packing or lacking?"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lacking-us","text":"/ˈlækɪŋ/"}]},{"word":"SYMBOLIC","idx":10574,"count":4625574,"meanings":[{"definitions":[{"definition":"Pertaining to a symbol."},{"definition":"Implicitly representing or referring to another thing.","example":"a symbolic gesture"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"symbolic-us"}]},{"word":"OBJECTIONABLE","idx":10577,"count":4624110,"meanings":[{"definitions":[{"definition":"Arousing disapproval; worthy of objection; offensive.","example":"Before removing objectionable material, you'll have to decide what will offend people."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"objectionable-us"}]},{"word":"ANGLES","idx":10578,"count":4623376,"meanings":[{"definitions":[{"definition":"A figure formed by two rays which start from a common point (a plane angle) or by three planes that intersect (a solid angle).","example":"the angle between lines A and B"},{"definition":"The measure of such a figure. In the case of a plane angle, this is the ratio (or proportional to the ratio) of the arc length to the radius of a section of a circle cut by the two rays, centered at their common point. In the case of a solid angle, this is the ratio of the surface area to the square of the radius of the section of a sphere.","example":"The angle between lines A and B is π/4 radians, or 45 degrees."},{"definition":"A corner where two walls intersect.","example":"an angle of a building"},{"definition":"A change in direction.","example":"The horse took off at an angle."},{"definition":"A viewpoint; a way of looking at something."},{"definition":"The focus of a news story."},{"definition":"Any of various hesperiid butterflies."},{"definition":"A storyline between two wrestlers, providing the background for and approach to a feud."},{"definition":"An ulterior motive; a scheme or means of benefitting from a situation, usually hidden, often immoral","example":"His angle is that he gets a percentage, but mostly in trade."},{"definition":"A projecting or sharp corner; an angular fragment."},{"definition":"Any of the four cardinal points of an astrological chart: the Ascendant, the Midheaven, the Descendant and the Imum Coeli."},{"definition":"A fishhook; tackle for catching fish, consisting of a line, hook, and bait, with or without a rod."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(often in the passive) To place (something) at an angle.","example":"The roof is angled at 15 degrees."},{"definition":"To change direction rapidly.","example":"The five ball angled off the nine ball but failed to reach the pocket."},{"definition":"To present or argue something in a particular way or from a particular viewpoint.","example":"How do you want to angle this when we talk to the client?"},{"definition":"(cue sports) To hamper (oneself or one's opponent) by leaving the cue ball in the jaws of a pocket such that the surround of the pocket (the \"angle\") blocks the path from cue ball to object ball."},{"definition":"To try to catch fish with a hook and line."},{"definition":"(with for) To attempt to subtly persuade someone to offer a desired thing.","example":"He must be angling for a pay rise."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"angles-us"}]},{"word":"LEMMA","idx":10579,"count":4623172,"meanings":[{"definitions":[{"definition":"A proposition proved or accepted for immediate use in the proof of some other proposition."},{"definition":"The canonical form of an inflected word; i.e., the form usually found as the headword in a dictionary, such as the nominative singular of a noun, the bare infinitive of a verb, etc."},{"definition":"(psycholinguistics) The theoretical abstract conceptual form of a word, representing a specific meaning, before the creation of a specific phonological form as the sounds of a lexeme, which may find representation in a specific written form as a dictionary or lexicographic word."},{"definition":"The outer shell of a fruit or similar body."},{"definition":"One of the specialized bracts around the floret in grasses."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɛmə/"}]},{"word":"PRESSURES","idx":10581,"count":4622535,"meanings":[{"definitions":[{"definition":"A pressing; a force applied to a surface.","example":"Apply pressure to the wound to stop the bleeding."},{"definition":"A contrasting force or impulse of any kind","example":"the pressure of poverty; the pressure of taxes; the pressure of motives on the mind; the pressure of civilization."},{"definition":"Distress.","example":"She has felt pressure lately because her boss expects her to get the job done by the first."},{"definition":"Urgency","example":"the pressure of business"},{"definition":"Impression; stamp; character impressed."},{"definition":"The amount of force that is applied over a given area divided by the size of this area."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To encourage or heavily exert force or influence.","example":"Do not let anyone pressure you into buying something you do not want."}],"partOfSpeech":"ve"}]},{"word":"SENSING","idx":10583,"count":4619533,"meanings":[{"definitions":[{"definition":"To use biological senses: to either see, hear, smell, taste, or feel."},{"definition":"To instinctively be aware.","example":"She immediately sensed her disdain."},{"definition":"To comprehend."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of sensation."}],"partOfSpeech":"n"}]},{"word":"MEDIATION","idx":10584,"count":4618800,"meanings":[{"definitions":[{"definition":"Negotiation to resolve differences conducted by some impartial party."},{"definition":"The act of intervening for the purpose of bringing about a settlement."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/midiˈeɪʃən/"}]},{"word":"BUMP","idx":10587,"count":4618593,"meanings":[{"definitions":[{"definition":"A light blow or jolting collision."},{"definition":"The sound of such a collision."},{"definition":"A protuberance on a level surface."},{"definition":"A swelling on the skin caused by illness or injury."},{"definition":"One of the protuberances on the cranium which, in phrenology, are associated with distinct faculties or affections of the mind. Also (metonymically) the faculty itself","example":"the bump of veneration; the bump of acquisitiveness"},{"definition":"The point, in a race in which boats are spaced apart at the start, at which a boat begins to overtake the boat ahead."},{"definition":"The swollen abdomen of a pregnant woman."},{"definition":"A post in an Internet forum thread made in order to raise the thread's profile by returning it to the top of the list of active threads."},{"definition":"A temporary increase in a quantity, as shown in a graph.","example":"US presidential nominees get a post-convention bump in survey ratings."},{"definition":"A dose of a drug such as ketamine or cocaine, when snorted recreationally."},{"definition":"The noise made by the bittern; a boom."},{"definition":"(preceded by definite article) A disco dance in which partners rhythmically bump each other's hips together."},{"definition":"In skipping, a single jump over two consecutive turns of the rope."},{"definition":"A coarse cotton fabric."},{"definition":"A training match for a fighting dog."},{"definition":"The jaw of either of the middle pockets."},{"definition":"Music, especially played over speakers at loud volume with strong bass frequency response."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To knock against or run into with a jolt."},{"definition":"To move up or down by a step; displace.","example":"I bumped the font size up to make my document easier to read."},{"definition":"To post in an Internet forum thread in order to raise the thread's profile by returning it to the top of the list of active threads."},{"definition":"(of a superheated liquid) To suddenly boil, causing movement of the vessel and loss of liquid."},{"definition":"To move (a booked passenger) to a later flight because of earlier delays or cancellations."},{"definition":"To move the time of (a scheduled event)."},{"definition":"To pick (a lock) with a repeated striking motion that dislodges the pins."},{"definition":"To make a loud, heavy, or hollow noise; to boom."},{"definition":"To spread out material so as to fill any desired number of pages."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bump-au","text":"/bʌmp/"}]},{"word":"COWBOYS","idx":10588,"count":4617968,"meanings":[{"definitions":[{"definition":"A man who tends free-range cattle, especially in the American West."},{"definition":"A man who identifies with cowboy culture, including wearing a cowboy hat and being a fan of country and western music."},{"definition":"A person who engages in reckless behavior, especially for the purpose of showing off."},{"definition":"A dishonest and/or incompetent independent tradesman."},{"definition":"A playing card of king rank."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To work as a cowboy, herding cattle."}],"partOfSpeech":"ve"}]},{"word":"FLAMES","idx":10589,"count":4617157,"meanings":[{"definitions":[{"definition":"The visible part of fire; a stream of burning vapour or gas, emitting light and heat."},{"definition":"A romantic partner or lover in a usually short-lived but passionate affair."},{"definition":"Intentionally insulting criticism or remark meant to incite anger."},{"definition":"A brilliant reddish orange-gold fiery colour."},{"definition":"The contrasting light and dark figure seen in wood used for stringed instrument making; the curl.","example":"The cello has a two-piece back with a beautiful narrow flame."},{"definition":"Burning zeal, passion, imagination, excitement, or anger."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce flames; to burn with a flame or blaze."},{"definition":"To burst forth like flame; to break out in violence of passion; to be kindled with zeal or ardour."},{"definition":"To post a destructively critical or abusive message (to somebody).","example":"I flamed him for spamming in my favourite newsgroup."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"flames-us","text":"/fleɪmz/"}]},{"word":"PRIMITIVE","idx":10590,"count":4616188,"meanings":[{"definitions":[{"definition":"An original or primary word; a word not derived from another, as opposed to derivative."},{"definition":"A member of a primitive society."},{"definition":"A simple-minded person."},{"definition":"A data type that is built into the programming language, as opposed to more complex structures."},{"definition":"Any of the simplest elements (instructions, statements, etc.) available in a programming language."},{"definition":"A basic geometric shape from which more complex shapes can be constructed."},{"definition":"A function whose derivative is a given function; an antiderivative."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the beginning or origin, or to early times; original; primordial; primeval; first.","example":"primitive innocence;   the primitive church"},{"definition":"Of or pertaining to or harking back to a former time; old-fashioned; characterized by simplicity.","example":"a primitive style of dress"},{"definition":"Crude, obsolete.","example":"primitive ideas"},{"definition":"(grammar) Original; primary; radical; not derived.","example":"a primitive verb"},{"definition":"Occurring in or characteristic of an early stage of development or evolution."},{"definition":"Not derived from another of the same type"},{"definition":"Most recent common ancestor (often hypothetical) of"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"primitive-us","text":"/ˈpɹɪmɪtɪv/"}]},{"word":"KBPS","idx":10591,"count":4615928,"meanings":[{"definitions":[{"definition":"Initialism of kilobits per second."}],"partOfSpeech":"n"}]},{"word":"STOCKING","idx":10594,"count":4613692,"meanings":[{"definitions":[{"definition":"A soft garment, usually knit or woven, worn on the foot and lower leg under shoes or other footwear.","example":"a pair of stockings"},{"definition":"A broad ring of a different fur colour on the lower part of the leg of a quadruped."},{"definition":"A knitted hood of cotton thread which is eventually converted by a special process into an incandescent mantle for gas lighting."},{"definition":"A ratio of the actual density of trees in an area to the ideal density that would make the fullest use of the land."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have on hand for sale.","example":"The store stocks all kinds of dried vegetables."},{"definition":"To provide with material requisites; to store; to fill; to supply.","example":"to stock a farm, i.e. to supply it with cattle and tools"},{"definition":"To allow (cows) to retain milk for twenty-four hours or more prior to sale."},{"definition":"To put in the stocks as punishment."},{"definition":"To fit (an anchor) with a stock, or to fasten the stock firmly in place."},{"definition":"To arrange cards in a certain manner for cheating purposes; to stack the deck."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stocking-us","text":"/ˈstɑkɪŋ/"}]},{"word":"ESP","idx":10595,"count":4612780,"meanings":[{"definitions":[{"definition":"(manner) In a special manner; specially."},{"definition":"(focus) Particularly; to a greater extent than is normal."},{"definition":"(focus) Used to place greater emphasis upon someone or something.","example":"Invite them all, especially Molly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"esp-us"}]},{"word":"BALLOONS","idx":10597,"count":4611796,"meanings":[{"definitions":[{"definition":"An inflatable buoyant object, often (but not necessarily) round and flexible."},{"definition":"Such an object as a child’s toy or party decoration."},{"definition":"Such an object designed to transport people through the air."},{"definition":"A sac inserted into part of the body for therapeutic reasons; such as angioplasty."},{"definition":"A speech bubble."},{"definition":"A type of glass cup, sometimes used for brandy."},{"definition":"A ball or globe on the top of a pillar, church, etc.","example":"the balloon of St. Paul's Cathedral in London"},{"definition":"A round vessel, usually with a short neck, to hold or receive whatever is distilled; a glass vessel of a spherical form."},{"definition":"A bomb or shell."},{"definition":"A game played with a large inflated ball."},{"definition":"(engraving) The outline enclosing words represented as coming from the mouth of a pictured figure."},{"definition":"A woman's breast."},{"definition":"A small container for illicit drugs made from a condom or the finger of a latex glove, etc."},{"definition":"An unusually large payment due at the end of the term of a loan agreement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To increase or expand rapidly.","example":"His stomach ballooned from eating such a large meal."},{"definition":"To go up or voyage in a balloon."},{"definition":"To take up in, or as if in, a balloon."},{"definition":"To inflate like a balloon."},{"definition":"To strike (a ball) so that it flies high in the air."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bəˈluːnz/"}]},{"word":"ECOSYSTEM","idx":10598,"count":4610884,"meanings":[{"definitions":[{"definition":"A system formed by an ecological community and its environment that functions as a unit."},{"definition":"The interconnectedness of organisms (plants, animals, microbes) with each other and their environment."},{"definition":"A set of interconnected products and services."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈikoʊˌsɪstəm/"},{"text":"/ˈiːkəʊˌsɪstəm/"}]},{"word":"DASHBOARD","idx":10600,"count":4610006,"meanings":[{"definitions":[{"definition":"A panel under the windscreen of a motor car or aircraft, containing indicator dials, compartments, and sometimes controls."},{"definition":"An upturned screen of wood or leather placed on the front of a horse-drawn carriage, sleigh or other vehicle that protected the driver from mud, debris, water and snow thrown up by the horse's hooves."},{"definition":"A graphical user interface in the form of or resembling a motor car dashboard.","example":"Log in to the dashboard to change your account settings."},{"definition":"The float of a paddle wheel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To organize in a dashboard format.","example":"Dashboarding your work can enhance productivity."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdæʃˌboəɹd/"},{"text":"/ˈdæʃˌbɔː(ɹ)d/"}]},{"word":"HALLS","idx":10607,"count":4607236,"meanings":[{"definitions":[{"definition":"A corridor; a hallway.","example":"The drinking fountain was out in the hall."},{"definition":"A meeting room.","example":"The hotel had three halls for conferences, and two were in use by the convention."},{"definition":"A manor house (originally because a magistrate's court was held in the hall of his mansion).","example":"The duke lived in a great hall overlooking the sea."},{"definition":"A building providing student accommodation at a university.","example":"The student government hosted several social events so that students from different halls would intermingle."},{"definition":"The principal room of a secular medieval building."},{"definition":"Cleared passageway through a crowd, as for dancing."},{"definition":"A place for special professional education, or for conferring professional degrees or licences.","example":"a Divinity Hall; Apothecaries' Hall"},{"definition":"A living room."},{"definition":"Student accommodation"}],"partOfSpeech":"n"}]},{"word":"DECORATIONS","idx":10609,"count":4606704,"meanings":[{"definitions":[{"definition":"The act of adorning, embellishing, or honoring; ornamentation."},{"definition":"That which adorns, enriches, or beautifies; something added by way of embellishment; ornament."},{"definition":"Specifically, any mark of honor to be worn upon the person, as a medal, cross, or ribbon of an order of knighthood, bestowed for services in war, great achievements in literature, art, etc."},{"definition":"The use of exotic sugars as decoys to distract the immune system of a host"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdɛkəˈɹeɪʃənz/"}]},{"word":"PAUSE","idx":10610,"count":4606318,"meanings":[{"definitions":[{"definition":"A button whose functions are pausing and resuming something, such as a DVD player, a video game or a computer."},{"definition":"A temporary stop or rest; an intermission of action; interruption; suspension; cessation."},{"definition":"A short time for relaxing and doing something else."},{"definition":"Hesitation; suspense; doubt."},{"definition":"In writing and printing, a mark indicating the place and nature of an arrest of voice in reading; a punctuation mark.","example":"Teach the pupil to mind the pauses."},{"definition":"A break or paragraph in writing."},{"definition":"A sign indicating continuance of a note or rest."},{"definition":"(as direct object) take pause: hesitate; give pause: cause to hesitate"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take a temporary rest, take a break for a short period after an effort."},{"definition":"To interrupt an activity and wait.","example":"When telling the scary story, he paused for effect."},{"definition":"To hesitate; to hold back; to delay."},{"definition":"To halt the play or playback of, temporarily, so that it can be resumed from the same point.","example":"to pause a song, a video, or a computer game"},{"definition":"To consider; to reflect."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pause-us","text":"/pɔz/"}]},{"word":"SIMPLICITY","idx":10611,"count":4606054,"meanings":[{"definitions":[{"definition":"The state or quality of being simple"},{"definition":"An act or instance of foolishness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"simplicity-us","text":"/sɪmˈplɪsɪti/"}]},{"word":"POSTSCRIPT","idx":10612,"count":4604982,"meanings":[{"definitions":[{"definition":"An addendum to a letter, added after the author's signature."},{"definition":"An addition to a story, play, etc. after its completion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extend (a letter or another document) with additional remarks."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"postscript-us","text":"/ˈpoʊst.skɹɪpt/"}]},{"word":"DIVIDENDS","idx":10613,"count":4604638,"meanings":[{"definitions":[{"definition":"A number or expression that is to be divided by another.","example":"In \"42 ÷ 3\" the dividend is the 42."},{"definition":"A pro rata payment of money by a company to its shareholders, usually made periodically (eg, quarterly or annually)."},{"definition":"Beneficial results from a metaphorical investment (of time, effort, etc.)","example":"His 10,000 hours of practice and recitals eventually paid dividends when he become first-chair violinist."}],"partOfSpeech":"n"}]},{"word":"RELAXED","idx":10614,"count":4603097,"meanings":[{"definitions":[{"definition":"To calm down."},{"definition":"To make something loose.","example":"to relax a rope or cord"},{"definition":"To become loose."},{"definition":"To make something less severe or tense.","example":"to relax discipline"},{"definition":"To become less severe or tense."},{"definition":"To make something (such as codes and regulations) more lenient."},{"definition":"(of codes and regulations) To become more lenient."},{"definition":"To relieve (something) from stress.","example":"Amusement relaxes the mind."},{"definition":"To relieve from constipation; to loosen; to open.","example":"An aperient relaxes the bowels."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having an easy-going mood or temperament.","example":"He's a relaxed kind of guy, he never lets himself get upset."},{"definition":"Eased or loosened.","example":"The relaxed rules were greatly tightened after the lawsuit."},{"definition":"Free from tension or anxiety; at ease."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈlækst/"}]},{"word":"PERIODICALS","idx":10615,"count":4602969,"meanings":[{"definitions":[{"definition":"A publication issued regularly, but less frequently than daily."},{"definition":"A regularly issued thematic publication that contains the most current information in its field, often the primary means for communication of original scholarship or creative work at the cutting edge of research in its field."}],"partOfSpeech":"n"}]},{"word":"DEMON","idx":10617,"count":4602331,"meanings":[{"definitions":[{"definition":"An evil supernatural spirit."},{"definition":"A neutral supernatural spirit."},{"definition":"Someone with great strength, passion or skill for a particular activity, pursuit etc.; an enthusiast.","example":"He’s a demon at the card tables."},{"definition":"A form of patience (known as Canfield in the US)."},{"definition":"Any of various hesperiid butterflies of the genera Notocrypta and Udaspes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"demon-uk","text":"/ˈdiː.mən/"}]},{"word":"WELCOMED","idx":10618,"count":4601400,"meanings":[{"definitions":[{"definition":"To affirm or greet the arrival of someone, especially by saying \"Welcome!\"."},{"definition":"To accept something willingly or gladly.","example":"We welcome suggestions for improvement."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having received a warm welcome.","example":"I felt so welcomed at your party last night."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈwɛlkəmd/"}]},{"word":"INFINITY","idx":10620,"count":4599935,"meanings":[{"definitions":[{"definition":"Endlessness, unlimitedness, absence of a beginning, end or limits to size."},{"definition":"A number that has an infinite numerical value that cannot be counted."},{"definition":"An idealised point which is said to be approached by sequences of values whose magnitudes increase without bound."},{"definition":"A number which is very large compared to some characteristic number. For example, in optics, an object which is much further away than the focal length of a lens is said to be \"at infinity\", as the distance of the image from the lens varies very little as the distance increases further."},{"definition":"The symbol ∞."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈfɪnɪti/"}]},{"word":"WK","idx":10621,"count":4597544,"meanings":[{"definitions":[{"definition":"Any period of seven consecutive days."},{"definition":"A period of seven days beginning with Sunday or Monday."},{"definition":"A period of five days beginning with Monday."},{"definition":"A subdivision of the month into longer periods of work days punctuated by shorter weekend periods of days for markets, rest, or religious observation such as a sabbath.","example":"A 4-day week consists of Monday, Tuesday, Wednesday, and Thursday."},{"definition":"Seven days after (sometimes before) a specified date.","example":"I'll see you Thursday week."},{"definition":"A player who stands behind the batsman’s wicket ready to catch the ball, or to stump the batsman."},{"definition":"(heading) Employment."},{"definition":"(heading) Effort."},{"definition":"Sustained effort to achieve a goal or result, especially overcoming obstacles.","example":"We don't have much time. Let's get to work piling up those sandbags."},{"definition":"(heading) Product; the result of effort."},{"definition":"The staging of events to appear as real."},{"definition":"Ore before it is dressed."},{"definition":"The equipment needed to inject a drug (syringes, needles, swabs etc.)","example":"Tell me you're using clean works at least."}],"partOfSpeech":"n"}]},{"word":"HANDLER","idx":10622,"count":4597107,"meanings":[{"definitions":[{"definition":"One who handles something (especially manually) or someone.","example":"The handler of a weapon gets a symbolic sensation of deadly power."},{"definition":"(in combination) A controller, trainer, someone who handles a specified thing, animal or person (especially a prizefighter).","example":"The spy's handler told him to approach the subject by posing as a dog handler."},{"definition":"An advisor or manager to a person occupying a position or office to which the speaker believes the holder does not possess the typical qualifications and/or experience."},{"definition":"A subroutine that handles a particular situation such as an event or exception."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhæn.dlɚ/"},{"text":"/ˈhæn.dlə/"}]},{"word":"NOTATION","idx":10624,"count":4594568,"meanings":[{"definitions":[{"definition":"The act, process, method, or an instance of representing by a system or set of marks, signs, figures, or characters."},{"definition":"A system of characters, symbols, or abbreviated expressions used in an art or science or in mathematics or logic to express technical facts or quantities.","example":"The notations used in the two books differed. (Using notation would be incorrect)."},{"definition":"A specific note or piece of information written in such a notation.","example":"She made a notation in the margin of the book."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"notation-us","text":"/noʊˈteɪʃən/"}]},{"word":"CHANDLER","idx":10625,"count":4594301,"meanings":[{"definitions":[{"definition":"A person who makes or sells candles"},{"definition":"A dealer in (a specific kind of) provisions or supplies; especially a ship chandler."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʃændlə(ɹ)/"}]},{"word":"AUNT","idx":10626,"count":4594042,"meanings":[{"definitions":[{"definition":"The sister or sister-in-law of one’s parent."},{"definition":"The female cousin of one’s parent."},{"definition":"A woman of an older generation than oneself, especially a friend of one's parents, by means of fictive kin."},{"definition":"Any elderly woman."},{"definition":"A procuress or bawd."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"aunt-us","text":"/eɪnt/"}]},{"word":"INTERVIEWED","idx":10627,"count":4592738,"meanings":[{"definitions":[{"definition":"To ask questions of (somebody); to have an interview.","example":"He interviewed the witness."},{"definition":"To be interviewed; to attend an interview."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɪn.tɚ.vjuːd/"},{"text":"/ˈɪn.tə.vjuːd/"}]},{"word":"CROW","idx":10628,"count":4592109,"meanings":[{"definitions":[{"definition":"A bird, usually black, of the genus Corvus, having a strong conical beak, with projecting bristles; it has a harsh, croaking call."},{"definition":"The cry of the rooster."},{"definition":"Any of various dark-coloured nymphalid butterflies of the genus Euploea."},{"definition":"A bar of iron with a beak, crook, or claw; a bar of iron used as a lever; a crowbar."},{"definition":"A gangplank (corvus) used by the Ancient Roman navy to board enemy ships."},{"definition":"(among butchers) The mesentery of an animal."},{"definition":"A black person."},{"definition":"The emblem of an eagle, a sign of military rank."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make the shrill sound characteristic of a rooster; to make a sound in this manner, either in gaiety, joy, pleasure, or defiance."},{"definition":"To shout in exultation or defiance; to brag.","example":"He’s been crowing all day about winning the game of cards."},{"definition":"To test the reed of a double reed instrument by placing the reed alone in the mouth and blowing it."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crow-us","text":"/kɹoʊ/"}]},{"word":"SEMANTIC","idx":10629,"count":4592016,"meanings":[{"definitions":[{"definition":"In such writing systems as the Chinese writing system, the portion of a phono-semantic character that provides an indication of its meaning; contrasted with phonetic."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to semantics or the meanings of words."},{"definition":"(software design, of code) Reflecting intended structure and meaning."},{"definition":"(of a detail or distinction) Petty or trivial; (of a person or statement) quibbling, niggling."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"semantic-au","text":"/sɪˈmæntɪk/"}]},{"word":"DISCONTINUED","idx":10631,"count":4589346,"meanings":[{"definitions":[{"definition":"To interrupt the continuance of; to put an end to, especially as regards commercial productions; to stop producing, making, or supplying something.","example":"They plan to discontinue that design."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Permanently no longer available or in production."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"discontinued-us"},{"text":"/ˌdɪskənˈtɪnjuːd/"}]},{"word":"CONCURRENT","idx":10632,"count":4589219,"meanings":[{"definitions":[{"definition":"One who, or that which, concurs; a joint or contributory cause."},{"definition":"One pursuing the same course, or seeking the same objects; hence, a rival; an opponent."},{"definition":"One of the supernumerary days of the year over fifty-two complete weeks; so called because they concur with the solar cycle, the course of which they follow."},{"definition":"One who accompanies a sheriff's officer as witness."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Happening at the same time; simultaneous."},{"definition":"Belonging to the same period; contemporary."},{"definition":"Acting in conjunction; agreeing in the same act or opinion; contributing to the same event or effect."},{"definition":"Joint and equal in authority; taking cognizance of similar questions; operating on the same objects.","example":"the concurrent jurisdiction of courts"},{"definition":"Meeting in one point."},{"definition":"Running alongside one another on parallel courses; moving together in space."},{"definition":"Involving more than one thread of computation."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"concurrent-uk","text":"/kɒŋˈkʌɹənt/"}]},{"word":"DECIDES","idx":10633,"count":4588774,"meanings":[{"definitions":[{"definition":"To resolve (a contest, problem, dispute, etc.); to choose, determine, or settle","example":"Her last-minute goal decided the game."},{"definition":"To make a judgment, especially after deliberation","example":"I have decided that it is healthier to walk to work."},{"definition":"To cause someone to come to a decision"},{"definition":"To cut off; to separate"}],"partOfSpeech":"ve"}]},{"word":"CAPTION","idx":10634,"count":4588270,"meanings":[{"definitions":[{"definition":"The descriptive heading or title of a document or part therof"},{"definition":"A title or brief explanation attached to an illustration, cartoon, user interface element, etc."},{"definition":"A piece of text appearing on screen as subtitle or other part of a film or broadcast."},{"definition":"The section on an official paper that describes when, where, what was taken, found or executed, and by whom it was authorized."},{"definition":"A seizure or capture, especially of tangible property (chattel)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add captions to a text or illustration.","example":"Only once the drawing is done will the letterer caption it."},{"definition":"To add captions to a film or broadcast."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkæp.ʃən/"}]},{"word":"BARGAINING","idx":10635,"count":4588171,"meanings":[{"definitions":[{"definition":"To make a bargain; to make a deal or contract for the exchange of property or services; to negotiate","example":"They had to bargain for a few minutes to get a decent price for the rug."},{"definition":"To transfer for a consideration; to barter; to trade"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who bargains."}],"partOfSpeech":"n"}]},{"word":"GLOBALIZATION","idx":10636,"count":4587681,"meanings":[{"definitions":[{"definition":"The process of becoming a more interconnected world."},{"definition":"The process of the world economy becoming dominated by capitalist models, according to the World System Theory."}],"partOfSpeech":"n"}]},{"word":"COMPLAIN","idx":10640,"count":4585812,"meanings":[{"definitions":[{"definition":"To express feelings of pain, dissatisfaction, or resentment.","example":"Joe was always complaining about the noise made by his neighbours."},{"definition":"To make a formal accusation or bring a formal charge.","example":"They've complained about me to the police again."},{"definition":"To creak or squeak, as a timber or wheel.","example":"the complaining bed-springs"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"complain-us","text":"/kəmˈpleɪn/"}]},{"word":"PULMONARY","idx":10641,"count":4585320,"meanings":[{"definitions":[{"definition":"Pertaining to, having, or affecting the lungs."}],"partOfSpeech":"j"}]},{"word":"ADHESIVE","idx":10642,"count":4585279,"meanings":[{"definitions":[{"definition":"A substance, such as glue, that provides or promotes adhesion"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Sticky; tenacious, as glutinous substances"},{"definition":"Apt or tending to adhere; clinging"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"adhesive-us","text":"/ædˈhi.sɪv/"}]},{"word":"ASSES","idx":10644,"count":4583177,"meanings":[{"definitions":[{"definition":"Any of several species of horse-like animals, especially Equus asinus, the domesticated of which are used as beasts of burden."},{"definition":"A stupid person.","example":"That new kid left the cap off the syrup bottle again! What an ass."},{"definition":"Buttocks."},{"definition":"Sex.","example":"I’m going to go down to the bar and try to get me some ass."},{"definition":"Anus."},{"definition":"Used in similes to express something bad or unpleasant."},{"definition":"Used after an adjective to indicate extremes or excessiveness.","example":"That was one big-ass fish!"},{"definition":"(metonymy) One's self or person, chiefly their body.","example":"Get your lazy ass out of bed!"},{"definition":"(unit of weight) A libra."},{"definition":"Any of several coins of Rome, coined in bronze or later copper; or the equivalent value."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"asses-1-us","text":"/ˈæsɪz/"}]},{"word":"ALTITUDE","idx":10645,"count":4582981,"meanings":[{"definitions":[{"definition":"The absolute height of a location, usually measured from sea level.","example":"As the altitude increases, the temperature gets lower, so remember to bring warm clothes to the mountains."},{"definition":"A vertical distance."},{"definition":"The distance measured perpendicularly from a figure's vertex to the opposite side of the vertex.","example":"The perpendicular height of a triangle is known as its altitude."},{"definition":"The angular distance of a heavenly body above our Earth's horizon."},{"definition":"Height of rank or excellence; superiority."},{"definition":"(in the plural) Elevation of spirits; heroics; haughty airs."},{"definition":"Highest point or degree."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"altitude-uk","text":"/ˈælt.ɪˌtjuːd/"}]},{"word":"COMPASS","idx":10646,"count":4581869,"meanings":[{"definitions":[{"definition":"A magnetic or electronic device used to determine the cardinal directions (usually magnetic or true north)."},{"definition":"A pair of compasses (a device used to draw an arc or circle)."},{"definition":"The range of notes of a musical instrument or voice."},{"definition":"A space within limits; an area."},{"definition":"An enclosing limit; a boundary, a circumference.","example":"within the compass of an encircling wall"},{"definition":"Moderate bounds, limits of truth; moderation; due limits; used with within."},{"definition":"Scope."},{"definition":"A passing round; circuit; circuitous course."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To surround; to encircle; to environ; to stretch round."},{"definition":"To go about or round entirely; to traverse."},{"definition":"To accomplish; to reach; to achieve; to obtain."},{"definition":"To plot; to scheme (against someone)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In a circuit; round about."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"compass-us","text":"/ˈkʌm.pəs/"}]},{"word":"CLOSET","idx":10647,"count":4581735,"meanings":[{"definitions":[{"definition":"Any private area, (particularly) bowers in the open air."},{"definition":"Any private or inner room, (particularly):"},{"definition":"A pew or side-chapel reserved for a monarch or other feudal lord."},{"definition":"A private cabinet, (particularly):"},{"definition":"Any small room or side-room, (particularly):"},{"definition":"An ordinary similar to a bar but half as broad."},{"definition":"A sewer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shut away for private discussion.","example":"The ambassador has been closeted with the prime minister all afternoon. We're all worried what will be announced when they exit."},{"definition":"To put into a private place for a secret interview or interrogation."},{"definition":"To shut up in, or as in, a closet for concealment or confinement."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Private."},{"definition":"Secret, (especially) with reference to gay people who are in the closet; closeted."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"closet-us","text":"/ˈklɑzɪt/"}]},{"word":"REEBOK","idx":10649,"count":4581373,"meanings":[{"definitions":[{"definition":"A British-established American brand of athletic wear (rendered with a capital R as Reebok)"},{"definition":"A medium-sized, deerlike South African antelope, Pelea capreolus, having pale-gray, curly fur and straight horns."}],"partOfSpeech":"n"}]},{"word":"COUCH","idx":10650,"count":4581367,"meanings":[{"definitions":[{"definition":"Couch grass, a species of persistent grass, Elymus repens, usually considered a weed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"couch-us","text":"/kaʊtʃ/"},{"audio":"couch-au","text":"/kaʊtʃ/"}]},{"word":"EVOLVED","idx":10651,"count":4581246,"meanings":[{"definitions":[{"definition":"To move in regular procession through a system."},{"definition":"To change; transform."},{"definition":"To come into being; develop."},{"definition":"Of a population, to change genetic composition over successive generations through the process of evolution."},{"definition":"To give off (gas, such as oxygen or carbon dioxide during a reaction).","example":"to evolve odours"},{"definition":"To cause something to change or transform."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having arisen through a process of evolution or iterative development."},{"definition":"Biologically gifted"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"evolved-us"}]},{"word":"DOWNS","idx":10652,"count":4578206,"meanings":[{"definitions":[{"definition":"A negative aspect; a downer.","example":"I love almost everything about my job. The only down is that I can't take Saturdays off."},{"definition":"A grudge (on someone)."},{"definition":"An act of swallowing an entire drink at once."},{"definition":"A single play, from the time the ball is snapped (the start) to the time the whistle is blown (the end) when the ball is down, or is downed.","example":"I bet after the third down, the kicker will replace the quarterback on the field."},{"definition":"(crosswords) A clue whose solution runs vertically in the grid.","example":"I haven't solved 12 or 13 across, but I've got most of the downs."},{"definition":"A downstairs room of a two-story house.","example":"She lives in a two-up two-down."},{"definition":"Down payment."},{"definition":"(especially southern England) A hill, especially a chalk hill; rolling grassland","example":"The North Downs are a ridge of chalk hills in south east England."},{"definition":"(usually in the plural) A field, especially one used for horse racing."},{"definition":"(chiefly in the plural) A tract of poor, sandy, undulating or hilly land near the sea, covered with fine turf which serves chiefly for the grazing of sheep."},{"definition":"Soft, fluffy immature feathers which grow on young birds. Used as insulating material in duvets, sleeping bags and jackets."},{"definition":"The pubescence of plants; the hairy crown or envelope of the seeds of certain plants, such as the thistle."},{"definition":"The soft hair of the face when beginning to appear."},{"definition":"That which is made of down, as a bed or pillow; that which affords ease and repose, like a bed of down."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To knock (someone or something) down; to cause to come down, to fell.","example":"A single rifle shot downed the mighty beast."},{"definition":"To lower; to put (something) down.","example":"The bell rang for lunch, and the workers downed their tools."},{"definition":"To defeat; to overpower."},{"definition":"To disparage, to put down."},{"definition":"To go or come down; to descend."},{"definition":"To drink or swallow, especially without stopping before the vessel containing the liquid is empty.","example":"He downed an ale and ordered another."},{"definition":"To render (the ball) dead, typically by touching the ground while in possession.","example":"He downed it at the seven-yard line."},{"definition":"(pocket billiards) To sink (a ball) into a hole or pocket.","example":"He downed two balls on the break."},{"definition":"To cover, ornament, line, or stuff with down."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/daʊnz/"}]},{"word":"EXCEEDING","idx":10654,"count":4577330,"meanings":[{"definitions":[{"definition":"To be larger, greater than (something).","example":"The company's 2005 revenue exceeds that of 2004."},{"definition":"To be better than (something).","example":"The quality of her essay has exceeded my expectations."},{"definition":"To go beyond (some limit); to surpass; to be longer than.","example":"Your password cannot exceed eight characters."},{"definition":"To predominate."},{"definition":"To go too far; to be excessive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The situation of being in excess."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Prodigious"},{"definition":"Exceptional, extraordinary"},{"definition":"Extreme"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Exceedingly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"exceeding-us","text":"/ɪkˈsiːdɪŋ/"}]},{"word":"ROGUE","idx":10656,"count":4576302,"meanings":[{"definitions":[{"definition":"A scoundrel, rascal or unprincipled, deceitful, and unreliable person."},{"definition":"A mischievous scamp."},{"definition":"A vagrant."},{"definition":"Deceitful software pretending to be anti-spyware, but in fact being malicious software itself."},{"definition":"An aggressive animal separate from the herd, especially an elephant."},{"definition":"A plant that shows some undesirable variation."},{"definition":"A character class focusing on stealthy conduct."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cull; to destroy plants not meeting a required standard, especially when saving seed, rogue or unwanted plants are removed before pollination."},{"definition":"To cheat."},{"definition":"To give the name or designation of rogue to; to decry."},{"definition":"To wander; to play the vagabond; to play knavish tricks."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of an animal, especially an elephant) Vicious and solitary."},{"definition":"(by extension) Large, destructive and unpredictable."},{"definition":"(by extension) Deceitful, unprincipled."},{"definition":"Mischievous, unpredictable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rogue-us","text":"/ˈɹoʊ̯ɡ/"}]},{"word":"UNFAIR","idx":10657,"count":4575832,"meanings":[{"definitions":[{"definition":"To make ugly"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not beautiful; uncomely; unattractive"},{"definition":"Sorrowful; sad"},{"definition":"Unseemly; disgraceful"},{"definition":"Not fair, unjust","example":"It was unfair for the boss to give larger bonuses to his friends."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unfair-us","text":"/ʌnˈfɛɚ/"}]},{"word":"ELECTRONICALLY","idx":10659,"count":4575196,"meanings":[{"definitions":[{"definition":"By means of electronics, or of electronic technology."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"electronically-us","text":"/ɪˌlɛkˈtɹɑn.ɪk.li/"}]},{"word":"INSPIRATIONAL","idx":10660,"count":4574490,"meanings":[{"definitions":[{"definition":"A book or article intended to inspire people with positive feelings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the ability to inspire."}],"partOfSpeech":"j"}]},{"word":"INFANTRY","idx":10663,"count":4572549,"meanings":[{"definitions":[{"definition":"Soldiers who fight on foot (on land), as opposed to cavalry and other mounted units, regardless of external transport (e.g. airborne)."},{"definition":"The part of an army consisting of infantry soldiers, especially opposed to mounted and technical troops"},{"definition":"A regiment of infantry"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪnfəntɹi/"}]},{"word":"RENOWNED","idx":10665,"count":4571998,"meanings":[{"definitions":[{"definition":"Famous, celebrated, or well-known.","example":"The movie “Three Stars” is about world-renowned chefs."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈnaʊnd/"}]},{"word":"CORRIDOR","idx":10666,"count":4571967,"meanings":[{"definitions":[{"definition":"A narrow hall or passage with rooms leading off it, as in a building or in a railway carriage."},{"definition":"A restricted tract of land that allows passage between two places."},{"definition":"The covered way lying round the whole compass of the fortifications of a place."},{"definition":"Airspace restricted for the passage of aircraft."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"corridor-us","text":"/ˈkɔɹəˌdɔɹ/"}]},{"word":"PHILOSOPHICAL","idx":10667,"count":4571852,"meanings":[{"definitions":[{"definition":"Of, or pertaining to, philosophy."},{"definition":"Rational; analytic or critically-minded; thoughtful."},{"definition":"Detached, calm, stoic."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌfɪləˈsɑfɪkl̩/"},{"text":"/ˌfɪləˈsɒfɪkl̩/"}]},{"word":"SCRIPTURE","idx":10668,"count":4571524,"meanings":[{"definitions":[{"definition":"A sacred writing or holy book.","example":"The primary scripture in Zoroastrianism is the Avesta."},{"definition":"(by extension) An authoritative statement."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"scripture-us","text":"/ˈskɹɪptʃɚ/"}]},{"word":"CELEBRATING","idx":10669,"count":4571260,"meanings":[{"definitions":[{"definition":"To extol or honour in a solemn manner.","example":"to celebrate the name of the Most High"},{"definition":"To honour by rites, by ceremonies of joy and respect, or by refraining from ordinary business; to observe duly.","example":"to celebrate a birthday"},{"definition":"To engage in joyful activity in appreciation of an event.","example":"I was promoted today at work—let’s celebrate!"},{"definition":"To perform or participate in, as a sacrament or solemn rite; to perform with appropriate rites.","example":"to celebrate a marriage"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Celebration"}],"partOfSpeech":"n"}]},{"word":"JUSTIFICATION","idx":10671,"count":4570150,"meanings":[{"definitions":[{"definition":"A reason, explanation, or excuse which provides convincing, morally acceptable support for behavior or for a belief or occurrence."},{"definition":"The alignment of text to the left margin (left justification), the right margin (right justification), or both margins (full justification)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdʒʌstɪfɪˈkeɪʃən/"}]},{"word":"REBUILD","idx":10672,"count":4569457,"meanings":[{"definitions":[{"definition":"A process or result of rebuilding."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To build again."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɹiːbɪld/"}]},{"word":"VACANT","idx":10674,"count":4569268,"meanings":[{"definitions":[{"definition":"Not occupied; empty."},{"definition":"Showing no intelligence or interest.","example":"a vacant stare"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"vacant-us","text":"/ˈveɪkənt/"}]},{"word":"MANUSCRIPT","idx":10675,"count":4569058,"meanings":[{"definitions":[{"definition":"A book, composition or any other document, written by hand (or manually typewritten), not mechanically reproduced."},{"definition":"A single, original copy of a book, article, composition etc, written by hand or even printed, submitted as original for (copy-editing and) reproductive publication."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Handwritten, or by extension manually typewritten, as opposed to being mechanically reproduced."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"manuscript-us","text":"/ˈmænjəˌskɹɪpt/"}]},{"word":"FIXING","idx":10676,"count":4568792,"meanings":[{"definitions":[{"definition":"To pierce; now generally replaced by transfix."},{"definition":"To attach; to affix; to hold in place or at a particular time.","example":"A dab of chewing gum will fix your note to the bulletin board."},{"definition":"To mend, to repair.","example":"That heater will start a fire if you don't fix it."},{"definition":"To prepare (food or drink).","example":"She fixed dinner for the kids."},{"definition":"To make (a contest, vote, or gamble) unfair; to privilege one contestant or a particular group of contestants, usually before the contest begins; to arrange immunity for defendants by tampering with the justice system via bribery or extortion","example":"A majority of voters believed the election was fixed in favor of the incumbent."},{"definition":"To surgically render an animal, especially a pet, infertile.","example":"Rover stopped digging under the fence after we had the vet fix him."},{"definition":"(sematics) To map a (point or subset) to itself."},{"definition":"To take revenge on, to best; to serve justice on an assumed miscreant.","example":"He got caught breaking into lockers, so a couple of guys fixed him after work."},{"definition":"To render (a photographic impression) permanent by treating with such applications as will make it insensitive to the action of light."},{"definition":"To convert into a stable or available form.","example":"Legumes are valued in crop rotation for their ability to fix nitrogen."},{"definition":"To become fixed; to settle or remain permanently; to cease from wandering; to rest."},{"definition":"To become firm, so as to resist volatilization; to cease to flow or be fluid; to congeal; to become hard and malleable, as a metallic substance."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of subverting (fixing) a vote."},{"definition":"(usually in the plural) Something to aid attachment during construction (screws, wall plugs, etc)"},{"definition":"See fixings."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fixing-au","text":"/ˈfɪksɪŋ/"}]},{"word":"MOTHERBOARDS","idx":10677,"count":4567884,"meanings":[{"definitions":[{"definition":"The primary circuit board of a personal computer, containing the circuitry for the central processing unit, keyboard, mouse and monitor, together with slots for other devices."}],"partOfSpeech":"n"}]},{"word":"GRAM","idx":10678,"count":4566651,"meanings":[{"definitions":[{"definition":"A unit of mass equal to one-thousandth of a kilogram. Symbol: g"},{"definition":"A leguminous plant grown for its seeds, especially the chickpea."},{"definition":"The seeds of these plants."},{"definition":"Grandmother"},{"definition":"A photograph or video shared on this service."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Angry"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gram-us","text":"/ɡɹæm/"}]},{"word":"HIDING","idx":10680,"count":4565153,"meanings":[{"definitions":[{"definition":"To put (something) in a place where it will be harder to discover or out of sight.","example":"He hides his magazines under the bed."},{"definition":"To put oneself in a place where one will be harder to find or out of sight."},{"definition":"To beat with a whip made from hide."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A state of concealment."},{"definition":"A place of concealment."},{"definition":"A beating or spanking."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hiding-us","text":"/ˈhaɪdɪŋ/"}]},{"word":"METHODIST","idx":10681,"count":4565081,"meanings":[{"definitions":[{"definition":"One who follows a method."}],"partOfSpeech":"n"}]},{"word":"INHERENT","idx":10682,"count":4564901,"meanings":[{"definitions":[{"definition":"Naturally as part or consequence of something."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"inherent-uk","text":"/ɪnˈhɛɹənt/"}]},{"word":"DYE","idx":10683,"count":4564149,"meanings":[{"definitions":[{"definition":"A colourant, especially one that has an affinity to the substrate to which it is applied."},{"definition":"Any hue, color, or blee."},{"definition":"A regular polyhedron, usually a cube, with numbers or symbols on each side and used in games of chance."},{"definition":"That which is, or might be, determined, by a throw of the die; hazard; chance."},{"definition":"(plural also dies) An oblong chip fractured from a semiconductor wafer engineered to perform as an independent device or integrated circuit."},{"definition":"The cubical part of a pedestal; a plinth."},{"definition":"A device for cutting into a specified shape."},{"definition":"A device used to cut an external screw thread. (Internal screw threads are cut with a tap.)"},{"definition":"A mold for forming metal or plastic objects."},{"definition":"An embossed device used in stamping coins and medals."},{"definition":"(plural also dice) An oblong chip fractured from a semiconductor wafer engineered to perform as an independent device or integrated circuit."},{"definition":"Any small cubical or square body."},{"definition":"A colourant, especially one that has an affinity to the substrate to which it is applied."},{"definition":"Any hue, color, or blee."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To colour with dye, or as if with dye."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dye-uk","text":"/daɪ/"}]},{"word":"SITS","idx":10684,"count":4562414,"meanings":[{"definitions":[{"definition":"Subsidence of the roof of a coal mine."},{"definition":"An event, usually lasting one full day or more, where the primary goal is to sit in meditation."},{"definition":"Short for situation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a person) To be in a position in which the upper body is upright and supported by the buttocks.","example":"After a long day of walking, it was good just to sit and relax."},{"definition":"(of a person) To move oneself into such a position.","example":"I asked him to sit."},{"definition":"(of an object) To occupy a given position permanently.","example":"The temple has sat atop that hill for centuries."},{"definition":"To remain in a state of repose; to rest; to abide; to rest in any position or condition."},{"definition":"To be a member of a deliberative body.","example":"I currently sit on a standards committee."},{"definition":"Of a legislative or, especially, a judicial body such as a court, to be in session.","example":"In what city is the circuit court sitting for this session."},{"definition":"To lie, rest, or bear; to press or weigh."},{"definition":"To be adjusted; to fit.","example":"Your new coat sits well."},{"definition":"(of an agreement or arrangement) To be accepted or acceptable; to work.","example":"How will this new contract sit with the workers?"},{"definition":"(causative) To cause to be seated or in a sitting posture; to furnish a seat to.","example":"Sit him in front of the TV and he might watch for hours."},{"definition":"To accommodate in seats; to seat.","example":"The dining room table sits eight comfortably."},{"definition":"To babysit.","example":"I need to find someone to sit my kids on Friday evening for four hours."},{"definition":"To take, to undergo or complete (an examination or test)."},{"definition":"To cover and warm eggs for hatching, as a fowl; to brood; to incubate."},{"definition":"To take a position for the purpose of having some artistic representation of oneself made, such as a picture or a bust.","example":"I'm sitting for a painter this evening."},{"definition":"To have position, as at the point blown from; to hold a relative position; to have direction."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sɪts/"}]},{"word":"ALPHABET","idx":10685,"count":4562325,"meanings":[{"definitions":[{"definition":"The set of letters used when writing in a language.","example":"In the first year of school, pupils are taught to recite the alphabet."},{"definition":"A writing system in which letters represent phonemes. (Contrast e.g. logography, a writing system in which each character represents a word, and syllabary, in which each character represents a syllable.)"},{"definition":"A typically finite set of distinguishable symbols.","example":"Let L be a regular language over the alphabet \\Sigma."},{"definition":"An individual letter of an alphabet; an alphabetic character."},{"definition":"The simplest rudiments; elements."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To designate by the letters of the alphabet; to arrange alphabetically."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"alphabet-us","text":"/ˈæl.fə.bɛt/"}]},{"word":"SHELVES","idx":10686,"count":4560501,"meanings":[{"definitions":[{"definition":"A flat, rigid structure, fixed at right angles to a wall or forming a part of a cabinet, desk etc., and used to support, store or display objects."},{"definition":"The capacity of such an object","example":"a shelf of videos"},{"definition":"A projecting ledge that resembles such an object."},{"definition":"A reef, shoal or sandbar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place on a shelf.","example":"The library needs volunteers to help shelve books."},{"definition":"To set aside; to quit or postpone.","example":"They shelved the entire project when they heard how much it would cost."},{"definition":"To furnish with shelves.","example":"to shelve a closet or a library"},{"definition":"To take (drugs) by anal or vaginal insertion."},{"definition":"To have sex with."},{"definition":"To slope; to incline; to form into shelves."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈʃɛlvz/"}]},{"word":"TOES","idx":10687,"count":4560478,"meanings":[{"definitions":[{"definition":"Each of the five digits on the end of the foot."},{"definition":"An equivalent part in an animal."},{"definition":"That part of a shoe or sock covering the toe."},{"definition":"Something resembling a toe, especially at the bottom or extreme end of something."},{"definition":"An advanced form of ballet primarily for the females, dancing ballet primarily using a Pointe shoe."},{"definition":"An alignment of the wheels of a road vehicle with positive toe (or toe in) signifying that the wheels are closer together at the front than at the back and negative toe (or toe out) the opposite."},{"definition":"The journal, or pivot, at the lower end of a revolving shaft or spindle, which rests in a step."},{"definition":"A lateral projection at one end, or between the ends, of a piece, such as a rod or bolt, by means of which it is moved."},{"definition":"A projection from the periphery of a revolving piece, acting as a cam to lift another piece."},{"definition":"The long side of an angled cut."},{"definition":"The upper end of the bit (cutting edge) of an axehead; as opposed to the heel (lower end)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To furnish (a stocking, etc.) with a toe."},{"definition":"To touch, tap or kick with the toes."},{"definition":"To touch or reach with the toes; to come fully up to.","example":"to toe the mark"},{"definition":"To fasten (a piece) by driving a fastener at a near-45-degree angle through the side (of the piece) into the piece to which it is to be fastened.","example":"The framers toed the irregular pieces into the sill."},{"definition":"To mishit a golf ball with the toe of the club."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/toʊz/"},{"text":"/təʊz/"}]},{"word":"CLEANED","idx":10688,"count":4560058,"meanings":[{"definitions":[{"definition":"To remove dirt from a place or object.","example":"Can you clean the windows today?"},{"definition":"To tidy up, make a place neat.","example":"Clean your room right now!"},{"definition":"To remove equipment from a climbing route after it was previously lead climbed."},{"definition":"To make things clean in general.","example":"She just likes to clean. That’s why I married her."},{"definition":"To remove unnecessary files, etc. from (a directory, etc.)."},{"definition":"To brush the ice lightly in front of a moving rock to remove any debris and ensure a correct line; less vigorous than a sweep."},{"definition":"To purge a raw of any blemishes caused by the scanning process such as brown tinting and poor color contrast."},{"definition":"To remove guts and/or scales of a butchered animal."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been made clean."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cleaned-us","text":"/kliːnd/"}]},{"word":"HONORED","idx":10689,"count":4559668,"meanings":[{"definitions":[{"definition":"To think of highly, to respect highly; to show respect for; to recognise the importance or spiritual value of","example":"The freedom fighters will be forever remembered and honored by the people."},{"definition":"To conform to, abide by, act in accordance with (an agreement, treaty, promise, request, or the like)","example":"I trusted you, but you have not honored your promise."},{"definition":"To confer (bestow) an honour or privilege upon (someone)","example":"Ten members of the profession were honored at the ceremony."},{"definition":"To make payment in respect of (a cheque, banker's draft, etc.)","example":"I'm sorry Sir, but the bank did not honour your cheque."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Respected, having received honour."}],"partOfSpeech":"j"}]},{"word":"OPTIC","idx":10690,"count":4558869,"meanings":[{"definitions":[{"definition":"An eye."},{"definition":"A lens or other part of an optical instrument that interacts with light."},{"definition":"A measuring device with a small window, attached to an upside-down bottle, used to dispense alcoholic drinks in a bar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to the eye or to vision."},{"definition":"Of, or relating to optics or optical instruments."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"optic-uk","text":"/ˈɒptɪk/"}]},{"word":"TELEPHONES","idx":10693,"count":4556400,"meanings":[{"definitions":[{"definition":"A telecommunication device (originally mechanical, and now electronic) used for two-way talking with another person (now often shortened to phone)."},{"definition":"The game of Chinese whispers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To (attempt to) contact someone using the telephone."},{"definition":"To convey (a message) by telephoning."}],"partOfSpeech":"ve"}]},{"word":"TAILORED","idx":10694,"count":4556136,"meanings":[{"definitions":[{"definition":"To make, repair, or alter clothes.","example":"We can tailor that jacket for you if you like."},{"definition":"To make or adapt (something) for a specific need.","example":"The website was tailored to the client's needs."},{"definition":"To restrict (something) in order to meet a particular need.","example":"a narrowly tailored law"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Adjusted by a tailor, fitted."},{"definition":"Made by a tailor.","example":"His expensive tailored shirts didn't look that much better than off-the-rack, but they lasted much longer."}],"partOfSpeech":"j"}]},{"word":"INSECT","idx":10695,"count":4554595,"meanings":[{"definitions":[{"definition":"An arthropod in the class Insecta, characterized by six legs, up to four wings, and a chitinous exoskeleton.","example":"Our shed has several insect infestions, including ants, yellowjackets, and wasps."},{"definition":"Any small arthropod similar to an insect including spiders, centipedes, millipedes, etc","example":"The swamp is swarming with every sort of insect."},{"definition":"A contemptible or powerless person.","example":"The manager’s assistant was the worst sort of insect."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"insect-us","text":"/ˈɪnsɛkt/"}]},{"word":"DIARIES","idx":10697,"count":4553662,"meanings":[{"definitions":[{"definition":"A daily log of experiences, especially those of the writer.","example":"They kept separate diaries. His was on paper and her diary was on her computer's hard drive."},{"definition":"A personal organizer or appointment diary."}],"partOfSpeech":"n"}]},{"word":"CHILI","idx":10698,"count":4553187,"meanings":[{"definitions":[{"definition":"The pungent, spicy fresh or dried fruit of any of several cultivated varieties of capsicum peppers, used in cooking."},{"definition":"Powdered chili pepper, used as a spice or flavouring in cooking."},{"definition":"(Indian Chinese cuisine) a spicy stew of chicken or paneer, capsicum and onion, eaten as an appetizer."},{"definition":"A dish made with chili peppers and other ingredients, such as beans and beef."},{"definition":"(Cincinnati) Cincinnati chili."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"chili-uk","text":"/ˈt͡ʃɪli/"}]},{"word":"GRIEF","idx":10699,"count":4552843,"meanings":[{"definitions":[{"definition":"Suffering, hardship."},{"definition":"Pain of mind arising from misfortune, significant personal loss, bereavement, misconduct of oneself or others, etc.; sorrow; sadness.","example":"She was worn out from so much grief."},{"definition":"Cause or instance of sorrow or pain; that which afflicts or distresses; trial."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deliberately harass and annoy or cause grief to other players of a game in order to interfere with their enjoyment of it; especially, to do this as one’s primary activity in the game."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"grief-us","text":"/ɡɹiːf/"},{"audio":"grief-uk","text":"/ɡɹiːf/"}]},{"word":"SWEAT","idx":10702,"count":4551615,"meanings":[{"definitions":[{"definition":"Fluid that exits the body through pores in the skin usually due to physical stress and/or high temperature for the purpose of regulating body temperature and removing certain compounds from the circulation."},{"definition":"The state of one who sweats; diaphoresis.","example":"Just thinking about the interview tomorrow puts me into a nervous sweat."},{"definition":"(especially WWI) A soldier (especially one who is old or experienced)."},{"definition":"The sweating sickness."},{"definition":"Moisture issuing from any substance.","example":"the sweat of hay or grain in a mow or stack"},{"definition":"A short run by a racehorse as a form of exercise."},{"definition":"Hard work; toil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To emit sweat."},{"definition":"To cause to excrete moisture through skin."},{"definition":"To work hard.","example":"I've been sweating over my essay all day."},{"definition":"To extract money, labour, etc. from, by exaction or oppression.","example":"to sweat a spendthrift"},{"definition":"To worry."},{"definition":"To worry about (something)."},{"definition":"To emit, in the manner of sweat.","example":"to sweat blood"},{"definition":"To emit moisture.","example":"The cheese will start sweating if you don't refrigerate it."},{"definition":"To solder (a pipe joint) together."},{"definition":"To stress out.","example":"Stop sweatin'  me!"},{"definition":"To cook slowly at low heat, in shallow oil and without browning, to reduce moisture content."},{"definition":"To remove a portion of (a coin), as by shaking it with others in a bag, so that the friction wears off a small quantity of the metal."},{"definition":"To suffer a penalty; to smart for one's misdeeds."},{"definition":"To scrape the sweat from (a horse)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sweat-1-us","text":"/swɛt/"}]},{"word":"DOLPHIN","idx":10703,"count":4551363,"meanings":[{"definitions":[{"definition":"A carnivorous aquatic mammal in one of several families of order Cetacea, famed for its intelligence and occasional willingness to approach humans."},{"definition":"A fish, the mahi-mahi or dorado, Coryphaena hippurus, with a dorsal fin that runs the length of the body, also known for iridescent coloration."},{"definition":"A depiction of a fish, with a broad indented fin, usually embowed."},{"definition":"The dauphin, eldest son of the kings of France."},{"definition":"(history) A mass of iron or lead hung from the yardarm, in readiness to be dropped through the deck and the hull of an enemy's vessel to sink it."},{"definition":"A kind of wreath or strap of plaited cordage."},{"definition":"A spar or buoy held by an anchor and furnished with a ring to which ships may fasten their cables."},{"definition":"A mooring post on a wharf or beach."},{"definition":"A permanent fender around a heavy boat just below the gunwale."},{"definition":"One of the handles above the trunnions by which a gun was lifted."},{"definition":"A man-made semi submerged maritime structure, usually installed to provide a fixed structure for temporary mooring, to prevent ships from drifting to shallow water or to serve as base for navigational aids."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dolphin-us","text":"/ˈdɑlfɪn/"}]},{"word":"PENDANTS","idx":10704,"count":4550520,"meanings":[{"definitions":[{"definition":"A supporting post attached to the main rafter."},{"definition":"A piece of jewellery which hangs down as an ornament, especially worn on a chain around the neck."},{"definition":"The dangling part of an earring."},{"definition":"A short rope hanging down, used to attach hooks for tackles; a pennant."},{"definition":"One of a pair; a counterpart.","example":"One vase is the pendant to the other vase."},{"definition":"An appendix or addition, as to a book."},{"definition":"(in the plural) Testicles."},{"definition":"A pendulum."},{"definition":"The stem and ring of a watch, by which it is suspended."},{"definition":"A lamp hanging from the roof."},{"definition":"An ornament of wood or of stone hanging downwards from a roof."},{"definition":"A long narrow flag at the head of the principal mast in a royal ship."}],"partOfSpeech":"n"}]},{"word":"WONDERS","idx":10705,"count":4549608,"meanings":[{"definitions":[{"definition":"Something that causes amazement or awe; a marvel.","example":"Wonders of the World seem to come in sevens."},{"definition":"Something astonishing and seemingly inexplicable.","example":"The idea was so crazy that it is a wonder that anyone went along with it."},{"definition":"Someone very talented at something, a genius.","example":"He's a wonder at cooking."},{"definition":"The sense or emotion which can be inspired by something curious or unknown; surprise; astonishment, often with awe or reverence."},{"definition":"A mental pondering, a thought."},{"definition":"A kind of donut; a cruller."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be affected with surprise or admiration; to be struck with astonishment; to be amazed; to marvel; often followed by at."},{"definition":"To ponder; to feel doubt and curiosity; to query in the mind.","example":"He wondered whether penguins could fly. She had wondered this herself sometimes."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈwʌndɚz/"},{"text":"/ˈwʌndəz/"}]},{"word":"VENTILATION","idx":10708,"count":4548657,"meanings":[{"definitions":[{"definition":"The replacement of stale or noxious air with fresh."},{"definition":"The mechanical system used to circulate and replace air."},{"definition":"An exchange of views during a discussion."},{"definition":"The public exposure of an issue or topic."},{"definition":"The bodily process of breathing; the inhalation of air to provide oxygen, and the exhalation of spent air to remove carbon dioxide."},{"definition":"The mechanical system used to assist breathing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ventilation-us"}]},{"word":"MASKS","idx":10710,"count":4548281,"meanings":[{"definitions":[{"definition":"A cover, or partial cover, for the face, used for disguise or protection.","example":"a dancer's mask; a fencer's mask; a ball player's mask"},{"definition":"That which disguises; a pretext or subterfuge."},{"definition":"A festive entertainment of dancing or other diversions, where all wear masks; a masquerade"},{"definition":"A person wearing a mask."},{"definition":"A dramatic performance, formerly in vogue, in which the actors wore masks and represented mythical or allegorical characters."},{"definition":"A grotesque head or face, used to adorn keystones and other prominent parts, to spout water in fountains, and the like"},{"definition":"(fortification) In a permanent fortification, a redoubt which protects the caponiere."},{"definition":"(fortification) A screen for a battery"},{"definition":"The lower lip of the larva of a dragonfly, modified so as to form a prehensile organ."},{"definition":"(Puebloan) A ceremonial object used in Puebloan kachina cults that resembles a Euro-American mask. (The term is objected to as an appropriate translation by Puebloan peoples as it emphasizes imitation but ignores power and representational intent.)"},{"definition":"A pattern of bits used in bitwise operations; bitmask."},{"definition":"A two-color (black and white) bitmap generated from an image, used to create transparency in the image."},{"definition":"The head of a fox, shown face-on and cut off immediately behind the ears."},{"definition":"A mesh."},{"definition":"The mesh of a net; a net; net-bag."},{"definition":"Mash."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover (the face or something else), in order to conceal the identity or protect against injury; to cover with a mask or visor."},{"definition":"To disguise; to cover; to hide."},{"definition":"To conceal; also, to intervene in the line of."},{"definition":"To cover or keep in check.","example":"to mask a body of troops or a fortess by a superior force, while some hostile evolution is being carried out"},{"definition":"To take part as a masker in a masquerade"},{"definition":"To wear a mask; to be disguised in any way"},{"definition":"To cover or shield a part of a design or picture in order to prevent reproduction or to safeguard the surface from the colors used when working with an air brush or painting"},{"definition":"To set or unset (certain bits, or binary digits, within a value) by means of a bitmask."},{"definition":"To disable (an interrupt, etc.) by setting or unsetting the associated bit."},{"definition":"To mash."},{"definition":"To mix malt with hot water to yield wort."},{"definition":"To be infused or steeped."},{"definition":"To prepare tea in a teapot; alternative to brew."},{"definition":"To bewilder; confuse."}],"partOfSpeech":"ve"}]},{"word":"CELEB","idx":10711,"count":4548138,"meanings":[{"definitions":[{"definition":"A celebrity; a famous person."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˈlɛb/"}]},{"word":"BUST","idx":10712,"count":4547742,"meanings":[{"definitions":[{"definition":"A sculptural portrayal of a person's head and shoulders."},{"definition":"The breasts and upper thorax of a woman."},{"definition":"The downward portion of a boom and bust cycle; a recession."},{"definition":"A police raid or takedown of a criminal enterprise."},{"definition":"A disappointment."},{"definition":"The act of arresting someone for a crime, or raiding a suspected criminal operation.","example":"a narcotics bust"},{"definition":"A failed enterprise; a bomb."},{"definition":"A refutation of an opening, or of a previously published analysis."},{"definition":"A player who fails to meet expectations."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To break.","example":"I busted my cooker while trying to fix it."},{"definition":"To arrest (someone) for a crime."},{"definition":"To catch (someone) in the act of doing something wrong, socially and morally inappropriate, or illegal, especially when being done in a sneaky or secretive state."},{"definition":"An emphatic synonym of do or get.","example":"He busted huge air off that jump!"},{"definition":"To reduce in rank.","example":"He busted him down to patrolman for insubordination."},{"definition":"To undo a trade, generally an error trade, that has already been executed."},{"definition":"To lose all of one's chips."},{"definition":"To exceed a score of 21."},{"definition":"To break in (an animal)."},{"definition":"To ejaculate; to eject semen."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Without any money, broke, bankrupt.","example":"After months of financial problems, the company finally went bust."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bust-us","text":"/ˈbʌst/"},{"audio":"bust-au","text":"/ˈbʌst/"}]},{"word":"LATERAL","idx":10713,"count":4547513,"meanings":[{"definitions":[{"definition":"An object, such as a passage or a protrusion, that is situated on the side of something else."},{"definition":"A sound produced through lateral pronunciation (such as /l/ in lateral)."},{"definition":"A lateral pass."},{"definition":"An employee hired for a position at the same organizational level or salary as their previous position."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move (oneself or something) in a lateral direction."},{"definition":"To execute a lateral pass."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"To the side; of or pertaining to the side.","example":"Instead of a promotion, I opted for a lateral move to a similar position in the marketing department."},{"definition":"Non-linear or unconventional, as in, lateral thinking."},{"definition":"Pertaining to the left or right of the body; further from the midline.","example":"A fish senses changes in hydrodynamic pressure with its lateral line."},{"definition":"At right angles to a line of motion or strain."},{"definition":"Pertaining to sounds generated by partially blocking the egress of the airstream with the tip of the tongue touching the alveolar ridge, leaving space on one or both sides of the occlusion for air passage."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈlæt.ɚ.əl/"},{"text":"/ˈlæt.ɹəl/"}]},{"word":"QUAKE","idx":10715,"count":4544481,"meanings":[{"definitions":[{"definition":"A trembling or shaking.","example":"We felt a quake in the apartment every time the train went by."},{"definition":"An earthquake, a trembling of the ground with force.","example":"California is plagued by quakes; there are a few minor ones almost every month."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tremble or shake.","example":"I felt the ground quaking beneath my feet."},{"definition":"To be in a state of fear, shock, amazement, etc., such as might cause one to tremble."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"quake-us","text":"/kweɪk/"}]},{"word":"USABILITY","idx":10717,"count":4543657,"meanings":[{"definitions":[{"definition":"The state or condition of being usable."},{"definition":"The degree to which an object, device, software application, etc. is easy to use with no specific training."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌjuːzəˈbɪlɪti/"}]},{"word":"ALLEY","idx":10718,"count":4541475,"meanings":[{"definitions":[{"definition":"A narrow street or passageway, especially one through the middle of a block giving access to the rear of lots or buildings.","example":"The parking lot to my friend's apartment building is in the alley."},{"definition":"The area between the outfielders.","example":"He hit one deep into the alley."},{"definition":"An establishment where bowling is played."},{"definition":"An elongated wooden strip of floor along which a bowling ball is rolled."},{"definition":"The extra area between the sidelines or tramlines on a tennis court that is used for doubles matches."},{"definition":"A walk or passage in a garden or park, bordered by rows of trees or bushes."},{"definition":"A passageway between rows of pews in a church."},{"definition":"(perspective drawing) Any passage having the entrance represented as wider than the exit, so as to give the appearance of length."},{"definition":"The space between two rows of compositors' stands in a printing office."},{"definition":"A glass marble or taw."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"alley-us","text":"/ˈæ.li/"}]},{"word":"BACKYARD","idx":10720,"count":4541081,"meanings":[{"definitions":[{"definition":"A yard to the rear of a house or similar residence."},{"definition":"A person's neighborhood, or an area nearby to a person's usual residence or place of work and where the person is likely to go."},{"definition":"An area nearby to a country or other jurisdiction's legal boundaries, particularly an area in which the country feels it has an interest."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bækˈjɑːd/"}]},{"word":"SANDERS","idx":10721,"count":4540478,"meanings":[{"definitions":[{"definition":"A person employed to sand wood."},{"definition":"A machine to mechanize the process of sanding."},{"definition":"A device which spreads sand on the rails in wet, snowy or icy conditions to improve traction."},{"definition":"A small device resembling a salt shaker but containing sand that was shaken over a document to remove excess ink."},{"definition":"Sandalwood, especially the red sandalwood"}],"partOfSpeech":"n"}]},{"word":"PATHWAYS","idx":10722,"count":4540135,"meanings":[{"definitions":[{"definition":"A footpath or other path or track."},{"definition":"A sequence of biochemical compounds, and the reactions linking them, that describe a process in metabolism or catabolism."},{"definition":"A course of action."}],"partOfSpeech":"n"}]},{"word":"TELEGRAPH","idx":10723,"count":4539841,"meanings":[{"definitions":[{"definition":"An apparatus, or a process, for communicating rapidly between distant points, especially by means of established visible or audible signals representing words or ideas, or by means of words and signs, transmitted by electrical means."},{"definition":"A visible or audible cue that indicates to an opponent the action that a character is about to take."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send a message by telegraph."},{"definition":"To give nonverbal signals to another, as with gestures or a change in attitude.","example":"Her frown telegraphed her displeasure."},{"definition":"To show one's intended action unintentionally."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"telegraph-us"},{"text":"/ˈtɛl.ə.ɡɹæf/"}]},{"word":"PERTAINING","idx":10724,"count":4539279,"meanings":[{"definitions":[{"definition":"To belong to or be a part of; be an adjunct, attribute, or accessory of"},{"definition":"To relate, to refer, be relevant to"},{"definition":"To apply; to be or remain in place; to continue to be applicable"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something that pertains; an appurtenance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pertaining-us","text":"/pɚˈteɪnɪŋ/"}]},{"word":"MEMORABLE","idx":10726,"count":4538880,"meanings":[{"definitions":[{"definition":"Worthy to be remembered; very important or remarkable."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmɛm(ə)ɹəbl̩/"}]},{"word":"REFUNDS","idx":10727,"count":4536684,"meanings":[{"definitions":[{"definition":"An amount of money returned.","example":"If the camera is faulty, you can return it to the store where you bought it for a full refund."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To return (money) to (someone); to reimburse.","example":"If you find this computer for sale anywhere at a lower price, we'll refund you the difference."},{"definition":"To supply again with funds.","example":"to refund a railroad loan"},{"definition":"To pour back."}],"partOfSpeech":"ve"}]},{"word":"NEWSROOM","idx":10728,"count":4536493,"meanings":[{"definitions":[{"definition":"The office of a news organisation, especially that part of it where the journalists work and news stories are processed."},{"definition":"A room where newspapers and magazines are available for reading."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnjuːzɹuːm/"}]},{"word":"PROFESSORS","idx":10730,"count":4534761,"meanings":[{"definitions":[{"definition":"The most senior rank for an academic at a university or similar institution, informally also known as \"full professor.\" Abbreviated Prof."},{"definition":"A teacher or faculty member at a college or university regardless of formal rank."},{"definition":"One who professes something, such as a religious doctrine."},{"definition":"A pianist in a saloon, brothel, etc."},{"definition":"The puppeteer who performs a Punch and Judy show; a Punchman."}],"partOfSpeech":"n"}]},{"word":"MONUMENT","idx":10732,"count":4533122,"meanings":[{"definitions":[{"definition":"A structure built for commemorative or symbolic reasons, or as a memorial; a commemoration.","example":"There is a monument on the town green to the soldiers who died in World War I."},{"definition":"An important site owned by the community as a whole."},{"definition":"An exceptional or proud achievement."},{"definition":"An important burial vault or tomb."},{"definition":"A legal document."},{"definition":"A surveying reference point marked by a permanently fixed marker (a survey monument)."},{"definition":"A pile of stones left by a prospector to claim ownership of ore etc. found in a mine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark or memorialize with a monument."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"monument-us","text":"/ˈmɑnjəmənt/"}]},{"word":"TAXPAYER","idx":10733,"count":4531596,"meanings":[{"definitions":[{"definition":"A person who is subject to, liable for, or pays tax as opposed to a nontaxpayer who is neither the subject nor the object of revenue laws."},{"definition":"All of the people, collectively, in a population who pay tax (especially used in the context of the government financing something using the tax revenue).","example":"1945: I got into the bus full of taxpayers who were giving some money to a taxpayer who had on his taxpayer's stomach a little box which allowed the other taxpayers to continue their taxpayers' journeys. I noticed in this bus a taxpayer with a long taxpayer's neck and whose taxpayer's head bore a taxpayer's felt hat encircled by a plait the like of which no taxpayer ever wore before. Suddenly the said taxpayer peremptorily addressed a nearby taxpayer, complaining bitterly that he was purposely treading on his taxpayer's toes every time other taxpayers got on or off the taxpayers' bus. Then the angry taxpayer went and sat down in a seat for taxpayers which another taxpayer had just vacated. — Raymond Queneau, 'from Polyptotes' in Exercises in Style, 1945 (Eng. 1958)"}],"partOfSpeech":"n"}]},{"word":"FORMALLY","idx":10735,"count":4530725,"meanings":[{"definitions":[{"definition":"In a formal manner.","example":"He was dressed too formally for the occasion."},{"definition":"In accordance with official procedure.","example":"He formally filed a complaint, which involved much paperwork."},{"definition":"In accordance with rigorous rules.","example":"He proved it formally but gave his students no intuitive feel for the matter."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈfɔɹməli/"},{"text":"/ˈfɔːməli/"}]},{"word":"COLA","idx":10736,"count":4530545,"meanings":[{"definitions":[{"definition":"The kola plant, genus Cola, famous for its nut, or one of these nuts."},{"definition":"A beverage or a drink made with kola nut flavoring, caramel and carbonated water."},{"definition":"The punctuation mark \":\"."},{"definition":"The triangular colon (especially in context of not being able to type the actual triangular colon)."},{"definition":"A rhetorical figure consisting of a clause which is grammatically, but not logically, complete."},{"definition":"A clause or group of clauses written as a line, or taken as a standard of measure in ancient manuscripts or texts."},{"definition":"Part of the large intestine; the final segment of the digestive system, after (distal to) the ileum and before (proximal to) the anus."},{"definition":"A cluster of buds on a cannabis plant."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkoʊlə/"},{"text":"/ˈkəʊ.lə/"}]},{"word":"TWAIN","idx":10737,"count":4530277,"meanings":[{"definitions":[{"definition":"Pair, couple"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Twofold"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Two","example":"Bring me these twain cups of wine and water, and let us drink from the one we feel more befitting of this day."}],"partOfSpeech":"nu"},{"definitions":[{"definition":"To part in twain; divide; sunder."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"twain-us","text":"/tweɪn/"}]},{"word":"ILE","idx":10738,"count":4529880,"meanings":[{"definitions":[{"definition":"An ear of corn."},{"definition":"A wing of a building, notably in a church separated from the nave proper by piers."},{"definition":"A clear path through rows of seating."},{"definition":"A clear corridor in a supermarket with shelves on both sides containing goods for sale."},{"definition":"Any path through an otherwise obstructed space."},{"definition":"Seat in public transport, such as a plane, train or bus, that's beside the aisle.","example":"Do you want to seat window or aisle?"},{"definition":"An idiomatic divide between the Republican Party and the Democratic Party, who are said to be on two sides of the aisle."},{"definition":"A wing of a building, notably in a church separated from the nave proper by piers."},{"definition":"A clear path through rows of seating."},{"definition":"A clear corridor in a supermarket with shelves on both sides containing goods for sale."},{"definition":"Any path through an otherwise obstructed space."},{"definition":"Seat in public transport, such as a plane, train or bus, that's beside the aisle.","example":"Do you want to seat window or aisle?"},{"definition":"An idiomatic divide between the Republican Party and the Democratic Party, who are said to be on two sides of the aisle."},{"definition":"A (small) island, compare with islet."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ile-uk","text":"/aɪl/"}]},{"word":"DEW","idx":10743,"count":4526551,"meanings":[{"definitions":[{"definition":"Any moisture from the atmosphere condensed by cool bodies upon their surfaces."},{"definition":"Moisture in the air that settles on plants, etc in the morning, resulting in drops."},{"definition":"(but see usage notes) An instance of such moisture settling on plants, etc.","example":"There was a heavy dew this morning."},{"definition":"Anything that falls lightly and in a refreshing manner."},{"definition":"An emblem of morning, or fresh vigour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wet with, or as if with, dew; to moisten."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dew-us","text":"/du/"},{"audio":"dew-uk","text":"/djuː/"}]},{"word":"LAVENDER","idx":10744,"count":4526547,"meanings":[{"definitions":[{"definition":"Any of a group of European plants, genus, Lavandula, of the mint family."},{"definition":"A pale purple colour, like that of the lavender flower."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate or perfume with lavender."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a pale purple colour."},{"definition":"Pertaining to LGBT people and rights"},{"definition":"Pertaining to lesbian feminism; opposing heterosexism."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈlæv.ən.dɚ/"},{"text":"/ˈlæv.ən.də/"}]},{"word":"REFINANCING","idx":10745,"count":4525870,"meanings":[{"definitions":[{"definition":"To renew the terms of a loan."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"One or more loans or other borrowings that repay and replace previous financings."}],"partOfSpeech":"n"}]},{"word":"JUSTIFIED","idx":10746,"count":4525307,"meanings":[{"definitions":[{"definition":"Having a justification.","example":"The act was fully justified."},{"definition":"Of text, arranged on a page or a computer screen such that the left and right ends of all lines within paragraphs are aligned."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To provide an acceptable explanation for.","example":"How can you justify spending so much money on clothes?"},{"definition":"To be a good, acceptable reason for; warrant.","example":"Nothing can justify your rude behaviour last night."},{"definition":"To arrange (text) on a page or a computer screen such that the left and right ends of all lines within paragraphs are aligned.","example":"The text will look better justified."},{"definition":"To absolve, and declare to be free of blame or sin."},{"definition":"To give reasons for one’s actions; to make an argument to prove that one is in the right.","example":"She felt no need to justify herself for deciding not to invite him."},{"definition":"To prove; to ratify; to confirm."},{"definition":"To show (a person) to have had a sufficient legal reason for an act that has been made the subject of a charge or accusation."},{"definition":"To qualify (oneself) as a surety by taking oath to the ownership of sufficient property."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"justified-us","text":"/ˈdʒʌstɪfaɪd/"}]},{"word":"WITHDRAWN","idx":10747,"count":4524191,"meanings":[{"definitions":[{"definition":"To pull (something) back, aside, or away."},{"definition":"To stop talking to, or interacting with, other people and start thinking thoughts that are not related to what is happening around."},{"definition":"To take back (a comment, etc); retract.","example":"to withdraw false charges"},{"definition":"To remove, to stop providing (one's support, etc); to take out of service."},{"definition":"To extract (money from an account)."},{"definition":"To retreat."},{"definition":"To be in withdrawal from an addictive drug etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Removed from circulation","example":"a withdrawn library book"},{"definition":"Introverted; not inclined to interact with other people","example":"a withdrawn child"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"withdrawn-us","text":"/wɪðˈdɹɔːn/"}]},{"word":"BREEZE","idx":10748,"count":4523241,"meanings":[{"definitions":[{"definition":"A light, gentle wind.","example":"The breeze rustled the papers on her desk."},{"definition":"Any activity that is easy, not testing or difficult.","example":"After studying Latin, Spanish was a breeze."},{"definition":"Wind blowing across a cricket match, whatever its strength."},{"definition":"Ashes and residue of coal or charcoal, usually from a furnace. See Wikipedia article on Clinker."},{"definition":"An excited or ruffled state of feeling; a flurry of excitement; a disturbance; a quarrel.","example":"The discovery produced a breeze."},{"definition":"A brief workout for a racehorse."},{"definition":"A gadfly; a horsefly; a strong-bodied dipterous insect of the family Tabanidae."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually with along) To move casually, in a carefree manner."},{"definition":"To blow gently."},{"definition":"To take a horse on a light run in order to understand the running characteristics of the horse and to observe it while under motion."},{"definition":"To buzz."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"breeze-us","text":"/bɹiːz/"},{"audio":"breeze-au","text":"/bɹiːz/"}]},{"word":"DEBATES","idx":10749,"count":4522758,"meanings":[{"definitions":[{"definition":"An argument, or discussion, usually in an ordered or formal setting, often with more than two people, generally ending with a vote or other decision.","example":"After a four-hour debate, the committee voted to table the motion."},{"definition":"An informal and spirited but generally civil discussion of opposing views.","example":"The debate over the age of the universe is thousands of years old."},{"definition":"Discussion of opposing views.","example":"There has been considerable debate concerning exactly how to format these articles."},{"definition":"(frequently in the French form débat) A type of literary composition, taking the form of a discussion or disputation, commonly found in the vernacular medieval poetry of many European countries, as well as in medieval Latin."},{"definition":"Strife, discord."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To participate in a debate; to dispute, argue, especially in a public arena.","example":"\"Debate me, coward!\" snarled the completely normal intellectual."},{"definition":"To fight."},{"definition":"To engage in combat for; to strive for."},{"definition":"To consider (to oneself), to think over, to attempt to decide","example":"He was debating where he'd spend his holiday."}],"partOfSpeech":"ve"}]},{"word":"GEMS","idx":10750,"count":4520987,"meanings":[{"definitions":[{"definition":"A precious stone, usually of substantial monetary value or prized for its beauty or shine."},{"definition":"Any precious or highly valued thing or person.","example":"She's an absolute gem."},{"definition":"Anything of small size, or expressed within brief limits, which is regarded as a gem on account of its beauty or value, such as a small picture, a verse of poetry, or an epigram.","example":"a gem of wit"},{"definition":"A gemma or leaf-bud."},{"definition":"A type of geometrid moth, Orthonama obstipata."},{"definition":"A package containing programs or libraries for the Ruby programming language."},{"definition":"A size of type between brilliant (4-point) and diamond (4½-point), running 222 lines to the foot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To adorn with, or as if with, gems."}],"partOfSpeech":"ve"}]},{"word":"CERT","idx":10751,"count":4520520,"meanings":[{"definitions":[{"definition":"Certificate.","example":"I bought some gift certs for my family for Christmas."},{"definition":"A certainty; something guaranteed to happen."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Abbreviation of certified."}],"partOfSpeech":"j"}]},{"word":"DOCTORAL","idx":10753,"count":4516544,"meanings":[{"definitions":[{"definition":"Relating to a doctorate."},{"definition":"Pertaining to a medical doctor or physician."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɒktəɹəl/"}]},{"word":"BACKPACK","idx":10754,"count":4514732,"meanings":[{"definitions":[{"definition":"A knapsack, sometimes mounted on a light frame, but always supported by straps, worn on a person’s back for the purpose of carrying things, especially when hiking, or on a student's back when carrying books."},{"definition":"A similarly placed item containing a parachute or other life-support equipment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hike and camp overnight in backcountry with one's gear carried in a backpack"},{"definition":"To engage in low-cost, generally urban, travel with minimal luggage and frugal accommodations"},{"definition":"To place or carry (an item or items) in a backpack"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"backpack-uk","text":"/ˈbæk.pæk/"}]},{"word":"IDENTITIES","idx":10756,"count":4513660,"meanings":[{"definitions":[{"definition":"Sameness, identicalness; the quality or fact of (several specified things) being the same."},{"definition":"The difference or character that marks off an individual or collective from the rest of the same kind, selfhood, sense of who something or someone or oneself is, or the recurring characteristics that enable the recognition of such an individual or group by others or themself.","example":"I've been through so many changes, I have no sense of identity."},{"definition":"A name or persona—a mask or appearance one presents to the world—by which one is known.","example":"This criminal has taken on several identities."},{"definition":"An equation which always holds true regardless of the choice of input variables."},{"definition":"Any function which maps all elements of its domain to themselves."},{"definition":"An element of an algebraic structure which, when applied to another element under an operation in that structure, yields this second element."},{"definition":"A well-known or famous person.","example":"2013 April 4, \"Cricket identities consult lawyers\", New Zealand Herald"}],"partOfSpeech":"n"}]},{"word":"OUTGOING","idx":10757,"count":4513500,"meanings":[{"definitions":[{"definition":"To go out, to set forth."},{"definition":"To go further; to exceed or surpass; go beyond."},{"definition":"To overtake; to travel faster than."},{"definition":"To outdo; exceed; surpass."},{"definition":"To come to an end."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of leaving or going out; exit, departure."},{"definition":"(chiefly in the plural) Money that leaves one's possession; expenditure, outlay, expense."},{"definition":"The extreme limit; the place of ending."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Extraverted: talkative, friendly, and social, especially with respect to meeting new people easily and comfortably.","example":"Tom is very outgoing and enjoys meeting people; his brother, on the other hand, is painfully shy."},{"definition":"Going out, on its way out.","example":"Is there any outgoing post?"},{"definition":"Being replaced in office (while still in office but after election has determined that he/she will be replaced).","example":"The outgoing politician wasn't too disappointed he'd lost the election; he was tired of political infighting."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"outgoing-uk"}]},{"word":"YANKEE","idx":10760,"count":4510747,"meanings":[{"definitions":[{"definition":"A headsail resembling a genoa or a jib but with a high-cut clew, normally used together with a staysail. A sailing boat is typically equipped with three yankee sails of different sizes, number one being the largest."}],"partOfSpeech":"n"}]},{"word":"OUTS","idx":10762,"count":4507979,"meanings":[{"definitions":[{"definition":"A means of exit, escape, reprieve, etc.","example":"They wrote the law to give those organizations an out."},{"definition":"A state in which a member of the batting team is removed from play due to the application of various rules of the game such as striking out, hitting a fly ball which is caught by the fielding team before bouncing, etc."},{"definition":"A dismissal; a state in which a member of the batting team finishes his turn at bat, due to the application of various rules of the game, such as the bowler knocking over the batsman's wicket with the ball."},{"definition":"A card which can make a hand a winner."},{"definition":"A trip out; an outing."},{"definition":"(chiefly in the plural) One who, or that which, is out; especially, one who is out of office."},{"definition":"A place or space outside of something; a nook or corner; an angle projecting outward; an open space."},{"definition":"A word or words omitted by the compositor in setting up copy; an omission."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eject; to expel."},{"definition":"To reveal (a person) as LGBT+ (gay, trans, etc)."},{"definition":"To reveal (a person or organization) as having a certain secret, such as a being a secret agent or undercover detective."},{"definition":"To reveal (a secret).","example":"A Brazilian company outed the new mobile phone design."},{"definition":"To come or go out; to get out or away; to become public or apparent."}],"partOfSpeech":"ve"}]},{"word":"SNACKS","idx":10763,"count":4505575,"meanings":[{"definitions":[{"definition":"A light meal."},{"definition":"An item of food eaten between meals."},{"definition":"A very sexy and attractive person."},{"definition":"A share; a part or portion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat a light meal."},{"definition":"To eat between meals."},{"definition":"To snatch."},{"definition":"To bite."},{"definition":"To share."}],"partOfSpeech":"ve"}]},{"word":"DEFICIENCY","idx":10764,"count":4505086,"meanings":[{"definitions":[{"definition":"Inadequacy or incompleteness."},{"definition":"An insufficiency, especially of something essential to health."},{"definition":"The amount by which the number of double points on a curve is short of the maximum for curves of the same degree."},{"definition":"The codimension of a linear system in the corresponding complete linear system."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈfɪʃənsi/"}]},{"word":"BOOSTER","idx":10765,"count":4503857,"meanings":[{"definitions":[{"definition":"Something that boosts."},{"definition":"The first stage of a multistage rocket that provides the thrust for liftoff and the initial flight"},{"definition":"A motor-generator set used for voltage regulation in direct current electrical power circuits."},{"definition":"Someone who is a fan or supporter of something."},{"definition":"Someone who promotes a town or business"},{"definition":"A member of a booster club."},{"definition":"A booster dose.","example":"When did you get your last tetanus booster?"},{"definition":"A term that serves to amplify or strengthen an utterance, such as \"really\"."},{"definition":"A power-up item."},{"definition":"A package of cards or figurines designed to add to a player's collection."},{"definition":"A thief.","example":"The security guard captured two boosters before they could exit the retail store."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbustɚ/"},{"audio":"booster-au"}]},{"word":"TAXABLE","idx":10766,"count":4503785,"meanings":[{"definitions":[{"definition":"Something on which tax must be paid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Subject to taxation."}],"partOfSpeech":"j"}]},{"word":"GUM","idx":10767,"count":4503031,"meanings":[{"definitions":[{"definition":"(often in the plural) The flesh around the teeth."},{"definition":"Any of various viscous or sticky substances that are exuded by certain plants."},{"definition":"Any viscous or sticky substance resembling those that are exuded by certain plants."},{"definition":"Chewing gum."},{"definition":"A single piece of chewing gum.","example":"Do you have a gum to spare?"},{"definition":"(often in the plural) A gummi candy."},{"definition":"A hive made of a section of a hollow gum tree; hence, any roughly made hive."},{"definition":"A vessel or bin made from a hollow log."},{"definition":"A rubber overshoe."},{"definition":"A gum tree."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To chew, especially of a toothless person or animal."},{"definition":"To deepen and enlarge the spaces between the teeth of (a worn saw), as with a gummer."},{"definition":"(sometimes with up) To apply an adhesive or gum to; to make sticky by applying a sticky substance to."},{"definition":"To stiffen with glue or gum."},{"definition":"(sometimes with together) To inelegantly attach into a sequence."},{"definition":"(with up) To impair the functioning of a thing or process.","example":"That cheap oil will gum up the engine valves."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gum-us","text":"/ɡʌm/"}]},{"word":"PROGRESSION","idx":10768,"count":4501732,"meanings":[{"definitions":[{"definition":"The act of moving from one thing to another."},{"definition":"The act of moving forward or proceeding in a course; motion onward."},{"definition":"A sequence obtained by adding or multiplying each term by a constant."},{"definition":"Development, increase, evolution."},{"definition":"Chord progression"},{"definition":"(exercise) The making an exercise more exerting by manipulating the details of its performance like loaded weight, range of motion, angle, speed."}],"partOfSpeech":"n"}]}]