[{"word":"FORTITUDE","idx":39595,"count":497342,"meanings":[{"definitions":[{"definition":"Mental or emotional strength that enables courage in the face of adversity."},{"definition":"Physical strength."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɔːtɪtjuːd/"}]},{"word":"ALOFT","idx":39596,"count":497342,"meanings":[{"definitions":[{"definition":"At, to, or in the air or sky.","example":"high winds aloft"},{"definition":"Above, overhead, in a high place; up."},{"definition":"In the top, at the masthead, or on the higher yards or rigging."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"aloft-us","text":"/əˈlɔft/"}]},{"word":"SHEETING","idx":39598,"count":497248,"meanings":[{"definitions":[{"definition":"To cover or wrap with cloth, or paper, or other similar material.","example":"Remember to sheet the floor before you start painting."},{"definition":"To form into sheets."},{"definition":"Of rain, or other precipitation, to pour heavily.","example":"We couldn't go out because the rain was sheeting down all day long."},{"definition":"To trim a sail using a sheet."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fabric used to make sheets (bedding)."},{"definition":"The process of forming material into sheets."},{"definition":"A lining of planks or boards for protecting an embankment."},{"definition":"A weathering process in which rock breaks into sheets after compressional stress on it is removed."}],"partOfSpeech":"n"}]},{"word":"HALLWAYS","idx":39599,"count":497169,"meanings":[{"definitions":[{"definition":"A corridor in a building that connects rooms."}],"partOfSpeech":"n"}]},{"word":"MATED","idx":39600,"count":497140,"meanings":[{"definitions":[{"definition":"To put the king of an opponent into checkmate.","example":"That jerk checkmated me in four moves!"},{"definition":"(by extension) To place in a losing situation that has no escape."},{"definition":"To match, fit together without space between.","example":"The pieces of the puzzle mate perfectly."},{"definition":"To copulate."},{"definition":"To pair in order to raise offspring"},{"definition":"To arrange in matched pairs."},{"definition":"To introduce (animals) together for the purpose of breeding."},{"definition":"(of an animal) To copulate with."},{"definition":"To marry; to match (a person)."},{"definition":"To match oneself against; to oppose as equal; to compete with."},{"definition":"To fit (objects) together without space between."},{"definition":"To move (a space shuttle orbiter) onto the back of an aircraft that can carry it."},{"definition":"To confuse; to confound."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fitted together or interlocked"}],"partOfSpeech":"j"}]},{"word":"WART","idx":39601,"count":497136,"meanings":[{"definitions":[{"definition":"A type of deformed growth occurring on the skin caused by the human papillomavirus (HPV)."},{"definition":"Any similar growth occurring in plants or animals, such as the parotoid glands in the back of toads."},{"definition":"Any of the prefixes used in Hungarian notation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wart-us","text":"/wɔɹt/"}]},{"word":"SNOOZE","idx":39603,"count":497075,"meanings":[{"definitions":[{"definition":"A brief period of sleep; a nap.","example":"The cat enjoys taking a snooze on a sunny windowsill."},{"definition":"The snooze button on an alarm clock."},{"definition":"Something boring.","example":"The whole movie was a snooze."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sleep, especially briefly; to nap, doze.","example":"The boss caught him snoozing at his desk."},{"definition":"To pause; to postpone for a short while."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/snʉːz/"}]},{"word":"KESTREL","idx":39606,"count":497006,"meanings":[{"definitions":[{"definition":"Any of various small falcons of the genus Falco that hover while hunting."},{"definition":"The common kestrel, Falco tinnunculus."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɛstɹəl/"}]},{"word":"PRAWNS","idx":39609,"count":496933,"meanings":[{"definitions":[{"definition":"Pornography.","example":"I just delete the porn before someone else uses the computer."},{"definition":"(chiefly in the plural) A pornographic work."},{"definition":"Material, usually visual, presenting something desirable in a sensational manner.","example":"car porn"},{"definition":"Material that provides illicit gratification of an obsessive or unhealthy interest in something."},{"definition":"A crustacean of the suborder Dendrobranchiata."},{"definition":"A crustacean sometimes confused with shrimp."},{"definition":"A woman with a very toned body, but an unattractive face.","example":"She's a prawn!"},{"definition":"A fool, an idiot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for prawns."}],"partOfSpeech":"ve"}]},{"word":"NONPARTISAN","idx":39610,"count":496929,"meanings":[{"definitions":[{"definition":"One who is not a partisan."},{"definition":"A person who has not selected or declared a side or party."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not partisan; impartial and unbiased"}],"partOfSpeech":"j"}]},{"word":"NAPS","idx":39611,"count":496868,"meanings":[{"definitions":[{"definition":"A short period of sleep, especially one during the day."},{"definition":"A soft or fuzzy surface, generally on fabric or leather."},{"definition":"The common direction, on some kinds of fabric, of the hairs making up the pile.","example":"If the fabric has a nap, make sure all pieces are cut with the nap going the same direction."},{"definition":"A type of bet in British horse racing, based on the experts' best tips."},{"definition":"A card game in which players take tricks; properly Napoleon."},{"definition":"A bid to take five tricks in the card game Napoleon."},{"definition":"(dialectal, Northern England, Scotland) A cup, bowl."},{"definition":"Kinky or curly hair"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have a nap; to sleep for a short period of time, especially during the day."},{"definition":"To be off one's guard.","example":"The regulators were caught napping by the financial collapse."},{"definition":"To form or raise a soft or fuzzy surface on (fabric or leather)."},{"definition":"To grab; to nab."},{"definition":"To cover (something) with a sauce (usually in passive)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"naps-au"}]},{"word":"RUFFLED","idx":39612,"count":496847,"meanings":[{"definitions":[{"definition":"To make a ruffle in; to curl or flute, as an edge of fabric.","example":"Ruffle the end of the cuff."},{"definition":"To disturb; especially, to cause to flutter.","example":"Her sudden volley of insults ruffled his composure."},{"definition":"To grow rough, boisterous, or turbulent."},{"definition":"To become disordered; to play loosely; to flutter."},{"definition":"To be rough; to jar; to be in contention; hence, to put on airs; to swagger."},{"definition":"To make into a ruff; to draw or contract into puckers, plaits, or folds; to wrinkle."},{"definition":"To erect in a ruff, as feathers."},{"definition":"To beat with the ruff or ruffle, as a drum."},{"definition":"To throw together in a disorderly manner."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having ruffles.","example":"It would have slid easily across the floor if not for the ruffled undersurface causing friction."},{"definition":"Puffed up like a bird's feathers."},{"definition":"Bothered."}],"partOfSpeech":"j"}]},{"word":"ARMAMENT","idx":39614,"count":496826,"meanings":[{"definitions":[{"definition":"A body of forces equipped for war."},{"definition":"All the cannon and small arms collectively, with their equipments, belonging to a ship or a fortification."},{"definition":"Any equipment for resistance."},{"definition":"The process of building up military capacity."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɑː(ɹ)məmənt/"}]},{"word":"PLUMS","idx":39616,"count":496751,"meanings":[{"definitions":[{"definition":"The fruit and its tree."},{"definition":"Extended senses."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To plumb."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/plʌmz/"}]},{"word":"REVISITING","idx":39619,"count":496718,"meanings":[{"definitions":[{"definition":"To visit again."},{"definition":"To reconsider or re-experience something."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of visiting again."}],"partOfSpeech":"n"}]},{"word":"FAIRER","idx":39621,"count":496708,"meanings":[{"definitions":[{"definition":"Beautiful, of a pleasing appearance, with a pure and fresh quality.","example":"Monday's child is fair of face."},{"definition":"Unblemished (figuratively or literally); clean and pure; innocent.","example":"After scratching out and replacing various words in the manuscript, he scribed a fair copy to send to the publisher."},{"definition":"Light in color, pale, particularly with regard to skin tone but also referring to blond hair.","example":"She had fair hair and blue eyes."},{"definition":"Just, equitable.","example":"He must be given a fair trial."},{"definition":"Adequate, reasonable, or decent.","example":"The patient was in a fair condition after some treatment."},{"definition":"(of a wind) Favorable to a ship's course."},{"definition":"Not overcast; cloudless; clear; pleasant; propitious; said of the sky, weather, or wind, etc.","example":"a fair sky;  a fair day"},{"definition":"Free from obstacles or hindrances; unobstructed; unencumbered; open; direct; said of a road, passage, etc.","example":"a fair mark;  in fair sight;  a fair view"},{"definition":"Without sudden change of direction or curvature; smooth; flowing; said of the figure of a vessel, and of surfaces, water lines, and other lines."},{"definition":"Between the baselines."},{"definition":"(of a catch) Taken direct from an opponent's foot, without the ball touching the ground or another player."},{"definition":"(of a ball delivered by the bowler) Not a no-ball."},{"definition":"Of a coin or die, having equal chance of landing on any side, unbiased."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɛɹɚ/"},{"text":"/ˈfɛəɹə(ɹ)/"}]},{"word":"HOPPERS","idx":39622,"count":496700,"meanings":[{"definitions":[{"definition":"One who or that which hops."},{"definition":"A temporary storage bin, filled from the top and emptied from the bottom, often funnel-shaped."},{"definition":"A funnel-shaped section at the top of a drainpipe used to collect water, from above, from one or more smaller drainpipes."},{"definition":"A device that feeds material into a machine."},{"definition":"Various insects"},{"definition":"An artificial fishing lure.","example":"To catch a big fish, use a hopper that jumps across the pond surface."},{"definition":"A toilet."},{"definition":"An escapement lever in a piano."},{"definition":"The game of hopscotch."},{"definition":"A window with hinges at the bottom, opened by tilting vertically."},{"definition":"A hopper car."},{"definition":"A fairy chess piece which moves only by jumping over another piece."},{"definition":"A person or machine that picks hops."},{"definition":"A Sri Lankan food made from a fermented batter of rice flour, coconut milk, and palm toddy or yeast."}],"partOfSpeech":"n"}]},{"word":"ONSCREEN","idx":39623,"count":496690,"meanings":[{"definitions":[{"definition":"As seen on a screen (as of television, film, or computer) rather than in real life.","example":"The two actors had a very realistic on-screen romance, but in reality they couldn't stand each other."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Inside the frame of the cinema, television or computer screen."}],"partOfSpeech":"v"}]},{"word":"DISTILLERS","idx":39625,"count":496678,"meanings":[{"definitions":[{"definition":"A person who distills, especially alcoholic spirits or hard liquor by a process of distillation; a person who owns, works in or operates a distillery."},{"definition":"A device or apparatus that distills, a condenser; a still."},{"definition":"A company whose business is distilling, especially one that manufactures alcoholic spirits or liquor."}],"partOfSpeech":"n"}]},{"word":"ENTERPRISING","idx":39626,"count":496658,"meanings":[{"definitions":[{"definition":"To undertake an enterprise, or something hazardous or difficult."},{"definition":"To undertake; to begin and attempt to perform; to venture upon."},{"definition":"To treat with hospitality; to entertain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The undertaking of an enterprise; purposeful activity; doings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Displaying bravery and daring in attempting some task."},{"definition":"Very able and ingenious in business dealings."}],"partOfSpeech":"j"}]},{"word":"COCKSUCKERS","idx":39630,"count":496570,"meanings":[{"definitions":[{"definition":"(strongly vulgar) Someone who performs fellatio."},{"definition":"(strongly vulgar) A very annoying or objectionable person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cocksuckers"}]},{"word":"HYPERTENSIVE","idx":39632,"count":496525,"meanings":[{"definitions":[{"definition":"A person with hypertension"},{"definition":"A drug that increases blood pressure"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, pertaining to, or causing hypertension."}],"partOfSpeech":"j"}]},{"word":"CHINCHILLA","idx":39634,"count":496483,"meanings":[{"definitions":[{"definition":"Either of two small, crepuscular rodents of the genus Chinchilla, native to the Andes, prized for their very soft fur and often kept as pets."},{"definition":"The fur of a chinchilla, used for clothing."},{"definition":"A variety of Persian cat with white fur and green eyes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"chinchilla-uk","text":"/tʃɪnˈtʃɪlə/"}]},{"word":"TRANSFORMATIONAL","idx":39636,"count":496442,"meanings":[{"definitions":[{"definition":"Of, pertaining to or leading to transformation"}],"partOfSpeech":"j"}]},{"word":"SAILBOATS","idx":39637,"count":496436,"meanings":[{"definitions":[{"definition":"A boat propelled by a sail."},{"definition":"A playing card with the rank of four."}],"partOfSpeech":"n"}]},{"word":"PRIDES","idx":39641,"count":496383,"meanings":[{"definitions":[{"definition":"The quality or state of being proud; an unreasonable overestimation of one's own superiority in terms of talents, looks, wealth, importance etc., which manifests itself in lofty airs, distance, reserve and often contempt of others."},{"definition":"(often with of or in) A sense of one's own worth, and abhorrence of what is beneath or unworthy of one; lofty self-respect; noble self-esteem; elevation of character; dignified bearing; proud delight; -- in a good sense.","example":"He had pride of ownership in his department."},{"definition":"Proud or disdainful behavior or treatment; insolence or arrogance of demeanor; haughty bearing and conduct; insolent exultation; disdain; hubris."},{"definition":"That of which one is proud; that which excites boasting or self-congratulation; the occasion or ground of self-esteem, or of arrogant and presumptuous confidence, as beauty, ornament, noble character, children, etc."},{"definition":"Show; ostentation; glory."},{"definition":"Highest pitch; elevation reached; loftiness; prime; glory,","example":"to be in the pride of one's life."},{"definition":"Consciousness of power; fullness of animal spirits; mettle; wantonness."},{"definition":"Lust; sexual desire; especially, excitement of sexual appetite in a female beast."},{"definition":"(collective) A company of lions or other large felines.","example":"A pride of lions often consists of a dominant male, his harem and their offspring, but young adult males 'leave home' to roam about as bachelors pride until able to seize/establish a family pride of their own."},{"definition":"The small European lamprey species Petromyzon branchialis."},{"definition":"Alternative letter-case form of Pride."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take or experience pride in something; to be proud of it.","example":"I pride myself on being a good judge of character."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɹaɪdz/"}]},{"word":"EXEMPLIFIES","idx":39642,"count":496379,"meanings":[{"definitions":[{"definition":"To show or illustrate by example."},{"definition":"To be an instance of or serve as an example."},{"definition":"To make an attested copy or transcript of (a document) under seal."},{"definition":"To prove by such an attested copy or transcript."}],"partOfSpeech":"ve"}]},{"word":"ARRHYTHMIA","idx":39643,"count":496374,"meanings":[{"definitions":[{"definition":"An irregular heartbeat."},{"definition":"A disease entity involving such beats, such as atrial fibrillation, ventricular tachycardia, AV nodal reentrant tachycardia, or others."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/eɪˈɹɪðmɪə/"}]},{"word":"WORKWEAR","idx":39645,"count":496279,"meanings":[{"definitions":[{"definition":"Clothes designed to be worn while working, especially in a physically demanding job."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɝkwɛɹ/"},{"text":"/ˈwɜːkwɛə/"}]},{"word":"GRAFTING","idx":39646,"count":496263,"meanings":[{"definitions":[{"definition":"To insert (a graft) in a branch or stem of another tree; to propagate by insertion in another stock; also, to insert a graft upon."},{"definition":"To insert scions (grafts) from one tree, or kind of tree, etc., into another; to practice grafting."},{"definition":"To implant a portion of (living flesh or akin) in a lesion so as to form an organic union."},{"definition":"To join (one thing) to another as if by grafting, so as to bring about a close union."},{"definition":"To cover, as a ring bolt, block strap, splicing, etc., with a weaving of small cord or rope-yarns."},{"definition":"To form a graft polymer"},{"definition":"To work."},{"definition":"To obtain illegal gain from bribery or similar corrupt practices."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act, art, or process of inserting grafts."},{"definition":"The act or method of weaving a cover for a ring, rope end, etc."},{"definition":"The transplanting of a portion of flesh or skin to a denuded surface; autoplastic."},{"definition":"A scarfing or endwise attachment of one timber to another."}],"partOfSpeech":"n"}]},{"word":"SMOOTHNESS","idx":39647,"count":496233,"meanings":[{"definitions":[{"definition":"The condition of being smooth; the degree or measure of said condition."},{"definition":"(of a function) The highest order of derivative (the differentiability class) over a given domain.","example":"Smoothness can vary from 0 (for a nondifferentiable function) to infinity (for a smooth function)."},{"definition":"(approximation theory, numerical analysis, of a function) The quantity measured by the modulus of smoothness."}],"partOfSpeech":"n"}]},{"word":"TRINKET","idx":39648,"count":496217,"meanings":[{"definitions":[{"definition":"A small showy ornament or piece of jewelry","example":"That little trinket around her neck must have cost a bundle."},{"definition":"A thing of little value; a trifle; a toy.","example":"It's only a little trinket, but it reminds her of him."},{"definition":"A three-cornered sail formerly carried on a ship's foremast, probably on a lateen yard."},{"definition":"A knife; a cutting tool."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give trinkets; to court favour."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"trinket-us","text":"/ˈtɹɪŋkɪt/"}]},{"word":"TRANSPOSE","idx":39653,"count":496158,"meanings":[{"definitions":[{"definition":"(adjective) In matrix mathematics, the resulting matrix, derived from performing a transpose operation on a given matrix."},{"definition":"In matrix mathematics, the process of rearranging elements in a matrix, by interchanging their respective row and column positional indicators."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reverse or change the order of (two or more things); to swap or interchange."},{"definition":"To rewrite or perform (a piece) in another key."},{"definition":"To move (a term) from one side of an algebraic equation to the other, reversing the sign of the term."},{"definition":"To rearrange elements in a matrix, by interchanging their respective row and column positional indicators."},{"definition":"(chiefly of the European Union) To give force to a directive by passing appropriate implementation measures."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(adjective) In matrix mathematics, a matrix with the characteristic of having been transposed from a given matrix."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"transpose-1-us","text":"/tɹænzˈpəʊz/"}]},{"word":"NEUTRALIZE","idx":39655,"count":496130,"meanings":[{"definitions":[{"definition":"To make even, inactive or ineffective.","example":"The antidote neutralised the toxin."},{"definition":"To make (a territory, etc.) politically neutral.","example":"1965, United States. Congress. Senate, Hearings (volume 1, page 77)"},{"definition":"To make (an acidic or alkaline substance) chemically neutral."},{"definition":"To kill."}],"partOfSpeech":"ve"}]},{"word":"MICROECONOMICS","idx":39659,"count":496074,"meanings":[{"definitions":[{"definition":"The field of economics that deals with small-scale economic activities such as those of an individual or company."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌmaɪkɹəʊˌiːkəˈnɒnɪks/"}]},{"word":"TELLY","idx":39661,"count":496040,"meanings":[{"definitions":[{"definition":"Television.","example":"Not much on telly tonight, as usual!"},{"definition":"A television set.","example":"We've got a new flat-screen telly."},{"definition":"A hotel or motel.","example":"I'm staying at the telly this weekend."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛli/"}]},{"word":"GRANDSTAND","idx":39662,"count":496011,"meanings":[{"definitions":[{"definition":"The seating area at a stadium or arena; the bleachers."},{"definition":"The audience at a public event."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To behave dramatically or showily to impress an audience or observers; to pander to a crowd.","example":"Many politicians prefer to grandstand on hot-button issues rather than enact tough policy changes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"grandstand-us"}]},{"word":"SLURP","idx":39664,"count":495920,"meanings":[{"definitions":[{"definition":"A loud sucking noise made in eating or drinking"},{"definition":"A mouthful of liquid"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat or drink noisily.","example":"They sat in the kitchen slurping their spaghetti."},{"definition":"To make a loud sucking noise.","example":"The mud slurped under our shoes."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/slɝp/"}]},{"word":"PLAYWRIGHTS","idx":39665,"count":495871,"meanings":[{"definitions":[{"definition":"A writer and creator of theatrical plays."}],"partOfSpeech":"n"}]},{"word":"WISHFUL","idx":39666,"count":495862,"meanings":[{"definitions":[{"definition":"Wished-for; desired, wanted."},{"definition":"Expressing a wish or longing for something."},{"definition":"Aspiring, or seeking advancement."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈwɪʃfəl/"}]},{"word":"INSTANTIATED","idx":39673,"count":495824,"meanings":[{"definitions":[{"definition":"To represent (something) by a concrete instance."},{"definition":"To create an object (an instance) of a specific class."}],"partOfSpeech":"ve"}]},{"word":"TRAILED","idx":39674,"count":495781,"meanings":[{"definitions":[{"definition":"To follow behind (someone or something); to tail (someone or something).","example":"The hunters trailed their prey deep into the woods."},{"definition":"To drag (something) behind on the ground.","example":"You'll get your coat all muddy if you trail it around like that."},{"definition":"To leave (a trail of).","example":"He walked into the house, soaking wet, and trailed water all over the place."},{"definition":"To show a trailer of (a film, TV show etc.); to release or publish a preview of (a report etc.) in advance of the full publication.","example":"His new film was trailed on TV last night."},{"definition":"To hang or drag loosely behind; to move with a slow sweeping motion.","example":"The bride's long dress trailed behind her as she walked down the aisle."},{"definition":"To run or climb like certain plants."},{"definition":"To drag oneself lazily or reluctantly along.","example":"Our parents marched to church and we trailed behind."},{"definition":"To be losing, to be behind in a competition."},{"definition":"To carry (a firearm) with the breech near the ground and the upper part inclined forward, the piece being held by the right hand near the middle."},{"definition":"To flatten (grass, etc.) by walking through it; to tread down."},{"definition":"To take advantage of the ignorance of; to impose upon."}],"partOfSpeech":"ve"}]},{"word":"HABITATION","idx":39675,"count":495770,"meanings":[{"definitions":[{"definition":"The act of inhabiting; state of inhabiting or dwelling, or of being inhabited; occupancy."},{"definition":"A place of abode; settled dwelling; residence; house."},{"definition":"A group, lodge, or company, as of the Primrose League."},{"definition":"A farm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌhæb.ɪˈteɪ.ʃən/"}]},{"word":"ROGUES","idx":39676,"count":495745,"meanings":[{"definitions":[{"definition":"A scoundrel, rascal or unprincipled, deceitful, and unreliable person."},{"definition":"A mischievous scamp."},{"definition":"A vagrant."},{"definition":"Deceitful software pretending to be anti-spyware, but in fact being malicious software itself."},{"definition":"An aggressive animal separate from the herd, especially an elephant."},{"definition":"A plant that shows some undesirable variation."},{"definition":"A character class focusing on stealthy conduct."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cull; to destroy plants not meeting a required standard, especially when saving seed, rogue or unwanted plants are removed before pollination."},{"definition":"To cheat."},{"definition":"To give the name or designation of rogue to; to decry."},{"definition":"To wander; to play the vagabond; to play knavish tricks."}],"partOfSpeech":"ve"}]},{"word":"SPEECHLESS","idx":39677,"count":495724,"meanings":[{"definitions":[{"definition":"Not speaking; not knowing what to say; silent, especially due to surprise, amazement, etc.","example":"When he walked into his surprise birthday party, he was completely speechless."},{"definition":"Incapable of being spoken or uttered"},{"definition":"Unfit or not permitted to be spoken or described."},{"definition":"Extremely bad or objectionable.","example":"an unspeakable fool"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"speechless-us","text":"/ˈspiːtʃ.lɪs/"}]},{"word":"EXPANSE","idx":39678,"count":495684,"meanings":[{"definitions":[{"definition":"A wide stretch, usually of sea, sky, or land."},{"definition":"An amount of spread or stretch."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"expanse-uk","text":"/ɛkˈspæns/"}]},{"word":"STYLISTS","idx":39680,"count":495661,"meanings":[{"definitions":[{"definition":"Designer."},{"definition":"Hairdresser."},{"definition":"A writer or speaker distinguished for excellence or individuality of style; one who cultivates, or is a master or critic of, literary style."},{"definition":"An artist who has a particular distinctive style."}],"partOfSpeech":"n"}]},{"word":"BLACKWATER","idx":39681,"count":495653,"meanings":[{"definitions":[{"definition":"Water containing loam, tannins, etc., giving it a very dark appearance."},{"definition":"Blackwater fever; malaria caused by Plasmodium falciparum."},{"definition":"Waste from domestic toilets; water containing fecal matter."}],"partOfSpeech":"n"}]},{"word":"HIPPIES","idx":39683,"count":495633,"meanings":[{"definitions":[{"definition":"(1950s slang) A teenager who imitated the beatniks."},{"definition":"(1960s slang; still widely used in reference to that era) One who chooses not to conform to prevailing social norms: especially one who subscribes to values or actions such as acceptance or self-practice of recreational drug use, liberal or radical sexual mores, advocacy of communal living, strong pacifism or anti-war sentiment, etc."},{"definition":"(modern slang) A person who keeps an unkempt or sloppy appearance and wearing unusually long hair (for males), and because of it, often stereotyped as a deadbeat."},{"definition":"Someone who dresses in a hippie style."},{"definition":"One who is hip."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɪpiz/"}]},{"word":"PRESIDE","idx":39684,"count":495621,"meanings":[{"definitions":[{"definition":"To act as president or chairperson."},{"definition":"To exercise authority or control, oversit."},{"definition":"To be a featured solo performer."}],"partOfSpeech":"ve"}]},{"word":"PUL","idx":39685,"count":495593,"meanings":[{"definitions":[{"definition":"A subdivision of currency, equal to one hundredth of an Afghan afghani."}],"partOfSpeech":"n"}]},{"word":"LARKSPUR","idx":39686,"count":495550,"meanings":[{"definitions":[{"definition":"Any plant of the genera Delphinium or Consolida"},{"definition":"In particular, a tall robust flowering plant with many purplish-blue flowers, Delphinium glaucum."}],"partOfSpeech":"n"}]},{"word":"KEA","idx":39688,"count":495514,"meanings":[{"definitions":[{"definition":"Nestor notabilis, a parrot of New Zealand."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɪə/"}]},{"word":"DELIGHTFULLY","idx":39691,"count":495482,"meanings":[{"definitions":[{"definition":"In a delightful manner."}],"partOfSpeech":"v"}]},{"word":"OEUVRES","idx":39693,"count":495455,"meanings":[{"definitions":[{"definition":"A work of art."},{"definition":"The complete body of an artist's work."}],"partOfSpeech":"n"}]},{"word":"NEOCON","idx":39696,"count":495398,"meanings":[{"definitions":[{"definition":"A neoconservative."}],"partOfSpeech":"n"}]},{"word":"MUSSEL","idx":39702,"count":495250,"meanings":[{"definitions":[{"definition":"Any of several groups of bivalve shellfish with elongated, asymmetrical shells"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mussel-us","text":"/ˈmʌsəl/"}]},{"word":"CONCEALMENT","idx":39703,"count":495239,"meanings":[{"definitions":[{"definition":"The practice of keeping secrets."},{"definition":"The condition of being hidden or concealed."},{"definition":"Protection from observation or surveillance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"concealment-us","text":"/kənˈsiːlmənt/"}]},{"word":"DSO","idx":39707,"count":495191,"meanings":[{"definitions":[{"definition":"A male hybrid of a yak and a domesticated cow."}],"partOfSpeech":"n"}]},{"word":"UNRULY","idx":39713,"count":495055,"meanings":[{"definitions":[{"definition":"Wild; uncontrolled.","example":"The police gathered to contain the unruly mob."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈɹuːli/"}]},{"word":"ACCREDITING","idx":39714,"count":495041,"meanings":[{"definitions":[{"definition":"To ascribe; attribute; credit with."},{"definition":"To put or bring into credit; to invest with credit or authority; to sanction."},{"definition":"To send with letters credential, as an ambassador, envoy, or diplomatic agent; to authorize, as a messenger or delegate."},{"definition":"To believe; to put trust in."},{"definition":"To enter on the credit side of an account book."},{"definition":"To certify as meeting a predetermined standard; to certify an educational institution as upholding the specified standards necessary for the students to advance.","example":"The school was an accredited college."},{"definition":"To recognize as outstanding."},{"definition":"To credit."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈkɹɛdɪtɪŋ/"}]},{"word":"STAPLER","idx":39715,"count":495009,"meanings":[{"definitions":[{"definition":"A device which binds together sheets of paper by driving a thin metal staple through the sheets and simultaneously folding over the ends of the staple against the back surface of the paper."},{"definition":"A dealer in staple goods."},{"definition":"One employed to sort wool according to its staple."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsteɪpləɹ/"},{"text":"/ˈsteɪplə/"}]},{"word":"PHEROMONES","idx":39716,"count":494997,"meanings":[{"definitions":[{"definition":"A chemical secreted by an animal, especially an insect, that affects the development or behavior of other members of the same species, functioning often as a means of attracting a member of the opposite sex."}],"partOfSpeech":"n"}]},{"word":"BISEXUALS","idx":39722,"count":494918,"meanings":[{"definitions":[{"definition":"A person who is bisexual."},{"definition":"A plant or fungus, or part thereof, which is bisexual."}],"partOfSpeech":"n"}]},{"word":"CUTEST","idx":39726,"count":494845,"meanings":[{"definitions":[{"definition":"Possessing physical features, behaviors, personality traits or other properties that are mainly attributed to infants and small or cuddly animals; e.g. fair, dainty, round, and soft physical features, disproportionately large eyes and head, playfulness, fragility, helplessness, curiosity or shyness, innocence, affectionate behavior.","example":"Our reaction to cute attributes is understood as the way nature ensures mammals care for their young."},{"definition":"Generally, attractive or pleasing, especially in a youthful, dainty, quaint or fun-spirited way.","example":"Let's go to the mall and look for cute girls."},{"definition":"Affected or contrived to charm; mincingly clever; precious; cutesy.","example":"Don't get cute with me, boy!"},{"definition":"Mentally keen or discerning (See also acute)","example":"Cute trick, but can you do it consistently?"}],"partOfSpeech":"j"}]},{"word":"UNCOMPROMISING","idx":39727,"count":494819,"meanings":[{"definitions":[{"definition":"Inflexible and unwilling to negotiate or make concessions."},{"definition":"Principled."}],"partOfSpeech":"j"}]},{"word":"OBSTRUCT","idx":39729,"count":494816,"meanings":[{"definitions":[{"definition":"To block or fill (a passage) with obstacles or an obstacle."},{"definition":"To impede, retard, or interfere with; hinder.","example":"They obstructed my progress."},{"definition":"To get in the way of so as to hide from sight."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əbˈstɹʌkt/"}]},{"word":"UNBOUNDED","idx":39730,"count":494813,"meanings":[{"definitions":[{"definition":"Having no boundaries or limits.","example":"The universe is finite but unbounded."}],"partOfSpeech":"j"}]},{"word":"HOON","idx":39731,"count":494813,"meanings":[{"definitions":[{"definition":"A worthless person; a hooligan or lout."},{"definition":"A pimp."},{"definition":"A person who drives excessively quickly, loudly or irresponsibly; a street drag racer often driving heavily customized cars."},{"definition":"An attempt or go at something."},{"definition":"A unit of weight (about 0.378125 of a gram, or 0.0133 of an ounce) used to measure opium in British-controlled parts of Asia; a candareen."},{"definition":"A pagoda, a type of gold coin."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act loutishly; specifically, to drive excessively quickly, loudly or irresponsibly."},{"definition":"To make a hooting or howling sound."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hun/"},{"text":"/huːn/"},{"audio":"hoon-au"}]},{"word":"COINCIDED","idx":39732,"count":494775,"meanings":[{"definitions":[{"definition":"To occupy exactly the same space.","example":"The two squares coincide nicely."},{"definition":"To occur at the same time.","example":"The conference will coincide with his vacation."},{"definition":"To correspond, concur, or agree.","example":"Our ideas coincide, except in certain areas."}],"partOfSpeech":"ve"}]},{"word":"ENCASED","idx":39738,"count":494670,"meanings":[{"definitions":[{"definition":"To enclose, as in a case."}],"partOfSpeech":"ve"}]},{"word":"UNDERTAKER","idx":39739,"count":494658,"meanings":[{"definitions":[{"definition":"A funeral director; someone whose business is to manage funerals, burials and cremations."},{"definition":"A person receiving land in Ireland during the Elizabethan era, so named because they gave an undertaking to abide by several conditions regarding marriage, to be loyal to the crown, and to use English as their spoken language."},{"definition":"A contractor for the royal revenue in England, one of those who undertook to manage the House of Commons for the king in the Addled Parliament of 1614."},{"definition":"One who undertakes or commits to doing something."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʌndə(ɹ)ˌteɪkə(ɹ)/"}]},{"word":"PRINTOUTS","idx":39741,"count":494637,"meanings":[{"definitions":[{"definition":"Something printed on paper, usually by a printer (machine)."}],"partOfSpeech":"n"}]},{"word":"FLICKERING","idx":39742,"count":494623,"meanings":[{"definitions":[{"definition":"To burn or shine unsteadily, or with a wavering light."},{"definition":"To keep going on and off; to appear and disappear for short moments; to flutter."},{"definition":"To flutter; to flap the wings without flying."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A short, uncertain burst.","example":"Even after the acrimonious breakup, she still felt flickerings of love for him."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Shining unsteadily or vary rapidly in brightness (referring to a light or a source of light)"}],"partOfSpeech":"j"}]},{"word":"TEMPT","idx":39744,"count":494586,"meanings":[{"definitions":[{"definition":"To provoke someone to do wrong, especially by promising a reward; to entice.","example":"She tempted me to eat the apple."},{"definition":"To attract; to allure.","example":"Its glossy skin tempted me."},{"definition":"To provoke something; to court.","example":"It would be tempting fate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tempt-us","text":"/tɛmpt/"}]},{"word":"CREDENTIALING","idx":39745,"count":494584,"meanings":[{"definitions":[{"definition":"To furnish with credentials"}],"partOfSpeech":"ve"}]},{"word":"SCALLOPED","idx":39746,"count":494577,"meanings":[{"definitions":[{"definition":"To create or form an edge in the shape of a crescent or multiple crescents."},{"definition":"To bake in a casserole (gratin), originally in a scallop shell; especially used in form scalloped"},{"definition":"To harvest scallops"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having an edge or border marked with semicircles"},{"definition":"Cooked gratin; baked in a typical type of sauce, usually with cheese, as a casserole, e.g. scalloped potatoes; scalloped corn"},{"definition":"Baked in a scallop shell"}],"partOfSpeech":"j"}]},{"word":"ETUDES","idx":39749,"count":494514,"meanings":[{"definitions":[{"definition":"A short piece of music, designed to give a performer practice in a particular area or skill."}],"partOfSpeech":"n"}]},{"word":"GURNEY","idx":39750,"count":494513,"meanings":[{"definitions":[{"definition":"A stretcher having wheeled legs."}],"partOfSpeech":"n"}]},{"word":"GUSH","idx":39752,"count":494498,"meanings":[{"definitions":[{"definition":"A sudden rapid outflow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flow forth suddenly, in great volume."},{"definition":"To send (something) flowing forth suddenly in great volume."},{"definition":"(especially of a woman) To ejaculate during orgasm."},{"definition":"To make an excessive display of enthusiasm, praise, or sentiment."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gush-us","text":"/ˈɡʌʃ/"}]},{"word":"SADDENED","idx":39754,"count":494456,"meanings":[{"definitions":[{"definition":"To make sad or unhappy.","example":"It saddens me to think that I might have hurt someone."},{"definition":"To become sad or unhappy."},{"definition":"To darken a color during dyeing."},{"definition":"To render heavy or cohesive."}],"partOfSpeech":"ve"}]},{"word":"GEOCHEMICAL","idx":39756,"count":494441,"meanings":[{"definitions":[{"definition":"Of or pertaining to geochemistry"}],"partOfSpeech":"j"}]},{"word":"DIGITIZING","idx":39759,"count":494394,"meanings":[{"definitions":[{"definition":"To represent something (such as an image or sound) as a structured sequence of binary digits"},{"definition":"To quantize a continuous or analog value; to convert it into a discrete value"},{"definition":"To finger.","example":"to digitize a pen"}],"partOfSpeech":"ve"}]},{"word":"ORGANICALLY","idx":39761,"count":494320,"meanings":[{"definitions":[{"definition":"In an organic manner."},{"definition":"In the manner of a living organism."},{"definition":"As part of an organized whole."},{"definition":"Inherently, naturally or constitutionally."},{"definition":"From, or using organic matter."},{"definition":"With regard to organic husbandry."}],"partOfSpeech":"v"}]},{"word":"BATHE","idx":39763,"count":494252,"meanings":[{"definitions":[{"definition":"The act of swimming or bathing, especially in the sea, a lake, or a river; a swimming bath.","example":"I'm going to have a midnight bathe tonight."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clean oneself by immersion in water or using water; to take a bath, have a bath."},{"definition":"To immerse oneself, or part of the body, in water for pleasure or refreshment; to swim."},{"definition":"To clean a person by immersion in water or using water; to give someone a bath.","example":"We bathe our baby before going to bed; other parents do it in the morning if they have time."},{"definition":"To apply water or other liquid to; to suffuse or cover with liquid.","example":"She bathed her eyes with liquid to remove the stinging chemical."},{"definition":"(transitive and intransitive) To cover or surround.","example":"A dense fog bathed the city streets."},{"definition":"To sunbathe.","example":"The women bathed in the sun."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bathe-us","text":"/beɪð/"}]},{"word":"SCARRED","idx":39765,"count":494189,"meanings":[{"definitions":[{"definition":"To mark the skin permanently."},{"definition":"To form a scar."},{"definition":"To affect deeply in a traumatic manner.","example":"Seeing his parents die in a car crash scarred him for life."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a scar or scars."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"scarred-uk","text":"/skɑː(ɹ)d/"}]},{"word":"ROLEPLAY","idx":39768,"count":494058,"meanings":[{"definitions":[{"definition":"The practice of roleplaying."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act out a fantasy, especially with a group."},{"definition":"To act as a character as part of a fantasy, especially with a group.","example":"He likes to roleplay a vampire."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"roleplay"}]},{"word":"IGNITED","idx":39769,"count":494043,"meanings":[{"definitions":[{"definition":"To set fire to (something), to light (something)"},{"definition":"To spark off (something), to trigger"},{"definition":"To commence burning."},{"definition":"To subject to the action of intense heat; to heat strongly; often said of incombustible or infusible substances.","example":"to ignite iron or platinum"}],"partOfSpeech":"ve"}]},{"word":"CROWDING","idx":39771,"count":494039,"meanings":[{"definitions":[{"definition":"To press forward; to advance by pushing.","example":"The man crowded into the packed room."},{"definition":"To press together or collect in numbers","example":"They crowded through the archway and into the park."},{"definition":"To press or drive together, especially into a small space; to cram.","example":"He tried to crowd too many cows into the cow-pen."},{"definition":"To fill by pressing or thronging together"},{"definition":"(often used with \"out of\" or \"off\") To push, to press, to shove.","example":"They tried to crowd her off the sidewalk."},{"definition":"To approach another ship too closely when it has right of way."},{"definition":"(of a square-rigged ship) To carry excessive sail in the hope of moving faster."},{"definition":"To press by solicitation; to urge; to dun; hence, to treat discourteously or unreasonably."},{"definition":"To play on a crowd; to fiddle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which somebody is crowded."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹaʊdɪŋ/"}]},{"word":"ROOTKIT","idx":39775,"count":493905,"meanings":[{"definitions":[{"definition":"A set of software tools used by a third party to gain unauthorized access to a computer system and control the system while concealing itself from the user."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To infect (a computer system) with a rootkit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rootkit-us"}]},{"word":"SPEARHEAD","idx":39776,"count":493900,"meanings":[{"definitions":[{"definition":"The pointed head, or end, of a spear."},{"definition":"One who leads or initiates an activity (such as an attack or a campaign)."},{"definition":"The leading military unit in an attack."},{"definition":"A player who initiates attacking moves."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drive or campaign ardently for, as an effort, project, etc.","example":"He spearheaded the entire project from day one."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spearhead-us","text":"/ˈspiɹ.hɛd/"}]},{"word":"RETICULUM","idx":39779,"count":493845,"meanings":[{"definitions":[{"definition":"A network."},{"definition":"A pattern of interconnected objects."},{"definition":"The second compartment of the stomach of a cow or other ruminant."}],"partOfSpeech":"n"}]},{"word":"DULCIMER","idx":39780,"count":493843,"meanings":[{"definitions":[{"definition":"A stringed instrument, with strings stretched across a sounding board, usually trapezoidal. It is played on the lap or horizontally on a table. Some have their own legs. These musical instruments are played by plucking on the strings (traditionally with a quill) or by tapping on them (in the case of the hammer dulcimers)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʌl.sɪ.mɚ/"},{"text":"/ˈdʌl.sɪ.mə/"}]},{"word":"VROUW","idx":39784,"count":493709,"meanings":[{"definitions":[{"definition":"A Dutchwoman."}],"partOfSpeech":"n"}]},{"word":"CORONAL","idx":39785,"count":493704,"meanings":[{"definitions":[{"definition":"A crown or coronet."},{"definition":"A wreath or garland of flowers."},{"definition":"The frontal bone, over which the ancients wore their coronae or garlands."},{"definition":"A consonant produced with the tip or blade of the tongue."},{"definition":"A commissioned officer in an armed military organization, typically the highest rank before flag officer ranks (generals). It is generally found in armies, air forces or naval infantry (marines)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to a crown or coronation."},{"definition":"Relating to the corona of a star."},{"definition":"Relating to the corona of a flower."},{"definition":"Relating to a sound made with the tip or blade of the tongue."},{"definition":"Relating to the coronal plane that divides a body into dorsal (back) and ventral (front)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"coronal-1-uk","text":"/kəˈɹəʊnəl/"}]},{"word":"TRANSPARENTLY","idx":39787,"count":493693,"meanings":[{"definitions":[{"definition":"In a transparent manner; with nothing hidden.","example":"They conducted their business transparently, solely in public meetings."},{"definition":"(manner) So as to admit light without distortion."},{"definition":"(modal) So as to be readily perceived and understood.","example":"Transparently to all, he had nothing of substance to say."}],"partOfSpeech":"v"}]},{"word":"FREEFORM","idx":39789,"count":493641,"meanings":[{"definitions":[{"definition":"Having an unconventional, variable or asymmetric form."},{"definition":"Referring to a roleplaying game which does not use a formal system of rules."}],"partOfSpeech":"j"}]},{"word":"TANTRIC","idx":39791,"count":493630,"meanings":[{"definitions":[{"definition":"Describing Vajrayana Buddhism."},{"definition":"Describing any of several branches of yoga or esoteric traditions rooted in India."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tantric-us","text":"/ˈtæntɹɪk/"}]},{"word":"GLADIATORS","idx":39794,"count":493557,"meanings":[{"definitions":[{"definition":"(in ancient Rome) A person (professional or slave) who entertained the public by engaging in mortal combat with another, or with a wild animal."},{"definition":"(by extension) A disputant in a public controversy or debate."},{"definition":"A professional boxer."}],"partOfSpeech":"n"}]},{"word":"OGLE","idx":39798,"count":493507,"meanings":[{"definitions":[{"definition":"An impertinent, flirtatious, amorous or covetous stare."},{"definition":"(usually in the plural) An eye."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stare at (someone or something), especially impertinently, amorously, or covetously."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ogle-uk","text":"/ˈɒɡəl/"}]},{"word":"VIDEOGRAPHER","idx":39802,"count":493398,"meanings":[{"definitions":[{"definition":"Any person involved in the production of video material, but especially a person who uses a video camera."}],"partOfSpeech":"n"}]},{"word":"PULA","idx":39807,"count":493339,"meanings":[{"definitions":[{"definition":"Rain, used as an expression of greeting or good luck."},{"definition":"The currency of Botswana, divided into 100 thebe."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pula-uk","text":"/pʊlə/"}]},{"word":"AEROPLANE","idx":39808,"count":493334,"meanings":[{"definitions":[{"definition":"A powered heavier-than-air aircraft with fixed wings."},{"definition":"An airfoil."},{"definition":"Any of various nymphalid butterflies, of various genera, having a slow gliding flight. Also called planes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fly in an aeroplane."},{"definition":"To transport by aeroplane."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"aeroplane-uk","text":"/ˈeə.ɹə.pleɪn/"},{"audio":"aeroplane-au","text":"/ˈeə.ɹə.pleɪn/"}]},{"word":"NAGGING","idx":39812,"count":493272,"meanings":[{"definitions":[{"definition":"To continuously remind or complain to (someone) in an annoying way, often about insignificant or unnecessary matters."},{"definition":"To bother with persistent thoughts or memories.","example":"The notion that he forgot something nagged him the rest of the day."},{"definition":"To bother or disturb persistently in any way.","example":"a nagging north wind"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb nag."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing persistent mild pain, or annoyance."}],"partOfSpeech":"j"}]},{"word":"FATHERHOOD","idx":39814,"count":493235,"meanings":[{"definitions":[{"definition":"The state of being a father."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɑ.ðɚˌhʊd/"},{"text":"/ˈfɑːðəˌhʊd/"}]},{"word":"REFLEXES","idx":39817,"count":493201,"meanings":[{"definitions":[{"definition":"An automatic response to a simple stimulus which does not require mental processing."},{"definition":"The descendant of an earlier language element, such as a word or phoneme, in a daughter language."},{"definition":"The descendant of anything from an earlier time, such as a cultural myth."},{"definition":"Reflection or an image produced by reflection. The light reflected from an illuminated surface to one in shade."}],"partOfSpeech":"n"}]},{"word":"CONTEMPORANEOUS","idx":39819,"count":493151,"meanings":[{"definitions":[{"definition":"Existing or created in the same period of time.","example":"Look in other contemporaneous works to see whether that idea was common then."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"contemporaneous-uk","text":"/kənˌtɛm.pəˈɹeɪ.ni.əs/"}]},{"word":"PRECIPITATED","idx":39822,"count":493058,"meanings":[{"definitions":[{"definition":"To make something happen suddenly and quickly.","example":"it precipitated their success"},{"definition":"To throw an object or person from a great height."},{"definition":"To send violently into a certain state or condition.","example":"we were precipitated into a conflict"},{"definition":"To come out of a liquid solution into solid form.","example":"Adding the acid will cause the salt to precipitate."},{"definition":"To separate a substance out of a liquid solution into solid form."},{"definition":"To have water in the air fall to the ground, for example as rain, snow, sleet, or hail; be deposited as condensed droplets.","example":"It will precipitate tomorrow, but we don't know whether as rain or snow."},{"definition":"To cause (water in the air) to condense or fall to the ground."},{"definition":"To fall headlong."},{"definition":"To act too hastily; to be precipitous."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Hastened; hurried."},{"definition":"Deposited from a solution, vapour or state of suspension into gas."}],"partOfSpeech":"j"}]},{"word":"HISS","idx":39823,"count":493054,"meanings":[{"definitions":[{"definition":"A sibilant sound, such as that made by a snake or escaping steam; an unvoiced fricative."},{"definition":"An expression of disapproval made using such a sound."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a hissing sound.","example":"As I started to poke it, the snake hissed at me."},{"definition":"To condemn or express contempt (for someone or something) by hissing.","example":"The crowd booed and hissed her off the stage."},{"definition":"To utter (something) with a hissing sound."},{"definition":"To move with a hissing sound.","example":"The arrow hissed through the air."},{"definition":"To emit or eject (something) with a hissing sound."},{"definition":"To whisper, especially angrily or urgently."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hiss-us","text":"/hɪs/"}]},{"word":"OUTLAWED","idx":39824,"count":493039,"meanings":[{"definitions":[{"definition":"To declare illegal."},{"definition":"To place a ban upon."},{"definition":"To remove from legal jurisdiction or enforcement.","example":"to outlaw a debt or claim"},{"definition":"To deprive of legal force.","example":"Laws outlawed by necessity. — Fuller."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of an act) put beyond the limits of the law, forbidden, against the law."},{"definition":"(of a person) put beyond the limits of the law, declared an outlaw or declared a criminal."}],"partOfSpeech":"j"}]},{"word":"INJURING","idx":39826,"count":492971,"meanings":[{"definitions":[{"definition":"To wound or cause physical harm to a living creature."},{"definition":"To damage or impair."},{"definition":"To do injustice to."}],"partOfSpeech":"ve"}]},{"word":"BELLOW","idx":39828,"count":492951,"meanings":[{"definitions":[{"definition":"The deep roar of a large animal, or any similar loud noise."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a loud, deep, hollow noise like the roar of an angry bull."},{"definition":"To shout in a deep voice."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bellow-us","text":"/ˈbɛloʊ/"}]},{"word":"GIRTH","idx":39830,"count":492919,"meanings":[{"definitions":[{"definition":"A band passed under the belly of an animal, which holds a saddle or a harness saddle in place."},{"definition":"The part of an animal around which the girth fits."},{"definition":"One's waistline circumference, most often a large one."},{"definition":"A small horizontal brace or girder."},{"definition":"The distance measured around an object."},{"definition":"The length of the shortest cycle in a graph."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bind as if with a girth or band."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"girth-uk","text":"/ɡɜːθ/"}]},{"word":"MILLERS","idx":39833,"count":492846,"meanings":[{"definitions":[{"definition":"A person who owns or operates a mill, especially a flour mill."},{"definition":"A milling machine."},{"definition":"Any of several moths that have powdery wings, especially Acronicta leporina and moths of the genus Agrotis."},{"definition":"The common name of a flour-smelling mushroom, Clitopilus prunulus."}],"partOfSpeech":"n"}]},{"word":"CLERICS","idx":39835,"count":492827,"meanings":[{"definitions":[{"definition":"A clergy member."}],"partOfSpeech":"n"}]},{"word":"POPPIES","idx":39836,"count":492826,"meanings":[{"definitions":[{"definition":"Any plant of the genus Papaver or the family Papaveraceae, with crumpled, often red, petals and a milky juice having narcotic properties; especially the common poppy or corn poppy (Papaver rhoeas) which has orange-red flowers; the flower of such a plant."},{"definition":"A bright red colour tinted with orange, like that of the common poppy flower."},{"definition":"A simple artificial poppy flower worn in a buttonhole or displayed in other contexts to remember those who died in the two World Wars and other armed conflicts, especially around Remembrance Sunday."},{"definition":"One's father or grandfather, or a male authority figure having similar standing."}],"partOfSpeech":"n"}]},{"word":"INLAID","idx":39837,"count":492826,"meanings":[{"definitions":[{"definition":"(of a design) Set into a surface in a decorative pattern."},{"definition":"(of the surface of an item) Having an inset decorative pattern."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To place (pieces of a foreign material) within another material to form a decorative design."},{"definition":"To place an inlay in a tooth."}],"partOfSpeech":"ve"}]},{"word":"BUSSES","idx":39838,"count":492807,"meanings":[{"definitions":[{"definition":"A motor vehicle for transporting large numbers of people along roads."},{"definition":"An electrical conductor or interface serving as a common connection for two or more circuits or components."},{"definition":"(medical industry) An ambulance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transport via a motor bus."},{"definition":"To transport students to school, often to a more distant school for the purposes of achieving racial integration."},{"definition":"To travel by bus."},{"definition":"(food service) To clear meal remains from.","example":"He bussed tables as the restaurant emptied out."},{"definition":"(food service) To work at clearing the remains of meals from tables or counters; to work as a busboy.","example":"He’s been bussing for minimum wage."}],"partOfSpeech":"ve"}]},{"word":"NOTCHED","idx":39839,"count":492786,"meanings":[{"definitions":[{"definition":"To cut a notch in (something)."},{"definition":"To record (a score or similar) by making notches on something.","example":"The tribe's hunters notch their kills by notches on each's axe's handle."},{"definition":"To join by means of notches."},{"definition":"To achieve (something); to add to one's score or record of successes.","example":"The team notched a pair of shutout wins on Sunday."},{"definition":"To fit (an arrow) to a bow by means of the notch cut at the end of the arrow; to nock."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having notches"}],"partOfSpeech":"j"}]},{"word":"UNDERPIN","idx":39841,"count":492734,"meanings":[{"definitions":[{"definition":"To support from below with props or masonry.","example":"You should underpin the mine roof to prevent further collapse."},{"definition":"To give support to; to corroborate.","example":"Public confidence in politicians must underpin our democracy."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"underpin-us","text":"/ˈʌn.dɚˌpɪn/"}]},{"word":"BALDNESS","idx":39843,"count":492702,"meanings":[{"definitions":[{"definition":"The condition or state of being (or becoming) bald.","example":"the baldness of an assertion"}],"partOfSpeech":"n"}]},{"word":"DIDACTIC","idx":39845,"count":492687,"meanings":[{"definitions":[{"definition":"A treatise on teaching or education."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Instructive or intended to teach or demonstrate, especially with regard to morality.","example":"didactic poetry"},{"definition":"Excessively moralizing."},{"definition":"Teaching from textbooks rather than laboratory demonstration and clinical application."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"didactic-au","text":"/daɪˈdæk.tɪk/"}]},{"word":"DELICATELY","idx":39848,"count":492625,"meanings":[{"definitions":[{"definition":"In a delicate manner; exquisitely.","example":"The gingerbread was delicately, if imprecisely, captured by the brushstrokes."},{"definition":"Tactfully.","example":"He approached the main subject delicately."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"delicately-us","text":"/ˈdɛlɪkətli/"}]},{"word":"YIP","idx":39850,"count":492531,"meanings":[{"definitions":[{"definition":"A sharp, high-pitched bark"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bark with a sharp, high-pitched voice"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/jɪp/"}]},{"word":"IRRITABILITY","idx":39853,"count":492505,"meanings":[{"definitions":[{"definition":"The state or quality of being irritable; quick excitability","example":"irritability of temper"},{"definition":"A natural susceptibility, characteristic of all living organisms, tissues, and cells, to the influence of certain stimuli, response being manifested in a variety of ways."},{"definition":"A condition of morbid excitability of an organ or part of the body; undue susceptibility to the influence of stimuli."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"irritability-uk","text":"/ˌɪɹɪtəˈbɪlɪti/"}]},{"word":"PULLOUT","idx":39854,"count":492448,"meanings":[{"definitions":[{"definition":"The practice of luring a whole team of employees away from a competitor and hiring them oneself."},{"definition":"A quotation taken from the main text and given special visual treatment."},{"definition":"A withdrawal, especially of armed forces."},{"definition":"The change of the flight of an aircraft from a dive to level flight."},{"definition":"An object, such as a newspaper supplement, that can be pulled out from something else."},{"definition":"An area by the side of a road where vehicles may temporarily stop in safety. Typical pullouts allow drivers and passengers to safely exit the vehicle but rarely have additional amenities."},{"definition":"The ending of a period of surfing by navigating the board into or over the back of a wave."}],"partOfSpeech":"n"}]},{"word":"PROVOCATION","idx":39859,"count":492334,"meanings":[{"definitions":[{"definition":"The act of provoking, inciting or annoying someone into doing something"},{"definition":"Something that provokes; a provocative act"},{"definition":"The second step in OPQRST regarding the investigation of what makes the symptoms MOI or NOI improve or deteriorate.","example":"When it's time to check for provocation ask the patient about what makes their chief complaint better or worse."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌpɹɑvəˈkeɪʃən/"},{"text":"/ˌpɹɒvəˈkeɪʃən/"}]},{"word":"LUSTROUS","idx":39861,"count":492303,"meanings":[{"definitions":[{"definition":"Having a glow or lustre."},{"definition":"As if shining with a brilliant light; radiant."}],"partOfSpeech":"j"}]},{"word":"REELING","idx":39862,"count":492289,"meanings":[{"definitions":[{"definition":"To wind on a reel."},{"definition":"To spin or revolve repeatedly."},{"definition":"To unwind, to bring or acquire something by spinning or winding something else.","example":"He reeled off some tape from the roll and sealed the package."},{"definition":"To walk shakily or unsteadily; to stagger; move as if drunk or not in control of oneself."},{"definition":"(with back) To back off or step away unsteadily and quickly.","example":"He reeled back from the punch."},{"definition":"To make or cause to reel."},{"definition":"To have a whirling sensation; to be giddy."},{"definition":"To be in shock."},{"definition":"To roll."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The motion of something that reels."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹiːlɪŋ/"}]},{"word":"BIRDHOUSE","idx":39863,"count":492279,"meanings":[{"definitions":[{"definition":"A small house for birds."},{"definition":"An aviary."}],"partOfSpeech":"n"}]},{"word":"DESERTIFICATION","idx":39868,"count":492156,"meanings":[{"definitions":[{"definition":"Process by which a geographic region becomes a desert. The change may result from natural changes in climate or by human activity."}],"partOfSpeech":"n"}]},{"word":"RIMMING","idx":39870,"count":492108,"meanings":[{"definitions":[{"definition":"To form a rim on."},{"definition":"To follow the contours, possibly creating a circuit.","example":"A walking path rims the island."},{"definition":"(of a ball) To roll around a rim.","example":"The basketball rimmed in and out."},{"definition":"To lick the anus of a partner as a sexual act."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of performing a rim job; anilingus."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹɪmɪŋ/"},{"audio":"rimming-au"}]},{"word":"CRESTS","idx":39872,"count":492071,"meanings":[{"definitions":[{"definition":"The summit of a hill or mountain ridge."},{"definition":"A tuft, or other natural ornament, growing on an animal's head, for example the comb of a cockerel, the swelling on the head of a snake, the lengthened feathers of the crown or nape of bird, etc."},{"definition":"The plume of feathers, or other decoration, worn on or displayed on a helmet; the distinctive ornament of a helmet."},{"definition":"A bearing worn, not upon the shield, but usually on a helmet above it, sometimes (as for clerics) separately above the shield or separately as a mark for plate, in letterheads, and the like."},{"definition":"The upper curve of a horse's neck."},{"definition":"The ridge or top of a wave."},{"definition":"The helm or head, as typical of a high spirit; pride; courage."},{"definition":"The ornamental finishing which surmounts the ridge of a roof, canopy, etc."},{"definition":"The top line of a slope or embankment."},{"definition":"A ridge along the surface of a bone."},{"definition":"A design or logo, especially one of an institution, association or high-class family."},{"definition":"Any of several birds in the family Regulidae, including the goldcrests and firecrests."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Particularly with reference to waves, to reach a peak."},{"definition":"To reach the crest of (a hill or mountain)"},{"definition":"To furnish with, or surmount as, a crest; to serve as a crest for."},{"definition":"To mark with lines or streaks like waving plumes."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɹɛsts/"}]},{"word":"PROPYLENE","idx":39875,"count":491997,"meanings":[{"definitions":[{"definition":"The organic chemical compound propene. An alkene which is a colorless gaseous (at room temperature and pressure) hydrocarbon with the chemical formula C3H6."}],"partOfSpeech":"n"}]},{"word":"LOAFERS","idx":39876,"count":491996,"meanings":[{"definitions":[{"definition":"An idle person."},{"definition":"A shoe with no laces, resembling a moccasin."},{"definition":"A wolf, especially a grey or timber wolf."}],"partOfSpeech":"n"}]},{"word":"FUELLED","idx":39881,"count":491974,"meanings":[{"definitions":[{"definition":"To provide with fuel."},{"definition":"To exacerbate, to cause to grow or become greater."}],"partOfSpeech":"ve"}]},{"word":"BIOHAZARD","idx":39882,"count":491965,"meanings":[{"definitions":[{"definition":"A biological hazard; a source of risk due to some biological factor such as bacteria or human waste."}],"partOfSpeech":"n"}]},{"word":"SLAPPING","idx":39883,"count":491918,"meanings":[{"definitions":[{"definition":"To give a slap to.","example":"She slapped him in response to the insult."},{"definition":"To cause something to strike soundly.","example":"He slapped the reins against the horse's back."},{"definition":"To strike soundly against something.","example":"The rain slapped against the window-panes."},{"definition":"To be excellent.","example":"The band's new single slaps."},{"definition":"To place, to put carelessly.","example":"We'd better slap some fresh paint on that wall."},{"definition":"To impose a penalty, etc. on (someone).","example":"I was slapped with a parking fine."},{"definition":"To play slap bass on (an instrument)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of giving a slap or slaps"},{"definition":"The slap bass technique"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Very large; whopping."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"slapping-au","text":"/ˈslæpɪŋ/"}]},{"word":"HORRIFYING","idx":39884,"count":491916,"meanings":[{"definitions":[{"definition":"To cause to feel extreme apprehension or unease; to cause to experience horror.","example":"The haunted house was horrifying, from one room to the next I felt more and more like I wasn’t going to survive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Tending to inspire horror; that horrifies; horrific."}],"partOfSpeech":"j"}]},{"word":"TOFFEE","idx":39886,"count":491876,"meanings":[{"definitions":[{"definition":"A type of confectionery made by boiling sugar (or treacle, etc) with butter or milk, then cooling the mixture so that it becomes hard"},{"definition":"A small, individual piece of toffee","example":"a box of toffees"},{"definition":"Any kind of sweets; candy"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To coat in toffee."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtɔfi/"},{"text":"/ˈtɒfi/"}]},{"word":"SQUIRES","idx":39890,"count":491801,"meanings":[{"definitions":[{"definition":"A shield-bearer or armor-bearer who attended a knight."},{"definition":"A title of dignity next in degree below knight, and above gentleman. See esquire."},{"definition":"A male attendant on a great personage."},{"definition":"A devoted attendant or follower of a lady; a beau."},{"definition":"A title of office and courtesy. See under esquire."},{"definition":"Term of address to an equal."},{"definition":"A ruler; a carpenter's square; a measure."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attend as a squire."},{"definition":"To attend as a beau, or gallant, for aid and protection."}],"partOfSpeech":"ve"}]},{"word":"INSURES","idx":39891,"count":491741,"meanings":[{"definitions":[{"definition":"To make a pledge to (someone); to promise, guarantee (someone of something); to assure."},{"definition":"To make sure or certain of something (usually some future event or condition).","example":"I use an alarm clock to ensure that I get up on time."},{"definition":"To provide for compensation if some specified risk occurs. Often agreed by policy (contract) to offer financial compensation in case of an accident, theft or other undesirable event.","example":"I'm not insured against burglary."},{"definition":"To deal in such contracts; subscribe to a policy of insurance"}],"partOfSpeech":"ve"}]},{"word":"SLAYING","idx":39893,"count":491722,"meanings":[{"definitions":[{"definition":"To kill, murder.","example":"Our foes must all be slain."},{"definition":"To eradicate or stamp out.","example":"You must slay these thoughts."},{"definition":"(by extension) To defeat, overcome (in a competition or contest).","example":"1956, “Giants Slay Bears in Pro Title Battle”, in Lodi News-Sentinel, 1956 December 31, page 8."},{"definition":"To delight or overwhelm, especially with laughter.","example":"Ha ha! You slay me!"},{"definition":"To amaze, stun or otherwise incapacitate by awesomeness; to be awesome at something; to kill (slang sense)."},{"definition":"To have sex with"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Killing, especially the murder of a human.","example":"The slaying of the civil rights activist brought a storm of protest."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsleɪɪŋ/"}]},{"word":"MAHATMA","idx":39894,"count":491695,"meanings":[{"definitions":[{"definition":"An epithet granted in India and Tibet to people thought to have great knowledge and love of humanity"},{"definition":"Such a person."}],"partOfSpeech":"n"}]},{"word":"PIPPIN","idx":39901,"count":491563,"meanings":[{"definitions":[{"definition":"A seed"},{"definition":"Any of several varieties of eating apple that have a yellow or green skin with patches of red"},{"definition":"Any of several roundish or oblate apple varieties"},{"definition":"An apple tree raised from a seed (not grafted)"}],"partOfSpeech":"n"}]},{"word":"FRAUDS","idx":39903,"count":491526,"meanings":[{"definitions":[{"definition":"The crime of stealing or otherwise illegally obtaining money by use of deception tactics."},{"definition":"Any act of deception carried out for the purpose of unfair, undeserved and/or unlawful gain."},{"definition":"The assumption of a false identity to such deceptive end."},{"definition":"A person who performs any such trick."},{"definition":"A trap or snare."}],"partOfSpeech":"n"}]},{"word":"PARLIAMENTARIANS","idx":39914,"count":491228,"meanings":[{"definitions":[{"definition":"A member of a parliament, congress or an elected national legislative body of another name."},{"definition":"A person well-versed in parliamentary procedure."},{"definition":"An officer in most legislative bodies charged with being well-versed in the parliamentary rules of that legislative house, and whose rulings are taken as authoritative, to be appealed only to the whole of the house itself under special rules."}],"partOfSpeech":"n"}]},{"word":"INADVERTENT","idx":39915,"count":491195,"meanings":[{"definitions":[{"definition":"Not intentional; not on purpose; not conscious.","example":"We check everything because an inadvertent error could be disastrous."},{"definition":"Inattentive."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"inadvertent-us","text":"/ˌɪnədˈvɝtn̩t/"}]},{"word":"UTES","idx":39916,"count":491093,"meanings":[{"definitions":[{"definition":"A small vehicle based on the same platform as a family car but with a unibody construction and a built-in open tray area for carrying goods; similar but not identical to a pick-up truck."}],"partOfSpeech":"n"}]},{"word":"LOBES","idx":39919,"count":491048,"meanings":[{"definitions":[{"definition":"Any projection or division, especially one of a somewhat rounded form.","example":"A lobe of lava was crawling down the side of the volcano."},{"definition":"A clear division of an organ that can be determined at the gross anatomy level, especially one of the parts of the brain, liver or lung."},{"definition":"A semicircular pattern left on the ice as the skater travels across it."}],"partOfSpeech":"n"}]},{"word":"HOMOPHOBIA","idx":39921,"count":491022,"meanings":[{"definitions":[{"definition":"Fear of, dislike of or prejudice against homosexuals."},{"definition":"(individual occurrences) A pathological fear of mankind."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌhɒ.məˈfəʊ.bi.ə/"}]},{"word":"WINCHES","idx":39922,"count":490997,"meanings":[{"definitions":[{"definition":"A machine consisting of a drum on an axle, a friction brake or ratchet and pawl, and a crank handle or prime mover (often an electric or hydraulic motor), with or without gearing, to give increased mechanical advantage when hauling on a rope or cable."},{"definition":"A hoisting machine used for loading or discharging cargo, or for hauling in lines. (FM 55-501)."},{"definition":"A wince (machine used in dyeing or steeping cloth)."},{"definition":"A kick, as of an animal, from impatience or uneasiness."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a winch","example":"Winch in those sails, lad!"},{"definition":"To wince; to shrink"},{"definition":"To kick with impatience or uneasiness."}],"partOfSpeech":"ve"}]},{"word":"ESCHATON","idx":39926,"count":490953,"meanings":[{"definitions":[{"definition":"The world during the posthistoric era of God's overt (apocalyptic) reign, immediately preceding the end of the world."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛskəˌtɑn/"}]},{"word":"HOAXES","idx":39927,"count":490943,"meanings":[{"definitions":[{"definition":"Anything deliberately intended to deceive or trick."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deceive (someone) by making them believe something that has been maliciously or mischievously fabricated."}],"partOfSpeech":"ve"}]},{"word":"HAIRSPRAY","idx":39930,"count":490874,"meanings":[{"definitions":[{"definition":"A usually scented hairstyling product in aerosol form that stiffens the hair, so it stays in a certain hairstyle."}],"partOfSpeech":"n"}]},{"word":"THUNDERING","idx":39936,"count":490825,"meanings":[{"definitions":[{"definition":"To produce thunder; to sound, rattle, or roar, as a discharge of atmospheric electricity; often used impersonally.","example":"It thundered continuously."},{"definition":"To make a noise like thunder.","example":"The train thundered along the tracks."},{"definition":"To talk with a loud, threatening voice."},{"definition":"To say (something) with a loud, threatening voice.","example":"\"Get back to work at once!\", he thundered."},{"definition":"To produce something with incredible power"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of, pertaining to, or accompanied by thunder."},{"definition":"Producing a noise or effect like thunder; thunderous."},{"definition":"Very great; extraordinary."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A loud percussive sound, like thunder."},{"definition":"A thunderstorm."}],"partOfSpeech":"n"}]},{"word":"ANTISENSE","idx":39939,"count":490779,"meanings":[{"definitions":[{"definition":"A molecule which interacts with a complementary strand of nucleic acids, so as to suppress its transcription."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌæntaɪˈsɛns/"}]},{"word":"COALS","idx":39940,"count":490751,"meanings":[{"definitions":[{"definition":"A black rock formed from prehistoric plant remains, composed largely of carbon and burned as a fuel.","example":"Put some coal on the fire."},{"definition":"A piece of coal used for burning (this use is less common in American English)","example":"Put some coals on the fire."},{"definition":"A type of coal, such as bituminous, anthracite, or lignite, and grades and varieties thereof."},{"definition":"A glowing or charred piece of coal, wood, or other solid fuel.","example":"Just as the camp-fire died down to just coals, with no flames to burn the marshmallows, someone dumped a whole load of wood on, so I gave up and went to bed."},{"definition":"Charcoal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take on a supply of coal (usually of steam ships)."},{"definition":"To supply with coal.","example":"to coal a steamer"},{"definition":"To be converted to charcoal."},{"definition":"To burn to charcoal; to char."},{"definition":"To mark or delineate with charcoal."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/koʊlz/"},{"text":"/kɔʊlz/"}]},{"word":"SUCCULENT","idx":39941,"count":490747,"meanings":[{"definitions":[{"definition":"A succulent plant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Juicy or lush."},{"definition":"Luscious or delectable."},{"definition":"Having fleshy leaves or other tissues that store water."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsʌkjələnt/"}]},{"word":"HEARTILY","idx":39942,"count":490746,"meanings":[{"definitions":[{"definition":"In a hearty manner."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"heartily-us","text":"/ˈhɑɹtɪli/"}]},{"word":"HIC","idx":39945,"count":490659,"meanings":[{"definitions":[{"definition":"An approximation to the sound of a hiccup, used e.g. to indicate drunkenness.","example":"\"This wine - hic! - tasted good.\""}],"partOfSpeech":"i"}],"phonetics":[{"text":"/hɪk/"}]},{"word":"YELLOWISH","idx":39947,"count":490629,"meanings":[{"definitions":[{"definition":"Somewhat yellow (in colour)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"yellowish-us","text":"/ˈjelɔʊɪʃ/"}]},{"word":"GRAFTS","idx":39948,"count":490594,"meanings":[{"definitions":[{"definition":"A small shoot or scion of a tree inserted in another tree, the stock of which is to support and nourish it. The two unite and become one tree, but the graft determines the kind of fruit."},{"definition":"A branch or portion of a tree growing from such a shoot."},{"definition":"A portion of living tissue used in the operation of autoplasty."},{"definition":"A ditch, a canal."},{"definition":"The depth of the blade of a digging tool such as a spade or shovel."},{"definition":"A narrow spade used in digging drainage trenches."},{"definition":"Corruption in official life."},{"definition":"Illicit profit by corrupt means, especially in public life."},{"definition":"A criminal’s special branch of practice."},{"definition":"A con job."},{"definition":"A cut of the take (money)."},{"definition":"A bribe, especially on an ongoing basis."},{"definition":"Work; labor"},{"definition":"A job or trade."},{"definition":"Effort needed for doing hard work."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To insert (a graft) in a branch or stem of another tree; to propagate by insertion in another stock; also, to insert a graft upon."},{"definition":"To insert scions (grafts) from one tree, or kind of tree, etc., into another; to practice grafting."},{"definition":"To implant a portion of (living flesh or akin) in a lesion so as to form an organic union."},{"definition":"To join (one thing) to another as if by grafting, so as to bring about a close union."},{"definition":"To cover, as a ring bolt, block strap, splicing, etc., with a weaving of small cord or rope-yarns."},{"definition":"To form a graft polymer"},{"definition":"To work."},{"definition":"To obtain illegal gain from bribery or similar corrupt practices."}],"partOfSpeech":"ve"}]},{"word":"UNSUCCESSFULLY","idx":39949,"count":490587,"meanings":[{"definitions":[{"definition":"Not successfully; without success; to no avail."}],"partOfSpeech":"v"}]},{"word":"HILLBILLY","idx":39950,"count":490582,"meanings":[{"definitions":[{"definition":"Someone who is from the hills; especially from a rural area, with a connotation of a lack of refinement or sophistication."},{"definition":"A white person from the rural southern part of the United States, especially the Southeastern states."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To emphasize one's rural or humble upbringing; to use unsophisticated charm."},{"definition":"To portray or act as an uneducated and unsophisticated fool."},{"definition":"To perform or experience stereotypically hillbilly-like actions."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hillbilly-us","text":"/ˈhɪlbɪli/"}]},{"word":"INTIFADA","idx":39951,"count":490579,"meanings":[{"definitions":[{"definition":"Insurrection, a usually violent attempt to take control of a government."},{"definition":"An uprising, resistant struggle or rebellious protest, especially the Palestinian uprisings against Israel."}],"partOfSpeech":"n"}]},{"word":"CARINA","idx":39953,"count":490507,"meanings":[{"definitions":[{"definition":"A longitudinal ridge or projection like the keel of a boat."},{"definition":"Part of a papilionaceous flower consisting of two petals, commonly united, which encloses the organs of fructification."},{"definition":"The keel of the breastbone of birds."},{"definition":"Any of several features that have a projecting central ridge"}],"partOfSpeech":"n"}]},{"word":"FON","idx":39954,"count":490495,"meanings":[{"definitions":[{"definition":"A fool or idiot."},{"definition":"A chieftain or king of a region of Cameroon."}],"partOfSpeech":"n"}]},{"word":"MOUSTACHE","idx":39958,"count":490460,"meanings":[{"definitions":[{"definition":"A growth of facial hair between the nose and the upper lip."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"moustache-us","text":"/məˈstæʃ/"}]},{"word":"EXTERNALITIES","idx":39962,"count":490437,"meanings":[{"definitions":[{"definition":"The state of being external or externalized."},{"definition":"A thing that is external relative to something else."},{"definition":"An impact, positive or negative, on any party not involved in a given economic transaction or act.","example":"Waste is a negative externality arising from consumption."}],"partOfSpeech":"n"}]},{"word":"LOBSTERS","idx":39964,"count":490418,"meanings":[{"definitions":[{"definition":"A crustacean of the Nephropidae family, dark green or blue-black in colour turning bright red when cooked, with a hard shell and claws, which is used as a seafood."},{"definition":"A crustacean of the Palinuridae family, pinkish red in colour, with a hard, spiny shell but no claws, which is used as a seafood."},{"definition":"A soldier or officer of the imperial British Army (due to their red or scarlet uniform)."},{"definition":"An Australian twenty dollar note, due to its reddish-orange colour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for lobsters."}],"partOfSpeech":"ve"}]},{"word":"BALSAMIC","idx":39965,"count":490403,"meanings":[{"definitions":[{"definition":"A balsamic vinegar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Producing balsam."},{"definition":"Having the health-giving properties of balsam; soothing, restorative."},{"definition":"Having the pleasant odour of balsam; balmy, fragrant."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌbɔːlˈsæmɪk/"}]},{"word":"CLASSICALLY","idx":39966,"count":490379,"meanings":[{"definitions":[{"definition":"In a classical manner; according to the manner of classical authors."},{"definition":"In the manner of classes; according to a regular order of classes or sets."}],"partOfSpeech":"v"}]},{"word":"EVENTFUL","idx":39967,"count":490326,"meanings":[{"definitions":[{"definition":"Of or pertaining to high levels of activity; having many memorable events.","example":"With the number of drunken revellers on the streets it could hardly fail to be an eventful night."}],"partOfSpeech":"j"}]},{"word":"CALORIMETER","idx":39968,"count":490308,"meanings":[{"definitions":[{"definition":"An apparatus for measuring the heat generated or absorbed by either a chemical reaction, change of phase or some other physical change."}],"partOfSpeech":"n"}]},{"word":"NECKED","idx":39969,"count":490302,"meanings":[{"definitions":[{"definition":"To hang by the neck; strangle; kill, eliminate","example":"Go neck yourself."},{"definition":"To make love; to intently kiss or cuddle; to canoodle.","example":"Alan and Betty were necking in the back of a car when Betty's dad caught them."},{"definition":"To drink rapidly."},{"definition":"To decrease in diameter."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in combination) Having some specific type of neck"},{"definition":"(of a treenail) Cracked."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/nɛkt/"}]},{"word":"IDIOPATHIC","idx":39970,"count":490278,"meanings":[{"definitions":[{"definition":"Of, relating to, or designating a disease or condition having no known cause."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɪdioʊˈpæθɪk/"}]},{"word":"FEASTS","idx":39973,"count":490244,"meanings":[{"definitions":[{"definition":"A very large meal, often of a ceremonial nature.","example":"We had a feast to celebrate the harvest."},{"definition":"Something delightful","example":"It was a feast for the eyes."},{"definition":"A festival; a holy day or holiday; a solemn, or more commonly, a joyous, anniversary."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To partake in a feast, or large meal.","example":"I feasted on turkey and dumplings."},{"definition":"To dwell upon (something) with delight."},{"definition":"To hold a feast in honor of (someone).","example":"We feasted them after the victory."},{"definition":"To serve as a feast for; to feed sumptuously."}],"partOfSpeech":"ve"}]},{"word":"STILETTO","idx":39974,"count":490209,"meanings":[{"definitions":[{"definition":"A small, slender knife or dagger-like weapon intended for stabbing."},{"definition":"A rapier."},{"definition":"An awl."},{"definition":"A woman's shoe with a tall, slender heel (called a stiletto heel)."},{"definition":"A beard trimmed into a pointed form."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attack or kill with a stiletto (dagger)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sharp and narrow like a stiletto.","example":"Her stiletto heels would cause damage if she ever stepped on someone's foot with them."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/stəˈlɛtoʊ/"}]},{"word":"UNIDIRECTIONAL","idx":39976,"count":490154,"meanings":[{"definitions":[{"definition":"A fabric in which the majority of fibres run in the same single direction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to only one direction, e.g.: where all component parts are aligned in the same direction in space."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/-daɪ-/"}]},{"word":"WESTBOUND","idx":39977,"count":490148,"meanings":[{"definitions":[{"definition":"Which is, or will be, moving towards the west.","example":"Westbound traffic was blocked for miles."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Towards the west; in a westerly direction.","example":"He was driving westbound on the George Washington Bridge."}],"partOfSpeech":"v"}]},{"word":"TEACUP","idx":39978,"count":490146,"meanings":[{"definitions":[{"definition":"A small cup, usually with a handle, used for drinking tea; normally sits in a saucer as part of a tea set."},{"definition":"A unit of measure; a teacupful."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of an animal, smaller than average."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/tiː.kʌp/"}]},{"word":"CABINETRY","idx":39982,"count":489988,"meanings":[{"definitions":[{"definition":"The craft of making high-quality wooden furniture; cabinetmaking."},{"definition":"High-quality wooden furniture; cabinetwork."}],"partOfSpeech":"n"}]},{"word":"STIPULATES","idx":39986,"count":489816,"meanings":[{"definitions":[{"definition":"To require (something) as a condition of a contract or agreement."},{"definition":"To specify, promise or guarantee something in an agreement."},{"definition":"To acknowledge the truth of; not to challenge. E.g. \"The defense stipulates that the witness has identified my client.\""}],"partOfSpeech":"ve"}]},{"word":"SECESSION","idx":39988,"count":489768,"meanings":[{"definitions":[{"definition":"The act of seceding.","example":"That year, secession was enacted on account of unreasonable policies."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˈsɛʃən/"}]},{"word":"OPTIMIZES","idx":39989,"count":489765,"meanings":[{"definitions":[{"definition":"(originally intransitive) To act optimistically or as an optimist."},{"definition":"To make (something) optimal."},{"definition":"To make (something) more efficient, such as a computer program."},{"definition":"To become optimal."}],"partOfSpeech":"ve"}]},{"word":"COUNTERED","idx":39994,"count":489682,"meanings":[{"definitions":[{"definition":"To contradict, oppose."},{"definition":"To return a blow while receiving one, as in boxing."},{"definition":"To take action in response to; to respond."},{"definition":"To encounter."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkaʊntəd/"}]},{"word":"TOQUES","idx":39995,"count":489646,"meanings":[{"definitions":[{"definition":"A type of hat with no brim."},{"definition":"(specifically) A tall white hat with no brim of the sort worn by chefs"},{"definition":"(by extension) A chef."},{"definition":"A variety of bonnet monkey; toque macaque, Macaca sinica."},{"definition":"An African nominal money of account, equal to 40 cowries."},{"definition":"A knitted hat, usually conical but of varying shape, often woollen, and sometimes topped by a pom-pom or tassel."},{"definition":"A rhythm used in Latin music, especially Cuban religious rituals."},{"definition":"The guitar part of flamenco music."}],"partOfSpeech":"n"}]},{"word":"INSTINCTIVELY","idx":39997,"count":489600,"meanings":[{"definitions":[{"definition":"Innately; by instinct; without being taught.","example":"Fish instinctively know how to swim; most humans don't."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"instinctively-us","text":"/ɪnˈstɪŋktɪvli/"}]},{"word":"DROPOUTS","idx":39998,"count":489585,"meanings":[{"definitions":[{"definition":"Someone who has left an educational institution without completing the course","example":"The politicians of the world are mere political university dropouts."},{"definition":"Someone who has opted out of conventional society."},{"definition":"One who suddenly leaves anything, or the act of doing so."},{"definition":"The slot in the frame that accepts the axles of the wheels."},{"definition":"A damaged portion of a tape or disk, causing a brief omission of audio, video, or data."},{"definition":"Momentary loss of an electronic signal."},{"definition":"A technique for regularizing a neural network by discarding a random subset of its units."}],"partOfSpeech":"n"}]},{"word":"GAMECOCKS","idx":40000,"count":489559,"meanings":[{"definitions":[{"definition":"A fighting cock: a rooster used in cockfighting."}],"partOfSpeech":"n"}]},{"word":"CONSPIRACIES","idx":40001,"count":489550,"meanings":[{"definitions":[{"definition":"The act of two or more persons, called conspirators, working secretly to obtain some goal, usually understood with negative connotations."},{"definition":"An agreement between two or more persons to break the law at some time in the future."},{"definition":"A group of ravens."},{"definition":"A group of lemurs."},{"definition":"A situation in which different phonological or grammatical rules lead to similar or related outcomes."},{"definition":"(by ellipsis) A conspiracy theory; a hypothesis alleging conspiracy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To conspire."}],"partOfSpeech":"ve"}]},{"word":"CHAPELS","idx":40002,"count":489542,"meanings":[{"definitions":[{"definition":"A place of worship, smaller than or subordinate to a church."},{"definition":"A place of worship in another building or within a civil institution such as a larger church, airport, prison, monastery, school, etc.; often primarily for private prayer."},{"definition":"A funeral home, or a room in one for holding funeral services."},{"definition":"A trade union branch in printing or journalism."},{"definition":"A printing office."},{"definition":"A choir of singers, or an orchestra, attached to the court of a prince or nobleman."}],"partOfSpeech":"n"}]},{"word":"SINUSITIS","idx":40006,"count":489399,"meanings":[{"definitions":[{"definition":"An inflammation of one or more paranasal sinuses."}],"partOfSpeech":"n"}]},{"word":"RUSK","idx":40007,"count":489388,"meanings":[{"definitions":[{"definition":"A rectangular, hard, dry biscuit"},{"definition":"A twice-baked bread, slices of bread baked until they are hard and crisp (also called a zwieback)"},{"definition":"A weaning food for children"},{"definition":"A cereal binder used in meat product manufacture"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹʌsk/"}]},{"word":"FRACTALS","idx":40008,"count":489367,"meanings":[{"definitions":[{"definition":"A mathematical set that has a non-integer and constant Hausdorff dimension; a geometric figure that is self-similar at all scales."},{"definition":"An object, system, or idea that exhibits a fractal-like property."}],"partOfSpeech":"n"}]},{"word":"DEPRESSANTS","idx":40009,"count":489353,"meanings":[{"definitions":[{"definition":"A pharmacological substance which decreases neuronal or physiological activity.","example":"Alcohol acts first as a stimulant and then as a depressant."},{"definition":"An agent that inhibits the flotation of a mineral or minerals."}],"partOfSpeech":"n"}]},{"word":"TRYOUTS","idx":40011,"count":489341,"meanings":[{"definitions":[{"definition":"A test of the suitability or effectiveness of a person or thing, especially of a performer or athlete (an audition)"}],"partOfSpeech":"n"}]},{"word":"MINIONS","idx":40015,"count":489305,"meanings":[{"definitions":[{"definition":"The lowest limit.","example":"We need a minimum of three staff members on duty at all time."},{"definition":"The smallest amount.","example":"He always tries to get away with doing the minimum."},{"definition":"A period of minimum brightness or energy intensity (of a star).","example":"The Maunder minimum of the Sun reportedly corresponded to a period of great cold on Earth."},{"definition":"A lower bound of a set which is also an element of that set."},{"definition":"The smallest member of a batch or sample or the lower bound of a probability distribution."},{"definition":"A loyal servant of another, usually a more powerful being.","example":"The archvillain deployed his minions to simultaneously rob every bank in the city."},{"definition":"A sycophantic follower."},{"definition":"A loved one; one highly esteemed and favoured."},{"definition":"An ancient form of ordnance with a calibre of about three inches."},{"definition":"The size of type between nonpareil and brevier, standardized as 7-point."}],"partOfSpeech":"n"}]},{"word":"ADAPTS","idx":40016,"count":489293,"meanings":[{"definitions":[{"definition":"To make suitable; to make to correspond; to fit or suit"},{"definition":"To fit by alteration; to modify or remodel for a different purpose; to adjust","example":"to adapt a story for the stage"},{"definition":"To make by altering or fitting something else; to produce by change of form or character","example":"a word of an adapted form"},{"definition":"To make oneself comfortable to a new thing.","example":"They could not adapt to the new climate and so perished."}],"partOfSpeech":"ve"}]},{"word":"BRUNT","idx":40019,"count":489270,"meanings":[{"definitions":[{"definition":"The full adverse effects; the chief consequences or negative results of a thing or event.","example":"Unfortunately, poor areas such as those in New Orleans bore the brunt of Hurricane Katrina’s winds."},{"definition":"The major part of something; the bulk.","example":"If you feel tired of walking, just think of the poor donkey who has carried the brunt of our load."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bear the brunt of; to weather or withstand.","example":"We brunted the storm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"brunt-au","text":"/bɹʌnt/"}]},{"word":"INFRACTION","idx":40020,"count":489190,"meanings":[{"definitions":[{"definition":"A minor offence, petty crime"},{"definition":"A violation; breach"},{"definition":"A major violation of rules which leads to a penalty, if detected by the referee."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈfɹækʃən/"},{"text":"/ɪnˈfɹakʃən/"}]},{"word":"GORY","idx":40021,"count":489190,"meanings":[{"definitions":[{"definition":"Covered with blood, very bloody"},{"definition":"Unpleasant","example":"Her autobiography gives all the gory details of her many divorces."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gory-us","text":"/ˈɡɔːɹ.i/"}]},{"word":"GLENS","idx":40022,"count":489161,"meanings":[{"definitions":[{"definition":"A secluded and narrow valley, especially one with a river running through it; a dale; a depression between hills."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡlɛnz/"}]},{"word":"STRANGEST","idx":40023,"count":489136,"meanings":[{"definitions":[{"definition":"Not normal; odd, unusual, surprising, out of the ordinary.","example":"He thought it strange that his girlfriend wore shorts in the winter."},{"definition":"Unfamiliar, not yet part of one's experience.","example":"I moved to a strange town when I was ten."},{"definition":"Having the quantum mechanical property of strangeness."},{"definition":"Of an attractor: having a fractal structure."},{"definition":"Belonging to another country; foreign."},{"definition":"Reserved; distant in deportment."},{"definition":"Backward; slow."},{"definition":"Not familiar; unaccustomed; inexperienced."},{"definition":"Not belonging to one."}],"partOfSpeech":"j"}]},{"word":"STAGNATION","idx":40025,"count":489059,"meanings":[{"definitions":[{"definition":"Inactivity","example":"The general concern about industrial stagnation inspired an overhaul of the patent system."},{"definition":"Being stagnant; being without circulation","example":"Factors known to encourage the growth of harmful bacteria inside cooling systems include the stagnation of the water."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/stæɡˈneɪʃən/"}]},{"word":"DISPLACE","idx":40026,"count":489049,"meanings":[{"definitions":[{"definition":"To put out of place; to disarrange."},{"definition":"To move something, or someone, especially to forcibly move people from their homeland."},{"definition":"To supplant, or take the place of something or someone; to substitute."},{"definition":"To replace, on account of being superior to or more suitable than that which is being replaced.","example":"Electronic calculators soon displaced the older mechanical kind."},{"definition":"(of a floating ship) To have a weight equal to that of the water displaced."},{"definition":"To repress"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪsˈpleɪs/"}]},{"word":"COUNTRYMEN","idx":40029,"count":488958,"meanings":[{"definitions":[{"definition":"Somebody from a certain country."},{"definition":"Somebody from one's own country; a fellow countryman; compatriot."},{"definition":"A country dweller, especially a follower of country pursuits."},{"definition":"(traveller) A settled person, as opposed to a traveller."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkʌntɹimən/"}]},{"word":"ENDNOTES","idx":40030,"count":488929,"meanings":[{"definitions":[{"definition":"An annotation placed at the end of a document or chapter of a document."}],"partOfSpeech":"n"}]},{"word":"DISSIDENTS","idx":40032,"count":488884,"meanings":[{"definitions":[{"definition":"A person who formally opposes the current political structure, the political group in power, the policies of the political group in power, or current laws."},{"definition":"One who disagrees or dissents; one who separates from the established religion."}],"partOfSpeech":"n"}]},{"word":"ITERATE","idx":40033,"count":488875,"meanings":[{"definitions":[{"definition":"A function that iterates"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform or repeat an action on each item in a set","example":"The max() function iterates through the data to find the highest value."},{"definition":"To perform or repeat an action on the results of each such prior action","example":"In mathematics, an iterated function is a function which is composed with itself, possibly ad infinitum, in a process called iteration."},{"definition":"To utter or do a second time or many times; to repeat.","example":"to iterate advice"},{"definition":"To repeat an activity, making incremental changes each time"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Said or done again; repeated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"iterate-uk","text":"/ˈaɪtəɹeɪt/"}]},{"word":"EMBER","idx":40035,"count":488846,"meanings":[{"definitions":[{"definition":"A glowing piece of coal or wood."},{"definition":"Smoldering ash."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Making a circuit of the year or the seasons; recurring in each quarter of the year, as certain religious days set apart for fasting and prayer.","example":"ember days"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɛm.bɚ/"},{"text":"/ˈɛm.bəː/"}]},{"word":"NEOLITHIC","idx":40037,"count":488818,"meanings":[{"definitions":[{"definition":"Hopelessly outdated","example":"What am I supposed to do with this neolithic piece of machinery?"}],"partOfSpeech":"j"}]},{"word":"PERISHABLE","idx":40038,"count":488808,"meanings":[{"definitions":[{"definition":"That which perishes or is short-lived."},{"definition":"(in the plural) food that does not keep for long."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Liable to perish, especially naturally subject to quick decomposition or decay."}],"partOfSpeech":"j"}]},{"word":"VETOED","idx":40042,"count":488671,"meanings":[{"definitions":[{"definition":"To use a veto against."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈviːtəʊd/"}]}]