[{"word":"ENGROSSING","idx":54278,"count":289548,"meanings":[{"definitions":[{"definition":"To write (a document) in large, aesthetic, and legible lettering; to make a finalized copy of."},{"definition":"To buy up wholesale, especially to buy the whole supply of (a commodity etc.)."},{"definition":"To monopolize; to concentrate (something) in the single possession of someone, especially unfairly."},{"definition":"To completely engage the attention of.","example":"She seems to be completely engrossed in that book."},{"definition":"To thicken; to condense."},{"definition":"To make gross, thick, or large; to thicken; to increase in bulk or quantity."},{"definition":"To amass."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who engrosses, or buys up wholesale."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Utterly consuming one's time and attention.","example":"an engrossing documentary"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɛnˈɡɹoʊsɪŋ/"},{"text":"/ɛnˈɡɹəʊsɪŋ/"}]},{"word":"VIREO","idx":54281,"count":289521,"meanings":[{"definitions":[{"definition":"Any of a number of small insectivorous passerine birds, of the genus Vireo, that have grey-green plumage."},{"definition":"Any bird of the family Vireonidae, which includes vireos, shrike-vireo, greenlets and peppershrikes."},{"definition":"(in plural) The family Vireonidae."}],"partOfSpeech":"n"}]},{"word":"LETHARGY","idx":54282,"count":289520,"meanings":[{"definitions":[{"definition":"A condition characterized by extreme fatigue or drowsiness, or prolonged sleep patterns."},{"definition":"A state of extreme torpor or apathy, especially with lack of emotion or interest; loosely, sluggishness, laziness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lethargy-uk","text":"/ˈlɛθədʒi/"}]},{"word":"GYNECOLOGICAL","idx":54286,"count":289465,"meanings":[{"definitions":[{"definition":"Of or pertaining to gynecology."}],"partOfSpeech":"j"}]},{"word":"REVERTS","idx":54293,"count":289395,"meanings":[{"definitions":[{"definition":"One who, or that which, reverts."},{"definition":"One who reverts to that religion which he had adhered to before having converted to another"},{"definition":"(due to the belief that all people are born Muslim) A convert to Islam."},{"definition":"The act of reversion (of e.g. a database transaction or source control repository) to an earlier state.","example":"We've found that git reverts are at least an order of magnitude faster than SVN reverse merges."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(now rare) To turn back, or turn to the contrary; to reverse."},{"definition":"To throw back; to reflect; to reverberate."},{"definition":"To cause to return to a former condition."},{"definition":"(now rare) To return; to come back.","example":"If they attack, we will revert to the bunker."},{"definition":"To return to the possession of.","example":"When a book goes out of print, rights revert from the publisher to the author."},{"definition":"To cause (a property or rights) to return to the previous owner.","example":"Sometimes a publisher will automatically revert rights back to an author once a book has gone out of print."},{"definition":"To return to a former practice, condition, belief, etc."},{"definition":"To return to an earlier or primitive type or state; to take on the traits or characters of an ancestral type."},{"definition":"To change back, as from a soluble to an insoluble state or the reverse.","example":"Phosphoric acid in certain fertilizers reverts."},{"definition":"To take up again or return to a previous topic."},{"definition":"(in Muslim usage, due to the belief that all people are born Muslim) To convert to Islam."},{"definition":"(originally India, now also Singapore, Malaysia, Hong Kong) To reply (to correspondence, for example).","example":"Please revert before Monday."},{"definition":"To treat (a series, such as y = a + bx + cx2 + ..., where one variable y is expressed in powers of a second variable x), so as to find the second variable x expressed in a series arranged in powers of y."}],"partOfSpeech":"ve"}]},{"word":"PURINE","idx":54294,"count":289355,"meanings":[{"definitions":[{"definition":"Any of a class of organic heterocyclic compounds, composed of fused pyrimidine and imidazole rings, that constitute one of the two groups of organic nitrogenous bases (the other being the pyrimidines) and are components of nucleic acids."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpjʊəɹiːn/"}]},{"word":"COUNTERPUNCH","idx":54295,"count":289354,"meanings":[{"definitions":[{"definition":"A punch delivered in response to a previous punch by somebody else, such as an opponent in a boxing match."},{"definition":"A punch used in the cutting of other punches, often used to create the negative space in or around a glyph."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deliver a punch designed to exploit an opponent's momentary defensive weakness caused by a punch thrown by the opponent."},{"definition":"To deliver a competitive response to an opponent designed to exploit a weakness created by the opponent's offensive efforts."}],"partOfSpeech":"ve"}]},{"word":"FROLIC","idx":54296,"count":289348,"meanings":[{"definitions":[{"definition":"Gaiety; merriment."},{"definition":"A playful antic."},{"definition":"A social gathering."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make merry; to have fun; to romp; to behave playfully and uninhibitedly.","example":"We saw the lambs frolicking in the meadow."},{"definition":"To cause to be merry."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Merry, joyous, full of mirth; later especially, frolicsome, sportive, full of playful mischief."},{"definition":"Free; liberal; bountiful; generous."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"frolic-us","text":"/ˈfɹɑlɪk/"}]},{"word":"TRANSFUSIONS","idx":54298,"count":289322,"meanings":[{"definitions":[{"definition":"The transfer of blood or blood products from one individual to another."},{"definition":"The act of pouring liquid from one vessel to another."}],"partOfSpeech":"n"}]},{"word":"LIGHTYEAR","idx":54300,"count":289312,"meanings":[{"definitions":[{"definition":"A unit of length (abbreviation ly; equal to just under 10 trillion kilometres (1016 metres)) equal to the distance light travels in one Julian year; used to measure extremely large distances."},{"definition":"(only in plural) A very long way.","example":"The marathon runner in the lead is light years ahead of the one at the back."},{"definition":"(only in plural) A very long time.","example":"Some of Leonardo da Vinci’s inventions were light years ahead of their time."}],"partOfSpeech":"n"}]},{"word":"GITES","idx":54303,"count":289297,"meanings":[{"definitions":[{"definition":"A gown."},{"definition":"A French holiday home, or a rented tourist cottage."}],"partOfSpeech":"n"}]},{"word":"CASEWORK","idx":54304,"count":289297,"meanings":[{"definitions":[{"definition":"The work required to deal with cases in any profession where a \"case\" has a specific definition (e.g. legal, social work, planning, etc.).","example":"Most of her time is spent on casework, rather than research."}],"partOfSpeech":"n"}]},{"word":"CASSIA","idx":54305,"count":289291,"meanings":[{"definitions":[{"definition":"The spice made from the bark of members of the genus Cinnamomum other than true cinnamon (C. verum), when they are distinguished from cinnamon."},{"definition":"Such trees themselves, particularly the Chinese cinnamon, Cinnamomum cassia."},{"definition":"Any of several tropical leguminous plants, of the genus Cassia."},{"definition":"Any of several tropical leguminous plants, of the genus Senna."},{"definition":"(countable, mistranslation from Chinese) The sweet osmanthus (O. fragrans)."}],"partOfSpeech":"n"}]},{"word":"PAINSTAKING","idx":54308,"count":289263,"meanings":[{"definitions":[{"definition":"The application of careful and attentive effort."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Carefully attentive to details; diligent in performing a process or procedure."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpeɪnˌsteɪkɪŋ/"},{"text":"/ˈpeɪnzˌteɪkɪŋ/"}]},{"word":"LAMINA","idx":54310,"count":289244,"meanings":[{"definitions":[{"definition":"A very thin layer of material."},{"definition":"A thin plate or scale, such as the arch of a vertebra."},{"definition":"The flat part of a leaf or leaflet; the blade."},{"definition":"A fine layer that occurs in sedimentary rocks."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlæm.ɪ.nə/"}]},{"word":"UMBER","idx":54312,"count":289235,"meanings":[{"definitions":[{"definition":"A brown clay, somewhat darker than ochre, which contains iron and manganese oxides."},{"definition":"A grayling."},{"definition":"A dusky brown African wading bird (Scopus umbretta) allied to the shoebill and herons; a hamerkop."},{"definition":"In ancient armour, a visor, or projection like the peak of a cap, to which a fixed or movable faceguard was sometimes attached."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a reddish-brown colour to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a reddish brown colour, like that of the pigment."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"umber-uk","text":"/ˈʌmbə/"}]},{"word":"GOTHS","idx":54315,"count":289217,"meanings":[{"definitions":[{"definition":"A punk-derived subculture of people who predominantly dress in black, associated with mournful music and attitudes.","example":"Philip had been into goth for many years."},{"definition":"A style of punk rock influenced by glam rock; gothic rock."},{"definition":"A person who is part of the goth subculture.","example":"We saw a solitary goth hanging out on the steps of the train station."}],"partOfSpeech":"n"}]},{"word":"FINALITY","idx":54316,"count":289205,"meanings":[{"definitions":[{"definition":"The state of being final; the condition from which no further changes occur.","example":"The finality of my father's death suddenly hit me: there would be no more bedtime stories, no more games of catch in the back yard."}],"partOfSpeech":"n"}]},{"word":"TOPPLED","idx":54318,"count":289200,"meanings":[{"definitions":[{"definition":"To push, throw over, overturn or overthrow something","example":"The massed crowds toppled the statue of the former dictator."},{"definition":"To totter and fall, or to lean as if about to do so","example":"The pile of pennies began to topple."}],"partOfSpeech":"ve"}]},{"word":"EWES","idx":54319,"count":289200,"meanings":[{"definitions":[{"definition":"A female sheep, as opposed to a ram."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/juːz/"}]},{"word":"MENDING","idx":54321,"count":289190,"meanings":[{"definitions":[{"definition":"To repair, as anything that is torn, broken, defaced, decayed, or the like; to restore from partial decay, injury, or defacement.","example":"My trousers have a big rip in them and need mending."},{"definition":"To alter for the better; to set right; to reform; hence, to quicken; as, to mend one's manners or pace.","example":"Her stutter was mended by a speech therapist."},{"definition":"To help, to advance, to further; to add to."},{"definition":"To grow better; to advance to a better state; to become improved."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is mended or repaired."}],"partOfSpeech":"n"}]},{"word":"EXCAVATORS","idx":54322,"count":289187,"meanings":[{"definitions":[{"definition":"A person who excavates."},{"definition":"A curette used to scrape out pathological material."},{"definition":"A vehicle, often on tracks, used to dig ditches etc; a backhoe; digger."}],"partOfSpeech":"n"}]},{"word":"WRESTLED","idx":54324,"count":289149,"meanings":[{"definitions":[{"definition":"To contend, with an opponent, by grappling and attempting to throw, immobilize or otherwise defeat him, depending on the specific rules of the contest"},{"definition":"To struggle or strive"},{"definition":"To take part in a wrestling match with someone"},{"definition":"To move or lift something with difficulty"},{"definition":"To throw a calf etc in order to brand it"},{"definition":"To fight."}],"partOfSpeech":"ve"}]},{"word":"SCIATICA","idx":54329,"count":289110,"meanings":[{"definitions":[{"definition":"Neuralgia of the sciatic nerve, characterised by pain radiating down through the buttocks and the back of the thigh."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/saɪˈætɪkə/"}]},{"word":"SHAKEDOWN","idx":54333,"count":289090,"meanings":[{"definitions":[{"definition":"Extortion, especially through blackmail","example":"What is this, a shakedown?"},{"definition":"A thorough search; a frisk"},{"definition":"A trial or test period, especially of a ship or aircraft"},{"definition":"An improvised bed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That tests the performance of a ship or aircraft"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shakedown-au"}]},{"word":"ANEURYSMS","idx":54334,"count":289089,"meanings":[{"definitions":[{"definition":"An abnormal blood-filled swelling of an artery or vein, resulting from a localized weakness in the wall of the vessel."}],"partOfSpeech":"n"}]},{"word":"CAUCUSES","idx":54337,"count":289063,"meanings":[{"definitions":[{"definition":"A usually preliminary meeting of party members to nominate candidates for public office or delegates to be sent a nominating convention, or to confer regarding policy."},{"definition":"A grouping of all the members of a legislature from the same party."},{"definition":"A political interest group by members of a legislative body."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To meet and participate in caucus."},{"definition":"To bring into or treat in caucus."}],"partOfSpeech":"ve"}]},{"word":"RERUNS","idx":54338,"count":289050,"meanings":[{"definitions":[{"definition":"A television program shown after its initial presentation — particularly many weeks after its initial presentation; a repeat."},{"definition":"Another printing run (impression; batch of copies of a given edition) of a book, cartoon, etc."},{"definition":"A political candidate who holds the same political agenda or doctrine as a past or incumbent holder of a given political office."},{"definition":"A second or subsequent run of a program.","example":"Each rerun of the algorithm takes several minutes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To run (a previously broadcast television program) again."},{"definition":"To run (a race) again."},{"definition":"To run (a computer program) again."}],"partOfSpeech":"ve"}]},{"word":"PLAZAS","idx":54342,"count":289008,"meanings":[{"definitions":[{"definition":"A town's public square."},{"definition":"An open area used for gathering in a city, often having small trees and sitting benches."},{"definition":"A strip mall."}],"partOfSpeech":"n"}]},{"word":"HURTFUL","idx":54343,"count":289005,"meanings":[{"definitions":[{"definition":"Tending to impair or damage; injurious; occasioning loss or injury."},{"definition":"Tending to hurt someone's feelings; insulting."}],"partOfSpeech":"j"}]},{"word":"ALTERNATION","idx":54346,"count":288969,"meanings":[{"definitions":[{"definition":"The reciprocal succession of (normally two) things in time or place; the act of following and being followed by turns; alternate succession, performance, or occurrence","example":"alternation between night shifts and day shifts"},{"definition":"The response of the congregation speaking alternately with the minister."},{"definition":"Ablaut."},{"definition":"A pattern by which more than one construct is possible, as with \"Alice cooked Bob dinner\" and \"Alice cooked dinner for Bob\".","example":"dative alternation; locative alternation"},{"definition":"The \"inclusive or\" truth function."},{"definition":"A sequence that alternates between positive and negative values; sometimes incorrectly used to mean permutation."},{"definition":"A construct in a regular expression that can match any of several specified subexpressions."},{"definition":"A type of partial truncation of a polygon, polyhedron or tiling in which alternate vertices are removed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"alternation-uk","text":"/ˈɒl.tə(ɹ).ˌneɪ.ʃən/"}]},{"word":"ASTIGMATISM","idx":54349,"count":288928,"meanings":[{"definitions":[{"definition":"A defect of a lens such that light rays coming from a point do not meet at a focal point so that the image is blurred."},{"definition":"A disorder of the vision, usually due to a misshapen cornea, such that light does not focus correctly on the retina causing a blurred image."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈstɪɡmətɪzm̩/"}]},{"word":"RECEDING","idx":54355,"count":288891,"meanings":[{"definitions":[{"definition":"To move back; to retreat; to withdraw."},{"definition":"To cede back; to grant or yield again to a former possessor.","example":"to recede conquered territory"},{"definition":"To take back."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of something that recedes; a recessed part."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Going or moving back or further away from a previous position, gradually diminishing."},{"definition":"That recedes","example":"A receding hairline"}],"partOfSpeech":"j"}]},{"word":"CONJUGATES","idx":54362,"count":288852,"meanings":[{"definitions":[{"definition":"Any entity formed by joining two or more smaller entities together."},{"definition":"(of a complex number) A complex conjugate."},{"definition":"More generally, any of a set of irrational or complex numbers that are zeros of the same polynomial with integral coefficients."},{"definition":"(of an element of an extension field) Given a field extension L / K and an element α ∈ L, any other element β ∈ L that is another root of the minimal polynomial of α over K."},{"definition":"An explementary angle."},{"definition":"(grammar) A word agreeing in derivation with another word, and therefore generally resembling it in meaning."},{"definition":"A weak and a strong antigen covalently linked together"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(grammar) To inflect (a verb) for each person, in order, for one or more tenses.","example":"In English, the verb 'to be' is conjugated as follows: 'I am', 'you are', 'he/she/it is', 'we are', 'you are', 'they are'."},{"definition":"To multiply on the left by one element and on the right by its inverse."},{"definition":"To join together, unite; to juxtapose."},{"definition":"(of bacteria and algae) To temporarily fuse, exchanging or transferring DNA."}],"partOfSpeech":"ve"}]},{"word":"CANDELABRA","idx":54369,"count":288762,"meanings":[{"definitions":[{"definition":"A single candelabrum."},{"definition":"A candle holder."}],"partOfSpeech":"n"}]},{"word":"MALFUNCTIONING","idx":54371,"count":288734,"meanings":[{"definitions":[{"definition":"To function improperly","example":"She told him the machine was poorly built, but they both knew that she was the one who had malfunctioned."},{"definition":"To fail to function"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A malfunction."}],"partOfSpeech":"n"}]},{"word":"OUTPOSTS","idx":54373,"count":288717,"meanings":[{"definitions":[{"definition":"A military post stationed at a distance from the main body of troops.","example":"The outpost did not have enough ammunition to resist a determined assault."},{"definition":"The body of troops manning such a post.","example":"Sgt. Smith fleeced most of the rest of the outpost of their earnings in their weekly game of craps."},{"definition":"An outlying settlement.","example":"Beyond the border proper, there are three small outposts not officially under government protection."},{"definition":"A square protected by a pawn that is in or near the enemy's stronghold."}],"partOfSpeech":"n"}]},{"word":"POLYUNSATURATED","idx":54374,"count":288711,"meanings":[{"definitions":[{"definition":"Of or relating to long chain organic compounds that have multiple double bonds; polyunsaturated fatty acids are essential to human nutrition."},{"definition":"(nutrition, of a fat or oil) Having a chemical structure that does not easily change into cholesterol (a substance containing a lot of fat though to be an important cause of heart disease)."}],"partOfSpeech":"j"}]},{"word":"MILLENNIAL","idx":54375,"count":288710,"meanings":[{"definitions":[{"definition":"A demographic term for a person from the generation born from around the early 1980s to the mid 1990s or early 2000s; individuals who reached adulthood early in the 3rd millennium, C.E."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Referring to the 1,000th anniversary of an event or happening.","example":"millennial fair"},{"definition":"Occurring every thousand years."},{"definition":"Occurring at the end or beginning of a millennium."},{"definition":"Of or relating to people born in the last two decades of the 20th century.","example":"He was suffering from a typical millennial problem: Which is the correct emoji to use?"},{"definition":"Referring to the millennium, the period of one thousand years during which Christ will reign on earth.","example":"the millennial judgment"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/mɪˈlɛni.əl/"}]},{"word":"ROASTS","idx":54377,"count":288677,"meanings":[{"definitions":[{"definition":"A cut of meat suited to roasting"},{"definition":"A meal consisting of roast foods."},{"definition":"The degree to which something, especially coffee, is roasted.","example":"Dark roast means that the coffee bean has been roasted to a higher temperature and for a longer period of time than in light roast."},{"definition":"A comical event, originally fraternal, where a person is subjected to verbal attack, yet may be praised by sarcasm and jokes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook food by heating in an oven or over a fire without covering, resulting in a crisp, possibly even slightly charred appearance.","example":"to roast meat on a spit"},{"definition":"To cook by surrounding with hot embers, ashes, sand, etc.","example":"to roast a potato in ashes"},{"definition":"To process by drying through exposure to sun or artificial heat","example":"Coffee beans need roasting before use."},{"definition":"To heat to excess; to heat violently; to burn."},{"definition":"To admonish someone vigorously","example":"I’m late home for the fourth time this week; my mate will really roast me this time."},{"definition":"To subject to bantering, severely criticize, sometimes as a comedy routine.","example":"The class clown enjoys being roasted by mates as well as staff."},{"definition":"To dissipate by heat the volatile parts of, as ores."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹoʊsts/"},{"text":"/ɹəʊsts/"}]},{"word":"ASYMMETRIES","idx":54379,"count":288662,"meanings":[{"definitions":[{"definition":"Absence of symmetry or proportion between the parts of a thing, or a distinction that produces such a lack of symmetry."},{"definition":"The lack of a common measure between two objects or quantities; incommensurability."}],"partOfSpeech":"n"}]},{"word":"TREADING","idx":54381,"count":288644,"meanings":[{"definitions":[{"definition":"To step or walk (on or over something); to trample.","example":"Don't tread on the lawn."},{"definition":"To step or walk upon.","example":"Actors tread the boards."},{"definition":"To beat or press with the feet.","example":"to tread a path; to tread land when too light; a well-trodden path"},{"definition":"To go through or accomplish by walking, dancing, etc."},{"definition":"To crush under the foot; to trample in contempt or hatred; to subdue."},{"definition":"To copulate; said of (especially male) birds."},{"definition":"(of a male bird) To copulate with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who treads."}],"partOfSpeech":"n"}]},{"word":"DOWNY","idx":54383,"count":288639,"meanings":[{"definitions":[{"definition":"Having down, covered with a soft fuzzy coating as of small feathers or hair.","example":"The chick's downy coat of feathers formed almost immediately to keep it warm."},{"definition":"Sharp-witted, perceptive."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A blanket filled with down; a duvet."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdaʊni/"}]},{"word":"CONFORMED","idx":54386,"count":288612,"meanings":[{"definitions":[{"definition":"(of persons, often followed by to) To act in accordance with expectations; to behave in the manner of others, especially as a result of social pressure."},{"definition":"(of things, situations, etc.) To be in accordance with a set of specifications or regulations, or with a policy or guideline."},{"definition":"To make similar in form or nature; to make suitable for a purpose; to adapt."}],"partOfSpeech":"ve"}]},{"word":"TACH","idx":54388,"count":288593,"meanings":[{"definitions":[{"definition":"Tachometer"},{"definition":"(costers) A hat."},{"definition":"Tachycardia.","example":"V-tach"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tæk/"}]},{"word":"MICROTUBULES","idx":54389,"count":288577,"meanings":[{"definitions":[{"definition":"A small tube made of protein and found in cells; part of the cytoskeleton."}],"partOfSpeech":"n"}]},{"word":"KUDZU","idx":54390,"count":288577,"meanings":[{"definitions":[{"definition":"An Asian vine (several species in the genus Pueraria, but mostly Pueraria montans var. lobata, syn. Pueraria lobata in the US), grown as a root starch, and which is a notorious invasive weed in the United States."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkʊd.zuː/"}]},{"word":"CHARACTERISTICALLY","idx":54393,"count":288572,"meanings":[{"definitions":[{"definition":"In a usual or expected way; in characteristic manner."}],"partOfSpeech":"v"}]},{"word":"BABS","idx":54400,"count":288517,"meanings":[{"definitions":[{"definition":"Baby"},{"definition":"A bait for eels, consisting of a bundle of live worms."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for eels using a bab."}],"partOfSpeech":"ve"}]},{"word":"TREATABLE","idx":54401,"count":288499,"meanings":[{"definitions":[{"definition":"Able to be treated; not incurable.","example":"In the 1980s, AIDS was not a treatable disease, and as a consequence the mortality rate at that time was very high."},{"definition":"Not intractable; moderate."}],"partOfSpeech":"j"}]},{"word":"GOLDSMITHS","idx":54404,"count":288467,"meanings":[{"definitions":[{"definition":"A person who makes, repairs or sells things out of gold, especially jewelry."},{"definition":"A banker (because the goldsmiths of London used to receive money on deposit, being equipped to keep it safely)."}],"partOfSpeech":"n"}]},{"word":"ERUPTS","idx":54406,"count":288455,"meanings":[{"definitions":[{"definition":"To eject something violently (such as lava or water, as from a volcano or geyser).","example":"The volcano erupted, spewing lava across a wide area."},{"definition":"To burst forth; to break out.","example":"The third molar tooth erupts late in most people, and sometimes does not appear at all."},{"definition":"To spontaneously release pressure or tension.","example":"The crowd erupted in anger."}],"partOfSpeech":"ve"}]},{"word":"SWARMS","idx":54409,"count":288429,"meanings":[{"definitions":[{"definition":"A large number of insects, especially when in motion or (for bees) migrating to a new colony."},{"definition":"A mass of people, animals or things in motion or turmoil.","example":"a swarm of meteorites"},{"definition":"A group of nodes sharing the same torrent in a BitTorrent network."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move as a swarm."},{"definition":"To teem, or be overrun with insects, people, etc."},{"definition":"To fill a place as a swarm."},{"definition":"To overwhelm as by an opposing army."},{"definition":"To climb by gripping with arms and legs alternately."},{"definition":"To breed multitudes."}],"partOfSpeech":"ve"}]},{"word":"TOROIDAL","idx":54411,"count":288420,"meanings":[{"definitions":[{"definition":"Having the shape of a torus or toroid"}],"partOfSpeech":"j"}]},{"word":"GEOGRAPHERS","idx":54414,"count":288373,"meanings":[{"definitions":[{"definition":"A specialist in geography."}],"partOfSpeech":"n"}]},{"word":"SCROLLER","idx":54416,"count":288358,"meanings":[{"definitions":[{"definition":"One who, or that which, scrolls."}],"partOfSpeech":"n"}]},{"word":"SPINNAKER","idx":54417,"count":288353,"meanings":[{"definitions":[{"definition":"A supplemental sail to the mainsail, especially a triangular one, used on yachts for running before the wind."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"spinnaker-uk","text":"/ˈspɪnəkə/"}]},{"word":"INCINERATORS","idx":54419,"count":288334,"meanings":[{"definitions":[{"definition":"A furnace that burns refuse."}],"partOfSpeech":"n"}]},{"word":"MEGAWATT","idx":54425,"count":288294,"meanings":[{"definitions":[{"definition":"One million (1 000 000) watts, abbreviated as MW."}],"partOfSpeech":"n"}]},{"word":"SUPERUSER","idx":54426,"count":288283,"meanings":[{"definitions":[{"definition":"A user with complete access to the operating system and its configuration."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"superuser-uk"}]},{"word":"EVOLUTIONS","idx":54428,"count":288272,"meanings":[{"definitions":[{"definition":"A change of position."},{"definition":"An unfolding."},{"definition":"Process of development."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɛvəˈluʃənz/"},{"text":"/ˌiːvəˈluːʃənz/"}]},{"word":"MINIMISED","idx":54429,"count":288261,"meanings":[{"definitions":[{"definition":"To make (something) as small or as insignificant as possible."},{"definition":"To remove (a window) from the main display area, collapsing it to an icon or caption.","example":"I didn't close anything, but I minimized all the windows so I could see the desktop."},{"definition":"To treat (someone) slightingly."}],"partOfSpeech":"ve"}]},{"word":"ESCORTING","idx":54430,"count":288254,"meanings":[{"definitions":[{"definition":"To attend to in order to guard and protect; to accompany as a safeguard (for the person escorted or for others); to give honorable or ceremonious attendance to"},{"definition":"To accompany (a person) in order to compel them to go somewhere (e.g. to leave a building).","example":"2018, TST-00493-18 (Re), Ontario Landlord and Tenant Board (Anna Solomon, member)"},{"definition":"To go with someone as a partner, for example on a formal date."}],"partOfSpeech":"ve"}]},{"word":"IRREGULARLY","idx":54431,"count":288250,"meanings":[{"definitions":[{"definition":"In an irregular manner; without rule, method, or order."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɪˈɹɛɡjʊləli/"}]},{"word":"CHIVES","idx":54434,"count":288208,"meanings":[{"definitions":[{"definition":"A perennial plant, Allium schoenoprasum, related to the onion."},{"definition":"(in the plural) The leaves of this plant used as a herb."},{"definition":"The style and stigma of a flower, especially saffron."},{"definition":"(thieves' cant) A knife."},{"definition":"(thieves' cant) A file."},{"definition":"(thieves' cant) A saw."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(thieves' cant) To stab."},{"definition":"(thieves' cant) To cut."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/t͡ʃaɪvz/"}]},{"word":"ORATORY","idx":54435,"count":288206,"meanings":[{"definitions":[{"definition":"A private chapel or prayer room."},{"definition":"A large Roman Catholic church."},{"definition":"The art of public speaking, especially in a formal, expressive, or forceful manner."},{"definition":"Eloquence; the quality of artistry and persuasiveness in speech or writing."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɔ.ɹə.tɔ.ɹi/"},{"text":"/ˈɒɹət(ə)ɹi/"},{"audio":"oratory-au"}]},{"word":"HARVESTERS","idx":54439,"count":288168,"meanings":[{"definitions":[{"definition":"A person who gathers the harvest."},{"definition":"A machine that gathers the harvest."},{"definition":"A program or algorithm that gathers data from a source."},{"definition":"A North American butterfly, Feniseca tarquinius, whose larvae eat aphids and are the only entirely carnivorous caterpillars in North America"},{"definition":"Any butterfly of the lycaenid subfamily Miletinae to which this belongs, which are all carnivores"}],"partOfSpeech":"n"}]},{"word":"WINGNUT","idx":54441,"count":288159,"meanings":[{"definitions":[{"definition":"A nut with wing-like projections to provide leverage in turning with thumb and forefinger."},{"definition":"One who advocates extreme measures or changes, especially if they hold or are perceived to hold far-right viewpoints; a radical or reactionary."},{"definition":"Someone with large, protruding ears."},{"definition":"A deciduous tree of the genus Pterocarya native to Asia."},{"definition":"Someone with crazy or extreme political views (especially extreme conservative views)."},{"definition":"(North American itinerant and street populations) A mentally ill homeless person."},{"definition":"Someone perceived as odd, eccentric, and/or extreme."},{"definition":"(rural US) A member of the air force (in a town that hosts a USAF installation)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wingnut-au","text":"/ˈwɪŋˌnʌt/"}]},{"word":"SHARPEST","idx":54449,"count":288076,"meanings":[{"definitions":[{"definition":"Terminating in a point or edge, especially one that can cut easily; not obtuse or rounded.","example":"A face with sharp features"},{"definition":"Intelligent.","example":"My nephew is a sharp lad; he can count to 100 in six languages, and he's only five years old."},{"definition":"Higher than usual by one semitone (denoted by the symbol ♯ after the name of the note)."},{"definition":"Higher in pitch than required.","example":"The orchestra's third violin several times was sharp about an eighth of a tone."},{"definition":"Having an intense, acrid flavour.","example":"Milly couldn't stand sharp cheeses when she was pregnant, because they made her nauseated."},{"definition":"Sudden and intense.","example":"A pregnant woman during labor normally experiences a number of sharp contractions."},{"definition":"Illegal or dishonest.","example":"Michael had a number of sharp ventures that he kept off the books."},{"definition":"Keenly or unduly attentive to one's own interests; shrewd.","example":"a sharp dealer;  a sharp customer"},{"definition":"Exact, precise, accurate; keen.","example":"You'll need sharp aim to make that shot."},{"definition":"Offensive, critical, or acrimonious.","example":"When the two rivals met, first there were sharp words, and then a fight broke out."},{"definition":"Stylish or attractive.","example":"You look so sharp in that tuxedo!"},{"definition":"Observant; alert; acute.","example":"Keep a sharp watch on the prisoners. I don't want them to escape!"},{"definition":"Forming a small angle; especially, forming an angle of less than ninety degrees.","example":"Drive down Main for three quarters of a mile, then make a sharp right turn onto Pine."},{"definition":"Steep; precipitous; abrupt.","example":"a sharp ascent or descent; a sharp turn or curve"},{"definition":"(of a statement) Said of as extreme a value as possible.","example":"Sure, any planar graph can be five-colored. But that result is not sharp: in fact, any planar graph can be four-colored. That is sharp: the same can't be said for any lower number."},{"definition":"Tactical; risky."},{"definition":"Piercing; keen; severe; painful.","example":"a sharp pain; the sharp and frosty winter air"},{"definition":"Eager or keen in pursuit; impatient for gratification.","example":"a sharp appetite"},{"definition":"Fierce; ardent; fiery; violent; impetuous."},{"definition":"Composed of hard, angular grains; gritty."},{"definition":"Uttered in a whisper, or with the breath alone; aspirated; unvoiced."},{"definition":"Hungry."}],"partOfSpeech":"j"}]},{"word":"PALISADE","idx":54451,"count":288033,"meanings":[{"definitions":[{"definition":"A long, strong stake, one end of which is set firmly in the ground, and the other sharpened."},{"definition":"A wall of wooden stakes, used as a defensive barrier."},{"definition":"A line of cliffs, especially one showing basaltic columns."},{"definition":"An even row of cells. e.g.: palisade mesophyll cells."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually in the passive) To equip with a palisade."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"palisade-us"}]},{"word":"SEPTAL","idx":54452,"count":288025,"meanings":[{"definitions":[{"definition":"Of or pertaining to the septum."},{"definition":"Relating to an Irish clan or sept."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɛptəl/"}]},{"word":"SPRAINS","idx":54454,"count":288007,"meanings":[{"definitions":[{"definition":"The act or result of spraining; lameness caused by spraining","example":"a bad sprain of the wrist"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To weaken, as a joint, ligament, or muscle, by sudden and excessive exertion, as by wrenching; to overstrain, or stretch injuriously, but without luxation","example":"to sprain one's ankle"}],"partOfSpeech":"ve"}]},{"word":"CORVETTES","idx":54455,"count":287999,"meanings":[{"definitions":[{"definition":"A flush-decked warship of the 17th-18th centuries having a single tier of guns; it ranked next below a frigate; – called in the United States navy a sloop of war."},{"definition":"In a modern navy, a lightly armed and armoured blue water warship, smaller than a frigate, capable of transoceanic duty."}],"partOfSpeech":"n"}]},{"word":"MOCCASIN","idx":54457,"count":287978,"meanings":[{"definitions":[{"definition":"A traditional Native North American shoe, usually without a heel or sole, made of a piece of deerskin or other soft leather turned up at the edges which are either stitched together at the top of the shoe, or sewn to a vamp (a piece covering the top of the foot)."},{"definition":"A modern shoe with either a low or no heel resembling a traditional Native American moccasin in that the leather forming the sides of the shoe is stitched at the top."},{"definition":"A light beige colour, like that of a moccasin."},{"definition":"Any of several North American snakes of the genus Agkistrodon, particularly the copperhead (Agkistrodon contortrix) and the cottonmouth or water moccasin (Agkistrodon piscivorus)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɑkəsɪn/"},{"text":"/ˈmɒkəsɪn/"},{"audio":"moccasin-au"}]},{"word":"INTRAOPERATIVE","idx":54460,"count":287971,"meanings":[{"definitions":[{"definition":"Happening during a surgical operation."}],"partOfSpeech":"j"}]},{"word":"CIRCUMCISED","idx":54461,"count":287969,"meanings":[{"definitions":[{"definition":"To surgically remove the foreskin (prepuce) from a penis (male)."},{"definition":"(sometimes proscribed) To surgically remove the clitoris (clitoridectomy), clitoral hood, or labia (female)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A circumcised person"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of an man) Having had the foreskin of the penis excised."},{"definition":"(of a woman) Having had the clitoris, prepuce, or labia excised."}],"partOfSpeech":"j"}]},{"word":"LEMUR","idx":54467,"count":287912,"meanings":[{"definitions":[{"definition":"Any strepsirrhine primate of the infraorder Lemuriformes, superfamily Lemuroidea, native only to Madagascar and some surrounding islands."},{"definition":"Any of the genus Lemur, represented by the ring-tailed lemur (Lemur catta)."},{"definition":"A loris (Lemur tardigradus, now Loris tardigradus), predating the 10th edition of Systema Naturæ."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lemur-uk","text":"/ˈliːmə(ɹ)/"}]},{"word":"GROWLED","idx":54469,"count":287897,"meanings":[{"definitions":[{"definition":"To utter a deep guttural sound, as an angry animal; to give forth an angry, grumbling sound.","example":"The dog growled at me as I walked past."},{"definition":"Of a wind instrument: to produce a low-pitched rumbling sound."},{"definition":"To send a user a message via the Growl software library."},{"definition":"To express (something) by growling.","example":"The old man growled his displeasure at the postman."},{"definition":"To play a wind instrument in a way that produces a low-pitched rumbling sound."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"growled-us","text":"/ɡɹaʊld/"}]},{"word":"AUXILIARIES","idx":54472,"count":287880,"meanings":[{"definitions":[{"definition":"A person or group that acts in an auxiliary manner."},{"definition":"A sailing vessel equipped with an engine."},{"definition":"(grammar) An auxiliary verb."},{"definition":"A marching band colorguard."}],"partOfSpeech":"n"}]},{"word":"APHRODISIAC","idx":54479,"count":287825,"meanings":[{"definitions":[{"definition":"Something, generally a food or drug, having such an effect."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Arousing or intensifying sexual desire."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/æf.ɹoʊ.ˈdi.zi.æk/"}]},{"word":"BENEFACTORS","idx":54484,"count":287746,"meanings":[{"definitions":[{"definition":"Somebody who gives a gift, often money to a charity."},{"definition":"Someone who performs good or noble deeds."}],"partOfSpeech":"n"}]},{"word":"SAXOPHONIST","idx":54486,"count":287729,"meanings":[{"definitions":[{"definition":"A person who owns, plays or practices with the saxophone."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"saxophonist-us","text":"/ˌsæk.ˈsɑ.fə.nɪst/"}]},{"word":"RESENTED","idx":54487,"count":287717,"meanings":[{"definitions":[{"definition":"To feel resentment over; to consider as an affront.","example":"The bride greatly resented being left at the church."},{"definition":"To express displeasure or indignation at."},{"definition":"To be sensible of; to feel."},{"definition":"In a positive sense, to take well; to receive with satisfaction."},{"definition":"To recognize; to perceive, especially as if by smelling; -- associated in meaning with sent, the older spelling of scent, to smell. See resent (intransitive verb)."},{"definition":"To give forth an odor; to smell; to savor."}],"partOfSpeech":"ve"}]},{"word":"TERSE","idx":54493,"count":287692,"meanings":[{"definitions":[{"definition":"(by extension) Of speech or style: brief, concise, to the point."},{"definition":"(by extension) Of manner or speech: abruptly or brusquely short; curt."},{"definition":"Burnished, polished; fine, smooth; neat, spruce."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/tɜːs/"},{"text":"/tɝːs/"},{"audio":"terse-au"}]},{"word":"MASJID","idx":54496,"count":287661,"meanings":[{"definitions":[{"definition":"A mosque.","example":"Any masjid where the practices are devoted absolutely to The God ALONE."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mæsdʒɪd/"},{"text":"/mʌsdʒɪd/"}]},{"word":"INSISTENT","idx":54497,"count":287642,"meanings":[{"definitions":[{"definition":"Standing or resting on something."},{"definition":"Urgent in dwelling upon anything; persistent in urging or maintaining."},{"definition":"Extorting attention or notice; coercively staring or prominent; vivid; intense."},{"definition":"Standing on end: specifically said of the hind toe of a bird when its base is inserted so high on the shank that only its tip touches the ground: correlated with incumbent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"insistent-uk","text":"/ɪnˈsɪstənt/"}]},{"word":"PEPPERED","idx":54499,"count":287595,"meanings":[{"definitions":[{"definition":"To add pepper to."},{"definition":"To strike with something made up of small particles."},{"definition":"To cover with lots of (something made up of small things).","example":"After the hailstorm, the beach was peppered with holes."},{"definition":"To add (something) at frequent intervals.","example":"He liked to pepper his conversation with long words."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Seasoned with pepper."},{"definition":"Speckled."}],"partOfSpeech":"j"}]},{"word":"NEBULAE","idx":54500,"count":287590,"meanings":[{"definitions":[{"definition":"A cloud in outer space consisting of gas or dust (e.g. a cloud formed after a star explodes)."},{"definition":"A white spot or slight opacity of the cornea."},{"definition":"A cloudy appearance in the urine"}],"partOfSpeech":"n"}]},{"word":"ABSTENTIONS","idx":54501,"count":287588,"meanings":[{"definitions":[{"definition":"The act of restraining oneself."},{"definition":"The act of abstaining; a holding aloof; refraining from."},{"definition":"The act of declining to vote on a particular issue."},{"definition":"Non-participation in the political world; as a country avoiding international affairs."}],"partOfSpeech":"n"}]},{"word":"LIDOCAINE","idx":54502,"count":287582,"meanings":[{"definitions":[{"definition":"A local anesthetic [2-(diethylamino)-N-(2,6-dimethylphenyl)acetamide], that is also used as a antiarrhythmic drug."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlaɪ.dəˌkeɪn/"},{"text":"/ˈlɪd.ək.eɪn/"}]},{"word":"MONOHYDRATE","idx":54503,"count":287581,"meanings":[{"definitions":[{"definition":"A hydrate whose solid contains a single molecule of water of crystallization per molecule, or per unit cell"}],"partOfSpeech":"n"}]},{"word":"INDOMETHACIN","idx":54507,"count":287563,"meanings":[{"definitions":[{"definition":"A non-steroidal anti-inflammatory drug commonly used to reduce fever, pain, stiffness, and swelling, having chemical formula C19H16ClNO4."}],"partOfSpeech":"n"}]},{"word":"UTILE","idx":54510,"count":287546,"meanings":[{"definitions":[{"definition":"A theoretical unit of measure of utility, for indicating a supposed quantity of satisfaction derived from an economic transaction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Useful."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈjuː.taɪl/"}]},{"word":"BRAK","idx":54511,"count":287545,"meanings":[{"definitions":[{"definition":"Brackish."}],"partOfSpeech":"j"}]},{"word":"FRIGHTFUL","idx":54514,"count":287528,"meanings":[{"definitions":[{"definition":"Full of fright, whether"},{"definition":"Full of something causing fright, whether"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Frightfully; very."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"frightful-us","text":"/ˈfɹaɪtfəl/"}]},{"word":"WAXY","idx":54518,"count":287502,"meanings":[{"definitions":[{"definition":"Resembling wax in texture or appearance."},{"definition":"Angry."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"waxy-uk","text":"/ˈwæksi/"}]},{"word":"TRITE","idx":54519,"count":287494,"meanings":[{"definitions":[{"definition":"Often in reference to a word or phrase: used so many times that it is commonplace, or no longer interesting or effective; worn out, hackneyed."},{"definition":"So well established as to be beyond debate: trite law."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A denomination of coinage in ancient Greece equivalent to one third of a stater."},{"definition":"Trite, a genus of spiders, found in Australia, New Zealand and Oceania, of the family Salticidae."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"trite-us","text":"/tɹaɪt/"},{"audio":"trite-au","text":"/tɹaɪt/"}]},{"word":"FISTED","idx":54520,"count":287488,"meanings":[{"definitions":[{"definition":"To strike with the fist.","example":"...may not score a point with his open hand(s), but may score a point by fisting the ball. Damian Cullen. \"Running the rule.\" The Irish Times 18 Aug 2003, pg. 52."},{"definition":"To close (the hand) into a fist."},{"definition":"To grip with a fist."},{"definition":"To fist-fuck."},{"definition":"To break wind."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in combination) Having some specific type of fist."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɪstɪd/"}]},{"word":"GENTLER","idx":54521,"count":287476,"meanings":[{"definitions":[{"definition":"Tender and amiable; of a considerate or kindly disposition.","example":"Stuart is a gentle man; he would never hurt you."},{"definition":"Soft and mild rather than hard or severe.","example":"I felt something touch my shoulder; it was gentle and a little slimy."},{"definition":"Docile and easily managed.","example":"We had a gentle swim in the lake."},{"definition":"Gradual rather than steep or sudden.","example":"The walks in this area have a gentle incline."},{"definition":"Polite and respectful rather than rude.","example":"He gave me a gentle reminder that we had to hurry up."},{"definition":"Well-born; of a good family or respectable birth, though not noble."}],"partOfSpeech":"j"}]},{"word":"VEX","idx":54522,"count":287473,"meanings":[{"definitions":[{"definition":"A trouble."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To trouble aggressively, to harass."},{"definition":"To annoy, irritate."},{"definition":"To cause (mental) suffering to; to distress."},{"definition":"To twist, to weave."},{"definition":"To be irritated; to fret."},{"definition":"To toss back and forth; to agitate; to disquiet."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vex-us","text":"/vɛks/"},{"audio":"vex-au","text":"/vɛks/"}]},{"word":"CYSTITIS","idx":54523,"count":287471,"meanings":[{"definitions":[{"definition":"Inflammation of the urinary bladder."}],"partOfSpeech":"n"}]},{"word":"PROFORMA","idx":54527,"count":287432,"meanings":[{"definitions":[{"definition":"A document that shows the standard entries of a form or similar document."}],"partOfSpeech":"n"},{"definitions":[{"definition":"For the sake of form only."},{"definition":"Of or relating to a document of form, especially an invoice sent in advance."},{"definition":"(of a financial document) Showing projected costs, liabilities, etc., especially as a result of an expected action or situation."}],"partOfSpeech":"j"}]},{"word":"SHARD","idx":54528,"count":287428,"meanings":[{"definitions":[{"definition":"A piece of broken glass or pottery, especially one found in an archaeological dig."},{"definition":"(by extension) A piece of material, especially rock and similar materials, reminding of a broken piece of glass or pottery."},{"definition":"A tough scale, sheath, or shell; especially an elytron of a beetle."},{"definition":"An instance of an MMORPG that is one of several independent and structurally identical virtual worlds, none of which has so many players as to exhaust a system's resources."},{"definition":"A component of a sharded distributed database."},{"definition":"(singular or plural) A piece of crystal methamphetamine."},{"definition":"The plant chard."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fall apart into shards, usually as the result of impact or explosion."},{"definition":"To break (something) into shards."},{"definition":"To divide (an MMORPG) into several shards, or to establish a shard of one."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shard-us","text":"/ʃɑɹd/"}]},{"word":"SUPERCRITICAL","idx":54529,"count":287420,"meanings":[{"definitions":[{"definition":"(of a gas) Above its critical temperature and critical pressure."},{"definition":"Having a mass sufficient to sustain a chain reaction."},{"definition":"(aerodynamics) Above the speed of sound."},{"definition":"Above some other critical value or range."}],"partOfSpeech":"j"}]},{"word":"INFECTS","idx":54530,"count":287417,"meanings":[{"definitions":[{"definition":"To bring into contact with a substance that causes illness (a pathogen).","example":"Not everyone will be infected when an epidemic strikes."},{"definition":"To make somebody enthusiastic about one's own passion.","example":"Her passion for dancing has infected me."}],"partOfSpeech":"ve"}]},{"word":"DILAPIDATED","idx":54531,"count":287413,"meanings":[{"definitions":[{"definition":"To fall into ruin or disuse."},{"definition":"To cause to become ruined or put into disrepair."},{"definition":"To squander or waste."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having fallen into a state of disrepair or deterioration, especially through neglect."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dilapidated-us"},{"text":"/dɪˈlæpɪdeɪtəd/"}]},{"word":"LOOS","idx":54535,"count":287375,"meanings":[{"definitions":[{"definition":"A half-mask, particularly those velvet half-masks fashionable in the 17th century as a means of protecting women's complexion from the sun."},{"definition":"A lavatory: a room used for urination and defecation."},{"definition":"A toilet: a fixture used for urination and defecation."},{"definition":"Praise, fame, reputation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/luːz/"}]},{"word":"MIEN","idx":54537,"count":287370,"meanings":[{"definitions":[{"definition":"Demeanor; facial expression or attitude, especially one which is intended by its bearer."},{"definition":"A specific facial expression."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mien-uk","text":"/miːn/"}]},{"word":"HANKY","idx":54540,"count":287363,"meanings":[{"definitions":[{"definition":"A piece of cloth, usually square and often fine and elegant, carried for wiping the face, eyes, nose or hands."},{"definition":"A piece of cloth shaped like a handkerchief to be worn about the neck; a neckerchief or neckcloth."}],"partOfSpeech":"n"}]},{"word":"SQUATS","idx":54545,"count":287331,"meanings":[{"definitions":[{"definition":"Nothing; nothing whatsoever."},{"definition":"A position assumed by bending deeply at the knees while resting on one's feet."},{"definition":"(exercise) Any of various modes of callisthenic exercises performed by moving the body and bending at least one knee."},{"definition":"A building occupied without permission, as practiced by a squatter."},{"definition":"A place of concealment in which a hare spends time when inactive, especially during the day; a form."},{"definition":"A toilet used by squatting as opposed to sitting; a squat toilet."},{"definition":"A sudden or crushing fall."},{"definition":"A small vein of ore."},{"definition":"A mineral consisting of tin ore and spar."},{"definition":"The angel shark (genus Squatina)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bend deeply at the knees while resting on one's feet."},{"definition":"(exercise) To perform one or more callisthenic exercises by moving the body and bending at least one knee."},{"definition":"To occupy or reside in a place without the permission of the owner."},{"definition":"To sit close to the ground; to cower; to stoop, or lie close, to escape observation, as a partridge or rabbit."},{"definition":"To bruise or flatten by a fall; to squash."}],"partOfSpeech":"ve"}]},{"word":"LIBERTARIANISM","idx":54548,"count":287297,"meanings":[{"definitions":[{"definition":"A political philosophy maintaining that all persons are the absolute owners of their own lives, and should be free to do whatever they wish with their persons or property, provided they allow others that same liberty."},{"definition":"The doctrine of free will, as opposed to necessitarianism."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/lɪbəˈtɛːɹɪənɪz(ə)m/"}]},{"word":"NICAD","idx":54552,"count":287230,"meanings":[{"definitions":[{"definition":"Rechargeable nickel-cadmium battery"}],"partOfSpeech":"n"}]},{"word":"PROLAPSE","idx":54556,"count":287181,"meanings":[{"definitions":[{"definition":"A moving out of place, especially a protrusion of an internal organ"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move out of place; especially for an internal organ to protrude beyond its normal position."}],"partOfSpeech":"ve"}]},{"word":"STUBBY","idx":54558,"count":287176,"meanings":[{"definitions":[{"definition":"A small, squat beer bottle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Abounding with stubs."},{"definition":"Like a stub; short, especially cut short, thick and stiff; stunted; stubbed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stubby-au"}]},{"word":"EVANGELISTIC","idx":54561,"count":287164,"meanings":[{"definitions":[{"definition":"Pertaining to evangelism or evangelists; spreading the gospel."},{"definition":"Pertaining to the Evangelical school."},{"definition":"Characterised by enthusiasm and a desire to communicate belief.","example":"I was pretty evangelistic about the merits of working in a small team."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪˌvænd͡ʒəˈlɪstɪk/"}]},{"word":"SIXPENCE","idx":54565,"count":287148,"meanings":[{"definitions":[{"definition":"The value of six old pence; half of a shilling; or one-fortieth of a pound sterling.","example":"Finest apples, sixpence each."},{"definition":"A former British coin worth sixpence, first minted in 1551.","example":"Have you got two sixpences for a shilling?"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sixpence-us"},{"text":"/ˈsɪks.pəns/"}]},{"word":"ENERGETICS","idx":54567,"count":287131,"meanings":[{"definitions":[{"definition":"The branch of physics that studies the flow and transformation of energy"},{"definition":"The flow and transformation of energy within a specific system or device"}],"partOfSpeech":"n"}]},{"word":"IMPALED","idx":54569,"count":287083,"meanings":[{"definitions":[{"definition":"To pierce (something) with any long, pointed object."},{"definition":"To place two coats of arms side by side on the same shield (often those of two spouses upon marriage)."},{"definition":"To pierce with a pale; to put to death by fixing on a sharp stake."},{"definition":"To enclose or fence with stakes."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pinned to something by piercing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪmˈpeɪld/"}]},{"word":"FORAYS","idx":54570,"count":287082,"meanings":[{"definitions":[{"definition":"A sudden or irregular incursion in border warfare; hence, any irregular incursion for war or spoils; a raid."},{"definition":"A brief excursion or attempt, especially outside one's accustomed sphere."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To scour (an area or place) for food, treasure, booty etc."},{"definition":"To pillage; to ravage."}],"partOfSpeech":"ve"}]},{"word":"SICKLY","idx":54579,"count":286991,"meanings":[{"definitions":[{"definition":"To make (something) sickly."},{"definition":"To become sickly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Frequently ill or in poor health.","example":"a sickly child"},{"definition":"Not in good health; (somewhat) sick."},{"definition":"(of a plant) Characterized by poor or unhealthy growth."},{"definition":"Appearing ill, infirm or unhealthy; giving the appearance of illness.","example":"a sickly pallor"},{"definition":"Shedding a relatively small amount of light; (of light) not very bright."},{"definition":"Lacking intensity or vigour.","example":"a sickly smile"},{"definition":"Associated with poor moral or mental well-being."},{"definition":"Tending to produce nausea.","example":"a sickly smell; sickly sentimentality"},{"definition":"Overly sweet."},{"definition":"Marked by the occurrence of illness or disease (of a period of time)."},{"definition":"Tending to produce disease or poor health.","example":"a sickly autumn; a sickly climate"}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a sick manner; in a way that reflects or causes sickness.","example":"sickly pale; to cough sickly"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈsɪkli/"}]},{"word":"FLANKS","idx":54580,"count":286991,"meanings":[{"definitions":[{"definition":"To attack the flank(s) of."},{"definition":"To defend the flank(s) of."},{"definition":"To place to the side(s) of."},{"definition":"To be placed to the side(s) of something (usually in terms of two objects, one on each side)."}],"partOfSpeech":"ve"}]},{"word":"BITWISE","idx":54587,"count":286950,"meanings":[{"definitions":[{"definition":"Being an operation that treats a value as a series of bits rather than a numerical quantity."}],"partOfSpeech":"j"}]},{"word":"INEXPLICABLY","idx":54591,"count":286895,"meanings":[{"definitions":[{"definition":"In an inexplicable manner; for an unknown reason."}],"partOfSpeech":"v"}]},{"word":"CURBED","idx":54595,"count":286884,"meanings":[{"definitions":[{"definition":"To check, restrain or control.","example":"\"Curb your dog.\""},{"definition":"To rein in."},{"definition":"To furnish with a curb, as a well; to restrain by a curb, as a bank of earth."},{"definition":"To force to \"bite the curb\" (hit the pavement curb); see curb stomp."},{"definition":"To damage vehicle wheels or tires by running into or over a pavement curb."},{"definition":"To bend or curve."},{"definition":"To crouch; to cringe."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Restrained"}],"partOfSpeech":"j"}]},{"word":"RETEST","idx":54596,"count":286883,"meanings":[{"definitions":[{"definition":"A repeat test."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To test again."}],"partOfSpeech":"ve"}]},{"word":"EFFICACIOUS","idx":54597,"count":286875,"meanings":[{"definitions":[{"definition":"Effective; possessing efficacy.","example":"This medicine is efficacious."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɛf.ɪ.ˈkeɪ.ʃəs/"}]},{"word":"PHILANTHROPIST","idx":54598,"count":286873,"meanings":[{"definitions":[{"definition":"A person who loves humankind in general."},{"definition":"A very generous person or institution."}],"partOfSpeech":"n"}]},{"word":"CHLORAMPHENICOL","idx":54599,"count":286871,"meanings":[{"definitions":[{"definition":"A broad-spectrum antibiotic originally derived from the bacterium Streptomyces venezuelae but now produced synthetically"}],"partOfSpeech":"n"}]},{"word":"DIESELS","idx":54603,"count":286814,"meanings":[{"definitions":[{"definition":"A fuel derived from petroleum (or other oils) but heavier than gasoline/petrol. Used to power diesel engines which burn this fuel using the heat produced when air is compressed."},{"definition":"A vehicle powered by a diesel engine."},{"definition":"A rider who has an even energy output, without bursts of speed."},{"definition":"Snakebite and black (a drink)."},{"definition":"A particular cannabis hybrid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ignite a substance by using the heat generated by compression"},{"definition":"For a spark-ignition internal combustion engine to continue running after the electrical current to the spark plugs has been turned off. This occurs when there's enough heat in the combustion chamber to ignite the air and fuel mixture without a spark, the same way that heat and pressure cause ignition in a diesel engine.","example":"The only reason the VW bug has a solenoid is to prevent it from dieseling."}],"partOfSpeech":"ve"}]},{"word":"CONVINCES","idx":54606,"count":286771,"meanings":[{"definitions":[{"definition":"To make someone believe, or feel sure about something, especially by using logic, argument or evidence.","example":"I wouldn't have or do something, unless I'm convinced that it's good."},{"definition":"To persuade."},{"definition":"To overcome, conquer, vanquish."},{"definition":"To confute; to prove wrong."},{"definition":"To prove guilty; to convict."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kənˈvɪnsɪz/"}]},{"word":"BANJOS","idx":54608,"count":286765,"meanings":[{"definitions":[{"definition":"A stringed musical instrument (chordophone), usually with a round body, a membrane-like soundboard and a fretted neck, played by plucking or strumming the strings.","example":"I come from Alabama with my banjo on my knee..."},{"definition":"Any of various similar musical instruments, such as the Tuvan doshpuluur, with a membrane-like soundboard."},{"definition":"An object shaped like a banjo, especially a frying pan or a shovel."},{"definition":"(Dagenham) A cul-de-sac with a round end."}],"partOfSpeech":"n"}]},{"word":"GEODESY","idx":54611,"count":286736,"meanings":[{"definitions":[{"definition":"The discipline which deals with the measurement and representation of Earth, its gravitational field and geodynamic phenomena (polar motion, Earth tides, and crustal motion) in three-dimensional, time-varying space"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dʒiˈɑdəsi/"},{"text":"/dʒiːˈɒdɪsi/"},{"audio":"geodesy-au"}]},{"word":"KIDDY","idx":54613,"count":286716,"meanings":[{"definitions":[{"definition":"A child.","example":"C. S. Lewis first made kiddie lit a respectable field of study."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To kid; to hoax or tease."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Alternative spelling of kiddie"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɪɾi/"},{"text":"/ˈkɪdi/"}]},{"word":"BIRCHWOOD","idx":54614,"count":286713,"meanings":[{"definitions":[{"definition":"A wood largely populated with birch trees (Betula spp.)."},{"definition":"The wood from a birch tree."}],"partOfSpeech":"n"}]},{"word":"VALUERS","idx":54616,"count":286701,"meanings":[{"definitions":[{"definition":"A person who valuates; an assessor or appraiser."},{"definition":"A person who appreciates something and sets a value on it."}],"partOfSpeech":"n"}]},{"word":"INNUENDO","idx":54618,"count":286651,"meanings":[{"definitions":[{"definition":"A derogatory hint or reference to a person or thing. An implication, intimation or insinuation.","example":"She made a devious innuendo about her husband, who was embarrassed."},{"definition":"A rhetorical device with an omitted, but obvious conclusion, made to increase the force of an argument."},{"definition":"Part of a pleading in cases of libel and slander, pointing out what and whom was meant by the libellous matter or description."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To interpret (something libellous or slanderous) in terms of what was implied."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"innuendo-us","text":"/ˌɪnjuˈɛndəʊ/"},{"audio":"innuendo-uk","text":"/ˌɪnjuˈɛndəʊ/"}]},{"word":"PITFALL","idx":54622,"count":286614,"meanings":[{"definitions":[{"definition":"A potential problem, hazard, or danger that is easily encountered but not immediately obvious.","example":"It's usually a simple task, but you should know the pitfalls before you attempt it yourself."},{"definition":"A type of trap consisting of a concealed hole in the ground: victims fall into the hole and are unable to escape."},{"definition":"An antipattern."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pitfall-us","text":"/ˈpɪtfɔl/"}]},{"word":"ATTENUATOR","idx":54623,"count":286613,"meanings":[{"definitions":[{"definition":"Any device that attenuates a signal, but especially an electronic device that reduces the amplitude of a signal"}],"partOfSpeech":"n"}]},{"word":"REDE","idx":54624,"count":286605,"meanings":[{"definitions":[{"definition":"Help, advice, counsel."},{"definition":"Decision, a plan."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To govern, protect."},{"definition":"To discuss, deliberate."},{"definition":"To advise."},{"definition":"To interpret (a riddle or dream); explain."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːd/"}]},{"word":"POLYSACCHARIDE","idx":54627,"count":286586,"meanings":[{"definitions":[{"definition":"A polymer made of many saccharide units linked by glycosidic bonds.","example":"Cellulose, starches, and complex carbohydrates, such as glycogen, are common polysaccharides in biology."}],"partOfSpeech":"n"}]},{"word":"SUPERHIGHWAY","idx":54631,"count":286539,"meanings":[{"definitions":[{"definition":"An expressway, especially one designed for high speeds."},{"definition":"(by extension) A major route that carries most of the traffic going in a given direction by a specified mode of transportation."},{"definition":"(metaphoric) The primary mechanism used in the movement of electronic data or information; information superhighway."}],"partOfSpeech":"n"}]},{"word":"DISSERVICE","idx":54633,"count":286536,"meanings":[{"definitions":[{"definition":"Service that results in harm; an (intentionally or unintentionally) unhelpful, harmful action.","example":"One renders young persons a disservice by heaping unearned rewards on them."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To disserve, to provide a disservice to; to provide harmful or inadequate service to."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪ(s)ˈsɝvɪs/"},{"text":"/dɪ(s)ˈsɜːvɪs/"}]},{"word":"MINDER","idx":54634,"count":286525,"meanings":[{"definitions":[{"definition":"One who minds, tends, or watches something such as a child, a machine, or cattle; a keeper"},{"definition":"A personal bodyguard."},{"definition":"A guide assigned by the authorities to foreign visitors so as to exercise control over their contacts with the populace."},{"definition":"One who is taken care of, such as a pauper child in the care of private person; a ward."}],"partOfSpeech":"n"}]},{"word":"ORATOR","idx":54635,"count":286521,"meanings":[{"definitions":[{"definition":"Someone who orates or delivers an oration."},{"definition":"A skilled and eloquent public speaker."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɒ.ɹə.tə(ɹ)/"}]},{"word":"PINATA","idx":54644,"count":286477,"meanings":[{"definitions":[{"definition":"(Latin American culture) A doll or other decorated container that is filled with candy and hit with a hammer or a stick by blindfolded children during birthday parties or other celebrations until the candy falls out."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit something or someone with sticks after having filled them with candy."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɪnˈjɑːtə/"}]},{"word":"PHOTOCOPIED","idx":54645,"count":286474,"meanings":[{"definitions":[{"definition":"To make a copy using a photocopier."}],"partOfSpeech":"ve"}]},{"word":"MOPEDS","idx":54646,"count":286473,"meanings":[{"definitions":[{"definition":"A lightweight, two-wheeled vehicle equipped with a small motor and pedals, designed to go no faster than some specified speed limit.","example":"He was drunk again and moped, whining at length about his moped."}],"partOfSpeech":"n"}]},{"word":"BUMBLEBEE","idx":54647,"count":286466,"meanings":[{"definitions":[{"definition":"Any of several species of large bee in the genus Bombus"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bumblebee-us","text":"/ˈbʌmbl̩bi/"}]},{"word":"DIGICAMS","idx":54649,"count":286443,"meanings":[{"definitions":[{"definition":"A digital camera"}],"partOfSpeech":"n"}]},{"word":"ABET","idx":54650,"count":286436,"meanings":[{"definitions":[{"definition":"Fraud or cunning."},{"definition":"An act of abetting; of helping; of giving aid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To urge on, stimulate (a person to do) something desirable."},{"definition":"To incite; to assist or encourage by aid or countenance in crime."},{"definition":"To support, countenance, maintain, uphold, or aid (any good cause, opinion, or action); to maintain."},{"definition":"To back up one's forecast of a doubtful issue, by staking money, etc., to bet."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"abet-us","text":"/əˈbɛt/"}]},{"word":"BIOMECHANICAL","idx":54651,"count":286430,"meanings":[{"definitions":[{"definition":"Of or pertaining to biomechanics"}],"partOfSpeech":"j"}]},{"word":"HIGHLIGHTER","idx":54664,"count":286287,"meanings":[{"definitions":[{"definition":"A marker pen used to highlight text."},{"definition":"A cosmetic product that reflects light, used to emphasize the contours of the face etc."},{"definition":"That which highlights or emphasizes something."}],"partOfSpeech":"n"}]},{"word":"MALACHITE","idx":54666,"count":286276,"meanings":[{"definitions":[{"definition":"A bright green mineral, a basic copper carbonate, Cu2CO3(OH)2; one of the principal ores of copper."},{"definition":"A mild green colour, like that of the mineral."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a colour ranging from olive-taupe to a mild to deeply-rich (at times seemingly translucent) green, like that of the mineral which is present on oxidized copper."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmæləkaɪt/"}]},{"word":"STEPPE","idx":54669,"count":286262,"meanings":[{"definitions":[{"definition":"The grasslands of Eastern Europe and Asia. Similar to (North American) prairie and (African) savanna."},{"definition":"A vast cold, dry grass-plain."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/stɛp/"}]},{"word":"PLOWED","idx":54672,"count":286245,"meanings":[{"definitions":[{"definition":"To use a plough on to prepare for planting.","example":"I've still got to plough that field."},{"definition":"To use a plough.","example":"Some days I have to plough from sunrise to sunset."},{"definition":"To have sex with, penetrate."},{"definition":"To move with force.","example":"Trucks plowed through the water to ferry flood victims to safety."},{"definition":"To furrow; to make furrows, grooves, or ridges in."},{"definition":"To run through, as in sailing."},{"definition":"To trim, or shave off the edges of, as a book or paper, with a plough."},{"definition":"(joinery) To cut a groove in, as in a plank, or the edge of a board; especially, a rectangular groove to receive the end of a shelf or tread, the edge of a panel, a tongue, etc."},{"definition":"(university slang) To fail (a student)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Turned over with the blade of a plow to create furrows (usually for planting crops)."},{"definition":"Well-trodden or well-researched, previously explored."},{"definition":"Drunk."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/plaʊd/"}]},{"word":"SIRES","idx":54673,"count":286232,"meanings":[{"definitions":[{"definition":"A lord, master, or other person in authority, most commonly used vocatively: formerly in speaking to elders and superiors, later only when addressing a sovereign."},{"definition":"A male animal; a stud, especially a horse or dog, that has fathered another."},{"definition":"A father; the head of a family; the husband."},{"definition":"A creator; a maker; an author; an originator."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a male) to procreate; to father, beget, impregnate."}],"partOfSpeech":"ve"}]},{"word":"FEATHERWEIGHT","idx":54675,"count":286224,"meanings":[{"definitions":[{"definition":"A weight class in many combat sports; e.g. in professional boxing of a maximum of 126 pounds or 57.2 kilograms."},{"definition":"A sportsman who fights in this division."},{"definition":"The lightest weight that may be carried by a racehorse."}],"partOfSpeech":"n"}]},{"word":"INTRICATELY","idx":54680,"count":286192,"meanings":[{"definitions":[{"definition":"In an intricate manner; with involution or infoldings; with perplexity or intricacy."}],"partOfSpeech":"v"}]},{"word":"TRANSGRESSIONS","idx":54681,"count":286190,"meanings":[{"definitions":[{"definition":"A violation of a law, duty or commandment."},{"definition":"An act that goes beyond generally accepted boundaries."},{"definition":"A relative rise in sea level resulting in deposition of marine strata over terrestrial strata."}],"partOfSpeech":"n"}]},{"word":"LINGERS","idx":54682,"count":286185,"meanings":[{"definitions":[{"definition":"To stay or remain in a place or situation, especially as if unwilling to depart or not easily able to do so; to loiter."},{"definition":"To remain alive or existent although still proceeding toward death or extinction; to die gradually."},{"definition":"(often followed by on) To consider or contemplate for a period of time; to engage in analytic thinking or discussion."}],"partOfSpeech":"ve"}]},{"word":"DIGITIZE","idx":54687,"count":286148,"meanings":[{"definitions":[{"definition":"To represent something (such as an image or sound) as a structured sequence of binary digits"},{"definition":"To quantize a continuous or analog value; to convert it into a discrete value"},{"definition":"To finger.","example":"to digitize a pen"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdɪdʒɪtaɪz/"}]},{"word":"BLOCKBUSTERS","idx":54689,"count":286125,"meanings":[{"definitions":[{"definition":"A high-explosive bomb used for the purposes of demolishing extensive areas, such as a city block."},{"definition":"Something, such as a film or book, that sustains exceptional and widespread popularity and achieves enormous sales, as opposed to a box office bomb."},{"definition":"Anything very large or powerful; a whopper."},{"definition":"A large firework of the firecracker type; an M-80."},{"definition":"One who engages in blockbusting (technique encouraging people to sell property)."}],"partOfSpeech":"n"}]},{"word":"SUPERGRASS","idx":54691,"count":286115,"meanings":[{"definitions":[{"definition":"An informer providing substantial quantities of information on criminal or terrorist activities to the police."}],"partOfSpeech":"n"}]},{"word":"KERB","idx":54692,"count":286112,"meanings":[{"definitions":[{"definition":"The edge between the pavement and the roadway, consisting of a line of kerbstones."},{"definition":"A stone ring built to enclose and sometimes revet the cairn or barrow built over a chamber tomb."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To damage vehicle wheels or tyres by running into or over a pavement kerb."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɝb/"},{"text":"/kɜːb/"},{"audio":"kerb-au"}]},{"word":"SEMIOTICS","idx":54694,"count":286094,"meanings":[{"definitions":[{"definition":"The study of signs and symbols, especially as means of language or communication."},{"definition":"The study of medical signs and symptoms; symptomatology."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"semiotics-uk","text":"/sɛmiˈɒtɪks/"}]},{"word":"SMOTHERING","idx":54697,"count":286049,"meanings":[{"definitions":[{"definition":"To suffocate; stifle; obstruct, more or less completely, the respiration of something or someone."},{"definition":"To extinguish or deaden, as fire, by covering, overlaying, or otherwise excluding the air.","example":"to smother a fire with ashes"},{"definition":"To reduce to a low degree of vigor or activity; suppress or do away with; extinguish","example":"The committee's report was smothered."},{"definition":"In cookery: to cook in a close dish.","example":"beefsteak smothered with onions"},{"definition":"To daub or smear."},{"definition":"To be suffocated."},{"definition":"To breathe with great difficulty by reason of smoke, dust, close covering or wrapping, or the like."},{"definition":"(of a fire) to burn very slowly for want of air; smolder."},{"definition":"To perish, grow feeble, or decline, by suppression or concealment; be stifled; be suppressed or concealed."},{"definition":"To get in the way of a kick of the ball."},{"definition":"To get in the way of a kick of the ball, preventing it going very far. When a player is kicking the ball, an opponent who is close enough will reach out with his hands and arms to get over the top of it, so the ball hits his hands after leaving the kicker's boot, dribbling away."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which someone or something is smothered."}],"partOfSpeech":"n"}]},{"word":"TOMORROWS","idx":54698,"count":286038,"meanings":[{"definitions":[{"definition":"The day after the present day."}],"partOfSpeech":"n"}]},{"word":"DRIFTERS","idx":54705,"count":285945,"meanings":[{"definitions":[{"definition":"(sometimes derogatory) A person who moves from place to place or job to job."},{"definition":"A type of lightweight sail used in light winds like a spinnaker."},{"definition":"A driver who uses driving techniques to modify vehicle traction to cause a vehicle to slide or power slide rather than drive in line with the tires."},{"definition":"One who takes part in drift fishing."},{"definition":"A boat used for drift fishing."},{"definition":"A parachutist who jumps before the rest of the group to determine the environmental conditions."},{"definition":"A person employed in driving in rock other than coal."}],"partOfSpeech":"n"}]},{"word":"ENCAMPMENT","idx":54707,"count":285939,"meanings":[{"definitions":[{"definition":"A campsite."},{"definition":"A group of temporary living quarters and/or other temporary structures."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"encampment-us","text":"/ɪnˈkæmpmənt/"}]},{"word":"CALAMARI","idx":54709,"count":285928,"meanings":[{"definitions":[{"definition":"Squid as food, especially cooked in the form of calamari rings"},{"definition":"Squid, the mollusk, in general"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kæləˈmɑːɹi/"}]},{"word":"LEMPIRA","idx":54710,"count":285925,"meanings":[{"definitions":[{"definition":"The currency of Honduras, divided into 100 centavos."}],"partOfSpeech":"n"}]},{"word":"ROQUE","idx":54712,"count":285897,"meanings":[{"definitions":[{"definition":"A form of croquet using short-handled mallets, and played on a hard surface"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹoʊk/"}]},{"word":"PROPHESY","idx":54714,"count":285877,"meanings":[{"definitions":[{"definition":"To speak or write with divine inspiration; to act as prophet."},{"definition":"To predict, to foretell (with or without divine inspiration)."},{"definition":"To foreshow; to herald; to prefigure."},{"definition":"To speak out on the Bible as an expression of holy inspiration; to preach."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɹɑfɪsaɪ/"},{"text":"/ˈpɹɒfɪsaɪ/"}]},{"word":"RECAST","idx":54716,"count":285859,"meanings":[{"definitions":[{"definition":"The act or process of recasting."},{"definition":"An utterance translated into another grammatical form.","example":"Adults may use recasts to suggest corrections to mistakes in children's speech."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cast or throw again."},{"definition":"To mould again.","example":"The whole bell had to be recast although it had only one tiny, hardly visible crack."},{"definition":"To reproduce in a new form."},{"definition":"To assign (roles in a play or performance) to different actors."},{"definition":"To assign (actors) to different roles.","example":"She was recast as the villain."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːˈkæst/"}]},{"word":"BURSAR","idx":54718,"count":285837,"meanings":[{"definitions":[{"definition":"The treasurer of a university, college or school."},{"definition":"A student funded by a bursary."}],"partOfSpeech":"n"}]},{"word":"MISREPRESENTATIONS","idx":54720,"count":285814,"meanings":[{"definitions":[{"definition":"Erroneous or false representation; an unfair or dishonest account or exposition; a false statement: as, to injure one's character by misrepresentations."},{"definition":"Incorrect or unfaithful representation in the capacity of agent or official representative, such as of a principal in a matter of business, or of constituents in legislation."},{"definition":"In map-making, faultiness in a map projection, estimated with regard to its unequal scale in different parts and to its distortion of angles."}],"partOfSpeech":"n"}]},{"word":"DOWEL","idx":54721,"count":285802,"meanings":[{"definitions":[{"definition":"A pin, or block, of wood or metal, fitting into holes in the abutting portions of two pieces, and being partly in one piece and partly in the other, to keep them in their proper relative position."},{"definition":"A wooden rod, as one to make short pins from."},{"definition":"A piece of wood or similar material fitted into a surface not suitable for fastening so that other pieces may be fastened to it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten together with dowels."},{"definition":"To furnish with dowels.","example":"A cooper dowels pieces for the head of a cask."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdaʊəl/"}]},{"word":"INTERDICTION","idx":54722,"count":285788,"meanings":[{"definitions":[{"definition":"The act of interdicting or something interdicted"},{"definition":"The destruction of an enemy's military potential before it can be used"}],"partOfSpeech":"n"}]},{"word":"CHASTE","idx":54724,"count":285769,"meanings":[{"definitions":[{"definition":"Abstaining from immoral or unlawful sexual intercourse."},{"definition":"Virginal, innocent, having had no sexual experience."},{"definition":"Austere, simple, undecorative.","example":"a chaste style in composition or art"},{"definition":"Decent, modest, morally pure.","example":"a chaste mind;  chaste eyes"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"chaste-us","text":"/tʃeɪst/"}]},{"word":"BARDS","idx":54725,"count":285757,"meanings":[{"definitions":[{"definition":"A professional poet and singer, like among the ancient Celts, whose occupation was to compose and sing verses in honor of the heroic achievements of princes and brave men."},{"definition":"(by extension) A poet.","example":"Shakespeare is known as the bard of Avon."},{"definition":"A piece of defensive (or, sometimes, ornamental) armor for a horse's neck, breast, and flanks; a barb. (Often in the plural.)"},{"definition":"Defensive armor formerly worn by a man at arms."},{"definition":"A thin slice of fat bacon used to cover any meat or game."},{"definition":"The exterior covering of the trunk and branches of a tree; the rind."},{"definition":"Specifically, Peruvian bark."}],"partOfSpeech":"n"}]}]