[{"word":"ALLEGIANCE","idx":18420,"count":1845566,"meanings":[{"definitions":[{"definition":"Loyalty to some cause, nation or ruler."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"allegiance-us","text":"/əˈliː.dʒəns/"}]},{"word":"HIRES","idx":18422,"count":1845244,"meanings":[{"definitions":[{"definition":"Payment for the temporary use of something.","example":"The sign offered pedalos on hire."},{"definition":"Reward, payment."},{"definition":"The state of being hired, or having a job; employment.","example":"When my grandfather retired, he had over twenty mechanics in his hire."},{"definition":"A person who has been hired, especially in a cohort.","example":"We pair up each of our new hires with one of our original hires."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To obtain the services of in return for fixed payment.","example":"We hired a car for two weeks because ours had broken down."},{"definition":"To employ; to obtain the services of (a person) in exchange for remuneration; to give someone a job.","example":"The company had problems when it tried to hire more skilled workers."},{"definition":"To exchange the services of for remuneration.","example":"They hired themselves out as day laborers.  They hired out their basement for Inauguration week."},{"definition":"To accomplish by paying for services.","example":"After waiting two years for her husband to finish the tiling, she decided to hire it done."},{"definition":"To accept employment.","example":"They hired out as day laborers."}],"partOfSpeech":"ve"}]},{"word":"CONDUIT","idx":18423,"count":1845238,"meanings":[{"definitions":[{"definition":"A pipe or channel for conveying water etc."},{"definition":"A duct or tube into which electrical cables may be pulled; a type of raceway."},{"definition":"A means by which something is transmitted."},{"definition":"An investment vehicle that issues short-term commercial paper to finance long-term off-balance sheet bank assets."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɑnd(j)ʊɪt/"},{"text":"/ˈkɒnd(j)ʊɪt/"}]},{"word":"DEPENDABLE","idx":18425,"count":1845100,"meanings":[{"definitions":[{"definition":"A reliable person or thing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Able, or easily able to be depended on.","example":"He was a very dependable person."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[dɪˈpɛndəbəɫ]"}]},{"word":"MAINFRAME","idx":18426,"count":1845011,"meanings":[{"definitions":[{"definition":"A large, powerful computer able to manage very many simultaneous tasks and communicate with very many connected terminals; used by large, complex organizations (such as banks and supermarkets) where continuously sustained operation is vital"}],"partOfSpeech":"n"}]},{"word":"ECHOES","idx":18427,"count":1844974,"meanings":[{"definitions":[{"definition":"A reflected sound that is heard again by its initial observer."},{"definition":"An utterance repeating what has just been said."},{"definition":"A device in verse in which a line ends with a word which recalls the sound of the last word of the preceding line."},{"definition":"Sympathetic recognition; response; answer."},{"definition":"The displaying on the command line of the command that has just been executed."},{"definition":"The letter E in the ICAO spelling alphabet."},{"definition":"(whist) A signal, played in the same manner as a trump signal, made by a player who holds four or more trumps (or, as played by some, exactly three trumps) and whose partner has led trumps or signalled for trumps."},{"definition":"(whist) A signal showing the number held of a plain suit when a high card in that suit is led by one's partner."},{"definition":"The visual image formed by an echocardiograph."},{"definition":"The use of ultrasound to produce images of the heart."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a sound or sound waves) To reflect off a surface and return."},{"definition":"To reflect back (a sound)."},{"definition":"(by extension) To repeat (another's speech, opinion etc.).","example":"Sid echoed his father's point of view."},{"definition":"To repeat its input as input to some other device or system."},{"definition":"(whist) To give the echo signal, informing one's partner about cards one holds."}],"partOfSpeech":"ve"}]},{"word":"COMPILERS","idx":18429,"count":1844894,"meanings":[{"definitions":[{"definition":"One who compiles.","example":"a compiler of poetry anthologies"},{"definition":"A computer program which transforms source code into object code."}],"partOfSpeech":"n"}]},{"word":"LADDERS","idx":18430,"count":1844710,"meanings":[{"definitions":[{"definition":"A frame, usually portable, of wood, metal, or rope, used for ascent and descent, consisting of two side pieces to which are fastened rungs (cross strips or rounds acting as steps)."},{"definition":"A series of stages by which one progresses to a better position."},{"definition":"The hierarchy or ranking system within an organization, such as the corporate ladder."},{"definition":"A length of unravelled fabric in a knitted garment, especially in nylon stockings; a run."},{"definition":"In the game of go, a sequence of moves following a zigzag pattern and ultimately leading to the capture of the attacked stones."},{"definition":"A pair of ladders"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To arrange or form into a shape of a ladder."},{"definition":"To ascend (a building, a wall, etc.) using a ladder."},{"definition":"Of a knitted garment: to develop a ladder as a result of a broken thread.","example":"Oh damn it, I've laddered my tights!"}],"partOfSpeech":"ve"}]},{"word":"PRUDENT","idx":18431,"count":1844703,"meanings":[{"definitions":[{"definition":"Sagacious in adapting means to ends; circumspect in action, or in determining any line of conduct; careful, discreet, sensible; — opposed to rash; directed by prudence or wise forethought; evincing prudence"},{"definition":"Practically wise, judicious, shrewd","example":"His prudent career moves reliably brought him to the top"},{"definition":"Frugal; economical; not extravagant;","example":"Only prudent expenditure may provide quality within a restrictive budget"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"prudent-us","text":"/ˈpɹuːdənt/"}]},{"word":"GLOWING","idx":18432,"count":1844686,"meanings":[{"definitions":[{"definition":"To give off light from heat or to emit light as if heated.","example":"The fire was still glowing after ten hours."},{"definition":"To radiate some emotional quality like light.","example":"The zealots glowed with religious fervor."},{"definition":"To gaze especially passionately at something."},{"definition":"To radiate thermal heat.","example":"After their workout, the gymnasts' faces were glowing red."},{"definition":"To shine brightly and steadily.","example":"The new baby's room glows with bright, loving colors."},{"definition":"To make hot; to flush."},{"definition":"To feel hot; to have a burning sensation, as of the skin, from friction, exercise, etc.; to burn."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb glow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That glows or glow.","example":"glowing embers"},{"definition":"Full of praise.","example":"He received glowing references from his previous employers."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡloʊɪŋ/"},{"text":"/ˈɡləʊɪŋ/"}]},{"word":"HEARTBEAT","idx":18434,"count":1844397,"meanings":[{"definitions":[{"definition":"One pulsation of the heart; especially an irregular one, hence the emotion which causes it.","example":"He alone gives me such heartbeats"},{"definition":"The rhythm at which a heart pulsates, a cardiac indicator","example":"If your heartbeat doesn't normalize soon, consult a doctor!"},{"definition":"A driving impulse or vital force.","example":"Music is the heartbeat of the people."},{"definition":"A very short space of time; an instant.","example":"The ambulance arrived in a heartbeat."},{"definition":"A periodic signal generated by hardware or software to indicate normal operation or to synchronize other parts of a system."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɑɹtˌbit/"},{"text":"/ˈhɑːtˌbiːt/"}]},{"word":"BLAZER","idx":18435,"count":1843932,"meanings":[{"definitions":[{"definition":"A semi-formal jacket."},{"definition":"A person or thing that blazes (marks or cuts a route)."},{"definition":"Anything that blazes or glows, as with heat or flame."},{"definition":"The dish used when cooking directly over the flame of a chafing-dish lamp, or the coals of a brazier."},{"definition":"One who smokes cannabis; a stoner."},{"definition":"One who spreads news, or blazes matters abroad."},{"definition":"An older member of a sporting club, often with old-fashioned or conservative views."},{"definition":"A con or swindle."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbleɪzɚ/"},{"text":"/ˈbleɪzə/"},{"audio":"blazer-au"}]},{"word":"ALCHEMY","idx":18436,"count":1843900,"meanings":[{"definitions":[{"definition":"The ancient search for a universal panacea, and of the philosopher's stone, that eventually developed into chemistry."},{"definition":"The causing of any sort of mysterious sudden transmutation."},{"definition":"Any elaborate transformation process or algorithm."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"alchemy-us","text":"/ˈælkəmi/"}]},{"word":"LINDEN","idx":18437,"count":1843791,"meanings":[{"definitions":[{"definition":"Any of various deciduous trees of the genus Tilia, having heart-shaped leaves."},{"definition":"The soft wood of such trees."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Made of lime-wood."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"linden-us","text":"/ˈlɪn.dən/"}]},{"word":"GEOGRAPHICALLY","idx":18442,"count":1842958,"meanings":[{"definitions":[{"definition":"In terms of geography."}],"partOfSpeech":"v"}]},{"word":"ALTERNATING","idx":18444,"count":1842467,"meanings":[{"definitions":[{"definition":"To perform by turns, or in succession; to cause to succeed by turns; to interchange regularly."},{"definition":"To happen, succeed, or act by turns; to follow reciprocally in place or time; followed by with.","example":"The flood and ebb tides alternate with each other."},{"definition":"To vary by turns.","example":"The land alternates between rocky hills and sandy plains."},{"definition":"To perform an alternation (removal of alternate vertices) on (a polytope or tessellation); to remove vertices (from a face or edge) as part of an alternation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That alternates."},{"definition":"(of a knot) Having a planar diagram whose crossings alternate between \"over\" and \"under\" as one travels along the knot."},{"definition":"(of a series) Having terms that alternate between positive and negative."},{"definition":"(of a multilinear mapping with all arguments belonging to the same space) Whose value is zero when any two adjacent arguments are equal."}],"partOfSpeech":"j"}]},{"word":"AUDIBLE","idx":18446,"count":1842341,"meanings":[{"definitions":[{"definition":"The act of or an instance of changing the play at the line of scrimmage by yelling out a new one.","example":"The audible changed the play to a run."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To change the play at the line of scrimmage by yelling out a new one.","example":"The quarterback audibled after seeing the defensive formation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Able to be heard."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɔːdɪbl̩/"}]},{"word":"FOLIO","idx":18447,"count":1842202,"meanings":[{"definitions":[{"definition":"A leaf of a book or manuscript"},{"definition":"A page of a book, that is, one side of a leaf of a book."},{"definition":"A page number. The even folios are on the left-hand pages and the odd folios on the right-hand pages."},{"definition":"A sheet of paper folded in half."},{"definition":"(books) A book made of sheets of paper each folded in half (two leaves or four pages to the sheet); hence, a book of the largest kind, exceeding 30 cm in height.","example":"A rare copy of Shakespeare’s First Folio."},{"definition":"A page in an account book; sometimes, two opposite pages bearing the same serial number."},{"definition":"(19th to early 20th century) A leaf containing a certain number of words; hence, a certain number of words in a writing, as in England, in law proceedings 72, and in chancery, 90; in New York, 100 words."},{"definition":"A wrapper for loose papers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put a serial number on each folio or page of (a book); to page"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfoʊliˌoʊ/"},{"text":"/ˈfəʊljəʊ/"},{"audio":"folio-au"}]},{"word":"PRESIDING","idx":18449,"count":1841676,"meanings":[{"definitions":[{"definition":"To act as president or chairperson."},{"definition":"To exercise authority or control, oversit."},{"definition":"To be a featured solo performer."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having authority over; vested with the authority to preside over."}],"partOfSpeech":"j"}]},{"word":"MANS","idx":18450,"count":1841660,"meanings":[{"definitions":[{"definition":"An adult male human.","example":"The show is especially popular with middle-aged men."},{"definition":"(collective) All human males collectively: mankind."},{"definition":"A human, a person of either gender, usually an adult. (See usage notes.)","example":"every man for himself"},{"definition":"(collective) All humans collectively: mankind, humankind, humanity. (Sometimes capitalized as Man.)"},{"definition":"A member of the genus Homo, especially of the species Homo sapiens."},{"definition":"An male person, usually an adult; a (generally adult male) sentient being, whether human, supernatural, elf, alien, etc."},{"definition":"An adult male who has, to an eminent degree, qualities considered masculine, such as strength, integrity, and devotion to family; a mensch."},{"definition":"Manliness; the quality or state of being manly."},{"definition":"A husband."},{"definition":"A lover; a boyfriend."},{"definition":"A male enthusiast or devotee; a male who is very fond of or devoted to a specified kind of thing. (Used as the last element of a compound.)","example":"Some people prefer apple pie, but me, I’m a cherry pie man."},{"definition":"A person, usually male, who has duties or skills associated with a specified thing. (Used as the last element of a compound.)","example":"I wanted to be a guitar man on a road tour, but instead I’m a flag man on a road crew."},{"definition":"A person, usually male, who can fulfill one's requirements with regard to a specified matter."},{"definition":"A male who belongs to a particular group: an employee, a student or alumnus, a representative, etc."},{"definition":"An adult male servant."},{"definition":"A vassal; a subject.","example":"Like master, like man."},{"definition":"A piece or token used in board games such as chess."},{"definition":"Used to refer to oneself or one's group: I, we; construed in the third person."},{"definition":"A term of familiar address often implying on the part of the speaker some degree of authority, impatience, or haste.","example":"Come on, man, we've got no time to lose!"},{"definition":"A friendly term of address usually reserved for other adult males.","example":"Hey, man, how's it goin'?"},{"definition":"A player on whom another is playing, with the intent of limiting their attacking impact."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply (something) with staff or crew (of either sex).","example":"The ship was manned with a small crew."},{"definition":"To take up position in order to operate (something).","example":"Man the machine guns!"},{"definition":"(possibly obsolete) To brace (oneself), to fortify or steel (oneself) in a manly way. (Compare man up.)"},{"definition":"To wait on, attend to or escort."},{"definition":"To accustom (a raptor or other type of bird) to the presence of people."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/mænz/"}]},{"word":"COLLEEN","idx":18451,"count":1841565,"meanings":[{"definitions":[{"definition":"Girl"},{"definition":"Young single woman"}],"partOfSpeech":"n"}]},{"word":"PARTICIPATES","idx":18453,"count":1841017,"meanings":[{"definitions":[{"definition":"To join in, to take part, to involve oneself (in something)."},{"definition":"To share, share in (something)."},{"definition":"To share (something) with others; to transfer (something) to or unto others."}],"partOfSpeech":"ve"}]},{"word":"WATERWAYS","idx":18454,"count":1840825,"meanings":[{"definitions":[{"definition":"A body of water, such as a river, channel or canal, that is navigable."},{"definition":"A conduit or watercourse, such as on the deck of a ship, to drain water."}],"partOfSpeech":"n"}]},{"word":"SYNDICATED","idx":18455,"count":1840789,"meanings":[{"definitions":[{"definition":"To become a syndicate."},{"definition":"To put under the control of a group acting as a unit."},{"definition":"(mass media) To release media content through a syndicate to be broadcast or published through multiple outlets."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a news article, etc.) published in multiple newspapers or magazines simultaneously via an agency."}],"partOfSpeech":"j"}]},{"word":"LEXICON","idx":18456,"count":1840672,"meanings":[{"definitions":[{"definition":"The vocabulary of a language."},{"definition":"A dictionary that includes or focuses on lexemes."},{"definition":"A dictionary of Classical Greek, Hebrew, Latin, or Aramaic."},{"definition":"The lexicology of a programming language. (Usually called lexical structure.)"},{"definition":"Any dictionary."},{"definition":"The vocabulary used by or known to an individual. (Also called lexical knowledge)"},{"definition":"A vocabulary specific to a certain subject.","example":"a baseball lexicon"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lexicon-us","text":"/ˈlɛk.sɪ.kɑn/"}]},{"word":"FRACTURES","idx":18458,"count":1840184,"meanings":[{"definitions":[{"definition":"An instance of breaking, a place where something has broken."},{"definition":"A break in bone or cartilage."},{"definition":"A fault or crack in a rock."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To break, or cause something to break."},{"definition":"To amuse (a person) greatly; to split someone's sides."}],"partOfSpeech":"ve"}]},{"word":"APPRENTICESHIP","idx":18459,"count":1840066,"meanings":[{"definitions":[{"definition":"The condition of, or the time served by, an apprentice."},{"definition":"The system by which a person learning a craft or trade is instructed by a master for a set time under set conditions."}],"partOfSpeech":"n"}]},{"word":"CHILDBIRTH","idx":18460,"count":1840004,"meanings":[{"definitions":[{"definition":"The fact or action of giving birth to a child, as the culmination of pregnancy."}],"partOfSpeech":"n"}]},{"word":"DUMPED","idx":18461,"count":1839893,"meanings":[{"definitions":[{"definition":"To release, especially in large quantities and chaotic manner."},{"definition":"To discard; to get rid of something one does not want anymore."},{"definition":"To sell below cost or very cheaply; to engage in dumping."},{"definition":"To copy data from a system to another place or system, usually in order to archive it."},{"definition":"To output the contents of storage or a data structure, often in order to diagnose a bug."},{"definition":"To end a relationship with."},{"definition":"To knock heavily; to stump."},{"definition":"To put or throw down with more or less of violence; hence, to unload from a cart by tilting it","example":"We dumped the coal onto the fireplace."},{"definition":"To precipitate (especially snow) heavily."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dʌmpt/"}]},{"word":"INTEGERS","idx":18462,"count":1839860,"meanings":[{"definitions":[{"definition":"A number that is not a fraction; an element of the infinite and numerable set {..., -3, -2, -1, 0, 1, 2, 3, ...}."},{"definition":"The smallest ring containing the natural numbers; the set {... -3, -2, -1, 0, 1, 2, 3 ...}."}],"partOfSpeech":"n"}]},{"word":"ZIRCONIA","idx":18463,"count":1839687,"meanings":[{"definitions":[{"definition":"The oxide of zirconium, obtained as a white powder, and possessing both acid and basic properties. On account of its infusibility, and brilliant luminosity when incandescent, it is used as an ingredient of sticks for the Drummond light."}],"partOfSpeech":"n"}]},{"word":"BARRE","idx":18464,"count":1839524,"meanings":[{"definitions":[{"definition":"A handrail fixed to a wall used for ballet exercises."},{"definition":"Short for barre chord."}],"partOfSpeech":"n"}]},{"word":"SHORTAGES","idx":18465,"count":1839326,"meanings":[{"definitions":[{"definition":"A lack or deficiency; an insufficient amount."}],"partOfSpeech":"n"}]},{"word":"PLUMBERS","idx":18466,"count":1839191,"meanings":[{"definitions":[{"definition":"One who works in or with lead."},{"definition":"One who furnishes, fits, and repairs pipes and other apparatus for the conveyance of water, gas, or drainage."},{"definition":"A person who investigates or prevents leaks of information"},{"definition":"In the Royal Navy, an apprentice, a boy aged 16 to 18, who is trained in technical skills at the Dockyard Schools to become an artificer."},{"definition":"A urologist."}],"partOfSpeech":"n"}]},{"word":"FIERY","idx":18469,"count":1838655,"meanings":[{"definitions":[{"definition":"Of or relating to fire."},{"definition":"Burning or glowing."},{"definition":"Inflammable or easily ignited."},{"definition":"Having the colour of fire."},{"definition":"Hot or inflamed."},{"definition":"Tempestuous or emotionally volatile.","example":"a fiery temper"},{"definition":"Spirited or filled with emotion."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fiery","text":"/ˈfaɪəɹi/"}]},{"word":"CONVEX","idx":18470,"count":1838604,"meanings":[{"definitions":[{"definition":"Any convex body or surface."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Curved or bowed outward like the outside of a bowl or sphere or circle"},{"definition":"(of a set in Euclidean space) arranged such that for any two points in the set, a straight line between the two points is contained within the set."},{"definition":"(of a polygon) having no internal angles greater than 180 degrees."},{"definition":"(of a real-valued function on the reals) having an epigraph which is a convex set."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"convex-uk","text":"/ˈkɒnvɛks/"}]},{"word":"RICHER","idx":18473,"count":1838539,"meanings":[{"definitions":[{"definition":"Wealthy: having a lot of money and possessions."},{"definition":"Having an intense fatty or sugary flavour.","example":"a rich dish; rich cream or soup; rich pastry"},{"definition":"Plentiful, abounding, abundant, fulfilling.","example":"a rich treasury; a rich entertainment; a rich crop"},{"definition":"Yielding large returns; productive or fertile; fruitful.","example":"rich soil or land; a rich mine"},{"definition":"Composed of valuable or costly materials or ingredients; procured at great outlay; highly valued; precious; sumptuous; costly.","example":"a rich endowment; a rich dress; rich silk or fur; rich presents"},{"definition":"Not faint or delicate; vivid.","example":"a rich red colour"},{"definition":"Very amusing.","example":"The scene was a rich one."},{"definition":"Ridiculous, absurd, outrageous, preposterous."},{"definition":"Elaborate, having complex formatting, multimedia, or depth of interaction."},{"definition":"Of a fuel-air mixture, having less air than is necessary to burn all of the fuel; less air- or oxygen- rich than necessary for a stoichiometric reaction."},{"definition":"Trading at a price level which is high relative to historical trends, a similar asset, or (for derivatives) a theoretical value."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹɪt͡ʃɚ/"},{"text":"/ˈɹɪt͡ʃə/"}]},{"word":"MOP","idx":18476,"count":1838160,"meanings":[{"definitions":[{"definition":"An implement for washing floors, or the like, made of a piece of cloth, or a collection of thrums, or coarse yarn, fastened to a handle."},{"definition":"A wash with a mop; the act of mopping","example":"He gave the floor a quick mop to soak up the spilt juice."},{"definition":"A dense head of hair.","example":"He ran a comb through his mop and hurried out the door."},{"definition":"A fair where servants are hired."},{"definition":"The young of any animal; also, a young girl; a moppet."},{"definition":"A made-up face; a grimace."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rub, scrub, clean or wipe with a mop, or as if with a mop.","example":"to mop (or scrub) a floor"},{"definition":"To make a wry expression with the mouth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mop-us","text":"/mɑp/"}]},{"word":"URN","idx":18477,"count":1838000,"meanings":[{"definitions":[{"definition":"A vase with a footed base."},{"definition":"A metal vessel for serving tea or coffee."},{"definition":"A vessel for the ashes or cremains of a deceased person."},{"definition":"Any place of burial; the grave."},{"definition":"A measure of capacity for liquids, containing about three gallons and a half, wine measure. It was half the amphora, and four times the congius."},{"definition":"A hollow body shaped like an urn, in which the spores of mosses are contained; a spore case; a theca."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place in an urn."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"urn-uk","text":"/ɜːn/"}]},{"word":"SURFER","idx":18481,"count":1837185,"meanings":[{"definitions":[{"definition":"A person who rides a surfboard."},{"definition":"A person who surfs the Internet."},{"definition":"A duck, the surf scoter (Melanitta perspicillata)."}],"partOfSpeech":"n"}]},{"word":"DIAPERS","idx":18482,"count":1837022,"meanings":[{"definitions":[{"definition":"A textile fabric having a diamond-shaped pattern formed by alternating directions of thread."},{"definition":"A towel or napkin made from such fabric."},{"definition":"An absorbent garment worn by a baby, by a young child not yet toilet trained, or by an adult who is incontinent; a nappy."},{"definition":"The diamond pattern associated with diaper textiles."},{"definition":"Surface decoration of any sort which consists of the constant repetition of one or more simple figures or units of design evenly spaced."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put diapers on someone.","example":"Diapering a baby is something you have to learn fast."},{"definition":"To draw flowers or figures, as upon cloth."}],"partOfSpeech":"ve"}]},{"word":"BISCUITS","idx":18489,"count":1835888,"meanings":[{"definitions":[{"definition":"(rare in the US) A small, flat, baked good which is either hard and crisp or else soft but firm: a cookie."},{"definition":"A small, usually soft and flaky bread, generally made with baking soda, which is similar in texture to a scone but which is usually not sweet."},{"definition":"A cracker.","example":"cheese and biscuits"},{"definition":"The \"bread\" formerly supplied to naval ships, which was made with very little water, kneaded into flat cakes and slowly baked, and which often became infested with weevils."},{"definition":"A form of unglazed earthenware."},{"definition":"A light brown colour."},{"definition":"A thin oval wafer of wood or other material inserted into mating slots on pieces of material to be joined to provide gluing surface and strength in shear."},{"definition":"A plastic card bearing the codes for authorizing a nuclear attack."},{"definition":"(hiphop) A handgun, especially a revolver."},{"definition":"(shuffleboard) A puck (hockey puck)."}],"partOfSpeech":"n"}]},{"word":"DISCLAIMS","idx":18490,"count":1835501,"meanings":[{"definitions":[{"definition":"To renounce all claim to; to deny ownership of or responsibility for; to disown; to disavow; to reject."},{"definition":"To deny, as a claim; to refuse."},{"definition":"To relinquish or deny having a claim; to disavow another's claim; to decline accepting, as an estate, interest, or office."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪsˈkleɪmz/"}]},{"word":"OUTBOUND","idx":18492,"count":1834727,"meanings":[{"definitions":[{"definition":"(logistics) An outbound shipment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Leaving or departing; traveling away from; outward bound."}],"partOfSpeech":"j"}]},{"word":"BREAKOUT","idx":18493,"count":1834521,"meanings":[{"definitions":[{"definition":"An escape from prison."},{"definition":"An escape from any restrictive or confining situation."},{"definition":"An outbreak."},{"definition":"A breakdown of statistics; a detailed view of component parts."},{"definition":"A room in a hotel etc. that can be taken by a smaller group at a large conference."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a book, film, or other work: leading its author to mainstream success."}],"partOfSpeech":"j"}]},{"word":"RESTLESS","idx":18494,"count":1834422,"meanings":[{"definitions":[{"definition":"Not allowing or affording rest.","example":"The night before his wedding was a restless one."},{"definition":"Without rest; unable to be still or quiet; uneasy; continually moving.","example":"He was a restless child."},{"definition":"Not satisfied to be at rest or in peace; averse to repose; eager for change; discontented.","example":"A restless ambition."},{"definition":"Deprived of rest or sleep.","example":"They remained restless, sitting by the window the entire night."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"restless-us","text":"/ˈɹɛstləs/"}]},{"word":"UNANSWERED","idx":18495,"count":1833886,"meanings":[{"definitions":[{"definition":"That has not been answered or addressed.","example":"The flashing light on the answering machine bore testimony to the unanswered call."}],"partOfSpeech":"j"}]},{"word":"PAIRED","idx":18496,"count":1833851,"meanings":[{"definitions":[{"definition":"To group into one or more sets of two.","example":"The wedding guests were paired boy/girl and groom's party/bride's party."},{"definition":"To bring two (animals, notably dogs) together for mating."},{"definition":"To engage (oneself) with another of opposite opinions not to vote on a particular question or class of questions."},{"definition":"To suit; to fit, as a counterpart."},{"definition":"To impair, to make worse."},{"definition":"To become worse, to deteriorate."}],"partOfSpeech":"ve"}]},{"word":"FAKES","idx":18497,"count":1833800,"meanings":[{"definitions":[{"definition":"Something which is not genuine, or is presented fraudulently."},{"definition":"A trick; a swindle."},{"definition":"A move meant to deceive an opposing player, used for gaining advantage for example when dribbling an opponent."},{"definition":"One of the circles or windings of a cable or hawser, as it lies in a coil; a single turn or coil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cheat; to swindle; to steal; to rob."},{"definition":"To modify fraudulently, so as to make an object appear better or other than it really is"},{"definition":"To make a counterfeit, to counterfeit, to forge, to falsify."},{"definition":"To make a false display of, to affect, to feign, to simulate.","example":"to fake a marriage"},{"definition":"To coil (a rope, line, or hawser), by winding alternately in opposite directions, in layers usually of zigzag or figure of eight form, to prevent twisting when running out."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/feɪks/"}]},{"word":"VAULTS","idx":18501,"count":1833132,"meanings":[{"definitions":[{"definition":"An arched masonry structure supporting and forming a ceiling, whether freestanding or forming part of a larger building."},{"definition":"Any arched ceiling or roof."},{"definition":"Anything resembling such a downward-facing concave structure, particularly the sky and caves."},{"definition":"The space covered by an arched roof, particularly underground rooms and church crypts."},{"definition":"Any cellar or underground storeroom."},{"definition":"Any burial chamber, particularly those underground.","example":"Family members had been buried in the vault for centuries."},{"definition":"The secure room or rooms in or below a bank used to store currency and other valuables; similar rooms in other settings.","example":"The bank kept their money safe in a large vault."},{"definition":"A piece of apparatus used for performing jumps."},{"definition":"A gymnastic movement performed on this apparatus."},{"definition":"An encrypted digital archive."},{"definition":"An underground or covered conduit for water or waste; a drain; a sewer."},{"definition":"An underground or covered reservoir for water or waste; a cistern; a cesspit."},{"definition":"A room employing a cesspit or sewer: an outhouse; a lavatory."},{"definition":"An act of vaulting, formerly by deer; a leap or jump."},{"definition":"An event or performance involving a vaulting horse."},{"definition":"A turning; a time (chiefly used in phrases signifying that the part is to be repeated)."},{"definition":"A volte"},{"definition":"A turning point or point of change in a poem, most commonly a sonnet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To build as, or cover with a vault."},{"definition":"To jump or leap over.","example":"The fugitive vaulted over the fence to escape."}],"partOfSpeech":"ve"}]},{"word":"INJECTIONS","idx":18502,"count":1832851,"meanings":[{"definitions":[{"definition":"The act of injecting, or something that is injected."},{"definition":"A specimen prepared by injection."},{"definition":"A morphism from either one of the two components of a coproduct to that coproduct."},{"definition":"The act of inserting materials like concrete grout or gravel by using high pressure pumps."},{"definition":"The supply of additional funding to a person or a business.","example":"The troubled business received a much-needed cash injection."},{"definition":"A relation on sets (X,Y) that associates each element of Y with at most one element of X."},{"definition":"The insertion of program code into an application, URL, hardware, etc.; especially when malicious or when the target is not designed for such insertion.","example":"a SQL injection exploit allowing a malicious user to modify a database query"},{"definition":"The act of putting a spacecraft into a particular orbit, especially for changing a stable orbit into a transfer orbit, e.g. trans-lunar injection."},{"definition":"A function that maps distinct x in the domain to distinct y in the codomain; formally, a f: X → Y such that f(a) = f(b) implies a = b for any a, b in the domain."},{"definition":"(specifically) Something injected subcutaneously, intravenously, or intramuscularly by use of a syringe and a needle."},{"definition":"(steam engines) The act of throwing cold water into a condenser to produce a vacuum."},{"definition":"(steam engines) The cold water thrown into a condenser to produce a vacuum."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪn.ˈdʒɛk.ʃəns/"}]},{"word":"REMORTGAGE","idx":18504,"count":1832346,"meanings":[{"definitions":[{"definition":"A subsequent or additional mortgage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mortgage again."}],"partOfSpeech":"ve"}]},{"word":"YOGURT","idx":18505,"count":1832002,"meanings":[{"definitions":[{"definition":"A milk-based product stiffened by a bacterium-aided curdling process, and sometimes mixed with fruit or other flavoring."},{"definition":"(especially in compounds) Any similar product based on other substances (e.g. soy yogurt)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"yogurt-us","text":"/ˈjoʊɡɚt/"}]},{"word":"COMPLIES","idx":18506,"count":1831945,"meanings":[{"definitions":[{"definition":"To yield assent; to accord; to acquiesce, agree, consent; to adapt oneself, to conform."},{"definition":"To accomplish, to fulfil."},{"definition":"To be ceremoniously courteous; to make one's compliments."},{"definition":"To enfold; to embrace."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəmˈplaɪz/"}]},{"word":"TOSSED","idx":18507,"count":1831899,"meanings":[{"definitions":[{"definition":"To throw with an initial upward direction.","example":"Toss it over here!"},{"definition":"To lift with a sudden or violent motion.","example":"to toss the head"},{"definition":"To agitate; to make restless."},{"definition":"To subject to trials; to harass."},{"definition":"To flip a coin, to decide a point of contention.","example":"I'll toss you for it."},{"definition":"To discard: to toss out","example":"I don't need it any more; you can just toss it."},{"definition":"To stir or mix (a salad).","example":"to toss a salad; a tossed salad."},{"definition":"(British slang) To masturbate"},{"definition":"To search (a room or a cell), sometimes leaving visible disorder, as for valuables or evidence of a crime.","example":"\"Someone tossed just his living room and bedroom.\" / \"They probably found what they were looking for.\""},{"definition":"To roll and tumble; to be in violent commotion.","example":"tossing and turning in bed, unable to sleep"},{"definition":"To be tossed, as a fleet on the ocean, or as a ship in heavy seas."},{"definition":"To keep in play; to tumble over.","example":"to spend four years in tossing the rules of grammar"},{"definition":"To peak (the oars), to lift them from the rowlocks and hold them perpendicularly, the handle resting on the bottom of the boat."},{"definition":"(British slang) To drink in large draughts; to gulp."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tossed-us","text":"/tɔst/"}]},{"word":"CAUCUS","idx":18508,"count":1831830,"meanings":[{"definitions":[{"definition":"A usually preliminary meeting of party members to nominate candidates for public office or delegates to be sent a nominating convention, or to confer regarding policy."},{"definition":"A grouping of all the members of a legislature from the same party."},{"definition":"A political interest group by members of a legislative body."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To meet and participate in caucus."},{"definition":"To bring into or treat in caucus."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɒ(ː).kəs/"},{"text":"/ˈkɔː.kəs/"}]},{"word":"WORKAROUND","idx":18509,"count":1831806,"meanings":[{"definitions":[{"definition":"A means of overcoming some obstacle, especially an obstacle consisting of laws, regulations, or constraints."},{"definition":"A procedure or a temporary fix that bypasses a problem and allows the user to continue working until a better solution can be provided."},{"definition":"(project management) An impromptu and temporary response to an unforeseen problem or risk."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɜːk.əɹaʊnd/"}]},{"word":"POLYTECHNIC","idx":18511,"count":1830938,"meanings":[{"definitions":[{"definition":"An educational institute that teaches applied arts and sciences rather than academic subjects."},{"definition":"An exhibition of objects illustrating many arts."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That teaches applied arts, sciences, technology, engineering and other academic subjects"}],"partOfSpeech":"j"}]},{"word":"PILLARS","idx":18512,"count":1830785,"meanings":[{"definitions":[{"definition":"A large post, often used as supporting architecture."},{"definition":"Something resembling such a structure.","example":"a pillar of smoke"},{"definition":"An essential part of something that provides support.","example":"He's a pillar of the community."},{"definition":"A portable ornamental column, formerly carried before a cardinal, as emblematic of his support to the church."},{"definition":"The centre of the volta, ring, or manege ground, around which a horse turns."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɪlɚz/"},{"text":"/ˈpɪləz/"}]},{"word":"OVERWHELMED","idx":18516,"count":1830158,"meanings":[{"definitions":[{"definition":"To engulf, surge over and submerge.","example":"The dinghy was overwhelmed by the great wave."},{"definition":"To overpower, crush.","example":"In December 1939 the Soviet Union attacked Finland with overwhelming force."},{"definition":"To overpower emotionally.","example":"He was overwhelmed with guilt."},{"definition":"To cause to surround, to cover."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"overwhelmed-us","text":"/ˌoʊvɚˈ(h)wɛlmd/"}]},{"word":"SALUTE","idx":18517,"count":1829803,"meanings":[{"definitions":[{"definition":"An utterance or gesture expressing greeting or honor towards someone, now especially a formal, non-verbal gesture made with the arms or hands in any of various specific positions.","example":"The soldiers greeted the dignitaries with a crisp salute."},{"definition":"A kiss, offered in salutation."},{"definition":"A discharge of cannon or similar arms, as a mark of honour or respect."},{"definition":"A pyrotechnic device primarily designed to produce a loud bang."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a gesture in honor of (someone or something).","example":"They saluted the flag as it passed in the parade."},{"definition":"To act in thanks, honor, or tribute; to thank or extend gratitude; to praise.","example":"I would like to salute the many dedicated volunteers that make this project possible."},{"definition":"To wave, to acknowledge an acquaintance.","example":"I saluted Bill at the concert, but he didn't see me through the crowd."},{"definition":"To address, as with expressions of kind wishes and courtesy; to greet; to hail."},{"definition":"To promote the welfare and safety of; to benefit; to gratify."},{"definition":"To kiss."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"salute-us","text":"/səˈlut/"},{"audio":"salute-uk","text":"/səˈl(j)uːt/"}]},{"word":"SHOPPE","idx":18518,"count":1829764,"meanings":[{"definitions":[{"definition":"(sometimes capitalized) A fanciful spelling of shop, chiefly used in the names of businesses to give an air of old-fashionedness.","example":"It's called “Ye Olde Grog Shoppe”, but really it's the new liquor shop and it opened just last month."}],"partOfSpeech":"n"}]},{"word":"PARODY","idx":18519,"count":1829413,"meanings":[{"definitions":[{"definition":"A work or performance that imitates another work or performance with ridicule or irony."},{"definition":"A popular maxim, adage, or proverb."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a parody of something.","example":"The comedy movie parodied the entire Western genre."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"parody-uk","text":"/ˈpæɹədi/"}]},{"word":"PENTHOUSE","idx":18522,"count":1828709,"meanings":[{"definitions":[{"definition":"An outhouse or other structure (especially one with a sloping roof) attached to the outside wall of a building, sometimes as protection from the weather."},{"definition":"An apartment or suite found on an upper floor, or floors, of a tall building, especially one that is expensive or luxurious with panoramic views. Sometimes these are located just under \"penthouse mechanical\" floors."},{"definition":"Any of the sloping roofs at the side of a real tennis court."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide with a penthouse, shelter by means of a shed sloping from a wall, or anything similar."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɛnthaʊs/"}]},{"word":"COMPENSATED","idx":18523,"count":1828676,"meanings":[{"definitions":[{"definition":"To do (something good) after (something bad) happens"},{"definition":"To pay or reward someone in exchange for work done or some other consideration.","example":"It is hard work, but they will compensate you well for it."},{"definition":"To make up for; to do something in place of something else; to correct, satisfy; to reach an agreement such that the scales are literally or (metaphorically) balanced; to equalize or make even.","example":"His loud voice cannot compensate for a lack of personality."},{"definition":"To adjust or adapt to a change, often a harm or deprivation.","example":"I don't like driving that old car because it always steers a little to the left so I'm forever compensating for that when I drive it. Trust me, it gets annoying real fast."}],"partOfSpeech":"ve"}]},{"word":"SYNTHASE","idx":18524,"count":1828488,"meanings":[{"definitions":[{"definition":"Any enzyme that catalyzes the synthesis of a biological compound but, unlike synthetases, does not make use of ATP as a source of energy"}],"partOfSpeech":"n"}]},{"word":"LACKED","idx":18525,"count":1828230,"meanings":[{"definitions":[{"definition":"To be without, to need, to require.","example":"My life lacks excitement."},{"definition":"To be short (of or for something).","example":"He'll never lack for company while he's got all that money."},{"definition":"To be in want."},{"definition":"To see the deficiency in (someone or something); to find fault with, to malign, reproach."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/lækt/"}]},{"word":"CIRCULATED","idx":18526,"count":1828203,"meanings":[{"definitions":[{"definition":"To move in circles or through a circuit"},{"definition":"To cause (a person or thing) to move in circles or through a circuit"},{"definition":"To move from person to person, as at a party"},{"definition":"To spread or disseminate","example":"to circulate money or gossip"},{"definition":"To become widely known"},{"definition":"Of decimals: to repeat."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Distributed about a circuit"}],"partOfSpeech":"j"}]},{"word":"PISTONS","idx":18528,"count":1827651,"meanings":[{"definitions":[{"definition":"A solid disk or cylinder that fits inside a hollow cylinder, and moves under pressure (as in an engine) or displaces fluid (as in a pump)"},{"definition":"A valve device in some brass instruments for changing the pitch"}],"partOfSpeech":"n"}]},{"word":"SAUVIGNON","idx":18531,"count":1826243,"meanings":[{"definitions":[{"definition":"Any of several grape varieties and associated wines originally from France"}],"partOfSpeech":"n"}]},{"word":"ACORN","idx":18532,"count":1825652,"meanings":[{"definitions":[{"definition":"The fruit of the oak, being an oval nut growing in a woody cup or cupule."},{"definition":"A cone-shaped piece of wood on the point of the spindle above the vane, on the mast-head."},{"definition":"See acorn-shell."},{"definition":"(usually in the plural) A testicle."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"acorn-us","text":"/ˈeɪ.kɔɹn/"}]},{"word":"BOSSES","idx":18533,"count":1825578,"meanings":[{"definitions":[{"definition":"A person who oversees and directs the work of others; a supervisor."},{"definition":"A person in charge of a business or company.","example":"Chat turned to whisper when the boss entered the conference room."},{"definition":"A leader, the head of an organized group or team.","example":"They named him boss because he had good leadership skills."},{"definition":"The head of a political party in a given region or district.","example":"He is the Republican boss in Kentucky."},{"definition":"A term of address to a man.","example":"Yes, boss."},{"definition":"An enemy, often at the end of a level, that is particularly challenging and must be beaten in order to progress."},{"definition":"Wife.","example":"There's no olive oil; will sunflower oil do? — I'll have to run that by the boss."},{"definition":"A swelling, lump or protuberance in an animal, person or object."},{"definition":"A lump-like mass of rock, especially one projecting through a stratum of different rock."},{"definition":"A convex protuberance in hammered work, especially the rounded projection in the centre of a shield."},{"definition":"A protrusion, frequently a cylinder of material that extends beyond a hole."},{"definition":"A knob or projection, usually at the intersection of ribs in a vault."},{"definition":"A target block, made of foam but historically made of hay bales, to which a target face is attached."},{"definition":"A wooden vessel for the mortar used in tiling or masonry, hung by a hook from the laths, or from the rounds of a ladder."},{"definition":"A head or reservoir of water."},{"definition":"A hassock or small seat, especially made from a bundle of straw."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To exercise authoritative control over; to tell (someone) what to do, often repeatedly."},{"definition":"To decorate with bosses; to emboss."}],"partOfSpeech":"ve"}]},{"word":"PINT","idx":18534,"count":1825570,"meanings":[{"definitions":[{"definition":"A unit of volume, equivalent to:"},{"definition":"(metonym) A pint of milk.","example":"Please leave three pints tomorrow, milkman."},{"definition":"(metonymy) A glass of beer or cider, served by the pint."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pint-us","text":"/paɪnt/"}]},{"word":"ASCENSION","idx":18535,"count":1825408,"meanings":[{"definitions":[{"definition":"The act of ascending; an ascent.","example":"The ascension of the hot-air balloon gave us a better view."},{"definition":"That which rises, as from distillation."}],"partOfSpeech":"n"}]},{"word":"PLY","idx":18538,"count":1824830,"meanings":[{"definitions":[{"definition":"A layer of material.","example":"two-ply toilet paper"},{"definition":"A strand that, twisted together with other strands, makes up rope or yarn."},{"definition":"Short for plywood."},{"definition":"In two-player sequential games, a \"half-turn\" or a move made by one of the players.","example":"He proposed to build Deep Purple, a super-computer capable of 24-ply look-ahead for chess."},{"definition":"A condition, a state."},{"definition":"A bent; a direction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bend; to fold; to mould; to adapt, to modify; to change (a person's) mind, to cause (a person) to submit."},{"definition":"To bend, to flex; to be bent by something, to give way or yield (to a force, etc.)."},{"definition":"To work at (something) diligently.","example":"He plied his trade as carpenter for forty-three years."},{"definition":"To wield or use (a tool, a weapon, etc.) steadily or vigorously.","example":"He plied his ax with bloody results."},{"definition":"To press upon; to urge persistently.","example":"to ply someone with questions or solicitations"},{"definition":"To persist in offering something to, especially for the purpose of inducement or persuasion.","example":"to ply someone with drink"},{"definition":"To travel over (a route) regularly.","example":"The steamer plies between several ports on the coast."},{"definition":"To work diligently."},{"definition":"To manoeuvre a sailing vessel so that the direction of the wind changes from one side of the vessel to the other; to work to windward, to beat, to tack."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/plaɪ/"},{"audio":"ply-au"}]},{"word":"MORNINGS","idx":18539,"count":1824695,"meanings":[{"definitions":[{"definition":"The part of the day from dawn to noon.","example":"I'll see you tomorrow morning."},{"definition":"The part of the day between midnight and noon."},{"definition":"The early part of anything."},{"definition":"The first alcoholic drink of the day; a morning draught."}],"partOfSpeech":"n"}]},{"word":"CATION","idx":18541,"count":1824071,"meanings":[{"definitions":[{"definition":"A positively charged ion, i.e. one that would be attracted to the cathode in electrolysis."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkætˌaɪ.ən/"},{"text":"/ˈkat.ʌɪ.ən/"}]},{"word":"MENTIONING","idx":18542,"count":1823902,"meanings":[{"definitions":[{"definition":"To make a short reference to something."},{"definition":"To utter a word or expression in order to refer to the expression itself, as opposed to its usual referent."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmɛnʃənɪŋ/"}]},{"word":"FLAGSTAFF","idx":18545,"count":1823335,"meanings":[{"definitions":[{"definition":"A pole on which a flag is raised."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"flagstaff-us","text":"/ˈflæɡstæf/"}]},{"word":"MAXI","idx":18546,"count":1823007,"meanings":[{"definitions":[{"definition":"A coat or skirt having such a hemline"},{"definition":"A class of racing sailing yacht that pushes at the upper limits of the International Offshore Rule of regulated sail yacht racing, having a waterline length in excess of 70-feet."},{"definition":"A music single with more than two tracks, i.e. not just an A-side and a B-side."},{"definition":"A maxi boat"},{"definition":"The highest limit"},{"definition":"The greatest value of a set or other mathematical structure, especially the global maximum or a local maximum of a function"},{"definition":"An upper bound of a set which is also an element of that set"},{"definition":"The largest value of a batch or sample or the upper bound of a probability distribution"},{"definition":"A 147 break; the highest possible break"},{"definition":"A score of 180 with three darts"},{"definition":"A scoring shot for 6 runs"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a hemline at ankle length"}],"partOfSpeech":"j"}]},{"word":"THRIVE","idx":18548,"count":1822797,"meanings":[{"definitions":[{"definition":"To grow or increase stature; to grow vigorously or luxuriantly, to flourish.","example":"Not all animals thrive well in captivity."},{"definition":"To increase in wealth or success; to prosper, be profitable.","example":"Since expanding in June, the business has really thrived."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"thrive-us","text":"/θɹaɪv/"}]},{"word":"FEMINISM","idx":18551,"count":1822628,"meanings":[{"definitions":[{"definition":"The state of being feminine; femininity."},{"definition":"A social theory or political movement which argues that legal and social restrictions on women must be removed in order to bring about equality of the sexes in all aspects of public and private life."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"feminism-us"},{"text":"/ˈfɛmɪnɪz(ə)m/"}]},{"word":"RIGHTLY","idx":18552,"count":1822243,"meanings":[{"definitions":[{"definition":"In a right manner, correctly, justifiably.","example":"I don't rightly know what he meant by that remark."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"rightly-us","text":"/ˈɹaɪtli/"}]},{"word":"PARAGON","idx":18553,"count":1822146,"meanings":[{"definitions":[{"definition":"A person of preeminent qualities, who acts as a pattern or model for others.","example":"In the novel, Constanza is a paragon of virtue who would never compromise her reputation."},{"definition":"A companion; a match; an equal."},{"definition":"Comparison; competition."},{"definition":"The size of type between great primer and double pica, standardized as 20-point."},{"definition":"A flawless diamond of at least 100 carats."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To compare; to parallel; to put in rivalry or emulation with."},{"definition":"To compare with; to equal; to rival."},{"definition":"To serve as a model for; to surpass."},{"definition":"To be equal; to hold comparison."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"paragon-uk","text":"/ˈpæɹəɡən/"}]},{"word":"BASAL","idx":18554,"count":1821739,"meanings":[{"definitions":[{"definition":"Base, bottom, minimum"},{"definition":"Any basal structure or part"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Basic, elementary; relating to, or forming, the base, or point of origin.","example":"A basal reader is a kind of book that is used to teach reading."},{"definition":"Associated with the base of an organism or structure.","example":"In the spring, basal leaves emerge from a stout taproot."},{"definition":"Of a minimal level that is necessary for maintaining the health or life of an organism.","example":"a basal diet"},{"definition":"In a phylogenetic tree, being a group, or member of a group, which diverged earlier. The earliest clade to branch in a larger clade.","example":"A magnolia is a basal angiosperm."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[ˈbeɪzəɫ]"},{"text":"[ˈbeɪsəɫ]"}]},{"word":"WEBINAR","idx":18556,"count":1821435,"meanings":[{"definitions":[{"definition":"An interactive seminar conducted via Internet. Usually a live presentation, lecture or workshop that happens in real time, as users participate through text-based chat, voice, video, or file-sharing.","example":"I just got an email invitation to a webinar on the value of primary sources."}],"partOfSpeech":"n"}]},{"word":"TURNOUT","idx":18558,"count":1821165,"meanings":[{"definitions":[{"definition":"The act of coming forth."},{"definition":"The number of people who attend or participate in an event (especially an election) or are present at a venue."},{"definition":"A place to pull off a road.","example":"When towing a trailer, use the turnouts to let faster traffic pass."},{"definition":"A place where moveable rails allow a train to switch tracks; a set of points."},{"definition":"A quitting of employment for the purpose of forcing increase of wages; a strike."},{"definition":"A striker."},{"definition":"That which is prominently brought forward or exhibited; hence, an equipage.","example":"A man with a showy carriage and horses is said to have a fine turnout."},{"definition":"Net quantity of produce yielded."}],"partOfSpeech":"n"}]},{"word":"BRUINS","idx":18559,"count":1821057,"meanings":[{"definitions":[{"definition":"A folk name for a bear, especially the brown bear, Ursus arctos."}],"partOfSpeech":"n"}]},{"word":"PERSIST","idx":18560,"count":1821030,"meanings":[{"definitions":[{"definition":"To go on stubbornly or resolutely."},{"definition":"To repeat an utterance."},{"definition":"To continue to exist."},{"definition":"To continue to be; to remain."},{"definition":"To cause to persist; make permanent."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"persist-us","text":"/pɚˈsɪst/"}]},{"word":"INDISPENSABLE","idx":18562,"count":1820574,"meanings":[{"definitions":[{"definition":"A thing that is not dispensable; a necessity."},{"definition":"(in the plural) Trousers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not admitting ecclesiastical dispensation; not subject to release or exemption; that cannot be allowed by bending the canonical rules."},{"definition":"(of duties, rules etc.) Unbendable, that cannot be set aside or ignored.","example":"The law was moral and indispensable. -Bp. Burnet"},{"definition":"Absolutely necessary or requisite; that one cannot do without.","example":"An indispensable component of a heart-healthy diet."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪndɪˈspɛnsəbəl/"}]},{"word":"CLAMPS","idx":18563,"count":1820337,"meanings":[{"definitions":[{"definition":"A brace, band, or clasp for strengthening or holding things together."},{"definition":"An instrument used to temporarily shut off blood vessels, etc."},{"definition":"A parking enforcement device used to immobilise a car until it can be towed or a fine is paid; a wheel clamp."},{"definition":"A mass of bricks heaped up to be burned; or of ore for roasting, or of coal coking."},{"definition":"A pile of root vegetables stored under a layer of earth."},{"definition":"A piece of wood (batten) across the grain of a board end to keep it flat, as in a breadboard."},{"definition":"An electronic circuit that fixes either the positive or the negative peak excursions of a signal to a defined value by shifting its DC value."},{"definition":"A heavy footstep; a tramp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten in place or together with (or as if with) a clamp."},{"definition":"To hold or grip tightly."},{"definition":"To modify (a numeric value) so it lies within a specific range."},{"definition":"To cover (vegetables, etc.) with earth."},{"definition":"To tread heavily or clumsily; to clump or clomp."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/klæmps/"}]},{"word":"ILLICIT","idx":18564,"count":1820204,"meanings":[{"definitions":[{"definition":"A banned or unlawful item."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not approved by law, but not invalid."},{"definition":"Breaking social norms."},{"definition":"Unlawful."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪˈlɪsɪt/"}]},{"word":"FIREFLY","idx":18565,"count":1820064,"meanings":[{"definitions":[{"definition":"Any beetle of the family Lampyridae, which exhibit bioluminescence during twilight."}],"partOfSpeech":"n"}]},{"word":"LIAR","idx":18566,"count":1819814,"meanings":[{"definitions":[{"definition":"One who tells lies."},{"definition":"A swabber responsible for cleaning the outside parts of the ship rather than the cabins, a role traditionally assigned to a person caught telling a lie the previous week."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlaɪ.ɚ/"},{"text":"/ˈlaɪ.ə/"}]},{"word":"TABLETOP","idx":18567,"count":1819329,"meanings":[{"definitions":[{"definition":"(furniture) the flat, horizontal surface of a table"},{"definition":"A fixed item resembling a table, used for performing skateboarding tricks."},{"definition":"A photograph of an object or product placed on a table."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Suitable for use on top of a table."},{"definition":"Taking place on top of a table.","example":"tabletop gaming"}],"partOfSpeech":"j"}]},{"word":"PLEDGED","idx":18568,"count":1818974,"meanings":[{"definitions":[{"definition":"To make a solemn promise (to do something)."},{"definition":"To deposit something as a security; to pawn."},{"definition":"To give assurance of friendship by the act of drinking; to drink to one's health."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/plɛdʒd/"}]},{"word":"MONOCLONAL","idx":18569,"count":1818772,"meanings":[{"definitions":[{"definition":"Something produced from a single clone, especially a monoclonal antibody"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Genetically engineered from a single clone; used especially of a protein or antibody"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌmɑn.əˈkloʊ.nəl/"},{"text":"/ˌmɒn.əˈkləʊ.nəl/"}]},{"word":"PICTORIAL","idx":18570,"count":1818744,"meanings":[{"definitions":[{"definition":"A newspaper or magazine with many pictures, or section thereof"},{"definition":"An article primarily featuring many photographs, or simply a collection of photographs"},{"definition":"A stamp featuring a vignette of local scenery or culture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, composed of, or illustrated by pictures."},{"definition":"Described or otherwise represented as if in a picture; graphic or vivid."},{"definition":"Stylistically similar to a painting, especially following pictorial conventions (of a photograph) – see pictorialism."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɪkˈtɔɹi.əl/"}]},{"word":"CURLING","idx":18571,"count":1818738,"meanings":[{"definitions":[{"definition":"To cause to move in a curve."},{"definition":"To make into a curl or spiral."},{"definition":"To assume the shape of a curl or spiral."},{"definition":"To move in curves."},{"definition":"To take part in the sport of curling.","example":"I curl at my local club every weekend."},{"definition":"To exercise by bending the arm, wrist, or leg on the exertion against resistance, especially of the biceps."},{"definition":"To twist or form (the hair, etc.) into ringlets."},{"definition":"To deck with, or as if with, curls; to ornament."},{"definition":"To raise in waves or undulations; to ripple."},{"definition":"(hat-making) To shape (the brim of a hat) into a curve."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action or motion of something that curls or is curled.","example":"a scornful curling of the lip"},{"definition":"A winter sport where players aim and slide stones down a sheet of ice and attempt to get their color stones closest to the house (a circular target marked on the ice)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"curling-us","text":"/ˈkəɹlɪŋ/"}]},{"word":"ARES","idx":18572,"count":1818295,"meanings":[{"definitions":[{"definition":"An accepted (but deprecated and rarely used) SI unit of area equal to 100 square metres, or a former unit of approximately the same extent. Symbol: a."}],"partOfSpeech":"n"}]},{"word":"WHOLESALER","idx":18573,"count":1818207,"meanings":[{"definitions":[{"definition":"A person or company that buys merchandise from manufacturers, importers, or distributors and resells the merchandise to retail businesses and to business and institutional end users."}],"partOfSpeech":"n"}]},{"word":"SMOKY","idx":18574,"count":1818184,"meanings":[{"definitions":[{"definition":"Filled with smoke.","example":"a smoky cabin"},{"definition":"Giving off smoke.","example":"a smoky oil lamp"},{"definition":"Of a colour or colour pattern similar to that of smoke."},{"definition":"Having a flavour or odour like smoke; flavoured with smoke.","example":"a smoky whisky"},{"definition":"Resembling or composed of smoke."},{"definition":"Blackened by smoke."},{"definition":"(of a person's voice) Having a deep, raspy quality, often as a result of smoking tobacco."},{"definition":"Attractive in a sensual way; sultry."},{"definition":"Having a dark, thick, bass sound.","example":"a few smoky jazz notes"},{"definition":"Giving off steam or vapour."},{"definition":"Obscuring or insubstantial like smoke."},{"definition":"Suspicious; open to suspicion; jealous."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsmoʊki/"}]},{"word":"OPUS","idx":18575,"count":1818130,"meanings":[{"definitions":[{"definition":"A work of music or set of works with a specified rank in an ordering of a composer's complete published works.","example":"Beethoven's opus eighteen quartets are considered by many to be the beginning of the Romantic era."},{"definition":"A work, especially of art.","example":"The painter's last opus was a dedication to all things living, in a surprising contrast to all of his prior work."}],"partOfSpeech":"n"}]},{"word":"AROMATIC","idx":18577,"count":1817946,"meanings":[{"definitions":[{"definition":"A fragrant plant or spice added to a dish to flavour it."},{"definition":"Any aromatic compound."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Fragrant or spicy."},{"definition":"Having a closed ring of alternate single and double bonds with delocalized electrons."},{"definition":"Derived from benzene."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"aromatic-us"},{"text":"/æ.ɹəˈmæt.ɪk/"}]},{"word":"FLIRT","idx":18578,"count":1817719,"meanings":[{"definitions":[{"definition":"A sudden jerk; a quick throw or cast; a darting motion"},{"definition":"Someone who flirts a lot or enjoys flirting; a flirtatious person."},{"definition":"An act of flirting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw (something) with a jerk or sudden movement; to fling.","example":"They flirt water in each other's faces."},{"definition":"To jeer at; to mock."},{"definition":"To dart about; to move with quick, jerky motions."},{"definition":"To blurt out."},{"definition":"To play at courtship; to talk with teasing affection, to insinuate sexual attraction in a playful (especially conversational) way."},{"definition":"To experiment, or tentatively engage, with; to become involved in passing with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pert; wanton"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"flirt-us","text":"/flɝt/"}]},{"word":"SLANG","idx":18579,"count":1817718,"meanings":[{"definitions":[{"definition":"Language outside of conventional usage and in the informal register."},{"definition":"Language that is unique to a particular profession or subject; jargon."},{"definition":"The specialized language of a social group, sometimes used to make what is said unintelligible to those not members of the group; cant."},{"definition":"A particular variety of slang; the slang used by a particular group."},{"definition":"An item of slang; a slang word or expression."},{"definition":"Any long, narrow piece of land; a promontory."},{"definition":"A fetter worn on the leg by a convict."},{"definition":"A counterfeit weight or measure."},{"definition":"A travelling show, or one of its performances."},{"definition":"A hawker's license."},{"definition":"A watchchain."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To vocally abuse, or shout at."},{"definition":"To throw with a circular or arcing motion."},{"definition":"To throw with a sling."},{"definition":"To pass a rope around (a cask, gun, etc.) preparatory to attaching a hoisting or lowering tackle."},{"definition":"To sell, peddle, or distribute illicitly (e.g. drugs, sex, etc.)."},{"definition":"To sell (especially illegal drugs)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slang-us","text":"/sleɪŋ/"}]},{"word":"EMPORIUM","idx":18580,"count":1817716,"meanings":[{"definitions":[{"definition":"A city or region which is a major trading centre; also, a place within a city for commerce and trading; a marketplace."},{"definition":"A shop that offers a wide variety of goods for sale; a department store; (with a descriptive word) a shop specializing in particular goods.","example":"With a name like “The Wine and Spirits Emporium”, no wonder the prices are so high."},{"definition":"A business set up to enable foreign traders to engage in commerce in a country; a factory (now the more common term)."},{"definition":"(by extension) The brain."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"emporium-us","text":"/ɛmˈpɔ.ɹi.əm/"}]},{"word":"PRINCES","idx":18581,"count":1817704,"meanings":[{"definitions":[{"definition":"A (male) ruler, a sovereign; a king, monarch."},{"definition":"A female monarch."},{"definition":"Someone who is preeminent in their field; a great person.","example":"He is a prince among men."},{"definition":"The (male) ruler or head of a principality."},{"definition":"A male member of a royal family other than the ruler; especially (in the United Kingdom) the son or grandson of the monarch."},{"definition":"A non-royal high title of nobility, especially in France and the Holy Roman Empire.","example":"Prince Louis de Broglie won the 1929 Nobel Prize in Physics."},{"definition":"The mushroom Agaricus augustus."},{"definition":"A type of court card used in tarot cards, the equivalent of the jack."},{"definition":"Any of various nymphalid butterflies of the genus Rohana."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"princes-us","text":"/ˈpɹɪnsɪz/"}]},{"word":"RESTRICTING","idx":18582,"count":1817556,"meanings":[{"definitions":[{"definition":"To restrain within boundaries; to limit; to confine","example":"After suffering diahrroea, the patient was restricted to a diet of rice, cold meat, and yoghurt."},{"definition":"(specifically) To consider (a function) as defined on a subset of its original domain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Serving to restrict"}],"partOfSpeech":"j"}]},{"word":"PARTNERING","idx":18583,"count":1817437,"meanings":[{"definitions":[{"definition":"To join as a partner."},{"definition":"(often with with) To work or perform as a partner."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The formation of a partnership."}],"partOfSpeech":"n"}]},{"word":"PROMOTERS","idx":18584,"count":1817398,"meanings":[{"definitions":[{"definition":"One who promotes, particularly with respect to entertainment events or goods."},{"definition":"The section of DNA that controls the initiation of RNA transcription as a product of a gene."},{"definition":"An accelerator of catalysis that is not itself a catalyst."}],"partOfSpeech":"n"}]},{"word":"SOOTHING","idx":18585,"count":1817294,"meanings":[{"definitions":[{"definition":"To restore to ease, comfort, or tranquility; relieve; calm; quiet; refresh."},{"definition":"To allay; assuage; mitigate; soften."},{"definition":"To smooth over; render less obnoxious."},{"definition":"To calm or placate someone or some situation."},{"definition":"To ease or relieve pain or suffering."},{"definition":"To temporise by assent, concession, flattery, or cajolery."},{"definition":"To bring comfort or relief."},{"definition":"To keep in good humour; wheedle; cajole; flatter."},{"definition":"To prove true; verify; confirm as true."},{"definition":"To confirm the statements of; maintain the truthfulness of (a person); bear out."},{"definition":"To assent to; yield to; humour by agreement or concession."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which somebody is soothed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Tending to soothe.","example":"soothing music"},{"definition":"Giving relief."},{"definition":"Freeing from fear or anxiety.","example":"soothing words"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsuːðɪŋ/"}]},{"word":"FRESHMEN","idx":18586,"count":1817045,"meanings":[{"definitions":[{"definition":"A novice; one in the rudiments of knowledge."},{"definition":"A person of either sex entering the first year of an institution, especially a high school (ninth grade), a university, or legislative body.","example":"At the time I was a wide-eyed freshman, but I was soon to grow jaded and cynical."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"freshmen-uk"}]},{"word":"MAGE","idx":18587,"count":1816965,"meanings":[{"definitions":[{"definition":"A magician, wizard or sorcerer."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/meɪdʒ/"}]},{"word":"DEPARTED","idx":18588,"count":1816797,"meanings":[{"definitions":[{"definition":"To leave."},{"definition":"To set out on a journey."},{"definition":"To die."},{"definition":"To disappear, vanish; to cease to exist."},{"definition":"To deviate (from), be different (from), fail to conform.","example":"His latest statements seemed to depart from party policy somewhat."},{"definition":"To go away from; to leave."},{"definition":"To divide up; to distribute, share."},{"definition":"To separate, part."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A dead person or persons."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Dead"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"departed-us","text":"/dɪˈpɑɹtɪd/"}]},{"word":"FINCH","idx":18592,"count":1816047,"meanings":[{"definitions":[{"definition":"Any bird of the family Fringillidae, seed-eating passerine birds, native chiefly to the Northern Hemisphere and usually having a conical beak."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hunt for finches, to go finching."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɪntʃ/"}]},{"word":"INHERENTLY","idx":18593,"count":1815659,"meanings":[{"definitions":[{"definition":"In an inherent way; naturally, innately."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"inherently-us","text":"/ɪnˈhɛɹəntli/"}]},{"word":"FOREFRONT","idx":18596,"count":1815372,"meanings":[{"definitions":[{"definition":"The leading position or edge.","example":"That laboratory researches topics at the forefront of technology."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bring to the forefront; to emphasize, or focus on."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"forefront-us","text":"/ˈfɔɹfɹʌnt/"}]},{"word":"HEADLIGHTS","idx":18597,"count":1815300,"meanings":[{"definitions":[{"definition":"A bright light, with a lens and reflector, on the front of a motor vehicle (or originally a ship or train), designed to illuminate the road when driving at night; normally one of a pair."},{"definition":"(chiefly in the plural) A woman's breast."},{"definition":"(chiefly in the plural) A woman's erect nipples, partially masked by clothing."},{"definition":"(chiefly in the plural) A jewel; especially a diamond."},{"definition":"(chiefly in the plural) Lysergic acid diethylamide (LSD)."}],"partOfSpeech":"n"}]},{"word":"MONOPHONIC","idx":18598,"count":1814578,"meanings":[{"definitions":[{"definition":"(of sound reproduction) having a single channel; monaural (compare stereophonic)"},{"definition":"Having a single melodic line and no harmony (compare polyphonic)"},{"definition":"Having simple one-to-one mapping between letters and phonemes"}],"partOfSpeech":"j"}]},{"word":"LARGO","idx":18599,"count":1814464,"meanings":[{"definitions":[{"definition":"A very slow tempo"},{"definition":"A musical piece or movement in such a tempo"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Strong and stately"}],"partOfSpeech":"j"}]},{"word":"AMAZINGLY","idx":18601,"count":1814293,"meanings":[{"definitions":[{"definition":"In an amazing manner; in a way that causes amazement; wonderfully.","example":"That violin solo was played amazingly."},{"definition":"Difficult to believe; strange but true.","example":"Amazingly, no one was injured in the crash."},{"definition":"To a wonder-inspiring extent.","example":"The car has amazingly low fuel consumption."}],"partOfSpeech":"v"}]},{"word":"PLURAL","idx":18602,"count":1814292,"meanings":[{"definitions":[{"definition":"(grammar) The plural number."},{"definition":"(grammar) A word in the form in which it potentially refers to something other than one person or thing; and other than two things if the language has a dual form."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Consisting of or containing more than one of something."},{"definition":"Pluralistic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"plural-us","text":"/ˈpləɹəl/"}]},{"word":"SWAPPING","idx":18605,"count":1813821,"meanings":[{"definitions":[{"definition":"To exchange or give (something) in an exchange (for something else)."},{"definition":"To hit, to strike."},{"definition":"To beat the air, or ply the wings, with a sweeping motion or noise; to flap."},{"definition":"To descend or fall; to rush hastily or violently."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is swapped; an exchange."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Large; whopping"}],"partOfSpeech":"j"}]},{"word":"SKIPPED","idx":18606,"count":1813764,"meanings":[{"definitions":[{"definition":"To move by hopping on alternate feet.","example":"She will skip from one end of the sidewalk to the other."},{"definition":"To leap about lightly."},{"definition":"To skim, ricochet or bounce over a surface.","example":"The rock will skip across the pond."},{"definition":"To throw (something), making it skim, ricochet, or bounce over a surface.","example":"I bet I can skip this rock to the other side of the pond."},{"definition":"To disregard, miss or omit part of a continuation (some item or stage).","example":"I will read most of the book, but skip the first chapter because the video covered it."},{"definition":"To place an item in a skip."},{"definition":"Not to attend (some event, especially a class or a meeting).","example":"Yeah, I really should go to the quarterly meeting but I think I'm going to skip it."},{"definition":"To leave, especially in a sudden and covert manner.","example":"a customer who skipped town without paying her hotel bill"},{"definition":"To leap lightly over.","example":"to skip the rope"},{"definition":"To jump rope.","example":"The girls were skipping in the playground."},{"definition":"(crocheting) To pass by a stitch as if it were not there, continuing with the next stitch."}],"partOfSpeech":"ve"}]},{"word":"HEREINAFTER","idx":18607,"count":1813712,"meanings":[{"definitions":[{"definition":"In the parts of this document, statement, or book that follow; after this"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈhɪɹɪnˈæftɚ/"},{"text":"/ˈhɪəɹɪnˈɑːftə/"}]},{"word":"EXTRACTING","idx":18609,"count":1813039,"meanings":[{"definitions":[{"definition":"To draw out; to pull out; to remove forcibly from a fixed position, as by traction or suction, etc.","example":"to extract a tooth from its socket, a stump from the earth, or a splinter from the finger"},{"definition":"To withdraw by expression, distillation, or other mechanical or chemical process. Compare abstract (transitive verb).","example":"to extract an essential oil from a plant"},{"definition":"To take by selection; to choose out; to cite or quote, as a passage from a book."},{"definition":"To select parts of a whole","example":"We need to try to extract the positives from the defeat."},{"definition":"To determine (a root of a number).","example":"Please extract the cube root of 27."}],"partOfSpeech":"ve"}]},{"word":"ANALOGOUS","idx":18610,"count":1812873,"meanings":[{"definitions":[{"definition":"Having analogy; corresponding to something else; bearing some resemblance or proportion (often followed by \"to\".)"},{"definition":"Functionally similar, but arising through convergent evolution rather than being homologous."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"analogous-us","text":"/əˈnæl.ə.ɡəs/"}]},{"word":"PARTICULATE","idx":18613,"count":1812618,"meanings":[{"definitions":[{"definition":"(chiefly in plural) Any solid or liquid in a subdivided state, especially one that exhibits special characteristics which are negligible in the bulk material.","example":"Particulates in engine oil can abrade moving parts."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Composed of separate particles.","example":"particulate air pollution"},{"definition":"Pertaining to heritable characteristics which are attributable discretely to either one or another of an offspring's parents, rather than a blend of the two."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɑːˈtɪkjʊleɪt/"},{"text":"/pɑɹˈtɪkjʊlət/"}]},{"word":"TALLY","idx":18614,"count":1812605,"meanings":[{"definitions":[{"definition":"Target sighted.","example":"(Air Traffic Control): Speedbird 123, New York, traffic at two o’clock, seven miles, a Boeing 737, west-bound, at 4000 feet.”"}],"partOfSpeech":"i"},{"definitions":[{"definition":"(by extension) One of two books, sheets of paper, etc., on which corresponding accounts were kept."},{"definition":"(by extension) Any account or score kept by notches or marks, whether on wood or paper, or in a book, especially one kept in duplicate."},{"definition":"One thing made to suit another; a match; a mate."},{"definition":"A notch, mark, or score made on or in a tally; as, to make or earn a score or tally in a game."},{"definition":"A tally shop."},{"definition":"A ribbon on a sailor's cap bearing the name of the ship or the (part of) the navy to which they belong."},{"definition":"A state of cohabitation, living with another individual in an intimate relationship outside of marriage."},{"definition":"A bone, or piece of wood, on which notches or scores are cut, as the marks of number, for account keeping."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To count something."},{"definition":"To record something by making marks."},{"definition":"To make things correspond or agree with each other."},{"definition":"To keep score."},{"definition":"To correspond or agree."},{"definition":"To check off, as parcels of freight going inboard or outboard."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In a tall way; stoutly; with spirit."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"tally-1","text":"/ˈtæli/"}]},{"word":"UNPLEASANT","idx":18615,"count":1812541,"meanings":[{"definitions":[{"definition":"Not pleasant."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unpleasant-us","text":"/ʌnˈplezənt/"}]},{"word":"TEMPTED","idx":18617,"count":1812384,"meanings":[{"definitions":[{"definition":"To provoke someone to do wrong, especially by promising a reward; to entice.","example":"She tempted me to eat the apple."},{"definition":"To attract; to allure.","example":"Its glossy skin tempted me."},{"definition":"To provoke something; to court.","example":"It would be tempting fate."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtɛmptɪd/"}]},{"word":"BLINDNESS","idx":18619,"count":1812018,"meanings":[{"definitions":[{"definition":"The condition of being blind; unable to see."},{"definition":"Want of intellectual or moral discernment; mental darkness; ignorance, heedlessness."},{"definition":"Concealment"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"blindness-us","text":"/ˈblaɪndnəs/"}]},{"word":"CREEP","idx":18620,"count":1811981,"meanings":[{"definitions":[{"definition":"To move slowly with the abdomen close to the ground."},{"definition":"Of plants, to grow across a surface rather than upwards."},{"definition":"To move slowly and quietly in a particular direction."},{"definition":"To make small gradual changes, usually in a particular direction."},{"definition":"To move in a stealthy or secret manner; to move imperceptibly or clandestinely; to steal in; to insinuate itself or oneself."},{"definition":"To slip, or to become slightly displaced."},{"definition":"To move or behave with servility or exaggerated humility; to fawn."},{"definition":"To have a sensation as of insects creeping on the skin of the body; to crawl."},{"definition":"To drag in deep water with creepers, as for recovering a submarine cable."},{"definition":"To covertly have sex (with a person other than one's primary partner); to cheat with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The movement of something that creeps (like worms or snails)"},{"definition":"A relatively small gradual change, variation or deviation (from a planned value) in a measure."},{"definition":"A slight displacement of an object: the slight movement of something"},{"definition":"The gradual expansion or proliferation of something beyond its original goals or boundaries, considered negatively.","example":"christmas creep"},{"definition":"In sewn books, the tendency of pages on the inside of a quire to stand out farther than those on the outside of it."},{"definition":"An increase in strain with time; the gradual flow or deformation of a material under stress."},{"definition":"The imperceptible downslope movement of surface rock."},{"definition":"Someone unpleasantly strange or eccentric."},{"definition":"A frightening and/or disconcerting person, especially one who gives the speaker chills.","example":"Stop following me, you creep!"},{"definition":"A barrier with small openings used to keep large animals out while allowing smaller animals to pass through."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"creep-us","text":"/kɹiːp/"}]},{"word":"STAINING","idx":18621,"count":1811623,"meanings":[{"definitions":[{"definition":"To discolour.","example":"armour stained with blood"},{"definition":"To taint or tarnish someone's character or reputation"},{"definition":"To coat a surface with a stain","example":"the stained glass used for church windows"},{"definition":"To become stained; to take a stain."},{"definition":"To treat (a microscopic specimen) with a dye, especially one that dyes specific features"},{"definition":"To cause to seem inferior or soiled by comparison."}],"partOfSpeech":"ve"}]},{"word":"SHADED","idx":18624,"count":1811288,"meanings":[{"definitions":[{"definition":"To shield from light.","example":"The old oak tree shaded the lawn in the heat of the day."},{"definition":"To alter slightly.","example":"Most politicians will shade the truth if it helps them."},{"definition":"To vary or approach something slightly, particularly in color.","example":"The hillside was bright green, shading towards gold in the drier areas."},{"definition":"(of a defensive player) To move slightly from one's normal fielding position.","example":"Jones will shade a little to the right on this pitch count."},{"definition":"To darken, particularly in drawing.","example":"I draw contours first, gradually shading in midtones and shadows."},{"definition":"To surpass by a narrow margin.","example":"Both parties claimed afterwards that their man did best in the debate, but an early opinion poll suggested Mr Cameron shaded it."},{"definition":"To reduce (a window) so that only its title bar is visible."},{"definition":"To shelter; to cover from injury; to protect; to screen."},{"definition":"To present a shadow or image of; to shadow forth; to represent."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Being in the shade, not in direct light."},{"definition":"Having a slight colour added (of a diagram or picture) or being slightly darkened as if in the shade."}],"partOfSpeech":"j"}]},{"word":"COT","idx":18625,"count":1811236,"meanings":[{"definitions":[{"definition":"A simple bed, especially one for portable or temporary purposes."},{"definition":"A bed for infants or small children, with high, often slatted, often moveable sides."},{"definition":"A wooden bed frame, slung by its corners from a beam, in which officers slept before the introduction of bunks."},{"definition":"A cottage or small homestead."},{"definition":"A pen, coop, or similar shelter for small domestic animals, such as sheep or pigeons."},{"definition":"A small, crudely-formed boat."},{"definition":"A cover or sheath; a fingerstall.","example":"a cot for a sore finger"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cot-us","text":"/kɑt/"}]},{"word":"PLASTER","idx":18626,"count":1811197,"meanings":[{"definitions":[{"definition":"A paste applied to the skin for healing or cosmetic purposes."},{"definition":"A small adhesive bandage to cover a minor wound; a sticking plaster."},{"definition":"A mixture of lime or gypsum, sand, and water, sometimes with the addition of fibres, that hardens to a smooth solid and is used for coating walls and ceilings; render, stucco."},{"definition":"A cast made of plaster of Paris and gauze; plaster cast."},{"definition":"Plaster of Paris."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or coat something with plaster; to render.","example":"to plaster a wall"},{"definition":"To apply a plaster to.","example":"to plaster a wound"},{"definition":"To smear with some viscous or liquid substance.","example":"Her face was plastered with mud."},{"definition":"To hide or cover up, as if with plaster; to cover thickly.","example":"The radio station plastered the buses and trains with its advertisement."},{"definition":"To smooth over."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plaster-us","text":"/ˈplæstɚ/"}]},{"word":"NEGOTIABLE","idx":18628,"count":1810941,"meanings":[{"definitions":[{"definition":"Something that is open to negotiation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of an obstacle, route etc) Able to be traversed; navigable."},{"definition":"Able to be transferred to another person, with or without endorsement, in exchange for money."},{"definition":"Open to negotiation or bargaining.","example":"Salary is negotiable, according to education and experience."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/nɪˈɡoʊʃi.əbəl/"},{"text":"/nɪˈɡəʊʃi.əbəl/"}]},{"word":"SUBCATEGORIES","idx":18629,"count":1810920,"meanings":[{"definitions":[{"definition":"With respect to a given category, a more narrow category."},{"definition":"A subclass of a category which is itself a category, whose arrows are a restriction of the arrows of the parent category, and whose composition rule is a restriction of the parent category's"}],"partOfSpeech":"n"}]},{"word":"HEARTED","idx":18630,"count":1810871,"meanings":[{"definitions":[{"definition":"To be fond of. Often bracketed or abbreviated with a heart symbol.","example":"2008 July 25, \"The Media Hearts Obama?\", On The Media, National Public Radio"},{"definition":"To give heart to; to hearten; to encourage."},{"definition":"To fill an interior with rubble, as a wall or a breakwater."},{"definition":"To form a dense cluster of leaves, a heart, especially of lettuce or cabbage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in combination) Having, or shaped like, a specified form of heart.","example":"a hard-hearted woman"},{"definition":"Seated or fixed in the heart."}],"partOfSpeech":"j"}]},{"word":"QUARTERBACK","idx":18631,"count":1810794,"meanings":[{"definitions":[{"definition":"An offensive back whose primary job is to pass the ball in a play."},{"definition":"An offensive back who receives the snap (hike) and then blocks the defense from crossing the line of scrimmage; a blocking back."},{"definition":"(rugby football) A position just behind the forwards, or one who plays this position."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play the position of quarterback."},{"definition":"(by extension) To lead a team or group; to be primarily responsible for some group project or activity."}],"partOfSpeech":"ve"}]},{"word":"OBSTRUCTION","idx":18632,"count":1810593,"meanings":[{"definitions":[{"definition":"The act of obstructing, or state of being obstructed."},{"definition":"Something which obstructs or impedes, either intentionally or unintentionally"},{"definition":"The condition of having the natural powers obstructed in their usual course; the arrest of the vital functions; death."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əbˈstɹʌk.ʃən/"}]},{"word":"AGILITY","idx":18633,"count":1810572,"meanings":[{"definitions":[{"definition":"The quality of being agile; the power of moving the limbs quickly and easily; quickness of motion","example":"His superior agility countered his lack of strength."},{"definition":"A faculty of being agile in body, mind, or figuratively."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈdʒɪl.ə.ti/"}]},{"word":"COMPLYING","idx":18634,"count":1810426,"meanings":[{"definitions":[{"definition":"To yield assent; to accord; to acquiesce, agree, consent; to adapt oneself, to conform."},{"definition":"To accomplish, to fulfil."},{"definition":"To be ceremoniously courteous; to make one's compliments."},{"definition":"To enfold; to embrace."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"complying-us","text":"/kəmˈplaɪɪŋ/"}]},{"word":"OVERTURE","idx":18637,"count":1809751,"meanings":[{"definitions":[{"definition":"An opening; a recess or chamber."},{"definition":"Disclosure; discovery; revelation."},{"definition":"(often in plural) An approach or proposal made to initiate communication, establish a relationship etc."},{"definition":"A motion placed before a legislative body, such as the General Assembly of the Church of Scotland."},{"definition":"A musical introduction to a piece of music."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make overtures; to approach with a proposal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"overture-uk","text":"/ˈəʊvətjʊə/"}]},{"word":"NEWCOMERS","idx":18638,"count":1809712,"meanings":[{"definitions":[{"definition":"One who has recently come to a community; a recent arrival."},{"definition":"A new participant in some activity; a neophyte."}],"partOfSpeech":"n"}]},{"word":"HECTARES","idx":18639,"count":1809579,"meanings":[{"definitions":[{"definition":"A unit of surface area (symbol ha) equal to 100 ares (that is, 10,000 square metres, one hundredth of a square kilometre, or approximately 2.5 acres), used for measuring the areas of geographical features such as land and bodies of water."}],"partOfSpeech":"n"}]},{"word":"UPSCALE","idx":18640,"count":1809380,"meanings":[{"definitions":[{"definition":"To increase in size, to scale up."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Marked by wealth or quality; high-class; upmarket.","example":"2002 \"This strategy [of rotating the garage with respect to the street] has become popular in many upscale housing developments nationwide primarily becaues it de-emphasizes the garage and makes the house look more like their traditional counterparts from the turn of the last century.\" — Sarah Susanka, Not So Big Solutions for Your Home"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"upscale-us"}]},{"word":"SCRABBLE","idx":18641,"count":1809087,"meanings":[{"definitions":[{"definition":"A scramble.","example":"a scrabble for dear life"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To scrape or scratch powerfully with hands or claws."},{"definition":"To gather hastily."},{"definition":"To move with difficulty by making rapid movements back and forth with the hands or paws.","example":"She was on her hands and knees scrabbling in the mud, looking for her missing wedding ring."},{"definition":"To scribble."},{"definition":"To mark with irregular lines or letters; to scribble on.","example":"to scrabble paper"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scrabble-us","text":"/ˈskɹæbəl/"}]},{"word":"NOTEWORTHY","idx":18642,"count":1809005,"meanings":[{"definitions":[{"definition":"A noteworthy person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Deserving attention; notable; worthy of notice.","example":"Zukertort represent the other most noteworthy tournaments."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈnoʊtˌwɝði/"},{"text":"/ˈnəʊtˌwɜːði/"}]},{"word":"AGILE","idx":18643,"count":1808955,"meanings":[{"definitions":[{"definition":"Having the faculty of quick motion in the limbs; apt or ready to move","example":"an agile creature"},{"definition":"Characterised by quick motion","example":"agile movements"},{"definition":"Of or relating to agile software development, a technique for iterative and incremental development of software involving collaboration between teams.","example":"agile methods"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"agile-us","text":"/ˈæd͡ʒ.aɪl/"}]},{"word":"SACKS","idx":18646,"count":1808394,"meanings":[{"definitions":[{"definition":"A bag or pouch inside a plant or animal that typically contains a fluid."},{"definition":"(games) A sacrifice.","example":"Kasparov's queen sac early in the game gained him a positional advantage against Kramnik."},{"definition":"The privilege, formerly enjoyed by the lord of a manor, of holding courts, trying causes, and imposing fines."},{"definition":"A bag; especially a large bag of strong, coarse material for storage and handling of various commodities, such as potatoes, coal, coffee; or, a bag with handles used at a supermarket, a grocery sack; or, a small bag for small items, a satchel."},{"definition":"The amount a sack holds; also, an archaic or historical measure of varying capacity, depending on commodity type and according to local usage; an old English measure of weight, usually of wool, equal to 13 stone (182 pounds), or in other sources, 26 stone (364 pounds).","example":"The American sack of salt is 215 pounds; the sack of wheat, two bushels. — McElrath."},{"definition":"The plunder and pillaging of a captured town or city.","example":"The sack of Rome."},{"definition":"Loot or booty obtained by pillage."},{"definition":"A successful tackle of the quarterback behind the line of scrimmage. See verb sense4 below."},{"definition":"One of the square bases anchored at first base, second base, or third base.","example":"He twisted his ankle sliding into the sack at second."},{"definition":"Dismissal from employment, or discharge from a position, usually as give (someone) the sack or get the sack. See verb sense5 below.","example":"He got the sack for being late all the time."},{"definition":"Bed; usually as hit the sack or in the sack. See also sack out."},{"definition":"(also sacque) A kind of loose-fitting gown or dress with sleeves which hangs from the shoulders, such as a gown with a Watteau back or sack-back, fashionable in the late 17th to 18th century; or, formerly, a loose-fitting hip-length jacket, cloak or cape."},{"definition":"A sack coat; a kind of coat worn by men, and extending from top to bottom without a cross seam."},{"definition":"The scrotum.","example":"He got passed the ball, but it hit him in the sack."},{"definition":"A variety of light-colored dry wine from Spain or the Canary Islands; also, any strong white wine from southern Europe; sherry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(games) To sacrifice.","example":"I kept saccing monsters at the altar until I was rewarded with a new weapon."},{"definition":"To put in a sack or sacks.","example":"Help me sack the groceries."},{"definition":"To bear or carry in a sack upon the back or the shoulders."},{"definition":"To plunder or pillage, especially after capture; to obtain spoils of war from.","example":"The barbarians sacked Rome."},{"definition":"To tackle the quarterback behind the line of scrimmage, especially before he is able to throw a pass."},{"definition":"To discharge from a job or position; to fire.","example":"He was sacked last September."},{"definition":"In the phrase sack out, to fall asleep. See also hit the sack.","example":"The kids all sacked out before 9:00 on New Year’s Eve."}],"partOfSpeech":"ve"}]},{"word":"KIOSK","idx":18648,"count":1808146,"meanings":[{"definitions":[{"definition":"A small enclosed structure, often freestanding, open on one side or with a window, used as a booth to sell newspapers, cigarettes, etc."},{"definition":"A similar unattended stand for the automatic dispensing of tickets, etc."},{"definition":"A public telephone booth."},{"definition":"A Turkish garden pavilion."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"kiosk-us","text":"/ˈkiˌɑsk/"}]},{"word":"IONIC","idx":18649,"count":1808092,"meanings":[{"definitions":[{"definition":"Of, relating to, or containing ions"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/aɪˈɒnɪk/"}]},{"word":"STRAY","idx":18650,"count":1807545,"meanings":[{"definitions":[{"definition":"Any domestic animal that has no enclosure, or its proper place and company, and wanders at large, or is lost; an estray."},{"definition":"One who is lost, either literally or metaphorically."},{"definition":"The act of wandering or going astray."},{"definition":"An area of common land or place administered for the use of general domestic animals, i.e. \"the stray\""}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wander, as from a direct course; to deviate, or go out of the way."},{"definition":"To wander from one's limits; to rove or roam at large; to go astray."},{"definition":"To wander from the path of duty or rectitude; to err."},{"definition":"To cause to stray."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having gone astray; strayed; wandering","example":"The alley is full of stray cats rummaging through the garbage."},{"definition":"In the wrong place; misplaced.","example":"a stray comma"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stray-us","text":"/stɹeɪ/"}]},{"word":"RUNAWAY","idx":18651,"count":1807276,"meanings":[{"definitions":[{"definition":"A person or animal that runs away or has run away; a person, animal, or organization that escapes captivity or restrictions.","example":"Runaway children are vulnerable to criminal exploitation."},{"definition":"A vehicle (especially, a train) that is out of control."},{"definition":"(usually attributive) An object or process that is out of control or out of equilibrium."},{"definition":"The act of running away, especially of a horse or teams."},{"definition":"An overwhelming victory.","example":"The home side won in a runaway."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having run away; escaped; fugitive","example":"a runaway thief"},{"definition":"Easily won, as a contest","example":"a runaway victory at the polls"},{"definition":"Unchecked; rampant","example":"runaway prices"},{"definition":"Deserting or revolting against one's group, duties, expected conduct, or the like, especially to establish or join a rival group, change one's life drastically, etc.","example":"The runaway delegates nominated their own candidate."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"runaway-uk","text":"/ˈɹʌnəweɪ/"}]},{"word":"SLOWING","idx":18652,"count":1807065,"meanings":[{"definitions":[{"definition":"To make (something) run, move, etc. less quickly; to reduce the speed of."},{"definition":"To keep from going quickly; to hinder the progress of."},{"definition":"To become slow; to slacken in speed; to decelerate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A deceleration; a slowing down."}],"partOfSpeech":"n"}]},{"word":"HOODIE","idx":18654,"count":1806748,"meanings":[{"definitions":[{"definition":"A sweatshirt, with an integral hood and, sometimes, a large kangaroo pocket at the front.","example":"You can buy hoodies on the cheap in summer."},{"definition":"(often with negative connotation of yobbishness) A young person wearing such a sweatshirt, usually a male.","example":"The wolf was accused of attacking a young girl, but it pleaded that it was simply motivated by the Prime Minister's speech to hug a hoodie."},{"definition":"Foreskin"},{"definition":"Hooded crow, Corvus cornix"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hoodie-au","text":"/ˈhʊdi/"}]},{"word":"HOODIA","idx":18655,"count":1806153,"meanings":[{"definitions":[{"definition":"Any of the genus Hoodia of succulent cactiform plants."}],"partOfSpeech":"n"}]},{"word":"PAYOUT","idx":18656,"count":1806070,"meanings":[{"definitions":[{"definition":"An amount of money paid out."},{"definition":"The value of dividends paid to shareholders."}],"partOfSpeech":"n"}]},{"word":"CLINICALLY","idx":18657,"count":1805895,"meanings":[{"definitions":[{"definition":"In a clinical manner; dispassionately or analytically."},{"definition":"In the setting of a medical clinic; in a clinical setting.","example":"Clinically, some signs of disease are less apparent than they would be in the normal home or work environment."},{"definition":"At a person's bedside.","example":"a person baptised clinically"}],"partOfSpeech":"v"}]},{"word":"WATCHERS","idx":18658,"count":1805728,"meanings":[{"definitions":[{"definition":"Someone who watches or observes."},{"definition":"Someone who keeps vigil."},{"definition":"A guard."}],"partOfSpeech":"n"}]},{"word":"SUPPLEMENTED","idx":18659,"count":1805290,"meanings":[{"definitions":[{"definition":"To provide or make a supplement to something."}],"partOfSpeech":"ve"}]},{"word":"POPPY","idx":18660,"count":1805254,"meanings":[{"definitions":[{"definition":"Any plant of the genus Papaver or the family Papaveraceae, with crumpled, often red, petals and a milky juice having narcotic properties; especially the common poppy or corn poppy (Papaver rhoeas) which has orange-red flowers; the flower of such a plant."},{"definition":"A bright red colour tinted with orange, like that of the common poppy flower."},{"definition":"A simple artificial poppy flower worn in a buttonhole or displayed in other contexts to remember those who died in the two World Wars and other armed conflicts, especially around Remembrance Sunday."},{"definition":"One's father or grandfather, or a male authority figure having similar standing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a bright red colour tinted with orange, like that of the common poppy flower (Papaver rhoeas)."},{"definition":"Having a popping or bursting sound."},{"definition":"Of a beverage: resembling soda pop; effervescent, fizzy."},{"definition":"Of eyes: protruding, sticking out."},{"definition":"Popular."},{"definition":"Typical, or in the style, of pop music."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"poppy-us","text":"/ˈpɑpi/"}]},{"word":"OBLIGATED","idx":18663,"count":1805015,"meanings":[{"definitions":[{"definition":"To bind, compel, constrain, or oblige by a social, legal, or moral tie."},{"definition":"To cause to be grateful or indebted; to oblige."},{"definition":"To commit (money, for example) in order to fulfill an obligation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Committed"},{"definition":"Having an obligation; obliged"}],"partOfSpeech":"j"}]},{"word":"FRENZY","idx":18664,"count":1804848,"meanings":[{"definitions":[{"definition":"A state of wild activity or panic.","example":"She went into a cleaning frenzy to prepare for the unexpected guests."},{"definition":"A violent agitation of the mind approaching madness; rage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To render frantic."},{"definition":"To exhibit a frenzy, such as a feeding frenzy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Mad; frantic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"frenzy-us","text":"/ˈfɹɛnzi/"}]},{"word":"DECODING","idx":18665,"count":1804831,"meanings":[{"definitions":[{"definition":"To convert from an encrypted form to plain text."},{"definition":"To figure out something difficult to interpret."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An instance of the translation of something into a form more suitable for subsequent processing."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈkəʊdɪŋ(ɡ)/"}]},{"word":"JARGON","idx":18666,"count":1804602,"meanings":[{"definitions":[{"definition":"A technical terminology unique to a particular subject."},{"definition":"Language characteristic of a particular group."},{"definition":"Speech or language that is incomprehensible or unintelligible; gibberish."},{"definition":"A variety of zircon."},{"definition":"A fake ring or other jewellery sold as genuine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To utter jargon; to emit confused or unintelligible sounds."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jargon-us","text":"/ˈdʒɑɹ.ɡən/"}]},{"word":"KANGAROO","idx":18667,"count":1804285,"meanings":[{"definitions":[{"definition":"A member of the Macropodidae family of large marsupials with strong hind legs for hopping, native to Australia."},{"definition":"A hooded jacket with a front pocket, usually of fleece material, a kangaroo jacket."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To practice kangaroo care on an infant; to hold a premature infant against the skin."},{"definition":"To hunt kangaroo."},{"definition":"To move like a kangaroo"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to Australia."},{"definition":"(investments) Characterized by rapidly jumping prices in securities markets or by belief that the prices are unstable in contrast to bear and bull markets."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"kangaroo-us","text":"/kaŋ.ɡə.ˈɹuː/"}]},{"word":"SLEEPER","idx":18668,"count":1804207,"meanings":[{"definitions":[{"definition":"Someone who sleeps.","example":"I'm a light sleeper: I get woken up by the smallest of sounds."},{"definition":"That which lies dormant, as a law."},{"definition":"A spy, saboteur, or terrorist who lives unobtrusively in a community until activated by a prearranged signal; may be part of a sleeper cell."},{"definition":"A small starter earring, worn to prevent a piercing from closing."},{"definition":"A railway sleeping car.","example":"We spent a night on an uncomfortable sleeper between Athens and Vienna."},{"definition":"A sleeper hold."},{"definition":"Something that achieves unexpected success after an interval of time.","example":"A box-office bomb when it first came out, the film was a sleeper, becoming much more popular decades after being released."},{"definition":"A goby-like bottom-feeding freshwater fish of the family Odontobutidae."},{"definition":"A nurse shark (family Ginglymostomatidae)."},{"definition":"A type of pajama for a person, especially a child, that covers the whole body, including the feet.","example":"Aaron, Devin, and Laura looked so comfy in their sleepers."},{"definition":"An automobile which has been internally modified to excess, while retaining a mostly stock appearance in order to fool opponents in a drag race, or to avoid the attention of the police."},{"definition":"A sedative."},{"definition":"A railroad tie."},{"definition":"A structural beam in a floor running perpendicular to both the joists beneath and floorboards above."},{"definition":"A heavy floor timber in a ship's bottom."},{"definition":"The lowest, or bottom, tier of casks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark a calf by cutting its ear."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sleeper-au"}]},{"word":"ELEMENTAL","idx":18669,"count":1804206,"meanings":[{"definitions":[{"definition":"(theosophy) A creature (usually a spirit) that is attuned with, or composed of, one of the classical elements: air, earth, fire and water or variations of them like ice, lightning, etc. They sometimes have unique proper names and sometimes are referred to as Air, Earth, Fire, or Water."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or being an element (as opposed to a compound)."},{"definition":"Basic, fundamental or elementary."},{"definition":"Of the ancient supposed elements of earth, air, fire and water."},{"definition":"(by extension) Of, or relating to a force or nature, especially to severe atmospheric conditions."}],"partOfSpeech":"j"}]},{"word":"PRESENTERS","idx":18670,"count":1804092,"meanings":[{"definitions":[{"definition":"Someone who presents a broadcast programme; a compere or master of ceremonies."},{"definition":"Someone who presents a thing or person to someone else."},{"definition":"A small handheld device used to remotely control a computerised slide show."},{"definition":"A conceptual layer in GUI-based software that assumes the functionality of the \"middle-man\"."}],"partOfSpeech":"n"}]},{"word":"TEAL","idx":18671,"count":1803669,"meanings":[{"definitions":[{"definition":"Any of various small freshwater ducks of the genus Anas that are brightly coloured and have short necks."},{"definition":"A dark, somewhat bluish-green colour; a dark cyan."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a bluish-green colour"}],"partOfSpeech":"j"}]},{"word":"UNNAMED","idx":18672,"count":1803582,"meanings":[{"definitions":[{"definition":"Not having a name."}],"partOfSpeech":"j"}]},{"word":"PARTICULARS","idx":18675,"count":1803128,"meanings":[{"definitions":[{"definition":"A small individual part of something larger; a detail, a point."},{"definition":"A person's own individual case."},{"definition":"(chiefly in plural) A particular case; an individual thing as opposed to a whole class. (Opposed to generals, universals.)"},{"definition":"The details or specifics of something.","example":"The overall plan is well understood, but we still have to work out the particulars."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pəˈtɪkjəlɚz/"}]},{"word":"JERKING","idx":18676,"count":1802926,"meanings":[{"definitions":[{"definition":"To make a sudden uncontrolled movement."},{"definition":"To give a quick, often unpleasant tug or shake."},{"definition":"To masturbate."},{"definition":"To beat, to hit."},{"definition":"To throw with a quick and suddenly arrested motion of the hand.","example":"to jerk a stone"},{"definition":"(usually transitive) To lift using a jerk."},{"definition":"To flout with contempt."},{"definition":"To cure (meat) by cutting it into strips and drying it, originally in the sun."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A motion that jerks; a jerk."}],"partOfSpeech":"n"}]},{"word":"BUNGALOW","idx":18679,"count":1802670,"meanings":[{"definitions":[{"definition":"A single-storey house, typically with rooms all on one level, or sometimes also with upper rooms set into the roof space.","example":"My aunt can't manage the stairs any more, so she's moving to a bungalow."},{"definition":"A thatched or tiled one-story house in India surrounded by a wide verandah"}],"partOfSpeech":"n"}]},{"word":"BAZAAR","idx":18681,"count":1802544,"meanings":[{"definitions":[{"definition":"A marketplace, particularly in the Middle East and South Asia, and often covered with shops and stalls."},{"definition":"A shop selling articles that are either exotic or eclectic."},{"definition":"A fair or temporary market, often for charity."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bazaar-us","text":"/bəˈzɑɹ/"}]},{"word":"INTERCONNECT","idx":18683,"count":1802363,"meanings":[{"definitions":[{"definition":"To connect to one another.","example":"The Internet interconnects a set of networks."}],"partOfSpeech":"ve"}]},{"word":"PREDICATE","idx":18684,"count":1802317,"meanings":[{"definitions":[{"definition":"(grammar) The part of the sentence (or clause) which states something about the subject or the object of the sentence.","example":"In \"The dog barked very loudly\", the subject is \"the dog\" and the predicate is \"barked very loudly\"."},{"definition":"A term of a statement, where the statement may be true or false depending on whether the thing referred to by the values of the statement's variables has the property signified by that (predicative) term.","example":"A nullary predicate is a proposition."},{"definition":"An operator or function that returns either true or false."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(grammar) Of or related to the predicate of a sentence or clause."},{"definition":"Predicated, stated."},{"definition":"Relating to or being any of a series of criminal acts upon which prosecution for racketeering may be predicated."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To announce, assert, or proclaim publicly."},{"definition":"To assume or suppose; to infer."},{"definition":"(originally United States) to base (on); to assert on the grounds of."},{"definition":"(grammar) To make a term (or expression) the predicate of a statement."},{"definition":"To assert or state as an attribute or quality of something."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"predicate-1-uk","text":"/ˈpɹɛdɪkət/"}]},{"word":"RECURRENCE","idx":18685,"count":1802249,"meanings":[{"definitions":[{"definition":"Return or reversion to a certain state."},{"definition":"The instance of recurring; frequent occurrence."},{"definition":"A return of symptoms as part of the natural progress of a disease."},{"definition":"Recourse."}],"partOfSpeech":"n"}]},{"word":"MINDLESS","idx":18687,"count":1802081,"meanings":[{"definitions":[{"definition":"Showing a lack of forethought or sense."},{"definition":"Having no sensible meaning or purpose.","example":"An act of mindless violence."},{"definition":"Heedless."},{"definition":"(of a thing done) Overly repetitive and unchallenging."},{"definition":"Lacking a mind.","example":"Atheism alleges that mindless scientific forces control the universe."}],"partOfSpeech":"j"}]},{"word":"RECRUITS","idx":18689,"count":1801916,"meanings":[{"definitions":[{"definition":"A supply of anything wasted or exhausted; a reinforcement."},{"definition":"A person enlisted for service in the army; a newly enlisted soldier."},{"definition":"A hired worker","example":"These new recruits were hired after passing the interviews"},{"definition":"A new member of a certain population, usually a juvenile."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enroll or enlist new members or potential employees on behalf of an employer, organization, sports team, the military, etc.","example":"We need to recruit more admin staff to deal with the massive surge in popularity of our products"},{"definition":"To supply with new men, as an army; to fill up or make up by enlistment; also, to muster","example":"the army was recruited for a campaign"},{"definition":"To replenish, renew, or reinvigorate by fresh supplies; to remedy a lack or deficiency in."},{"definition":"To recuperate; to gain health, flesh, spirits, or the like.","example":"Go to the country to recruit."},{"definition":"To prompt a protein, leucocyte. etc. to intervene in a given region of the body."}],"partOfSpeech":"ve"}]},{"word":"SHARPER","idx":18690,"count":1801890,"meanings":[{"definitions":[{"definition":"Terminating in a point or edge, especially one that can cut easily; not obtuse or rounded.","example":"A face with sharp features"},{"definition":"Intelligent.","example":"My nephew is a sharp lad; he can count to 100 in six languages, and he's only five years old."},{"definition":"Higher than usual by one semitone (denoted by the symbol ♯ after the name of the note)."},{"definition":"Higher in pitch than required.","example":"The orchestra's third violin several times was sharp about an eighth of a tone."},{"definition":"Having an intense, acrid flavour.","example":"Milly couldn't stand sharp cheeses when she was pregnant, because they made her nauseated."},{"definition":"Sudden and intense.","example":"A pregnant woman during labor normally experiences a number of sharp contractions."},{"definition":"Illegal or dishonest.","example":"Michael had a number of sharp ventures that he kept off the books."},{"definition":"Keenly or unduly attentive to one's own interests; shrewd.","example":"a sharp dealer;  a sharp customer"},{"definition":"Exact, precise, accurate; keen.","example":"You'll need sharp aim to make that shot."},{"definition":"Offensive, critical, or acrimonious.","example":"When the two rivals met, first there were sharp words, and then a fight broke out."},{"definition":"Stylish or attractive.","example":"You look so sharp in that tuxedo!"},{"definition":"Observant; alert; acute.","example":"Keep a sharp watch on the prisoners. I don't want them to escape!"},{"definition":"Forming a small angle; especially, forming an angle of less than ninety degrees.","example":"Drive down Main for three quarters of a mile, then make a sharp right turn onto Pine."},{"definition":"Steep; precipitous; abrupt.","example":"a sharp ascent or descent; a sharp turn or curve"},{"definition":"(of a statement) Said of as extreme a value as possible.","example":"Sure, any planar graph can be five-colored. But that result is not sharp: in fact, any planar graph can be four-colored. That is sharp: the same can't be said for any lower number."},{"definition":"Tactical; risky."},{"definition":"Piercing; keen; severe; painful.","example":"a sharp pain; the sharp and frosty winter air"},{"definition":"Eager or keen in pursuit; impatient for gratification.","example":"a sharp appetite"},{"definition":"Fierce; ardent; fiery; violent; impetuous."},{"definition":"Composed of hard, angular grains; gritty."},{"definition":"Uttered in a whisper, or with the breath alone; aspirated; unvoiced."},{"definition":"Hungry."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A swindler; a cheat; a professional gambler who makes his living by cheating."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʃɑɹpɚ/"}]},{"word":"TABLESPOONS","idx":18692,"count":1801389,"meanings":[{"definitions":[{"definition":"A large spoon, used for eating food from a bowl."},{"definition":"A spoon too large for eating, usually used for cooking or serving."},{"definition":"A unit of volume, the value of which varies regionally; in the US: three teaspoons or roughly 15 ml; in Britain and Canada: exactly 15 ml; in Australia: four teaspoons or 20 ml."}],"partOfSpeech":"n"}]},{"word":"GREEDY","idx":18693,"count":1801104,"meanings":[{"definitions":[{"definition":"Having greed; consumed by selfish desires."},{"definition":"Prone to overeat."},{"definition":"Tending to match as much text as possible.","example":"This regular expression performs a greedy match."},{"definition":"(of an algorithm) That tries to find the global optimum by finding the local optimum at each stage."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɹiːdi/"}]},{"word":"SUPERVISE","idx":18696,"count":1799608,"meanings":[{"definitions":[{"definition":"To oversee or direct a task or organization.","example":"Without someone to supervise them, the group will lack direction."},{"definition":"To look over so as to read; to peruse."}],"partOfSpeech":"ve"}]},{"word":"TERMED","idx":18697,"count":1798864,"meanings":[{"definitions":[{"definition":"To phrase a certain way; to name or call."},{"definition":"To terminate one's employment"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɝmd/"},{"text":"/tɜːmd/"}]},{"word":"STAMPING","idx":18700,"count":1798269,"meanings":[{"definitions":[{"definition":"To step quickly and heavily, once or repeatedly.","example":"The toddler screamed and stamped, but still got no candy."},{"definition":"To move (the foot or feet) quickly and heavily, once or repeatedly.","example":"The crowd cheered and stamped their feet in appreciation."},{"definition":"To strike, beat, or press forcibly with the bottom of the foot, or by thrusting the foot downward."},{"definition":"To mark by pressing quickly and heavily.","example":"This machine stamps the design into the metal cover."},{"definition":"To give an official marking to, generally by impressing or imprinting a design or symbol.","example":"The immigration officer stamped my passport."},{"definition":"To apply postage stamps to.","example":"I forgot to stamp this letter."},{"definition":"To mark; to impress."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The sound or action of one who stamps."},{"definition":"A method of manufacturing using dies and extreme pressure."},{"definition":"A part made by such a method."}],"partOfSpeech":"n"}]},{"word":"COOLEST","idx":18701,"count":1798263,"meanings":[{"definitions":[{"definition":"Having a slightly low temperature; mildly or pleasantly cold."},{"definition":"Allowing or suggesting heat relief.","example":"Linen has made cool and breathable clothing for millennia."},{"definition":"Of a color, in the range of violet to green.","example":"If you have a reddish complexion, you should mainly wear cool colors."},{"definition":"Of a person, not showing emotion; calm and in control of oneself."},{"definition":"Unenthusiastic, lukewarm, skeptical.","example":"His proposals had a cool reception."},{"definition":"Calmly audacious.","example":"In control as always, he came up with a cool plan."},{"definition":"Applied facetiously to a sum of money, commonly as if to give emphasis to the largeness of the amount."},{"definition":"Of a person, knowing what to do and how to behave; considered popular by others."},{"definition":"In fashion, part of or fitting the in crowd; originally hipster slang."},{"definition":"Of an action, all right; acceptable; that does not present a problem.","example":"Is it cool if I sleep here tonight?"},{"definition":"Of a person, not upset by circumstances that might ordinarily be upsetting.","example":"I'm completely cool with my girlfriend leaving me."},{"definition":"Quietly impudent, defiant, or selfish; deliberately presuming: said of persons and acts."}],"partOfSpeech":"j"}]},{"word":"DOWNING","idx":18704,"count":1797688,"meanings":[{"definitions":[{"definition":"To knock (someone or something) down; to cause to come down, to fell.","example":"A single rifle shot downed the mighty beast."},{"definition":"To lower; to put (something) down.","example":"The bell rang for lunch, and the workers downed their tools."},{"definition":"To defeat; to overpower."},{"definition":"To disparage, to put down."},{"definition":"To go or come down; to descend."},{"definition":"To drink or swallow, especially without stopping before the vessel containing the liquid is empty.","example":"He downed an ale and ordered another."},{"definition":"To render (the ball) dead, typically by touching the ground while in possession.","example":"He downed it at the seven-yard line."},{"definition":"(pocket billiards) To sink (a ball) into a hole or pocket.","example":"He downed two balls on the break."},{"definition":"To cover, ornament, line, or stuff with down."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An occasion on which something is downed."},{"definition":"A defeat."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdaʊnɪŋ/"}]},{"word":"BASQUE","idx":18707,"count":1797455,"meanings":[{"definitions":[{"definition":"The part of a waistcoat etc. extending below the waist."},{"definition":"A woman's close-fitting bodice, underbodice, or corset having such a feature."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bæsk/"}]},{"word":"SOCIETAL","idx":18708,"count":1797259,"meanings":[{"definitions":[{"definition":"Of or pertaining to society or social groups, or to their activities, customs, etc."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/səˈsaɪətl/"}]},{"word":"IRE","idx":18710,"count":1797064,"meanings":[{"definitions":[{"definition":"Iron."},{"definition":"Great anger; wrath; keen resentment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To anger; to fret; to irritate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ire-us","text":"/aɪɹ/"}]},{"word":"HALOGEN","idx":18711,"count":1797038,"meanings":[{"definitions":[{"definition":"Any element of group 17, i.e. fluorine, chlorine, bromine, iodine and astatine, which form a salt by direct union with a metal."},{"definition":"A light fixture in which the filament is surrounded by an atmosphere of a halogen gas,"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhæ.lə.d͡ʒən/"},{"text":"/ˈheɪ.lə.d͡ʒən/"}]},{"word":"SILHOUETTE","idx":18713,"count":1796610,"meanings":[{"definitions":[{"definition":"An illustrated outline filled in with a solid color(s), usually only black, and intended to represent the shape of an object without revealing any other visual details; a similar appearance produced when the object being viewed is situated in relative darkness with brighter lighting behind it; a profile portrait in black, such as a shadow appears to be.","example":"I could see a silhouette of a figure looking out from the window, but I couldn't tell if it was a man or a woman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To represent by a silhouette; to project upon a background, so as to be like a silhouette."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"silhouette-us","text":"/ˌsɪ.luːˈwɛt/"}]},{"word":"DORADO","idx":18717,"count":1796206,"meanings":[{"definitions":[{"definition":"Coryphaena hippurus, the mahi-mahi or dolphin, a species of fish with a dorsal fin that runs the length of the body, also known for iridescent coloration."}],"partOfSpeech":"n"}]},{"word":"DARING","idx":18718,"count":1796196,"meanings":[{"definitions":[{"definition":"To have enough courage (to do something).","example":"I wouldn't dare argue with my boss."},{"definition":"To defy or challenge (someone to do something)","example":"I dare you (to) kiss that girl."},{"definition":"To have enough courage to meet or do something, go somewhere, etc.; to face up to","example":"Will you dare death to reach your goal?"},{"definition":"To terrify; to daunt."},{"definition":"To catch (larks) by producing terror through the use of mirrors, scarlet cloth, a hawk, etc., so that they lie still till a net is thrown over them."},{"definition":"To stare stupidly or vacantly; to gaze as though amazed or terrified."},{"definition":"To lie or crouch down in fear."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Boldness."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Adventurous, willing to take on or look for risks; overbold."},{"definition":"Courageous or showing bravery; doughty."},{"definition":"Racy; sexually provocative."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɛəɹɪŋ/"}]},{"word":"REALMS","idx":18719,"count":1796195,"meanings":[{"definitions":[{"definition":"An abstract sphere of influence, real or imagined."},{"definition":"The domain of a certain abstraction."},{"definition":"A scope of operation in networking or security."},{"definition":"A territory or state, as ruled by a specific power, especially by a king."},{"definition":"An otherworldly dimension or domain — magical, ethereal, or otherwise — usually ruled or created by a mystical character."},{"definition":"A taxonomic rank in the phylogeny of viruses, higher than kingdoms."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"realms-us"}]},{"word":"MAESTRO","idx":18720,"count":1796104,"meanings":[{"definitions":[{"definition":"A master in some art, especially a composer or conductor."},{"definition":"A gang elder in prison."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmaɪstɹoʊ/"},{"audio":"maestro-au"}]},{"word":"FORTE","idx":18725,"count":1795408,"meanings":[{"definitions":[{"definition":"A strength or talent.","example":"He writes respectably, but poetry is not his forte."},{"definition":"The strong part of a sword blade, close to the hilt."},{"definition":"A passage in music to be played loudly; a loud section of music."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Loud. Used as a dynamic directive in sheet music in its abbreviated form, \"f.\", to indicate raising the volume of the music. (Abbreviated in musical notation with an f, the Unicode character 1D191.)"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Loudly.","example":"The musicians played the passage forte."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"forte-1-uk","text":"/fɔːt/"}]},{"word":"COAXIAL","idx":18726,"count":1795390,"meanings":[{"definitions":[{"definition":"A coaxial cable"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a common central axis"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/koʊ.ˈæk.sɪi.əl/"},{"text":"/kəʊ.ˈæk.sɪi.əl/"}]},{"word":"TIPPING","idx":18727,"count":1795369,"meanings":[{"definitions":[{"definition":"To provide with a tip; to cover the tip of."},{"definition":"(To cause) to become knocked over, fall down or overturn."},{"definition":"(To cause) to be, or come to be, in a tilted or sloping position; (to cause) to become unbalanced."},{"definition":"To drink."},{"definition":"To dump (refuse)."},{"definition":"To pour a libation or a liquid from a container, particularly from a forty of malt liquor."},{"definition":"To deflect with one′s fingers, especially one′s fingertips."},{"definition":"To hit quickly and lightly; to tap."},{"definition":"To give a small gratuity to, especially to an employee of someone who provides a service.","example":"In some cities waiters must be tipped."},{"definition":"To give, pass."},{"definition":"To give a piece of private information to; to inform (someone) of a clue, secret knowledge, etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The practice of leaving a tip (gratuity)."},{"definition":"The act by which something is tipped or inclined."},{"definition":"The dumping of rubbish."},{"definition":"A distinct articulation given in playing quick notes on the flute, by striking the tongue against the roof of the mouth; double-tonguing."}],"partOfSpeech":"n"}]},{"word":"HOLSTER","idx":18729,"count":1794771,"meanings":[{"definitions":[{"definition":"A case for carrying a tool, particularly a gun, safely and accessibly."},{"definition":"A belt with loops or slots for carrying small tools or other equipment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put something in a holster."}],"partOfSpeech":"ve"}]},{"word":"FIDDLE","idx":18730,"count":1794725,"meanings":[{"definitions":[{"definition":"Any of various bowed string instruments, often a violin when played in any of various traditional styles, as opposed to classical violin.","example":"When I play it like this, it's a fiddle; when I play it like that, it's a violin."},{"definition":"A kind of dock (Rumex pulcher) with leaves shaped like the musical instrument."},{"definition":"An adjustment intended to cover up a basic flaw.","example":"That parameter setting is just a fiddle to make the lighting look right."},{"definition":"A fraud; a scam."},{"definition":"On board a ship or boat, a rail or batten around the edge of a table or stove to prevent objects falling off at sea. (Also fiddle rail)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play aimlessly.","example":"You're fiddling your life away."},{"definition":"To adjust or manipulate for deception or fraud.","example":"Fred was sacked when the auditors caught him fiddling the books."},{"definition":"To play traditional tunes on a violin in a non-classical style."},{"definition":"To touch or fidget with something in a restless or nervous way, or tinker with something in an attempt to make minor adjustments or improvements."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fiddle-us","text":"/ˈfɪdl̩/"}]},{"word":"CRUNCH","idx":18731,"count":1794603,"meanings":[{"definitions":[{"definition":"A noisy crackling sound; the sound usually associated with crunching."},{"definition":"A critical moment or event."},{"definition":"A problem that leads to a crisis."},{"definition":"(exercise) A form of abdominal exercise, based on a sit-up but in which the lower back remains in contact with the floor."},{"definition":"The overtime work required to catch up and finish a project, usually in the final weeks of development before release."},{"definition":"A dessert consisting of a crunchy topping with fruit underneath."},{"definition":"(generally in the plural) A small piece created by crushing; a piece of material with a friable or crunchy texture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To crush something, especially food, with a noisy crackling sound.","example":"When I came home, Susan was watching TV with her feet up on the couch, crunching a piece of celery."},{"definition":"To be crushed with a noisy crackling sound.","example":"Beetles crunched beneath the men's heavy boots as they worked."},{"definition":"To calculate or otherwise process (e.g. to crunch numbers: to perform mathematical calculations). Presumably from the sound made by mechanical calculators.","example":"That metadata makes it much easier for the search engine to crunch the data for queries."},{"definition":"To grind or press with violence and noise."},{"definition":"To emit a grinding or crunching noise."},{"definition":"To compress (data) using a particular algorithm, so that it can be restored by decrunching."},{"definition":"To make employees work overtime in order to meet a deadline in the development of a project."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crunch-us","text":"/kɹʌntʃ/"}]},{"word":"BARD","idx":18735,"count":1793654,"meanings":[{"definitions":[{"definition":"A professional poet and singer, like among the ancient Celts, whose occupation was to compose and sing verses in honor of the heroic achievements of princes and brave men."},{"definition":"(by extension) A poet.","example":"Shakespeare is known as the bard of Avon."},{"definition":"A piece of defensive (or, sometimes, ornamental) armor for a horse's neck, breast, and flanks; a barb. (Often in the plural.)"},{"definition":"Defensive armor formerly worn by a man at arms."},{"definition":"A thin slice of fat bacon used to cover any meat or game."},{"definition":"The exterior covering of the trunk and branches of a tree; the rind."},{"definition":"Specifically, Peruvian bark."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover a horse in defensive armor."},{"definition":"To cover (meat or game) with a thin slice of fat bacon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bard-us","text":"[bɑɹd]"}]},{"word":"REAP","idx":18738,"count":1793273,"meanings":[{"definitions":[{"definition":"A bundle of grain; a handful of grain laid down by the reaper as it is cut."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut (for example a grain) with a sickle, scythe, or reaping machine"},{"definition":"To gather (e.g. a harvest) by cutting."},{"definition":"To obtain or receive as a reward, in a good or a bad sense.","example":"to reap a benefit from exertions"},{"definition":"To terminate a child process that has previously exited, thereby removing it from the process table.","example":"Until a child process is reaped, it may be listed in the process table as a zombie or defunct process."},{"definition":"To deprive of the beard; to shave."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"reap-us","text":"/ɹiːp/"}]},{"word":"FAUCETS","idx":18742,"count":1792254,"meanings":[{"definitions":[{"definition":"An exposed plumbing fitting; a tap or spigot; a regulator for controlling the flow of a liquid from a reservoir."},{"definition":"(game development) One or several systems that inject currency into the game's economy, thus controlling or preventing inflation"}],"partOfSpeech":"n"}]},{"word":"BALLISTIC","idx":18743,"count":1792214,"meanings":[{"definitions":[{"definition":"Or relating to ballistics."},{"definition":"Or relating to projectiles moving under their own momentum, air drag, gravity and sometimes rocket power"},{"definition":"Very angry.","example":"When he heard him lie about it, he went ballistic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ballistic-us","text":"/bəˈlɪs.tɪk/"}]},{"word":"EXEMPLARY","idx":18744,"count":1791669,"meanings":[{"definitions":[{"definition":"An example, or typical instance."},{"definition":"A copy of a book or a piece of writing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Deserving honour, respect and admiration."},{"definition":"Of such high quality that it should serve as an example to be imitated; ideal, perfect.","example":"Her behaviour was always exemplary."},{"definition":"Serving as a warning; monitory.","example":"exemplary justice, exemplary punishment, exemplary damages"},{"definition":"Providing an example or illustration."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɛɡˈzɛmpləɹi/"},{"audio":"exemplary-au"}]},{"word":"PAYOUTS","idx":18745,"count":1791650,"meanings":[{"definitions":[{"definition":"An amount of money paid out."},{"definition":"The value of dividends paid to shareholders."}],"partOfSpeech":"n"}]},{"word":"CALIBER","idx":18747,"count":1791378,"meanings":[{"definitions":[{"definition":"Diameter of the bore of a firearm, typically measured between opposite lands."},{"definition":"The diameter of round or cylindrical body, as of a bullet, a projectile, or a column."},{"definition":"A nominal name for a cartridge type, which may not exactly indicate its true size and may include other measurements such as cartridge length or black powder capacity. Eg 7.62×39 or 38.40."},{"definition":"Unit of measure used to express the length of the bore of a weapon. The number of calibres is determined by dividing the length of the bore of the weapon, from the breech face of the tube to the muzzle, by the diameter of its bore. A gun tube the bore of which is 40 feet (480 inches) long and 12 inches in diameter is said to be 40 calibers long."},{"definition":"Relative size, importance, magnitude."},{"definition":"Capacity or compass of mind."},{"definition":"Degree of importance or station in society."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæl.ə.bɚ/"}]},{"word":"APOSTLE","idx":18748,"count":1790768,"meanings":[{"definitions":[{"definition":"A missionary, or leader of a religious mission, especially one in the early Christian Church (but see Apostle)."},{"definition":"A pioneer or early advocate of a particular cause, prophet of a belief."},{"definition":"A top-ranking ecclesiastical official in the twelve seat administrative council of The Church of Jesus Christ of Latter-day Saints."},{"definition":"A person who is plucked, that is, refused an academic degree."},{"definition":"A letter dismissory."},{"definition":"A note sent to an appeals court presenting the appeal in summary."},{"definition":"The trial court record sent to an appeal court concerning an appeal."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"apostle-us","text":"/əˈpɑsl̩/"}]},{"word":"PLAYFUL","idx":18749,"count":1790754,"meanings":[{"definitions":[{"definition":"Liking play, prone to play frequently, such as a child or kitten; rather sportive.","example":"Actually, we are pretty playful in our romantic life."},{"definition":"Funny, humorous, jesting, frolicsome.","example":"A party hat is a playful conical hat people wear at parties."},{"definition":"Fun, recreational, not serious.","example":"A brainteaser is a playful puzzle posed as a test of intelligence."},{"definition":"Experimental.","example":"He was a rather playful artist."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpleɪfəl/"}]},{"word":"SUPERMARKETS","idx":18750,"count":1790671,"meanings":[{"definitions":[{"definition":"A large self-service store that sells groceries and, usually, medications, household goods and/or clothing.","example":"I went to the supermarket to buy some food."},{"definition":"A chain of such stores."},{"definition":"A one-stop shop; a place offering a range of products or services."}],"partOfSpeech":"n"}]},{"word":"MULTIPLIED","idx":18753,"count":1790425,"meanings":[{"definitions":[{"definition":"To increase the amount, degree or number of (something)."},{"definition":"(with by) To perform multiplication on (a number).","example":"when you multiply 3 by 7, you get 21;  he multiplied several numbers"},{"definition":"To grow in number."},{"definition":"To breed or propagate."},{"definition":"To perform multiplication.","example":"He had been multiplying, but it occurred to him he needed to resolve the exponents, first."},{"definition":"To be a factor in a multiplication with (another factor)."}],"partOfSpeech":"ve"}]},{"word":"ENCHANTED","idx":18754,"count":1789839,"meanings":[{"definitions":[{"definition":"To attract and delight, to charm."},{"definition":"To cast a spell upon (often one that attracts or charms)."},{"definition":"To magically enhance or degrade an item."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Charmed, delighted, enraptured."},{"definition":"Under the influence of enchantment."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A greeting used when introduced to someone for the first time, especially by a man when introduced to a woman."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"enchanted-us","text":"/ɛnˈt͡ʃæntɪd/"}]},{"word":"STYLED","idx":18756,"count":1789390,"meanings":[{"definitions":[{"definition":"To design, fashion, make, or arrange in a certain way or form (style)"},{"definition":"To call or give a name or title to."},{"definition":"To create for, or give to, someone a style, fashion, or image, particularly one which is regarded as attractive, tasteful, or trendy."},{"definition":"To act in a way which seeks to show that one possesses style."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Set in place, arranged.","example":"His styled hair was not as attractive as he thought."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"styled-us"}]},{"word":"COMMANDERS","idx":18758,"count":1789190,"meanings":[{"definitions":[{"definition":"One who exercises control and direction of a military or naval organization."},{"definition":"A naval officer whose rank is above that of a lieutenant commander and below that of captain."},{"definition":"One who exercises control and direction over a group of persons."},{"definition":"A designation or rank in certain non-military organizations such as NASA and various police forces."},{"definition":"The chief officer of a commandry."},{"definition":"A heavy beetle or wooden mallet, used in paving, in sail lofts, etc."},{"definition":"A rank within an honorary order: e.g. Commander of the Legion of Honour."},{"definition":"Any of various nymphalid butterflies of the Asian genus Moduza."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"commanders-us","text":"/kəˈmændɚz/"}]},{"word":"WAIVE","idx":18762,"count":1789027,"meanings":[{"definitions":[{"definition":"To relinquish (a right etc.); to give up claim to; to forego.","example":"If you waive the right to be silent, anything you say can be used against you in a court of law."},{"definition":"To put aside, avoid."},{"definition":"To outlaw (someone)."},{"definition":"To abandon, give up (someone or something)."},{"definition":"To move from side to side; to sway."},{"definition":"To stray, wander."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A woman put out of the protection of the law; an outlawed woman."},{"definition":"A waif; a castaway."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"waive-uk","text":"/weɪv/"}]},{"word":"CONTRACEPTION","idx":18763,"count":1788872,"meanings":[{"definitions":[{"definition":"The use of a device or procedure to prevent conception as a result of sexual activity."}],"partOfSpeech":"n"}]},{"word":"POLAROID","idx":18765,"count":1788581,"meanings":[{"definitions":[{"definition":"A sheet of plastic embedded with microscopic crystals of herapathite or similarly acting material, so that light passing through it is polarised."},{"definition":"(in the plural) Spectacles made with lenses of polaroid, once used to view certain 3-D movies."},{"definition":"(in the plural) Polaroid sunglasses."},{"definition":"A camera that develops its own film."},{"definition":"A print from such a camera."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To photograph with a polaroid camera."}],"partOfSpeech":"ve"}]},{"word":"SOPRANO","idx":18767,"count":1788265,"meanings":[{"definitions":[{"definition":"Musical part or section higher in pitch than alto and other sections."},{"definition":"Person or instrument that performs the soprano part."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sing or utter with high pitch, like a soprano singer"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"soprano-us","text":"/səˈpɹænoʊ/"}]},{"word":"POLISHING","idx":18768,"count":1788195,"meanings":[{"definitions":[{"definition":"To shine; to make a surface very smooth or shiny by rubbing, cleaning, or grinding.","example":"He polished up the chrome until it gleamed."},{"definition":"To refine; remove imperfections from.","example":"The band has polished its performance since the last concert."},{"definition":"To apply shoe polish to shoes."},{"definition":"To become smooth, as from friction; to receive a gloss; to take a smooth and glossy surface.","example":"Steel polishes well."},{"definition":"To refine; to wear off the rudeness, coarseness, or rusticity of; to make elegant and polite."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to polish."},{"definition":"(usually in the plural) An extract of partially milled rice."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That makes shiny or smooth."},{"definition":"That refines."}],"partOfSpeech":"j"}]},{"word":"MARQUIS","idx":18769,"count":1788011,"meanings":[{"definitions":[{"definition":"A nobleman in England, France, and Germany, of a rank next below that of duke, but above a count. Originally, the marquis was an officer whose duty was to guard the marches or frontiers of the kingdom. The office has ceased, and the name is now a mere title conferred by letters patent or letters close."},{"definition":"Any of various nymphalid butterflies of the Asian genus Bassarona."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mɑɹ.ˈki/"},{"text":"/ˈmɑː.kwɪs/"}]},{"word":"UNDERAGE","idx":18770,"count":1787414,"meanings":[{"definitions":[{"definition":"Below the legal age for some activity, such as drinking or having sex."},{"definition":"Not yet a legal adult; still a minor."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A deficit or shortfall in funds, inventory, or capacity."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌʌndəɹˈeɪdʒ/"}]},{"word":"CARDIO","idx":18771,"count":1787338,"meanings":[{"definitions":[{"definition":"(exercise) Exercise with the goal of raising the heart rate.","example":"I did some cardio today instead of lifting weights."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Cardiovascular; pertaining to the health of the circulatory and respiratory systems."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɑɹ.di.oʊ/"},{"text":"/ˈkɑː.dɪ.əʊ/"}]},{"word":"WEN","idx":18772,"count":1787310,"meanings":[{"definitions":[{"definition":"A cyst on the skin."},{"definition":"A runic letter later replaced by w"},{"definition":"The time at which something happens.","example":"A good article will cover the who, the what, the when, the where, the why and the how."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(interrogative) At what time? At which time? Upon which occasion or circumstance? Used to introduce direct or indirect questions about time.","example":"Do you know when they arrived?"},{"definition":"At an earlier time and under different, usually less favorable, circumstances.","example":"He's mister high and mighty now, but I remember him when."},{"definition":"(relative) At which, on which, during which: often omitted or replaced with that.","example":"That was the day when the Twin Towers fell."}],"partOfSpeech":"v"},{"definitions":[{"definition":"(interrogative) What time; which time.","example":"Since when do I need your permission?"},{"definition":"The time that.","example":"I recall when they were called the Greys."}],"partOfSpeech":"p"},{"definitions":[{"definition":"At (or as soon as) that time that; at the (or any and every) time that; if.","example":"A player wins when [as soon as, or at any time that, if] she has four cards of the same suit."},{"definition":"During the time that; at the time of the action of the following clause or participle phrase.","example":"Be careful when crossing the street."},{"definition":"At what time; at which time.","example":"I am here till Friday, when [i.e. at which time] I leave for Senegal."},{"definition":"Since; given the fact that; considering that.","example":"I don't see the point of putting up Christmas decorations when I am the only person who is going to see them."},{"definition":"Whereas; although; at the same time as; in spite of the fact that.","example":"He keeps changing things when the existing system works perfectly well."}],"partOfSpeech":"c"}],"phonetics":[{"text":"/wɛn/"}]},{"word":"TRANSLATING","idx":18773,"count":1787091,"meanings":[{"definitions":[{"definition":"Senses relating to the change of information, etc., from one form to another."},{"definition":"Senses relating to a change of position."},{"definition":"To entrance, to cause to lose recollection or sense.","example":"William was translated by the blow to the head he received, being unable to speak for the next few minutes."}],"partOfSpeech":"ve"}]},{"word":"FRONTIERS","idx":18774,"count":1785820,"meanings":[{"definitions":[{"definition":"The part of a country which borders or faces another country or unsettled region"},{"definition":"The most advanced or recent version of something; leading edge.","example":"the frontier of civilization"},{"definition":"An outwork of a fortification."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"frontiers-us"}]},{"word":"TIMESHARES","idx":18775,"count":1785716,"meanings":[{"definitions":[{"definition":"A property jointly owned or leased by multiple people who are allowed to use it only during specified periods each year."}],"partOfSpeech":"n"}]},{"word":"QI","idx":18777,"count":1784611,"meanings":[{"definitions":[{"definition":"The twenty-second letter of the Classical and Modern Greek alphabets."},{"definition":"A life force in traditional Chinese philosophy, culture, medicine, etc, related (but not limited) to breath and circulation."},{"definition":"The Chinese foot, a traditional Chinese unit of length based on the human forearm."},{"definition":"(Mainland China) The Chinese unit of length standardized in 1984 as 1/3 of a meter."},{"definition":"(Taiwan) The Taiwanese unit of length standardized as 10/33 of a meter, identical to the Japanese shaku."},{"definition":"(Hong Kong) The chek or Hong Kong foot, a unit of length standardized as 0.371475 meters."}],"partOfSpeech":"n"}]},{"word":"LOGGER","idx":18778,"count":1784581,"meanings":[{"definitions":[{"definition":"A worker whose occupation is to harvest trees."},{"definition":"That which logs, such as a computer program to keep track of events."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɑːɡɚ/"},{"text":"/ˈlɒɡə/"}]},{"word":"ADJOINING","idx":18779,"count":1784248,"meanings":[{"definitions":[{"definition":"To be in contact or connection with.","example":"The living room and dining room adjoin each other."},{"definition":"To extend an algebraic object (e.g. a field, a ring etc.) by adding to it (an element not belonging to it) and all finite power series of (the element)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Being in contact at some point or line; joining to","example":"an adjoining room"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"adjoining-us","text":"/ʌˈd͡ʒɔɪn.ɪŋ/"}]},{"word":"GREET","idx":18780,"count":1784219,"meanings":[{"definitions":[{"definition":"To welcome in a friendly manner, either in person or through another means e.g. writing or over the phone/internet"},{"definition":"To arrive at or reach, or meet (talking of something which brings joy)"},{"definition":"To accost; to address."},{"definition":"To meet and give salutations."},{"definition":"To be perceived by (somebody).","example":"A brilliant dawn greeted her eyes as she looked out of the window."},{"definition":"To weep; to cry."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(obsolete outside Scotland) Great."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Mourning, weeping, lamentation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"greet-us","text":"/ɡɹiːt/"}]},{"word":"ACCLAIM","idx":18781,"count":1784066,"meanings":[{"definitions":[{"definition":"To shout; to call out."},{"definition":"To express great approval (for).","example":"a highly-acclaimed novel"},{"definition":"To salute or praise with great approval; to compliment; to applaud; to welcome enthusiastically."},{"definition":"To claim."},{"definition":"To declare by acclamations."},{"definition":"To elect to an office by having no opposition."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An acclamation; a shout of applause."},{"definition":"A claim."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ə.ˈkleɪm/"},{"audio":"acclaim-uk"}]},{"word":"BIRDING","idx":18784,"count":1783424,"meanings":[{"definitions":[{"definition":"Birdwatching"},{"definition":"The catching of birds; fowling"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bɜː(ɹ)dɪŋ/"}]},{"word":"HARDSHIP","idx":18785,"count":1782871,"meanings":[{"definitions":[{"definition":"Difficulty or trouble; hard times.","example":"He has survived periods of financial hardship before."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat (a person) badly; to subject to hardships."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhɑɹdˌʃɪp/"},{"text":"/ˈhɑːdˌʃɪp/"}]},{"word":"DETAINEES","idx":18786,"count":1782662,"meanings":[{"definitions":[{"definition":"Someone who is detained, especially in custody or confinement."}],"partOfSpeech":"n"}]},{"word":"HAST","idx":18787,"count":1782598,"meanings":[{"definitions":[{"definition":"To possess, own.","example":"I have a house and a car."},{"definition":"To hold, as something at someone's disposal.","example":"Do you have the key? (not necessarily one's own key)"},{"definition":"Used to state the existence or presence of someone in a specified relationship with the subject.","example":"I have a really mean boss."},{"definition":"To partake of (a particular substance, especially food or drink, or action or activity).","example":"Can I have a look at that?"},{"definition":"To be scheduled to attend, undertake or participate in.","example":"Fred won't be able to come to the party; he has a meeting that day."},{"definition":"To experience, go through, undergo.","example":"He had surgery on his hip yesterday."},{"definition":"To be afflicted with, suffer from.","example":"He had a cold last week."},{"definition":"(auxiliary verb, taking a past participle) Used in forming the perfect aspect.","example":"I had already eaten."},{"definition":"Used as an interrogative verb before a pronoun to form a tag question, echoing a previous use of 'have' as an auxiliary verb or, in certain cases, main verb. (For further discussion, see the appendix English tag questions.)","example":"They haven't eaten dinner yet, have they?"},{"definition":"(auxiliary verb, taking a to-infinitive) See have to.","example":"I have to go."},{"definition":"To give birth to.","example":"My mother had me when she was 25."},{"definition":"To engage in sexual intercourse with.","example":"He's always bragging about how many women he's had."},{"definition":"To accept as a romantic partner.","example":"Despite my protestations of love, she would not have me."},{"definition":"(transitive with bare infinitive) To cause to, by a command, request or invitation.","example":"They had me feed their dog while they were out of town."},{"definition":"(transitive with adjective or adjective-phrase complement) To cause to be.","example":"He had him arrested for trespassing."},{"definition":"(transitive with bare infinitive) To be affected by an occurrence. (Used in supplying a topic that is not a verb argument.)","example":"I've had three people today tell me my hair looks nice."},{"definition":"(transitive with adjective or adjective-phrase complement) To depict as being.","example":"Their stories differed; he said he'd been at work when the incident occurred, but her statement had him at home that entire evening."},{"definition":"To defeat in a fight; take.","example":"I could have him!"},{"definition":"(obsolete outside Ireland) To be able to speak (a language).","example":"I have no German."},{"definition":"To feel or be (especially painfully) aware of.","example":"Dan certainly has arms today, probably from scraping paint off four columns the day before."},{"definition":"To trick, to deceive.","example":"You had me alright! I never would have thought that was just a joke."},{"definition":"(often with present participle) To allow; to tolerate.","example":"I asked my dad if I could go to the concert this Thursday, but he wouldn't have it since it's a school night."},{"definition":"(often used in the negative) To believe, buy, be taken in by.","example":"I made up an excuse as to why I was out so late, but my wife wasn't having any of it."},{"definition":"To host someone; to take in as a guest.","example":"Thank you for having me!"},{"definition":"To get a reading, measurement, or result from an instrument or calculation.","example":"I have two contacts on my scope."},{"definition":"(of a jury) To consider a court proceeding that has been completed; to begin deliberations on a case.","example":"We'll schedule closing arguments for Thursday, and the jury will have the case by that afternoon."},{"definition":"To make an observation of (a bird species)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hast-us","text":"/hæst/"}]},{"word":"LYMPH","idx":18789,"count":1781845,"meanings":[{"definitions":[{"definition":"(poetical) Pure water."},{"definition":"A colourless, watery bodily fluid, carried by the lymphatic system, that consists mainly of white blood cells."},{"definition":"Discharge from a sore, inflammation etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lymph-us"},{"text":"/lɪmf/"}]},{"word":"POLLUTANT","idx":18791,"count":1781371,"meanings":[{"definitions":[{"definition":"A foreign substance that makes something dirty, or impure, especially waste from human activities."}],"partOfSpeech":"n"}]},{"word":"CLOSEOUTS","idx":18792,"count":1781209,"meanings":[{"definitions":[{"definition":"A wave which breaks all at once, as opposed to breaking progressively along its length.","example":"Dealing with closeouts is something every surfer should learn – especially if you live and surf in California. — Chris Cote, Transworld Surf https//web.archive.org/web/20051223005322/http://www.transworldsurf.com/surf/howto/article/0,,595802,00.html"},{"definition":"(retail) A sale in which all merchandise is sold, at whatever reduced price is necessary"}],"partOfSpeech":"n"}]},{"word":"CAVALIERS","idx":18794,"count":1780571,"meanings":[{"definitions":[{"definition":"A military man serving on horse, early modern cavalry officers who had abandoned the heavy armor of medieval knights."},{"definition":"A gallant: a sprightly young dashing military man."},{"definition":"A gentleman of the class of such officers, particularly:"},{"definition":"Someone with an uncircumcised penis."},{"definition":"A defensive work rising from a bastion, etc., and overlooking the surrounding area."}],"partOfSpeech":"n"}]},{"word":"ROLLERS","idx":18795,"count":1780553,"meanings":[{"definitions":[{"definition":"(heading) Anything that rolls."},{"definition":"A long wide bandage used in surgery."},{"definition":"A large, wide, curling wave that falls back on itself as it breaks on a coast."},{"definition":"(heading) A bird."},{"definition":"A police patrol car or patrolman (rather than an unmarked police car or a detective)"},{"definition":"A padded surcingle that is used on horses for training and vaulting."},{"definition":"A roll of titles or (especially) credits played over film or video; television or film credits."},{"definition":"A wheelchair user."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To roller skate."}],"partOfSpeech":"ve"}]},{"word":"PUMPED","idx":18797,"count":1780464,"meanings":[{"definitions":[{"definition":"To use a pump to move (liquid or gas).","example":"I've pumped over 1000 gallons of water in the last ten minutes."},{"definition":"(often followed by up) To fill with air.","example":"He pumped up the air-bed by hand, but used the service station air to pump up the tyres."},{"definition":"To move rhythmically, as the motion of a pump.","example":"I pumped my fist with joy when I won the race."},{"definition":"To shake (a person's hand) vigorously."},{"definition":"To gain information from (a person) by persistent questioning."},{"definition":"To use a pump to move liquid or gas.","example":"I've been pumping for over a minute but the water isn't coming through."},{"definition":"To be going very well.","example":"Last night's party was really pumping."},{"definition":"To kick, throw or hit the ball far and high."},{"definition":"To pass gas; to fart."},{"definition":"To pass (messages) into a program so that it can obey them."},{"definition":"(British slang) To copulate."},{"definition":"To weightlift."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pumped up.","example":"I'm feeling pumped for the game on Friday."},{"definition":"Wearing pumps (the type of shoe)."},{"definition":"Very tired, especially when too fatigued to grip handholds well.","example":"I was so pumped by the end of the climb that I could barely hold onto the jugs."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pumped-au","text":"/pʌmpt/"}]},{"word":"DIFFERENTIATED","idx":18799,"count":1780282,"meanings":[{"definitions":[{"definition":"To show, or be the distinction between two things."},{"definition":"To perceive the difference between things; to discriminate."},{"definition":"To modify, or be modified."},{"definition":"To calculate the derivative of a function."},{"definition":"To calculate the differential of a function of multiple variables."},{"definition":"To produce distinct organs or to achieve specific functions by a process of development called differentiation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a cell or tissue) That has taken on a specialized form and function"}],"partOfSpeech":"j"}]},{"word":"VERIFYING","idx":18802,"count":1780073,"meanings":[{"definitions":[{"definition":"To substantiate or prove the truth of something"},{"definition":"To confirm or test the truth or accuracy of something"},{"definition":"To affirm something formally, under oath"}],"partOfSpeech":"ve"}]},{"word":"ALMIGHTY","idx":18804,"count":1780004,"meanings":[{"definitions":[{"definition":"(sometimes postpositive) Unlimited in might; omnipotent; all-powerful","example":"God almighty"},{"definition":"Great; extreme; terrible.","example":"I heard an almighty crash and ran into the kitchen to see what had happened."},{"definition":"(by extension) Having very great power, influence, etc.","example":"The almighty press condemned him without trial."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Extremely; thoroughly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"almighty-au","text":"/ɔːlˈmaɪti/"}]},{"word":"WEEKDAY","idx":18805,"count":1779661,"meanings":[{"definitions":[{"definition":"A day of the week except those which form the weekend; that is:"},{"definition":"Any day of the week (Monday through Sunday)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"weekday-us","text":"/ˈwiːkdeɪ/"}]},{"word":"HOMECOMING","idx":18806,"count":1779345,"meanings":[{"definitions":[{"definition":"The act or event of returning home.","example":"His homecoming was saddened by the news of his mother's death the day before."},{"definition":"In colleges and high schools, a tradition centred around a football game, a parade and the \"coronation\" of a Homecoming Queen.","example":"Many alumni come back for homecoming, and many freshmen are advised to flee."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhoʊmˌkʌmɪŋ/"}]},{"word":"INCREMENTS","idx":18807,"count":1779202,"meanings":[{"definitions":[{"definition":"The action of increasing or becoming greater."},{"definition":"The waxing of the moon."},{"definition":"The amount of increase."},{"definition":"An amplification without strict climax, as in the following passage: \"Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report, [...] think on these things.\""},{"definition":"The amount of time added to a player's clock after each move."},{"definition":"(grammar) A syllable in excess of the number of the nominative singular or the second-person singular present indicative."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To increase by steps or by a step, especially by one."}],"partOfSpeech":"ve"}]},{"word":"INTUITION","idx":18810,"count":1778931,"meanings":[{"definitions":[{"definition":"Immediate cognition without the use of conscious rational processes."},{"definition":"A perceptive insight gained by the use of this faculty."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"intuition-us","text":"/ɪntuwˈɪʃɨn/"}]},{"word":"REVOKED","idx":18811,"count":1778921,"meanings":[{"definitions":[{"definition":"To cancel or invalidate by withdrawing or reversing.","example":"I hereby revoke all former wills."},{"definition":"To fail to follow suit in a game of cards when holding a card in that suit."},{"definition":"To call or bring back."},{"definition":"To hold back."},{"definition":"To move (something) back or away."},{"definition":"To call back to mind."}],"partOfSpeech":"ve"}]},{"word":"OPENNESS","idx":18812,"count":1778779,"meanings":[{"definitions":[{"definition":"Accommodating attitude or opinion, as in receptivity to new ideas, behaviors, cultures, peoples, environments, experiences, etc., different from the familiar, conventional, traditional, or one's own."},{"definition":"The degree to which a person, group, organization, institution, or society exhibits this liberal attitude or opinion."},{"definition":"Lack of secrecy; candour, transparency."},{"definition":"Degree of accessibility to view, use, and modify in a shared environment with legal rights generally held in common and preventing proprietary restrictions on the right of others to continue viewing, using, modifying and sharing."},{"definition":"(systems theory) The degree to which a system operates with distinct boundaries across which exchange occurs capable of inducing change in the system while maintaining the boundaries themselves."}],"partOfSpeech":"n"}]},{"word":"CHROMIUM","idx":18813,"count":1778657,"meanings":[{"definitions":[{"definition":"A chemical element (symbol Cr) with an atomic number of 24: a steely-grey, lustrous, hard and brittle transition metal."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"chromium-us","text":"/ˈkɹoʊmi.əm/"}]},{"word":"CIRCULATING","idx":18814,"count":1778611,"meanings":[{"definitions":[{"definition":"To move in circles or through a circuit"},{"definition":"To cause (a person or thing) to move in circles or through a circuit"},{"definition":"To move from person to person, as at a party"},{"definition":"To spread or disseminate","example":"to circulate money or gossip"},{"definition":"To become widely known"},{"definition":"Of decimals: to repeat."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Moving about freely.","example":"He glanced at the slowly circulating guests."},{"definition":"An institution lending from its collection, especially of books, on condition of membership.","example":"A circulating library."}],"partOfSpeech":"j"}]},{"word":"LATCH","idx":18817,"count":1777882,"meanings":[{"definitions":[{"definition":"To close or lock as if with a latch."},{"definition":"To catch; lay hold of."},{"definition":"To smear; to anoint."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A fastening for a door that has a bar that fits into a notch or slot, and is lifted by a lever or string from either side."},{"definition":"A flip-flop electronic circuit"},{"definition":"A latching."},{"definition":"A crossbow."},{"definition":"That which fastens or holds; a lace; a snare."},{"definition":"A breastfeeding baby's connection to the breast."},{"definition":"A lightweight lock to protect internal structures from being modified by multiple concurrent accesses."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"latch-us","text":"/lætʃ/"}]},{"word":"VERBS","idx":18819,"count":1777489,"meanings":[{"definitions":[{"definition":"(grammar) A word that indicates an action, event, or state.","example":"The word “speak” is an English verb."},{"definition":"Any word; a vocable."},{"definition":"An action as opposed to a trait or thing.","example":"Kindness is a verb, not an adjective. You're only kind if you do kind things."},{"definition":"A named command that performs a specific operation on an object."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use any word that is not, or had not been a verb (especially a noun) as if it were a verb."},{"definition":"(used as a neutral, unspecific verb) To perform any action that is normally expressed by a verb."}],"partOfSpeech":"ve"}]},{"word":"DRANK","idx":18820,"count":1777243,"meanings":[{"definitions":[{"definition":"Dextromethorphan"},{"definition":"A drink, usually alcoholic"},{"definition":"Wild oats, or darnel grass."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To consume (a liquid) through the mouth.","example":"He drank the water I gave him."},{"definition":"(metonymic) To consume the liquid contained within (a bottle, glass, etc.).","example":"Jack drank the whole bottle by himself."},{"definition":"To consume alcoholic beverages.","example":"Everyone who is drinking is drinking, but not everyone who is drinking is drinking."},{"definition":"To take in (a liquid), in any manner; to suck up; to absorb; to imbibe."},{"definition":"To take in; to receive within one, through the senses; to inhale; to hear; to see."},{"definition":"To smoke, as tobacco."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"drank-us","text":"/dɹæŋk/"}]},{"word":"PCM","idx":18821,"count":1776396,"meanings":[{"definitions":[{"definition":"(initialism) per cent mille (1000 pcm = 1%)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(initialism) per calendar month"}],"partOfSpeech":"v"}]},{"word":"CONFRONTATION","idx":18822,"count":1776377,"meanings":[{"definitions":[{"definition":"The act of confronting or challenging another, especially face to face."},{"definition":"A conflict between armed forces."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"confrontation-uk","text":"/ˌkɒnfɹənˈteɪʃən/"}]},{"word":"GROWER","idx":18824,"count":1776182,"meanings":[{"definitions":[{"definition":"A farmer; one who grows things.","example":"He was an orange grower from Florida."},{"definition":"Something that grows.","example":"These flowers are fast growers"},{"definition":"Someone or something who becomes more likeable over time","example":"I didn't like the song at first, but it is a real grower."},{"definition":"A man whose penis does not show its full size until it is erect."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹoʊɚ/"},{"audio":"grower-au"}]},{"word":"SLIPPERY","idx":18827,"count":1775430,"meanings":[{"definitions":[{"definition":"Of a surface, having low friction, often due to being covered in a non-viscous liquid, and therefore hard to grip, hard to stand on without falling, etc.","example":"Oily substances render things slippery."},{"definition":"(by extension) Evasive; difficult to pin down.","example":"a slippery person"},{"definition":"Liable to slip; not standing firm."},{"definition":"Unstable; changeable; inconstant."},{"definition":"Wanton; unchaste; loose in morals."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"slippery-us","text":"/ˈslɪpəɹi/"}]},{"word":"UNPREDICTABLE","idx":18828,"count":1775357,"meanings":[{"definitions":[{"definition":"An unpredictable thing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Unable to be predicted."}],"partOfSpeech":"j"}]},{"word":"CAPACITOR","idx":18831,"count":1774424,"meanings":[{"definitions":[{"definition":"An electronic component capable of storing electrical energy in an electric field; especially one consisting of two conductors separated by a dielectric."}],"partOfSpeech":"n"}]},{"word":"OUTPOST","idx":18832,"count":1774045,"meanings":[{"definitions":[{"definition":"A military post stationed at a distance from the main body of troops.","example":"The outpost did not have enough ammunition to resist a determined assault."},{"definition":"The body of troops manning such a post.","example":"Sgt. Smith fleeced most of the rest of the outpost of their earnings in their weekly game of craps."},{"definition":"An outlying settlement.","example":"Beyond the border proper, there are three small outposts not officially under government protection."},{"definition":"A square protected by a pawn that is in or near the enemy's stronghold."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈaʊtˌpoʊst/"}]},{"word":"LITRES","idx":18836,"count":1773654,"meanings":[{"definitions":[{"definition":"The metric unit of fluid measure, equal to one cubic decimetre. Symbols: l, L, ℓ","example":"You should be able to fill four cups with one litre of water."},{"definition":"A measure of volume equivalent to a litre."}],"partOfSpeech":"n"}]},{"word":"CHATTER","idx":18841,"count":1773184,"meanings":[{"definitions":[{"definition":"Talk, especially meaningless or unimportant talk."},{"definition":"The sound of talking."},{"definition":"The sound made by a magpie."},{"definition":"An intermittent noise, as from vibration.","example":"Proper brake adjustment will help to reduce the chatter."},{"definition":"In national security, the degree of communication between suspect groups and individuals, used to gauge the degree of expected terrorist activity."},{"definition":"One who chats"},{"definition":"A user of chat rooms"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To talk idly.","example":"They knitted and chattered the whole time."},{"definition":"Of teeth, machinery, etc, to make a noise by rapid collisions.","example":"He was so cold that his teeth were chattering."},{"definition":"To utter sounds which somewhat resemble language, but are inarticulate and indistinct."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chatter-uk","text":"/ˈtʃætə/"}]},{"word":"LETTUCE","idx":18845,"count":1772273,"meanings":[{"definitions":[{"definition":"An edible plant, Lactuca sativa and its close relatives, having a head of green and/or purple leaves."},{"definition":"The leaves of the lettuce plant, eaten as a vegetable; as a dish often mixed with other ingredients, dressing etc.","example":"I’ll have a ham sandwich with lettuce and tomato."},{"definition":"United States paper currency; dollars.","example":"Twelve dollars an hour? That's a lot of lettuce!"},{"definition":"A strong yellow-green colour, like that of lettuce (also called lettuce green)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lettuce-us","text":"/ˈlɛtəs/"}]},{"word":"RAGING","idx":18846,"count":1772182,"meanings":[{"definitions":[{"definition":"To act or speak in heightened anger."},{"definition":"(sometimes figurative) To move with great violence, as a storm etc."},{"definition":"To enrage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A display of rage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Volatile, very active or unpredictable.","example":"A raging storm kept us indoors."},{"definition":"(of a person) In a state of rage; in a state of extreme, often uncontrollable, anger."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"raging-us","text":"/ˈɹeɪdʒɪŋ/"}]},{"word":"TIDY","idx":18847,"count":1771735,"meanings":[{"definitions":[{"definition":"A tabletop container for pens and stationery.","example":"a desk tidy"},{"definition":"A cover, often of tatting, drawn work, or other ornamental work, for the back of a chair, the arms of a sofa, etc."},{"definition":"A child's pinafore."},{"definition":"The wren."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make tidy; to neaten."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Arranged neatly and in order.","example":"Keep Britain tidy."},{"definition":"Not messy; neat and controlled."},{"definition":"Satisfactory; comfortable."},{"definition":"Generous, considerable.","example":"The scheme made a tidy profit."},{"definition":"In good time; at the right time; timely; seasonable; opportune; favourable; fit; suitable."},{"definition":"Brave; smart; skillful; fine; good."},{"definition":"Appropriate or suitable as regards occasion, circumstances, arrangement, or order."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Expression of positive agreement, usually in reply to a question."}],"partOfSpeech":"i"}],"phonetics":[{"text":"/ˈtaɪdi/"}]},{"word":"MOTORIZED","idx":18848,"count":1771577,"meanings":[{"definitions":[{"definition":"To fit something with a motor.","example":"Most canoe aficionados would argue that motorizing a canoe removes the pleasurable aspects of traveling in one."},{"definition":"To supply something or someone with motor vehicles.","example":"Once Jack decided to motorize his paper delivery route, he found he could reach far more subscribers."},{"definition":"To supply armoured vehicles; to mechanize.","example":"The refit plan recommended that the first battalion be motorized to upgrade their offensive capabilities."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Equipped with a motor.","example":"Some would argue that a moped is little more than a motorized bicycle, but others would disagree."},{"definition":"Supplied with motor vehicles.","example":"Because the medic had been supplied with a jeep, he and his aide were classed as a motorized detachment."}],"partOfSpeech":"j"}]},{"word":"JONG","idx":18849,"count":1771554,"meanings":[{"definitions":[{"definition":"A Tibetan building which makes up a prefecture; typically a monastery or fortress."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dʒɒŋ/"}]},{"word":"SUBGROUP","idx":18850,"count":1771255,"meanings":[{"definitions":[{"definition":"A group within a larger group; a group whose members are some, but not all, of the members of a larger group."},{"definition":"A subset H of a group G that is itself a group and has the same binary operation as G."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide or classify into subgroups"}],"partOfSpeech":"ve"}]},{"word":"OPPRESSION","idx":18851,"count":1770635,"meanings":[{"definitions":[{"definition":"The exercise of authority or power in a burdensome, cruel, or unjust manner."},{"definition":"The act of oppressing, or the state of being oppressed.","example":"The oppression of the poor by the aristocracy was one cause of the French Revolution."},{"definition":"A feeling of being oppressed.","example":"Our oppression was lifted by the reappearance of the sun."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"oppression-us","text":"/əˈpɹɛʃən/"}]},{"word":"VETS","idx":18853,"count":1770054,"meanings":[{"definitions":[{"definition":"A veterinarian or veterinary surgeon."},{"definition":"A veteran (a former soldier or other member of an armed forces)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To thoroughly check or investigate particularly with regard to providing formal approval.","example":"The FBI vets all nominees to the Federal bench."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/vɛts/"}]},{"word":"BOWS","idx":18854,"count":1769864,"meanings":[{"definitions":[{"definition":"A firm branch of a tree.","example":"When the bough breaks, the cradle will fall."},{"definition":"The gallows."},{"definition":"A weapon made of a curved piece of wood or other flexible material whose ends are connected by a string, used for shooting arrows."},{"definition":"A curved bend in a rod or planar surface, or in a linear formation such as a river (see oxbow)."},{"definition":"A rod with horsehair (or an artificial substitute) stretched between the ends, used for playing various stringed musical instruments."},{"definition":"A stringed instrument (chordophone), consisting of a stick with a single taut cord stretched between the ends, most often played by plucking."},{"definition":"A type of knot with two loops, used to tie together two cords such as shoelaces or apron strings, and frequently used as decoration, such as in gift-wrapping."},{"definition":"Anything bent or curved, such as a rainbow."},{"definition":"The U-shaped piece which goes around the neck of an ox and fastens it to the yoke."},{"definition":"Either of the arms of a pair of spectacles, running from the side of the lens to behind the wearer's ear."},{"definition":"Any instrument consisting of an elastic rod, with ends connected by a string, employed for giving reciprocating motion to a drill, or for preparing and arranging hair, fur, etc., used by hatters."},{"definition":"A crude sort of quadrant formerly used for taking the sun's altitude at sea."},{"definition":"(saddlery) Two pieces of wood which form the arched forward part of a saddletree."},{"definition":"The part of a key that is not inserted into the lock and that is used to turn the key."},{"definition":"A gesture, usually showing respect, made by inclining the head or bending forward at the waist; a reverence","example":"He made a polite bow as he entered the room."},{"definition":"The front of a boat or ship."},{"definition":"The rower that sits in the seat closest to the bow of the boat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play music on (a stringed) instrument using a bow.","example":"The musician bowed his violin expertly."},{"definition":"To become bent or curved.","example":"The shelf bowed under the weight of the books."},{"definition":"To make something bend or curve."},{"definition":"To exercise powerful or controlling influence over; to bend, figuratively; to turn; to incline."},{"definition":"To premiere.","example":"Cronenberg’s \"Cosmopolis\" bows in Cannes this week."},{"definition":"To bend oneself as a gesture of respect or deference.","example":"That singer always bows towards her audience for some reason."},{"definition":"To debut."},{"definition":"To defer (to something).","example":"I bow to your better judgement in the matter."},{"definition":"To give a direction, indication, or command to by bowing."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/baʊz/"}]},{"word":"YIELDING","idx":18855,"count":1769641,"meanings":[{"definitions":[{"definition":"To pay, give in payment; repay, recompense; reward; requite."},{"definition":"To furnish; to afford; to render; to give forth."},{"definition":"To give way; to allow another to pass first.","example":"Yield the right of way to pedestrians."},{"definition":"To give as required; to surrender, relinquish or capitulate.","example":"They refuse to yield to the enemy."},{"definition":"To give, or give forth, (anything)."},{"definition":"To give way; to succumb to a force."},{"definition":"To produce as return, as from an investment.","example":"Historically, that security yields a high return."},{"definition":"To produce as a result.","example":"Adding 3 and 4 yields a result of 7."},{"definition":"To produce a particular sound as the result of a sound law.","example":"Indo-European p- yields Germanic f-."},{"definition":"(of a material specimen) To pass the material's yield point and undergo plastic deformation."},{"definition":"To admit to be true; to concede; to allow."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Docile, or inclined to give way to pressure."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A concession."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈjiːldɪŋ/"}]},{"word":"ASSAYS","idx":18856,"count":1769636,"meanings":[{"definitions":[{"definition":"Trial, attempt."},{"definition":"Examination and determination; test."},{"definition":"The qualitative or quantitative chemical analysis of something."},{"definition":"Trial by danger or by affliction; adventure; risk; hardship; state of being tried."},{"definition":"Tested purity or value."},{"definition":"The act or process of ascertaining the proportion of a particular metal in an ore or alloy; especially, the determination of the proportion of gold or silver in bullion or coin."},{"definition":"The alloy or metal to be assayed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attempt (something)."},{"definition":"To try, attempt (to do something)."},{"definition":"To analyze or estimate the composition or value of (a metal, ore etc.)."},{"definition":"To test the abilities of (someone) in combat; to fight."},{"definition":"To affect."},{"definition":"To try tasting, as food or drink."}],"partOfSpeech":"ve"}]},{"word":"TORSO","idx":18857,"count":1769562,"meanings":[{"definitions":[{"definition":"The main part of the (human) body that extends from the neck to the groin, excluding the head and limbs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"torso-us","text":"/ˈtɔɹ.soʊ/"}]},{"word":"OCCULT","idx":18858,"count":1769403,"meanings":[{"definitions":[{"definition":"(usually with \"the\") Supernatural affairs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or hide from view.","example":"The Earth occults the Moon during a lunar eclipse."},{"definition":"To dissimulate, conceal, or obfuscate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Secret; hidden from general knowledge; undetected.","example":"occult blood loss;  occult cancer"},{"definition":"Related to the occult; pertaining to mysticism, magic, or astrology."},{"definition":"Esoteric."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈkʌlt/"},{"audio":"occult-au"}]},{"word":"EXPEDITIONS","idx":18859,"count":1769110,"meanings":[{"definitions":[{"definition":"The act of expediting something; prompt execution."},{"definition":"A military journey; an enterprise against some enemy or into enemy territory."},{"definition":"The quality of being expedite; speed, quickness."},{"definition":"An important or long journey, for example a march or a voyage"},{"definition":"A trip, especially a long one, made by a person or a group of people for a specific purpose","example":"a naval expedition"},{"definition":"The group of people making such excursion."}],"partOfSpeech":"n"}]},{"word":"HOOKER","idx":18861,"count":1768891,"meanings":[{"definitions":[{"definition":"A rod bent into a curved shape, typically with one end free and the other end secured to a rope or other attachment."},{"definition":"A barbed metal hook used for fishing; a fishhook."},{"definition":"Any of various hook-shaped agricultural implements such as a billhook."},{"definition":"The curved needle used in the art of crochet."},{"definition":"The part of a hinge which is fixed to a post, and on which a door or gate hangs and turns."},{"definition":"A loop shaped like a hook under certain written letters, for example, g and j."},{"definition":"A tie-in to a current event or trend that makes a news story or editorial relevant and timely."},{"definition":"A snare; a trap."},{"definition":"(in the plural) The projecting points of the thighbones of cattle; called also hook bones."},{"definition":"Removal or expulsion from a group or activity","example":"He is not handling this job, so we're giving him the hook."},{"definition":"A field sown two years in succession."},{"definition":"(authorship) A brief, punchy opening statement intended to get attention from an audience, reader, or viewer, and make them want to continue to listen to a speech, read a book, or watch a play."},{"definition":"(authorship) A gimmick or element of a creative work intended to be attention-grabbing for the audience; a compelling idea for a story that will be sure to attract people's attention."},{"definition":"A finesse."},{"definition":"A jack (the playing card)."},{"definition":"A spit or narrow cape of sand or gravel turned landward at the outer end, such as Sandy Hook in New Jersey."},{"definition":"A catchy musical phrase which forms the basis of a popular song.","example":"The song's hook snared me."},{"definition":"A ship's anchor."},{"definition":"Part of a system's operation that can be intercepted to change or augment its behaviour.","example":"We've added hooks to allow undefined message types to be handled with custom code."},{"definition":"(Scrabble) An instance of playing a word perpendicular to a word already on the board, adding a letter to the start or the end of the word to form a new word."},{"definition":"A diacritical mark shaped like the upper part of a question mark, as in ỏ."},{"definition":"A háček."},{"definition":"Senses relating to sports."},{"definition":"One who, or that which, hooks."},{"definition":"A small fishing boat."},{"definition":"Any antiquated craft."},{"definition":"A player who hooks the ball out of the scrum with his foot."},{"definition":"A crocheter."},{"definition":"A thief who uses a pole with a hook on the end to steal goods."},{"definition":"A prostitute."},{"definition":"(1920s to 1940s) An imprecise measure of alcoholic drink; a \"slug\" (of gin), or an overlarge gulp."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hooker-us","text":"/ˈhʊk.ɚ/"}]},{"word":"LONGHORN","idx":18863,"count":1768593,"meanings":[{"definitions":[{"definition":"A breed of beef cattle, having long horns, bred in Texas and other parts of southwest United States."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɔŋhɔɹn/"},{"text":"/ˈlɒŋhɔːn/"}]},{"word":"BEAU","idx":18865,"count":1768520,"meanings":[{"definitions":[{"definition":"A man with a reputation for fine dress and etiquette; a dandy or fop."},{"definition":"A male lover; a boyfriend."},{"definition":"A male escort."},{"definition":"A suitor of a lady."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"beau-uk","text":"/bəʊ/"}]},{"word":"BACKDROP","idx":18866,"count":1768258,"meanings":[{"definitions":[{"definition":"A decorated cloth hung at the back of a stage."},{"definition":"An image that serves as a visual background."},{"definition":"The setting or background of an acted performance."},{"definition":"Any background situation.","example":"Against a backdrop of falling interest rates, the new savings account is looking less appealing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To serve as a backdrop for.","example":"a brilliant sunset backdropping the famous skyline"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbæk.dɹɒp/"}]},{"word":"SUBORDINATE","idx":18867,"count":1768208,"meanings":[{"definitions":[{"definition":"One who is subordinate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make subservient."},{"definition":"To treat as of less value or importance."},{"definition":"To make of lower priority in order of payment in bankruptcy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Placed in a lower class, rank, or position."},{"definition":"Submissive or inferior to, or controlled by authority."},{"definition":"(grammar, of a clause) dependent on and either modifying or complementing the main clause","example":"In the sentence “The barbecue finished before John arrived”, the subordinate clause “before John arrived” specifies the time of the main clause, “The barbecue finished”."},{"definition":"Descending in a regular series."}],"partOfSpeech":"j"}]},{"word":"LILIES","idx":18868,"count":1768158,"meanings":[{"definitions":[{"definition":"Any of several flowers in the genus Lilium of the family Liliaceae, which includes a great many ornamental species."},{"definition":"Any of several species of herbaceous flower which may or may not resemble the genus Lilium in some way, and which are not closely related to it or each other."},{"definition":"The flower used as a heraldic charge; also commonly used to describe the fleur-de-lis."},{"definition":"The end of a compass needle that should point north, traditionally often ornamented with the figure of a lily or fleur-de-lis."},{"definition":"(usually in the plural) A royal spade in auction bridge."},{"definition":"The thirtieth Lenormand card, representing calmness and maturity."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lilies-us","text":"/ˈlɪliz/"}]},{"word":"AEROBIC","idx":18869,"count":1768075,"meanings":[{"definitions":[{"definition":"Living or occurring only in the presence of oxygen e.g. aerobic bacteria."},{"definition":"Of exercise, performed while maintaining a sufficient supply of oxygen to meet bodily energy needs."},{"definition":"Of or relating to aerobics."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈɹoʊbɪk/"}]}]