[{"word":"CRUSHES","idx":50446,"count":328146,"meanings":[{"definitions":[{"definition":"A violent collision or compression; a crash; destruction; ruin."},{"definition":"Violent pressure, as of a moving crowd."},{"definition":"A crowd that produces uncomfortable pressure.","example":"a crush at a reception"},{"definition":"A violent crowding."},{"definition":"A crowd control barrier."},{"definition":"A drink made by squeezing the juice out of fruit."},{"definition":"An infatuation with somebody one is not dating.","example":"I've had a huge crush on her since we met many years ago."},{"definition":"A standing stock or cage with movable sides used to restrain livestock for safe handling."},{"definition":"A party or festive function."},{"definition":"The process of crushing cane to remove the raw sugar, or the season when this process takes place."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press between two hard objects; to squeeze so as to alter the natural shape or integrity of it, or to force together into a mass.","example":"to crush grapes"},{"definition":"To reduce to fine particles by pounding or grinding","example":"to crush quartz"},{"definition":"To overwhelm by pressure or weight.","example":"After the corruption scandal, the opposition crushed the ruling party in the elections"},{"definition":"To oppress or grievously burden."},{"definition":"To overcome completely; to subdue totally.","example":"The sultan's black guard crushed every resistance bloodily."},{"definition":"To be or become broken down or in, or pressed into a smaller compass, by external weight or force","example":"an eggshell crushes easily"},{"definition":"To feel infatuation or unrequited love.","example":"She's crushing on him."},{"definition":"To give a compressed or foreshortened appearance to."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɹʌʃɪz/"}]},{"word":"FORESHORE","idx":50447,"count":328134,"meanings":[{"definitions":[{"definition":"The part of a shore between high water and low water, especially the beach exposed at maximum ebb spring tides."}],"partOfSpeech":"n"}]},{"word":"CARNIVOROUS","idx":50448,"count":328116,"meanings":[{"definitions":[{"definition":"Of, or relating to carnivores, or the taxonomic order Carnivora."},{"definition":"Predatory or flesh eating."},{"definition":"Insectivorous: capable of trapping insects and absorbing nutrient from them."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kɑɹˈnɪv.əɹ.əs/"}]},{"word":"GUSSET","idx":50450,"count":328084,"meanings":[{"definitions":[{"definition":"A small piece of cloth inserted in a garment, for the purpose of strengthening some part or giving it a tapering enlargement cf. godet."},{"definition":"A small piece of mail, providing some protection where two plates of armor are joined, usually at the elbows, under the shoulders, and behind the knees."},{"definition":"(machinery) A kind of bracket, or angular piece of iron, fastened in the angles of a structure to give strength or stiffness; especially, the part joining the barrel and the fire box of a locomotive boiler."},{"definition":"An abatement or mark of dishonor in a coat of arms, resembling a gusset."},{"definition":"(roofing) A large flat metal piece wider than the valley to help prevent build-up at the base of the valley, either from debris or ice dam formations."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make with a gusset; to sew a gusset into."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡʌsɪt/"},{"text":"/ˈɡasət/"}]},{"word":"MINCE","idx":50452,"count":328039,"meanings":[{"definitions":[{"definition":"Finely chopped meat."},{"definition":"Finely chopped mixed fruit used in Christmas pies; mincemeat.","example":"During Christmas time my dad loves to eat mince pies."},{"definition":"An affected (often dainty or short and precise) gait."},{"definition":"An affected manner, especially of speaking; an affectation."},{"definition":"(chiefly in the plural) An eye (from mince pie)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make less; make small."},{"definition":"To lessen; diminish; to diminish in speaking; speak of lightly or slightingly; minimise."},{"definition":"To effect mincingly."},{"definition":"To cut into very small pieces; to chop fine.","example":"Butchers often use machines to mince meat."},{"definition":"To suppress or weaken the force of"},{"definition":"To say or utter vaguely, not directly or frankly","example":"a minced oath"},{"definition":"To affect; to pronounce affectedly or with an accent."},{"definition":"To walk with short steps; to walk in a prim, affected manner."},{"definition":"To act or talk with affected nicety; to affect delicacy in manner.","example":"I love going to gay bars and seeing drag queens mince around on stage."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/mɪns/"}]},{"word":"BANISH","idx":50454,"count":328029,"meanings":[{"definitions":[{"definition":"(heading) To send someone away and forbid that person from returning."},{"definition":"To expel, especially from the mind.","example":"banish fear, qualm."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbænɪʃ/"}]},{"word":"METALWORK","idx":50456,"count":328016,"meanings":[{"definitions":[{"definition":"Objects made of metal.","example":"The local blacksmith made all the metalwork for this reconstructed old house."},{"definition":"The act of shaping metal, metalworking."}],"partOfSpeech":"n"}]},{"word":"FLAPPING","idx":50457,"count":328008,"meanings":[{"definitions":[{"definition":"An instance where one flaps."},{"definition":"A phonological process found in many dialects of English, especially American English and Canadian English, by which intervocalic /t/ and /d/ surface as the alveolar flap /ɾ/ before an unstressed syllable, so that words such as \"metal\" and \"medal\" are pronounced similarly or identically."},{"definition":"The situation where a resource, a network destination, etc., is advertised as being available and then unavailable (or available by different routes) in rapid succession."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That flaps or flap","example":"flapping sails"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈflæpɪŋ/"}]},{"word":"FINO","idx":50459,"count":328002,"meanings":[{"definitions":[{"definition":"The driest and palest type of traditional sherry."}],"partOfSpeech":"n"}]},{"word":"PUNTING","idx":50460,"count":327997,"meanings":[{"definitions":[{"definition":"To propel a punt or similar craft by means of a pole."},{"definition":"To dropkick; to kick something a considerable distance."},{"definition":"To equivocate and delay or put off (answering a question, addressing an issue, etc)."},{"definition":"To retreat from one's objective; to abandon an effort one still notionally supports."},{"definition":"To make the best choice from a set of non-ideal alternatives."},{"definition":"To play at basset, baccara, faro, etc."},{"definition":"To stake against the bank, to back a horse, to gamble or take a chance more generally"},{"definition":"To make a highly speculative investment or other commitment, or take a wild guess."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpʌntɪŋ/"}]},{"word":"FRETS","idx":50461,"count":327989,"meanings":[{"definitions":[{"definition":"Agitation of the surface of a fluid by fermentation or some other cause; a rippling on the surface of water."},{"definition":"Agitation of the mind marked by complaint and impatience; disturbance of temper; irritation.","example":"He keeps his mind in a continual fret."},{"definition":"Herpes; tetter."},{"definition":"(in the plural) The worn sides of riverbanks, where ores or stones containing them accumulate after being washed down from higher ground, which thus indicate to miners the locality of veins of ore."},{"definition":"An ornamental pattern consisting of repeated vertical and horizontal lines, often in relief."},{"definition":"A saltire interlaced with a mascle."},{"definition":"A ferrule, a ring."},{"definition":"One of the pieces of metal, plastic or wood across the neck of a guitar or other string instrument that marks where a finger should be positioned to depress a string as it is played."},{"definition":"A channel, a strait; a fretum."},{"definition":"A channel or passage created by the sea."},{"definition":"A fog or mist at sea, or coming inland from the sea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Especially when describing animals: to consume, devour, or eat."},{"definition":"To chafe or irritate; to worry."},{"definition":"To make rough, to agitate or disturb; to cause to ripple.","example":"to fret the surface of water"},{"definition":"In the form fret out: to squander, to waste."},{"definition":"To gnaw; to consume, to eat away."},{"definition":"To be chafed or irritated; to be angry or vexed; to utter peevish expressions through irritation or worry."},{"definition":"To be worn away; to chafe; to fray.","example":"A wristband frets on the edges."},{"definition":"To be anxious, to worry."},{"definition":"To be agitated; to rankle; to be in violent commotion.","example":"Rancour frets in the malignant breast."},{"definition":"To have secondary fermentation (fermentation occurring after the conversion of sugar to alcohol in beers and wine) take place."},{"definition":"To decorate or ornament, especially with an interlaced or interwoven pattern, or with carving or relief (raised) work."},{"definition":"To form a pattern on; to variegate."},{"definition":"To cut through with a fretsaw, to create fretwork."},{"definition":"To bind, to tie, originally with a loop or ring."},{"definition":"Musical senses."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɹɛts/"}]},{"word":"SCAB","idx":50463,"count":327970,"meanings":[{"definitions":[{"definition":"An incrustation over a sore, wound, vesicle, or pustule, formed during healing."},{"definition":"The scabies."},{"definition":"The mange, especially when it appears on sheep."},{"definition":"Any of several different diseases of potatoes producing pits and other damage on their surface, caused by streptomyces bacteria (but formerly believed to be caused by a fungus)."},{"definition":"Common scab, a relatively harmless variety of scab (potato disease) caused by Streptomyces scabies."},{"definition":"Any one of various more or less destructive fungal diseases that attack cultivated plants, forming dark-colored crustlike spots."},{"definition":"(founding) A slight irregular protuberance which defaces the surface of a casting, caused by the breaking away of a part of the mold."},{"definition":"A mean, dirty, paltry fellow."},{"definition":"A worker who acts against trade union policies, especially a strikebreaker."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become covered by a scab or scabs."},{"definition":"To form into scabs and be shed, as damaged or diseased skin."},{"definition":"To remove part of a surface (from)."},{"definition":"To act as a strikebreaker."},{"definition":"To beg (for), to cadge or bum.","example":"I scabbed some money off a friend."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scab-us","text":"/skæb/"}]},{"word":"SCHISM","idx":50465,"count":327944,"meanings":[{"definitions":[{"definition":"A split or separation within a group or organization, typically caused by discord."},{"definition":"A formal division or split within a religious body.","example":"The schism between Sunnis and Shias happened quite early in Islamic history."},{"definition":"A split within Christianity whereby a group no longer recognizes the Bishop of Rome as the head of the Church, but shares essentially the same beliefs with the Church of Rome. In other words, a political split without the introduction of heresy."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"schism-us","text":"/ˈskɪzəm/"}]},{"word":"SCULPTURED","idx":50469,"count":327878,"meanings":[{"definitions":[{"definition":"Made like a sculpture."},{"definition":"Attractively formed.","example":"His sculptured features drew appreciative looks."}],"partOfSpeech":"j"}]},{"word":"TIDBIT","idx":50472,"count":327832,"meanings":[{"definitions":[{"definition":"A tasty morsel (of food)."},{"definition":"A quarter of a byte (Half of a nybble; two bits)."},{"definition":"A short mention of news or gossip."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tidbit-us"}]},{"word":"TERIYAKI","idx":50475,"count":327807,"meanings":[{"definitions":[{"definition":"A cooking technique used in Japanese cuisine in which foods are broiled or grilled in a sweet soy sauce marinade."},{"definition":"A sweet soy sauce marinade","example":"Put some teriyaki on it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌtɛɹiˈjɑki/"},{"text":"/ˌtɛɹiˈjaki/"},{"text":"/ˌteɹiˈjɐːki/"}]},{"word":"INTERRELATIONSHIPS","idx":50478,"count":327759,"meanings":[{"definitions":[{"definition":"A relationship between multiple things."}],"partOfSpeech":"n"}]},{"word":"HERETICS","idx":50486,"count":327681,"meanings":[{"definitions":[{"definition":"Someone who believes contrary to the fundamental tenets of a religion they claim to belong to."},{"definition":"Someone who does not conform to generally accepted beliefs or practices"}],"partOfSpeech":"n"}]},{"word":"DOGGED","idx":50488,"count":327646,"meanings":[{"definitions":[{"definition":"To pursue with the intent to catch."},{"definition":"To follow in an annoying or harassing way.","example":"The woman cursed him so that trouble would dog his every step."},{"definition":"To fasten a hatch securely.","example":"It is very important to dog down these hatches..."},{"definition":"To watch, or participate, in sexual activity in a public place.","example":"I admit that I like to dog at my local country park."},{"definition":"To intentionally restrict one's productivity as employee; to work at the slowest rate that goes unpunished.","example":"A surprise inspection of the night shift found that some workers were dogging it."},{"definition":"To criticize."},{"definition":"To divide (a watch) with a comrade."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Stubbornly persevering, steadfast"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Very"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/dɔɡd/"},{"text":"/dɒɡd/"},{"audio":"dogged-1-au"}]},{"word":"APPARITION","idx":50491,"count":327614,"meanings":[{"definitions":[{"definition":"An act of becoming visible; appearance; visibility."},{"definition":"The thing appearing; a visible object; a form."},{"definition":"An unexpected, wonderful, or preternatural appearance; especially something such as a ghost or phantom.","example":"The attic is haunted by the ghostly apparition of a young girl who died there."},{"definition":"The first appearance of a star or other luminary after having been invisible or obscured; opposed to occultation."},{"definition":"A period of consecutive days or nights when a particular celestial body may be observed, beginning with the heliacal rising of the body and ending with its heliacal setting."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"apparition-uk","text":"/ˌæp.əɹˈɪʃn̩/"}]},{"word":"BARRISTERS","idx":50493,"count":327600,"meanings":[{"definitions":[{"definition":"A lawyer with the right to speak and argue as an advocate in higher lawcourts."}],"partOfSpeech":"n"}]},{"word":"FERMION","idx":50495,"count":327592,"meanings":[{"definitions":[{"definition":"(Standard Model) Any elementary or composite particle that has half-integer spin and thus obeys Fermi–Dirac statistics and the Pauli exclusion principle (equivalently, a particle for which the wavefunction of any system of identical such particles changes sign whenever two are swapped); a baryon, a lepton or a quark; (slightly more loosely) any such particle or any composite particle composed of fermions.","example":"According to the spin–statistics theorem, the wavefunction of a system of identical fermions (particles of half-integer spin) is antisymmetric under the operation of swapping any two particles."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɜːmɪɒn/"}]},{"word":"INOPERABLE","idx":50499,"count":327514,"meanings":[{"definitions":[{"definition":"Incapable of being successfully surgically operated on."},{"definition":"Incapable of operation or function; inoperative."}],"partOfSpeech":"j"}]},{"word":"SCRUTINIZED","idx":50503,"count":327475,"meanings":[{"definitions":[{"definition":"To examine something with great care or detail, as to look for hidden or obscure flaws.","example":"to scrutinize the conduct or motives of individuals"},{"definition":"To audit accounts etc in order to verify them."}],"partOfSpeech":"ve"}]},{"word":"EARTHWORKS","idx":50504,"count":327472,"meanings":[{"definitions":[{"definition":"Any structure made from earth; especially an embankment or rampart used as a fortification."}],"partOfSpeech":"n"}]},{"word":"THRASHING","idx":50505,"count":327460,"meanings":[{"definitions":[{"definition":"To beat mercilessly."},{"definition":"To defeat utterly."},{"definition":"To thresh."},{"definition":"To move about wildly or violently; to flail; to labour."},{"definition":"To extensively test a software system, giving a program various inputs and observing the behavior and outputs that result."},{"definition":"In computer architecture, to cause poor performance of a virtual memory (or paging) system."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Action of the verb to thrash.","example":"the thrashings of a fish on a hook"},{"definition":"A beating, especially a severe one."},{"definition":"A heavy defeat."},{"definition":"Excessive paging within virtual storage."},{"definition":"Slam dancing."},{"definition":"Threshing. (of cereal crop, etc)"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"thrashing-au","text":"/ˈθɹæʃɪŋ/"}]},{"word":"CYCLONIC","idx":50510,"count":327430,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or resembling a cyclone."},{"definition":"Rotating in the same direction as the Earth i.e. anticlockwise in the Northern Hemisphere and clockwise in the Southern Hemisphere."}],"partOfSpeech":"j"}]},{"word":"UNSUBSCRIBING","idx":50512,"count":327393,"meanings":[{"definitions":[{"definition":"To cancel a subscription, especially to an online service.","example":"How do I unsubscribe from your mailing list?"}],"partOfSpeech":"ve"}]},{"word":"PINYIN","idx":50514,"count":327377,"meanings":[{"definitions":[{"definition":"A phonetic script or romanization system for a language spoken in the People's Republic of China."}],"partOfSpeech":"n"},{"definitions":[{"definition":"A system of romanization for Standard Mandarin, used in the People’s Republic of China, and more recently in other Chinese-speaking areas as well."},{"definition":"A Grassfields Bantu language of Cameroon."}],"partOfSpeech":"pn"}]},{"word":"THUMPING","idx":50515,"count":327373,"meanings":[{"definitions":[{"definition":"To hit (someone or something) as if to make a thump."},{"definition":"To cause to make a thumping sound.","example":"The cat thumped its tail in irritation."},{"definition":"To thud or pound."},{"definition":"To throb with a muffled rhythmic sound.","example":"Dance music thumped from the nightclub entrance."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A dull, heavy sound."},{"definition":"A beating.","example":"He received a thumping from the school bully."},{"definition":"A heavy defeat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Exceptional in some degree."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈθʌmpɪŋ/"}]},{"word":"TEIN","idx":50522,"count":327323,"meanings":[{"definitions":[{"definition":"A currency unit of Uzbekistan, one hundredth of a som."},{"definition":"A former currency unit of Kazakhstan, one hundredth of a tenge."}],"partOfSpeech":"n"}]},{"word":"EUGENICS","idx":50526,"count":327257,"meanings":[{"definitions":[{"definition":"A social philosophy or practice which advocates the improvement of human hereditary qualities through selective breeding, either by encouraging people with good genetic qualities to reproduce (positive eugenics), or discouraging people with bad genetic qualities from reproducing (negative eugenics), or by technological means."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/juːˈdʒɛnɪks/"}]},{"word":"DUSTJACKET","idx":50527,"count":327234,"meanings":[{"definitions":[{"definition":"The detachable paper cover of a book; used to protect the binding, and to provide blurb."}],"partOfSpeech":"n"}]},{"word":"QUENCHING","idx":50528,"count":327230,"meanings":[{"definitions":[{"definition":"To satisfy, especially an actual or figurative thirst.","example":"The library quenched her thirst for knowledge."},{"definition":"To extinguish or put out (as a fire or light)."},{"definition":"To cool rapidly by dipping into a bath of coolant, as a blacksmith quenching hot iron.","example":"The swordsmith quenched the sword in an oil bath so that it wouldn't shatter."},{"definition":"To terminate or greatly diminish (a chemical reaction) by destroying or deforming the remaining reagents."},{"definition":"To rapidly change the parameters of a physical system."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The extinction of any of several physical properties."},{"definition":"The rapid cooling of a hot metal object, by placing it in a liquid, in order to harden it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkwɛntʃ.ɪŋ/"}]},{"word":"HUNCH","idx":50531,"count":327195,"meanings":[{"definitions":[{"definition":"A hump; a protuberance."},{"definition":"A stooped or curled posture; a slouch.","example":"The old man walked with a hunch."},{"definition":"A theory, idea, or guess; an intuitive impression that something will happen.","example":"I have a hunch they'll find a way to solve the problem."},{"definition":"A hunk; a lump; a thick piece.","example":"a hunch of bread"},{"definition":"A push or thrust, as with the elbow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bend the top of one's body forward while raising one's shoulders.","example":"Don't hunch over your computer if you want to avoid neck problems."},{"definition":"To raise (one's shoulders) (while lowering one's head or bending the top of one's body forward); to curve (one's body) forward (sometimes followed by up).","example":"He hunched up his shoulders and stared down at the ground."},{"definition":"To walk (somewhere) while hunching one's shoulders."},{"definition":"To thrust a hump or protuberance out of (something); to crook, as the back."},{"definition":"To push or jostle with the elbow; to push or thrust against (someone)."},{"definition":"To have a hunch, or make an intuitive guess."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hunch-us","text":"/hʌntʃ/"}]},{"word":"AMARYLLIS","idx":50533,"count":327190,"meanings":[{"definitions":[{"definition":"The belladonna lily, Amaryllis belladonna, native to South Africa."},{"definition":"A similar lily in genus Hippeastrum, such as Hippeastrum puniceum, and cultivars."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌæməˈɹɪlɪs/"}]},{"word":"SANDPAPER","idx":50534,"count":327174,"meanings":[{"definitions":[{"definition":"A strong paper coated with sand, ground glass, or other abrasive material for smoothing and polishing."},{"definition":"A sheet of such paper."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To polish or grind (a surface) with or as if with sandpaper."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sandpaper-us","text":"/ˈsændˌpeɪpɚ/"}]},{"word":"MESSES","idx":50535,"count":327162,"meanings":[{"definitions":[{"definition":"A disagreeable mixture or confusion of things; hence, a situation resulting from blundering or from misunderstanding; disorder.","example":"He made a mess of it."},{"definition":"A large quantity or number.","example":"My boss dumped a whole mess of projects on my desk today."},{"definition":"Excrement.","example":"Parked under a tree, my car was soon covered in birds' mess."},{"definition":"A person in a state of (especially emotional) turmoil or disarray; an emotional wreck.","example":"Between the pain and the depression, I'm a mess."},{"definition":"Mass; a church service."},{"definition":"A quantity of food set on a table at one time; provision of food for a person or party for one meal; also, the food given to an animal at one time.","example":"A mess of pottage."},{"definition":"A number of persons who eat together, and for whom food is prepared in common, especially military personnel who eat at the same table.","example":"the wardroom mess"},{"definition":"A building or room in which mess is eaten."},{"definition":"A set of four (from the old practice of dividing companies into sets of four at dinner)."},{"definition":"The milk given by a cow at one milking."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(transitive, often used with \"up\") To make untidy or dirty."},{"definition":"(transitive, often used with \"up\") To throw into disorder or to ruin."},{"definition":"To interfere.","example":"This doesn't concern you. Don't mess."},{"definition":"(used with \"with\") To screw around with, to bother, to be annoying to.","example":"Stop messing with me!"},{"definition":"To take meals with a mess."},{"definition":"To belong to a mess."},{"definition":"To eat (with others).","example":"I mess with the wardroom officers."},{"definition":"To supply with a mess."}],"partOfSpeech":"ve"}]},{"word":"PERDITION","idx":50537,"count":327117,"meanings":[{"definitions":[{"definition":"Eternal damnation."},{"definition":"Hell."},{"definition":"Absolute ruin."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"perdition-us","text":"/pɜː(ɹ).ˈdɪ.ʃən/"}]},{"word":"WINTERING","idx":50540,"count":327078,"meanings":[{"definitions":[{"definition":"To spend the winter (in a particular place).","example":"When they retired, they hoped to winter in Florida."},{"definition":"To store something (for instance animals) somewhere over winter to protect it from cold."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of staying at a place throughout the winter."}],"partOfSpeech":"n"}]},{"word":"TOPPLE","idx":50542,"count":327077,"meanings":[{"definitions":[{"definition":"To push, throw over, overturn or overthrow something","example":"The massed crowds toppled the statue of the former dictator."},{"definition":"To totter and fall, or to lean as if about to do so","example":"The pile of pennies began to topple."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtɑpl̩/"},{"text":"/ˈtɒpl̩/"}]},{"word":"HARDINESS","idx":50544,"count":327073,"meanings":[{"definitions":[{"definition":"The quality of being hardy."},{"definition":"Hardship; fatigue."}],"partOfSpeech":"n"}]},{"word":"PHEW","idx":50546,"count":327052,"meanings":[{"definitions":[{"definition":"Used to express relief of tension, fatigue, or surprise.","example":"Phew, that took a long time to cook!"},{"definition":"Used to show disgust.","example":"Phew, it stinks in here!"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"phew-uk","text":"/fjuː/"}]},{"word":"JOHNSONS","idx":50550,"count":327016,"meanings":[{"definitions":[{"definition":"Penis."}],"partOfSpeech":"n"}]},{"word":"PUNGENT","idx":50551,"count":327011,"meanings":[{"definitions":[{"definition":"Having a strong odor that stings the nose, said especially of acidic or spicy substances.","example":"I accidentally dropped the bottle of ammonia and after few seconds, a very pungent stench could be detected."},{"definition":"Having a strong taste that stings the tongue, said especially of hot (spicy) food, which has a strong and sharp or bitter taste."},{"definition":"Stinging; acerbic.","example":"The critic gave a pungent review."},{"definition":"Having a sharp and stiff point."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pungent-us","text":"/ˈpʌndʒənt/"}]},{"word":"CARBONATED","idx":50555,"count":326985,"meanings":[{"definitions":[{"definition":"Containing carbon dioxide gas under pressure, especially pertaining to beverages, as natural mineral water or man-made drinks."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"carbonated-us","text":"/ˈkɑɹ.bəˌneɪ.təd/"}]},{"word":"WAIVES","idx":50556,"count":326966,"meanings":[{"definitions":[{"definition":"To relinquish (a right etc.); to give up claim to; to forego.","example":"If you waive the right to be silent, anything you say can be used against you in a court of law."},{"definition":"To put aside, avoid."},{"definition":"To outlaw (someone)."},{"definition":"To abandon, give up (someone or something)."},{"definition":"To move from side to side; to sway."},{"definition":"To stray, wander."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A woman put out of the protection of the law; an outlawed woman."},{"definition":"A waif; a castaway."}],"partOfSpeech":"n"}]},{"word":"WRAPAROUND","idx":50557,"count":326949,"meanings":[{"definitions":[{"definition":"A garment that is wrapped around the body and tied."},{"definition":"A label or advertising display that wraps around a container."},{"definition":"A segment where material featuring one person (such as a reporter) is introduced and concluded by another person."},{"definition":"An extension to a property that combines side and rear extensions."},{"definition":"Word wrap, the word processing feature that moves text on to the next line if it will not fit on the current one."},{"definition":"Wrapping of numerical value in case of underflow or overflow","example":"In C# the addition of integers is unchecked, so wraparound occurs if the resulting value is beyond the representable range."},{"definition":"A form of mortgage in which the seller of a property extends to the buyer a junior mortgage which exists in addition to any superior mortgages already secured on the property. The seller accepts a secured promissory note from the buyer for the amount due on the underlying mortgage plus an amount up to the remaining purchase-money balance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of clothing) designed to be wrapped around the body and tied"},{"definition":"(of windows, lenses, etc.) that extends around a corner or bend"},{"definition":"Serving to surround or bookend something else."}],"partOfSpeech":"j"}]},{"word":"REBOOTS","idx":50560,"count":326915,"meanings":[{"definitions":[{"definition":"An instance of rebooting."},{"definition":"The restarting of a series' storyline, discarding all previous continuity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To execute a computer's boot process, effectively resetting the computer and causing the operating system to reload, possibly after a system failure.","example":"The system reboots every weekend after updates are installed."},{"definition":"To start afresh.","example":"They rebooted the TV series, but it's even worse than the original."},{"definition":"Restart; to return to a an initial configuration or state."}],"partOfSpeech":"ve"}]},{"word":"HEADLINER","idx":50561,"count":326915,"meanings":[{"definitions":[{"definition":"The headlining band or performer at a concert or similar event; the best-known and first billed musician, comedian, etc., often performing as the final act of the evening."},{"definition":"The interior fabric covering the roof of a vehicle."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɛdˌlaɪnɚ/"}]},{"word":"UNBRIDLED","idx":50562,"count":326894,"meanings":[{"definitions":[{"definition":"To remove the bridle, and other tack, from (a horse or other animal)."},{"definition":"To remove restraint from.","example":"If we unbridle our greed and lust we will be nothing but animals."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not fitted with a bridle.","example":"an unbridled horse"},{"definition":"(by extension) Without restraint or limit.","example":"She jumped into the project with unbridled enthusiasm."}],"partOfSpeech":"j"}]},{"word":"SUPERPOSITION","idx":50567,"count":326837,"meanings":[{"definitions":[{"definition":"The placing of one thing on top of another."},{"definition":"The deposition of one stratum over another; the principle that in a series of sedimentary strata, the lower strata are the older."},{"definition":"The situation in quantum mechanics where two or more quantum states are added together (superposed) to yield another valid quantum state."}],"partOfSpeech":"n"}]},{"word":"SUPREMES","idx":50568,"count":326818,"meanings":[{"definitions":[{"definition":"To divide a citrus fruit into its segments, removing the skin, pith, membranes, and seeds."}],"partOfSpeech":"ve"}]},{"word":"FANZINE","idx":50570,"count":326796,"meanings":[{"definitions":[{"definition":"A magazine, normally produced by amateurs, intended for people who share a common interest"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfænˌziːn/"}]},{"word":"ASTROLOGER","idx":50571,"count":326787,"meanings":[{"definitions":[{"definition":"One who studies or practices astrology."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"astrologer","text":"/əˈstrɒl.ə.dʒə(ɹ)/"}]},{"word":"PURPORTEDLY","idx":50573,"count":326763,"meanings":[{"definitions":[{"definition":"Supposedly, putatively or reputedly"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/pə(ɹ)ˈpɔː(ɹ).təd.li/"}]},{"word":"DIETETICS","idx":50576,"count":326728,"meanings":[{"definitions":[{"definition":"The study of diet and nutrition in relation to health and disease."}],"partOfSpeech":"n"}]},{"word":"ASSEMBLES","idx":50577,"count":326725,"meanings":[{"definitions":[{"definition":"To put together.","example":"He assembled the model ship."},{"definition":"To gather as a group.","example":"The parents assembled in the school hall."},{"definition":"To translate from assembly language to machine code"}],"partOfSpeech":"ve"}]},{"word":"CHAIRWOMAN","idx":50583,"count":326676,"meanings":[{"definitions":[{"definition":"A female chairperson"},{"definition":"A charwoman"}],"partOfSpeech":"n"}]},{"word":"PETROCHEMICALS","idx":50584,"count":326670,"meanings":[{"definitions":[{"definition":"Any compound derived from petroleum or natural gas"}],"partOfSpeech":"n"}]},{"word":"TECHIES","idx":50588,"count":326549,"meanings":[{"definitions":[{"definition":"One who works with, or has an interest in, technology or computers."},{"definition":"A person who works on the technical side of events."}],"partOfSpeech":"n"}]},{"word":"DUT","idx":50591,"count":326522,"meanings":[{"definitions":[{"definition":"(Hartlepool) A snug woolly hat."},{"definition":"A woollen hat with a rim underneath made famous by the character Benny in ITV's Crossroads."}],"partOfSpeech":"n"}]},{"word":"RADISH","idx":50593,"count":326496,"meanings":[{"definitions":[{"definition":"A plant of the Brassicaceae family, Raphanus sativus or Raphanus raphanistrum subsp. sativus, having an edible root."},{"definition":"The root of this plant used as food. Some varieties are pungent and usually eaten raw in salads, etc., while others have a milder taste and are cooked."},{"definition":"With a distinguishing word: some other plant of the Raphanus genus or Brassicaceae family.","example":"rat-tail radish (Raphanus caudatus); wild radish (Raphanus raphanistrum)"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"radish-us","text":"/ˈɹædɪʃ/"}]},{"word":"MANIFESTLY","idx":50595,"count":326460,"meanings":[{"definitions":[{"definition":"In a manifest manner; obviously."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"manifestly-us","text":"/ˈmæn.ɪ.fɛst.li/"}]},{"word":"CHECKMATE","idx":50596,"count":326448,"meanings":[{"definitions":[{"definition":"The conclusive victory in a game of chess that occurs when an opponent's king is threatened with unavoidable capture."},{"definition":"(by extension) Any losing situation with no escape; utter defeat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put the king of an opponent into checkmate.","example":"That jerk checkmated me in four moves!"},{"definition":"(by extension) To place in a losing situation that has no escape."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Word called out by the victor when making a move that wins the game."},{"definition":"(by extension) Said when one has checkmated someone (placed them in a losing situation with no escape.)"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"checkmate-us","text":"/ˈt͡ʃɛkmeɪt/"}]},{"word":"STARLETS","idx":50600,"count":326410,"meanings":[{"definitions":[{"definition":"A young actress with a promising career ahead of her."},{"definition":"An accomplished and important supporting player in a sports team."},{"definition":"A small star."}],"partOfSpeech":"n"}]},{"word":"EMPHATIC","idx":50601,"count":326393,"meanings":[{"definitions":[{"definition":"An emphatic consonant."},{"definition":"A word or phrase adding emphasis, such as \"a lot\" or \"really\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Characterized by emphasis; forceful."},{"definition":"Stated with conviction.","example":"He gave me an emphatic no when I asked him out."},{"definition":"(grammar) Belonging to a set of English tense forms comprising the auxiliary verb do + an infinitive without to."},{"definition":"Belonging to a series of obstruent consonants in several Semitic languages that are distinguished from both voiced and voiceless consonants by a certain phonetic feature or features."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əmˈfætək/"}]},{"word":"AFICIONADO","idx":50605,"count":326331,"meanings":[{"definitions":[{"definition":"An amateur bullfighter."},{"definition":"A person who likes, knows about, and appreciates a particular interest or activity (originally bullfighting); a fan or devotee."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əfɪsjəˈnɑːdəʊ/"}]},{"word":"MOTIVATOR","idx":50606,"count":326314,"meanings":[{"definitions":[{"definition":"Agent noun of motivate; one who motivates."}],"partOfSpeech":"n"}]},{"word":"OUTGROWTH","idx":50611,"count":326263,"meanings":[{"definitions":[{"definition":"Anything that grows out of something else."},{"definition":"Excessive growth."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈaʊtˌɡroʊθ/"}]},{"word":"HOMEWARD","idx":50614,"count":326240,"meanings":[{"definitions":[{"definition":"Towards home.","example":"I am homeward bound."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Oriented towards home","example":"I caught a homeward bus."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"homeward-us","text":"/ˈhoʊmwɚd/"}]},{"word":"WITHERED","idx":50615,"count":326236,"meanings":[{"definitions":[{"definition":"To shrivel, droop or dry up, especially from lack of water."},{"definition":"To cause to shrivel or dry up."},{"definition":"To lose vigour or power; to languish; to pass away."},{"definition":"To become helpless due to emotion."},{"definition":"To make helpless due to emotion."},{"definition":"To go against, resist; oppose."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Shrivelled, shrunken or faded, especially due to lack of water."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"withered-us","text":"/ˈwɪðɚd/"}]},{"word":"SANDSTORM","idx":50616,"count":326232,"meanings":[{"definitions":[{"definition":"A strong wind carrying clouds of sand and dust through the air."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sandstorm-us"}]},{"word":"NAMEPLATE","idx":50619,"count":326181,"meanings":[{"definitions":[{"definition":"A plate or plaque inscribed with a name.","example":"the brass nameplate on the doctor's front door"},{"definition":"The masthead of a newspaper."}],"partOfSpeech":"n"}]},{"word":"BAITING","idx":50620,"count":326177,"meanings":[{"definitions":[{"definition":"To attract with bait; to entice."},{"definition":"To affix bait to a trap or a fishing hook or fishing line."},{"definition":"To set dogs on (an animal etc.) to bite or worry; to attack with dogs, especially for sport.","example":"to bait a bear with dogs;  to bait a bull"},{"definition":"To intentionally annoy, torment, or threaten by constant rebukes or threats; to harass."},{"definition":"To feed and water (a horse or other animal), especially during a journey."},{"definition":"(of a horse or other animal) To take food, especially during a journey."},{"definition":"(of a person) To stop to take a portion of food and drink for refreshment during a journey."},{"definition":"To flap the wings; to flutter as if to fly; or to hover, as a hawk when she stoops to her prey."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A bloodsport involving the act of worrying or tormenting a chained or confined animal by setting dogs upon it."},{"definition":"The act of luring, as into a trap."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbeɪtɪŋ/"}]},{"word":"SURRENDERING","idx":50621,"count":326176,"meanings":[{"definitions":[{"definition":"To give up into the power, control, or possession of another."},{"definition":"(by extension) To yield (a town, a fortification, etc.) to an enemy."},{"definition":"To give oneself up into the power of another, especially as a prisoner; to submit or give in.","example":"I surrender!"},{"definition":"To give up possession of; to yield; to resign.","example":"to surrender a right, privilege, or advantage"},{"definition":"To yield (oneself) to an influence, emotion, passion, etc.","example":"to surrender oneself to grief, to despair, to indolence, or to sleep"},{"definition":"To abandon (one's hand of cards) and recover half of the initial bet."},{"definition":"For a policyholder, to voluntarily terminate an insurance contract before the end of its term, usually with the expectation of receiving a surrender value."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of surrender."}],"partOfSpeech":"n"}]},{"word":"MOTHERING","idx":50624,"count":326147,"meanings":[{"definitions":[{"definition":"To give birth to or produce (as its female parent) a child. (Compare father.)"},{"definition":"To treat as a mother would be expected to treat her child; to nurture."},{"definition":"To cause to contain mother.","example":"mothered oil / vinegar / wine"},{"definition":"(of an alcohol) To develop mother."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The nurturing of a child by its mother."},{"definition":"The protective behaviour of a mother towards her child."},{"definition":"Nurturing or protective behaviour reminiscent of that performed by a literal mother."},{"definition":"Shortened form of a-mothering ; practice of visiting one's literal or figurative mother or mother church (compare Mothering Sunday)."}],"partOfSpeech":"n"}]},{"word":"CHRYSANTHEMUM","idx":50626,"count":326128,"meanings":[{"definitions":[{"definition":"Any of many flowering perennial plants, of the genus Chrysanthemum, native to China, that have showy radiate heads."}],"partOfSpeech":"n"}]},{"word":"RECONSTRUCTIONS","idx":50627,"count":326124,"meanings":[{"definitions":[{"definition":"A thing that has been reconstructed or restored to an earlier state."},{"definition":"The act of restoring something to an earlier state.","example":"The reconstruction of the medieval bridge began last year."},{"definition":"A result of an attempt to understand in detail how a certain result or event occurred.","example":"The detective's reconstruction of what happened that night is dubious."}],"partOfSpeech":"n"}]},{"word":"SUNSPOT","idx":50629,"count":326104,"meanings":[{"definitions":[{"definition":"A region on the sun's surface with a lower temperature than its surroundings and intense magnetic activity."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsʌnspɑt/"},{"text":"/ˈsʌnspɒt/"}]},{"word":"FLUORINE","idx":50631,"count":326084,"meanings":[{"definitions":[{"definition":"The chemical element (symbol F) with an atomic number of 9. It is the lightest of the halogens, a pale yellow-green, highly reactive gas that attacks all metals."},{"definition":"A single atom of this element.","example":"an octahedron of fluorines"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fluorine-us","text":"/ˈflɔːɹiːn/"}]},{"word":"RETYPE","idx":50633,"count":326058,"meanings":[{"definitions":[{"definition":"To re-enter (text) using a keyboard."}],"partOfSpeech":"ve"}]},{"word":"FORTIFICATION","idx":50634,"count":326057,"meanings":[{"definitions":[{"definition":"The act of fortifying; the art or science of fortifying places to strengthen defence against an enemy."},{"definition":"That which fortifies; especially, a work or works erected to defend a place against attack; a fortified place; a fortress; a fort; a castle."},{"definition":"An increase in effectiveness, as by adding ingredients."},{"definition":"A jagged pattern sometimes seen during an attack of migraine."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fortification-uk","text":"/ˌfɔː(ɹ)tɪfəˈkeɪʃən/"}]},{"word":"SPURT","idx":50641,"count":325911,"meanings":[{"definitions":[{"definition":"A brief gush, as of liquid spurting from an orifice or a cut/wound.","example":"a spurt of water; a spurt of blood"},{"definition":"Ejaculation of semen."},{"definition":"A shoot; a bud."},{"definition":"A moment, a short period of time."},{"definition":"A sudden brief burst of, or increase in, speed, effort, activity, emotion or development.","example":"The boss's visit prompted a brief spurt of activity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to gush out suddenly or violently in a stream or jet."},{"definition":"To rush from a confined place in a small stream or jet."},{"definition":"To make a strong effort for a short period of time.","example":"The bullion market spurted on Thursday."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/spɝt/"},{"text":"/spɜː(r)t/"},{"audio":"spurt-au"}]},{"word":"ELATION","idx":50642,"count":325901,"meanings":[{"definitions":[{"definition":"An exhilarating psychological state of pride and optimism."},{"definition":"A feeling of joy and pride."},{"definition":"A collineation that fixes all points on a line (called its axis) and all lines though a point on the axis (called its center)."}],"partOfSpeech":"n"}]},{"word":"CREATIONIST","idx":50644,"count":325885,"meanings":[{"definitions":[{"definition":"A proponent or supporter of creationism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to creationism."}],"partOfSpeech":"j"}]},{"word":"WTH","idx":50645,"count":325864,"meanings":[{"definitions":[{"definition":"Initialism of what the hell."},{"definition":"Initialism of what the heck."}],"partOfSpeech":"i"},{"definitions":[{"definition":"Against.","example":"He picked a fight with the class bully."},{"definition":"In the company of; alongside, close to; near to.","example":"He went with his friends."},{"definition":"In addition to; as an accessory to.","example":"She owns a motorcycle with a sidecar."},{"definition":"Used to indicate simultaneous happening, or immediate succession or consequence.","example":"Jim was listening to Bach with his eyes closed."},{"definition":"In support of.","example":"We are with you all the way."},{"definition":"In regard to.","example":"He was pleased with the outcome."},{"definition":"To denote the accomplishment of cause, means, instrument, etc; – sometimes equivalent to by.","example":"slain with robbers"},{"definition":"Using as an instrument; by means of.","example":"Find what you want instantly with our search engine."},{"definition":"Using as nourishment; more recently replaced by on."},{"definition":"Having, owning.","example":"It was small and bumpy, with a tinge of orange."},{"definition":"Affected by (a certain emotion or condition).","example":"He spoke with sadness in his voice."},{"definition":"Prompted by (a certain emotion).","example":"green with envy; flushed with success"}],"partOfSpeech":"pr"}]},{"word":"WAIL","idx":50646,"count":325861,"meanings":[{"definitions":[{"definition":"A prolonged cry, usually high-pitched, especially as of grief or anguish.","example":"She let out a loud, doleful wail."},{"definition":"Any similar sound as of lamentation; a howl.","example":"A bird's wail in the night."},{"definition":"A sound made by emergency vehicle sirens, contrasted with \"yelp\" which is higher-pitched and faster."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cry out, as in sorrow or anguish."},{"definition":"To weep, lament persistently or bitterly."},{"definition":"To make a noise like mourning or crying.","example":"The wind wailed and the rain streamed down."},{"definition":"To lament; to bewail; to grieve over.","example":"to wail one's death"},{"definition":"To perform with great liveliness and force."},{"definition":"To strike the skin in such a way as to produce a wale or welt."},{"definition":"To give a surface a texture of wales or welts."},{"definition":"To choose, select."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wail-us","text":"/weɪl/"}]},{"word":"ARTISTICALLY","idx":50647,"count":325860,"meanings":[{"definitions":[{"definition":"In an artistic manner."}],"partOfSpeech":"v"}]},{"word":"SETLIST","idx":50648,"count":325859,"meanings":[{"definitions":[{"definition":"A list of the songs to be played by a particular band or musical act for a particular show or tour."}],"partOfSpeech":"n"}]},{"word":"SCROLLBARS","idx":50649,"count":325853,"meanings":[{"definitions":[{"definition":"A graphical widget in the form of a horizontal or vertical bar, on the edges of a personal computer screen, that is used to move scrollable text or images."}],"partOfSpeech":"n"}]},{"word":"AMPICILLIN","idx":50653,"count":325791,"meanings":[{"definitions":[{"definition":"A broad-spectrum antibiotic having a beta-lactam structure."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æm.pɪ-sɪ-lɪn/"}]},{"word":"COWBELL","idx":50656,"count":325751,"meanings":[{"definitions":[{"definition":"The lead cow in a herd."},{"definition":"A leader; an influencer."},{"definition":"A bell worn by cows; sometimes with an ornate strap."},{"definition":"A musical instrument, typically found without a clapper.","example":"It's good, but it really needs more cowbell."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkaʊˌbɛl/"}]},{"word":"EPILEPTIC","idx":50660,"count":325674,"meanings":[{"definitions":[{"definition":"A person who has epilepsy."},{"definition":"A medicine for the cure of epilepsy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to epilepsy."},{"definition":"Of or relating to an epileptic or epileptics (epileptic people)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɛpɪˈlɛptɪk/"}]},{"word":"CRAG","idx":50663,"count":325657,"meanings":[{"definitions":[{"definition":"A rocky outcrop; a rugged steep rock or cliff."},{"definition":"A rough broken fragment of rock."},{"definition":"A partially compacted bed of gravel mixed with shells, of the Tertiary age."},{"definition":"The neck or throat."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"crag-1-uk","text":"/kɹæɡ/"}]},{"word":"FELLER","idx":50665,"count":325654,"meanings":[{"definitions":[{"definition":"A person who fells trees; a lumberjack"},{"definition":"A machine for felling trees."},{"definition":"A person who fells a seam."},{"definition":"An appliance to a sewing machine for felling a seam."},{"definition":"A colleague or partner."},{"definition":"A companion; a comrade."},{"definition":"A man without good breeding or worth; an ignoble or mean man."},{"definition":"An equal in power, rank, character, etc."},{"definition":"One of a pair, or of two things used together or suited to each other; a mate."},{"definition":"A person with common characteristics, being of the same kind, or in the same group.","example":"Roger and his fellow workers are to go on strike."},{"definition":"A male person; a man."},{"definition":"A person; an individual, male or female."},{"definition":"A rank or title in the professional world, usually given as \"Fellow\"."},{"definition":"(Aboriginal English) Used as a general intensifier"},{"definition":"A person who was a fellow attendee at one's school.","example":"I've lost touch with all my old schoolmates: I only see them at class reunions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a strong and cruel nature; eager and unsparing; grim; fierce; ruthless; savage.","example":"one fell swoop"},{"definition":"Strong and fiery; biting; keen; sharp; pungent"},{"definition":"Very large; huge."},{"definition":"Eager; earnest; intent."}],"partOfSpeech":"j"}]},{"word":"EARPIECE","idx":50667,"count":325640,"meanings":[{"definitions":[{"definition":"A speaker placed inside or held near to the ear.","example":"Holding the earpiece to my ear, I could hear him speaking clearly."},{"definition":"A receiver of a telephone to hold near to your ear."},{"definition":"The arm on a pair of glasses that hooks over the ear to hold them in place."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪɹpiːs/"},{"text":"/ˈɪəpiːs/"}]},{"word":"THYMIDINE","idx":50669,"count":325600,"meanings":[{"definitions":[{"definition":"The nucleoside consisting of a combination of deoxyribose and thymine"}],"partOfSpeech":"n"}]},{"word":"TRANCHE","idx":50672,"count":325549,"meanings":[{"definitions":[{"definition":"A slice, section or portion."},{"definition":"A distinct subdivision of a single policyholder's benefits, typically relating to separate premium increments."},{"definition":"A pension scheme's or scheme member's benefits relating to distinct accrual periods with different rules."},{"definition":"One of a set of classes or risk maturities that compose a multiple-class security, such as a CMO or REMIC; a class of bonds. Collateralized mortgage obligations are structured with several tranches of bonds that have various maturities."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide into tranches."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɹæntʃ/"},{"text":"/tɹɑːnʃ/"}]},{"word":"ENMITY","idx":50673,"count":325547,"meanings":[{"definitions":[{"definition":"The quality of being an enemy; hostile or unfriendly disposition."},{"definition":"A state or feeling of opposition, hostility, hatred or animosity."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"enmity-us","text":"/ˈɛn.mɪ.tiː/"}]},{"word":"SANCTUM","idx":50675,"count":325541,"meanings":[{"definitions":[{"definition":"A place set apart, as with a sanctum sanctorum; a sacred or private place; a private retreat or workroom."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sanctum-au","text":"/ˈsæŋktəm/"}]},{"word":"MAZES","idx":50676,"count":325527,"meanings":[{"definitions":[{"definition":"A labyrinth; a puzzle consisting of a complicated network of paths or passages, the aim of which is to find one's way."},{"definition":"Something made up of many confused or conflicting elements; a tangle."},{"definition":"Confusion of thought; state of bewilderment."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmeɪzɪz/"}]},{"word":"UNCONSTRAINED","idx":50682,"count":325452,"meanings":[{"definitions":[{"definition":"Not constrained"}],"partOfSpeech":"j"}]},{"word":"SOUTER","idx":50684,"count":325436,"meanings":[{"definitions":[{"definition":"A shoemaker or cobbler."}],"partOfSpeech":"n"}]},{"word":"OSTEOPATHY","idx":50689,"count":325384,"meanings":[{"definitions":[{"definition":"The branch of therapy based on manipulation of bones and muscles."},{"definition":"Any disease of the bones."}],"partOfSpeech":"n"}]},{"word":"MATERIALISTIC","idx":50695,"count":325282,"meanings":[{"definitions":[{"definition":"Being overly concerned with material possessions and wealth."},{"definition":"Of or concerning philosophical materialism."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/məˌtɪəɹ.i.əˈlɪs.tɪk/"}]},{"word":"ROOFTOPS","idx":50698,"count":325268,"meanings":[{"definitions":[{"definition":"(somewhat formal) The area atop a roof."},{"definition":"The top layer of a roof; the material covering or composing a roof."}],"partOfSpeech":"n"}]},{"word":"DISCOURAGES","idx":50700,"count":325266,"meanings":[{"definitions":[{"definition":"To extinguish the courage of; to dishearten; to depress the spirits of; to deprive of confidence; to deject.","example":"Don't be discouraged by the amount of work left to do: you'll finish it in good time."},{"definition":"To persuade somebody not to do (something)."}],"partOfSpeech":"ve"}]},{"word":"BOATER","idx":50702,"count":325221,"meanings":[{"definitions":[{"definition":"Someone who travels by boat."},{"definition":"One who works on a boat, especially as captain."},{"definition":"A straw hat, very stiff, with a flat brim and crown."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"boater-us","text":"/ˈboʊ.tɚ/"}]},{"word":"WEIRDO","idx":50704,"count":325197,"meanings":[{"definitions":[{"definition":"A strange, odd, eccentric person."},{"definition":"An insane, possibly dangerous person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"weirdo-us","text":"/ˈwɪəɹdoʊ/"}]},{"word":"CONGRESSWOMAN","idx":50705,"count":325193,"meanings":[{"definitions":[{"definition":"A female member of congress"},{"definition":"A female member of the House of Representatives"}],"partOfSpeech":"n"}]},{"word":"DALEK","idx":50706,"count":325189,"meanings":[{"definitions":[{"definition":"A member of a species of extraterrestrial cyborg mutants who appear in the television programme Doctor Who and are known for travelling in metallic shells, having monotone, mechanically distorted voices, repeating a limited number of phrases, and being bent on exterminating other beings mercilessly."},{"definition":"One who is dogmatic, unfeeling and determined."}],"partOfSpeech":"n"}]},{"word":"TASS","idx":50707,"count":325180,"meanings":[{"definitions":[{"definition":"A heap, pile."},{"definition":"A cup or cupful."},{"definition":"A piece of armor for the thighs, forming an appendage to the ancient corselet. Usually the tasse was a plate of iron swinging from the cuirass, but the skirts of sliding splints were also called by this name."},{"definition":"An Oriental silk fabric, with gold or silver thread."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tæs/"}]},{"word":"REPERFUSION","idx":50713,"count":325111,"meanings":[{"definitions":[{"definition":"The restoration of blood flow to an organ, after it was cut off (e.g. in an operation)."}],"partOfSpeech":"n"}]},{"word":"FIELDHOUSE","idx":50714,"count":325101,"meanings":[{"definitions":[{"definition":"A tent."},{"definition":"A large building for indoor sports, particularly at colleges."},{"definition":"A building for equipment storage and changing rooms (locker rooms) by an outdoor sports field."}],"partOfSpeech":"n"}]},{"word":"MONG","idx":50718,"count":325059,"meanings":[{"definitions":[{"definition":"A mingling, mixture, or crowd."},{"definition":"A muddle or confusion."},{"definition":"A mongrel dog."},{"definition":"A person with Down's syndrome."},{"definition":"A stupid person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"An aphetic form of among"}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"mong-1-uk","text":"/ˈmʌŋ/"}]},{"word":"HOMEWARE","idx":50719,"count":325044,"meanings":[{"definitions":[{"definition":"Homewares"}],"partOfSpeech":"n"}]},{"word":"FARTS","idx":50723,"count":325011,"meanings":[{"definitions":[{"definition":"An emission of digestive gases from the anus; a flatus."},{"definition":"(impolite) An irritating person; a fool."},{"definition":"(impolite, potentially offensive) (usually as \"old fart\") An elderly person; especially one perceived to hold old-fashioned views."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(impolite) To emit digestive gases from the anus; to flatulate."},{"definition":"(usually as \"fart around\") To waste time with idle and inconsequential tasks; to go about one's activities in a lackadaisical manner; to be lazy or over-relaxed in one's manner or bearing."},{"definition":"To emit (fumes, gases, etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"farts-us","text":"/fɑːɹts/"}]},{"word":"ONCOMING","idx":50730,"count":324940,"meanings":[{"definitions":[{"definition":"To arrive; come to; come on."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Approach, onset"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Approaching; coming closer","example":"Look carefully before pulling out into oncoming traffic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"oncoming-us"}]},{"word":"RACKED","idx":50733,"count":324889,"meanings":[{"definitions":[{"definition":"To place in or hang on a rack."},{"definition":"To torture (someone) on the rack."},{"definition":"To cause (someone) to suffer pain."},{"definition":"To stretch or strain; to harass, or oppress by extortion."},{"definition":"To put the balls into the triangular rack and set them in place on the table."},{"definition":"To strike a male in the testicles."},{"definition":"To (manually) load (a round of ammunition) from the magazine or belt into firing position in an automatic or semiautomatic firearm."},{"definition":"To move the slide bar on a shotgun in order to chamber the next round."},{"definition":"To wash (metals, ore, etc.) on a rack."},{"definition":"To bind together, as two ropes, with cross turns of yarn, marline, etc."},{"definition":"(structural engineering) Tending to shear a structure (that is, force it to move in different directions at different points).","example":"Post-and-lintel construction racks easily."},{"definition":"To stretch a person's joints."},{"definition":"To drive; move; go forward rapidly; stir"},{"definition":"To fly, as vapour or broken clouds"},{"definition":"To clarify, and thereby deter further fermentation of, beer, wine or cider by draining or siphoning it from the dregs."},{"definition":"(of a horse) To amble fast, causing a rocking or swaying motion of the body; to pace."}],"partOfSpeech":"ve"}]},{"word":"KNOCKOFFS","idx":50737,"count":324869,"meanings":[{"definitions":[{"definition":"An imitation of something, particularly a well-known product, usually lower in quality and price than the original.","example":"It's not a name-brand bag; it's just a cheap knockoff."},{"definition":"A device in a knitting machine to remove loops from the needles."}],"partOfSpeech":"n"}]},{"word":"CLOISTER","idx":50739,"count":324868,"meanings":[{"definitions":[{"definition":"A covered walk with an open colonnade on one side, running along the walls of buildings that face a quadrangle; especially:"},{"definition":"A place, especially a monastery or convent, devoted to religious seclusion."},{"definition":"The monastic life."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become a Roman Catholic religious."},{"definition":"To confine in a cloister, voluntarily or not."},{"definition":"To deliberately withdraw from worldly things."},{"definition":"To provide with a cloister or cloisters.","example":"The architect cloistered the college just like the monastery which founded it."},{"definition":"To protect or isolate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cloister-us","text":"/ˈklɔɪstɚ/"}]},{"word":"HYGIENIST","idx":50741,"count":324862,"meanings":[{"definitions":[{"definition":"A person skilled in hygienics, but especially a dental assistant who cleans teeth etc"}],"partOfSpeech":"n"}]},{"word":"QUIDDITCH","idx":50743,"count":324834,"meanings":[{"definitions":[{"definition":"A fictional ball game played between two teams of seven players riding flying broomsticks, using four balls and six elevated ring-shaped goals."},{"definition":"(by extension) Muggle Quidditch"}],"partOfSpeech":"n"}]},{"word":"STAPLED","idx":50747,"count":324757,"meanings":[{"definitions":[{"definition":"To sort according to its staple.","example":"to staple cotton"},{"definition":"To secure with a staple."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fastened with staples.","example":"a stapled document"},{"definition":"(in combination) Having a specified kind of staple.","example":"Gossypium barbadense is a fine long-stapled variety of cotton."}],"partOfSpeech":"j"}]},{"word":"BUTTERNUT","idx":50749,"count":324726,"meanings":[{"definitions":[{"definition":"A North American walnut tree, Juglans cinerea."},{"definition":"The wood or bark of this walnut tree."},{"definition":"The nut of this walnut tree."},{"definition":"A dye made from the fruit of this walnut tree."},{"definition":"The souari nut."},{"definition":"(informal outside South Africa) Butternut squash.","example":"He made a delicious butternut soup."}],"partOfSpeech":"n"}]},{"word":"FANCIED","idx":50751,"count":324708,"meanings":[{"definitions":[{"definition":"Imagined.","example":"The plant was named for its fancied resemblance to a Roman spear."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To appreciate without jealousy or greed.","example":"I fancy your new car, but I like my old one just fine."},{"definition":"Would like","example":"Do you fancy going to town this weekend?"},{"definition":"To be sexually attracted to.","example":"I fancy that girl over there."},{"definition":"To imagine, suppose.","example":"Fancy meeting you here!"},{"definition":"To form a conception of; to portray in the mind."},{"definition":"To have a fancy for; to like; to be pleased with, particularly on account of external appearance or manners."},{"definition":"To breed (animals) as a hobby."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fancied-us","text":"/ˈfæn.sid/"}]},{"word":"SPOILT","idx":50755,"count":324636,"meanings":[{"definitions":[{"definition":"To strip (someone who has been killed or defeated) of their arms or armour."},{"definition":"To strip or deprive (someone) of their possessions; to rob, despoil."},{"definition":"To plunder, pillage (a city, country etc.)."},{"definition":"To carry off (goods) by force; to steal."},{"definition":"To ruin; to damage (something) in some way making it unfit for use."},{"definition":"To ruin the character of, by overindulgence; to coddle or pamper to excess."},{"definition":"Of food, to become bad, sour or rancid; to decay.","example":"Make sure you put the milk back in the fridge, otherwise it will spoil."},{"definition":"To render (a ballot paper) invalid by deliberately defacing it."},{"definition":"To reveal the ending or major events of (a story etc.); to ruin (a surprise) by exposing it ahead of time."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having lost its original value"},{"definition":"Of food, that has deteriorated to the point of no longer being usable or edible."},{"definition":"(of a person, usually a child) Having a selfish or greedy character, especially due to pampering"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"spoilt-uk","text":"/spɔɪlt/"}]},{"word":"PREDISPOSED","idx":50757,"count":324627,"meanings":[{"definitions":[{"definition":"To make someone susceptible to something (such as a disease)."},{"definition":"To make someone inclined to something in advance; to influence."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Inclined."},{"definition":"Made susceptible to."}],"partOfSpeech":"j"}]},{"word":"LOGOFF","idx":50763,"count":324577,"meanings":[{"definitions":[{"definition":"The process of logging off."}],"partOfSpeech":"n"}]},{"word":"COCKROACH","idx":50764,"count":324569,"meanings":[{"definitions":[{"definition":"A black or brown straight-winged insect of the order Blattodea."},{"definition":"A person or a member of a group of people regarded as undesirable and rapidly procreating."},{"definition":"(Rwanda) A Tutsi."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cockroach-us"}]},{"word":"STRODE","idx":50767,"count":324522,"meanings":[{"definitions":[{"definition":"To walk with long steps."},{"definition":"To stand with the legs wide apart; to straddle."},{"definition":"To pass over at a step; to step over."},{"definition":"To straddle; to bestride."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"strode-us","text":"/ˈstɹoʊd/"}]},{"word":"PLAYGROUP","idx":50769,"count":324515,"meanings":[{"definitions":[{"definition":"A group of children who meet together for supervised play."},{"definition":"A group of gamers who meet together, especially for role-playing games."}],"partOfSpeech":"n"}]},{"word":"DISORGANIZED","idx":50773,"count":324475,"meanings":[{"definitions":[{"definition":"To make less organized; to reduce to chaos.","example":"The arrival of her new baby would inevitably disorganize her life."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lacking order or organization; confused; chaotic."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪsˈɔːɡənaɪzd/"}]},{"word":"ETHNICITIES","idx":50774,"count":324470,"meanings":[{"definitions":[{"definition":"The common characteristics of a group of people, especially regarding ancestry, culture, language or national experiences."},{"definition":"An ethnic group."},{"definition":"(casual) Race; common ancestry."}],"partOfSpeech":"n"}]},{"word":"DISASSEMBLE","idx":50778,"count":324408,"meanings":[{"definitions":[{"definition":"To take to pieces; to reverse the process of assembly.","example":"To perform the repair it was necessary to disassemble most of the mechanism."},{"definition":"To convert machine code to a human-readable, mnemonic form."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪsəˈsɛmbəɫ/"}]},{"word":"LITTORAL","idx":50780,"count":324389,"meanings":[{"definitions":[{"definition":"A shore."},{"definition":"The zone of a coast between high tide and low tide levels."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to the shore, especially the seashore."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"littoral-uk","text":"/ˈlɪtəɹəl/"}]},{"word":"ANISE","idx":50784,"count":324336,"meanings":[{"definitions":[{"definition":"An umbelliferous plant (Pimpinella anisum) growing naturally in Egypt, and cultivated in Spain, Malta, etc., for its carminative and aromatic seeds, which are used as a spice. It has a licorice scent."},{"definition":"(often qualified as \"sweet anise\" or \"wild anise\") Fennel, Foeniculum vulgare."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æˈnis/"},{"text":"/ˈæn.ɪs/"},{"text":"/əˈnis/"}]},{"word":"GRAINY","idx":50785,"count":324326,"meanings":[{"definitions":[{"definition":"Resembling grains; granular."},{"definition":"Coarsely ground or gritty."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɹeɪni/"}]},{"word":"HOSPITALIZATIONS","idx":50786,"count":324324,"meanings":[{"definitions":[{"definition":"The hospitalizing of a patient, the condition of being hospitalized, or the period a patient stays in hospital."},{"definition":"Insurance that pays a patient's expenses."}],"partOfSpeech":"n"}]},{"word":"AGGRESSOR","idx":50788,"count":324310,"meanings":[{"definitions":[{"definition":"The person or country that first attacks or makes an aggression; that begins hostility or a quarrel; an assailant."}],"partOfSpeech":"n"}]},{"word":"GIGGLED","idx":50789,"count":324279,"meanings":[{"definitions":[{"definition":"To laugh gently or in a high-pitched voice; to laugh in a silly or giddy way.","example":"The jokes had them giggling like little girls all evening."}],"partOfSpeech":"ve"}]},{"word":"WALKABOUT","idx":50793,"count":324243,"meanings":[{"definitions":[{"definition":"(Australian aboriginal) A nomadic excursion into the bush, especially one taken by young teenage boys in certain ancient-custom honoring tribes."},{"definition":"A walking trip."},{"definition":"A public stroll by some celebrity to meet a group of people informally."},{"definition":"An absence, usually from a regular place with a possibility of a return."}],"partOfSpeech":"n"}]},{"word":"PEPPERONI","idx":50794,"count":324243,"meanings":[{"definitions":[{"definition":"A spicy salami-style Italian-American sausage."},{"definition":"Pizza with only tomato sauce, cheese and pepperoni toppings.","example":"Yo, Tony, gimme a slice of pepperoni and a coke."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɛpəˈɹoʊni/"}]},{"word":"OPTIMISING","idx":50795,"count":324243,"meanings":[{"definitions":[{"definition":"(originally intransitive) To act optimistically or as an optimist."},{"definition":"To make (something) optimal."},{"definition":"To make (something) more efficient, such as a computer program."},{"definition":"To become optimal."}],"partOfSpeech":"ve"}]},{"word":"BOATHOUSE","idx":50797,"count":324233,"meanings":[{"definitions":[{"definition":"A building at the edge of a river, lake or other body of water in which boats are kept."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈboʊtˌhaʊs/"}]},{"word":"CONSUMMATION","idx":50800,"count":324186,"meanings":[{"definitions":[{"definition":"The act of consummating, or the state of being consummated; the state of being completed; completion."},{"definition":"The first act of sexual intercourse in a relationship, particularly the first such act following marriage."},{"definition":"The achievement of perfection."},{"definition":"Termination; the end (as of the world or of life)."},{"definition":"The date at which the mortgagor becomes contractually obligated to the mortgagee in a real estate transaction."}],"partOfSpeech":"n"}]},{"word":"FRONTING","idx":50804,"count":324162,"meanings":[{"definitions":[{"definition":"To face (on, to); to be pointed in a given direction."},{"definition":"To face, be opposite to."},{"definition":"To face up to, to meet head-on, to confront."},{"definition":"To adorn the front of; to put on the front."},{"definition":"To pronounce with the tongue in a front position."},{"definition":"To move (a word or clause) to the start of a sentence."},{"definition":"To act as a front (for); to cover (for)."},{"definition":"To lead or be the spokesperson of (a campaign, organisation etc.)."},{"definition":"To provide money or financial assistance in advance to."},{"definition":"To assume false or disingenuous appearances."},{"definition":"To deceive or attempt to deceive someone with false or disingenuous appearances (on)."},{"definition":"To appear before.","example":"to front court"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A process whereby a vowel or a consonant is pronounced farther to the front of the vocal tract than some reference point."},{"definition":"A phonological relationship where a front vowel is found in place of a relative back vowel in an inflected form of a word."},{"definition":"An analogous relationship between the vowel sounds in a dialect of a language relative to the language standard or an earlier form of the language."},{"definition":"The movement of a word of phrase to nearer the beginning of a sentence or clause than it would usually appear, often for emphasis. May also occur as part of the standard syntax of particular constructions (e.g. wh-fronting)."},{"definition":"An act of putting on a false façade to impress people."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fronting-au","text":"/ˈfɹʌntɪŋ/"}]},{"word":"REFRESHINGLY","idx":50805,"count":324153,"meanings":[{"definitions":[{"definition":"In a refreshing manner.","example":"a refreshingly original film in which the villain defeated the hero"}],"partOfSpeech":"v"}]},{"word":"SCULPTURAL","idx":50808,"count":324114,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or having characteristics of sculpture.","example":"His sculptural work never gained the acclaim his paintings did."}],"partOfSpeech":"j"}]},{"word":"NEUROPHYSIOLOGY","idx":50809,"count":324113,"meanings":[{"definitions":[{"definition":"The branch of physiology that deals with the nervous system."}],"partOfSpeech":"n"}]},{"word":"ANNEXURE","idx":50814,"count":324077,"meanings":[{"definitions":[{"definition":"The process of annexing; annexation."},{"definition":"Something annexed."},{"definition":"An appendix or attachment to a document."}],"partOfSpeech":"n"}]},{"word":"UNFAITHFUL","idx":50823,"count":324015,"meanings":[{"definitions":[{"definition":"Not having religious faith."},{"definition":"Not keeping good faith; disloyal; not faithful."},{"definition":"Adulterous."},{"definition":"Not honest or upright."},{"definition":"Negligent or imperfect.","example":"The painting was an unfaithful rendering of its subject."},{"definition":"Not faithfully rendering the meaning of the source language; incorrect."}],"partOfSpeech":"j"}]},{"word":"OUTFLOWS","idx":50824,"count":324010,"meanings":[{"definitions":[{"definition":"The process of flowing out"}],"partOfSpeech":"n"}]},{"word":"SAAS","idx":50825,"count":324006,"meanings":[{"definitions":[{"definition":"A mother-in-law, especially the mother of the groom, who lives with the married couple."}],"partOfSpeech":"n"}]},{"word":"EXECUTIONER","idx":50826,"count":323995,"meanings":[{"definitions":[{"definition":"An official person who carries out the capital punishment of a criminal."},{"definition":"Executor."},{"definition":"A hit man, especially being in some organization."}],"partOfSpeech":"n"}]},{"word":"ASTHMATIC","idx":50827,"count":323982,"meanings":[{"definitions":[{"definition":"A person who suffers from asthma."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the characteristics of asthma, as in an \"asthmatic cough\"."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/æzˈmætɪk/"}]},{"word":"GUILLEMOT","idx":50828,"count":323971,"meanings":[{"definitions":[{"definition":"Any seabird belonging to the genera Uria and Cepphus of the auk family Alcidae. They have black and white bodies and are good at swimming and diving."}],"partOfSpeech":"n"}]},{"word":"REALIZATIONS","idx":50829,"count":323969,"meanings":[{"definitions":[{"definition":"The act of realizing."},{"definition":"The result of an artistic effort.","example":"The painter's realization of her concept was breathtaking."}],"partOfSpeech":"n"}]},{"word":"LINGUISTICALLY","idx":50830,"count":323966,"meanings":[{"definitions":[{"definition":"In the manner of linguistics."},{"definition":"From a linguistic perspective."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/lɪŋˈɡwɪstɪk(ə)li/"}]},{"word":"RECONSTITUTION","idx":50835,"count":323904,"meanings":[{"definitions":[{"definition":"The process or result of reconstituting"},{"definition":"Restoration, reconstruction"},{"definition":"The addition of water to dehydrated food"}],"partOfSpeech":"n"}]},{"word":"INTERVIEWEE","idx":50838,"count":323871,"meanings":[{"definitions":[{"definition":"Someone being interviewed, i.e. the person answering the questions."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɪn.tɚ.vjuːˈiː/"},{"text":"/ˌɪn.tə.vjuːˈiː/"}]},{"word":"TITULAR","idx":50843,"count":323843,"meanings":[{"definitions":[{"definition":"One who holds a title."},{"definition":"The person from whom a church takes its special name; distinguished from a patron, who must be canonized or an angel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, being, derived from, or having a title."},{"definition":"Existing in name only; nominal."},{"definition":"Named or referred to in the title."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɪtʃəlɚ/"},{"text":"/ˈtɪtjʊlə/"}]},{"word":"REBBE","idx":50844,"count":323839,"meanings":[{"definitions":[{"definition":"The spiritual leader of a Chassidic Jewish community."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹɛbi/"}]},{"word":"SWEARS","idx":50845,"count":323831,"meanings":[{"definitions":[{"definition":"To take an oath, to promise."},{"definition":"To use offensive, profane, or obscene language."},{"definition":"To be lazy; rest for a short while during working hours."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A swear word."}],"partOfSpeech":"n"}]},{"word":"PINUP","idx":50846,"count":323824,"meanings":[{"definitions":[{"definition":"A photograph, printed in a magazine or other publication, of a sexually attractive person (often nude or provocatively dressed), and intended to be removed and pinned up on a wall."},{"definition":"The person so depicted."},{"definition":"Figurehead, person who represents an idea, cause etc."}],"partOfSpeech":"n"}]},{"word":"DIMINUTIVE","idx":50847,"count":323818,"meanings":[{"definitions":[{"definition":"(grammar) A word form expressing smallness, youth, unimportance, or endearment.","example":"Booklet, the diminutive of book, means ‘small book’."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Very small."},{"definition":"Serving to diminish."},{"definition":"(grammar) Of or pertaining to, or creating a word form expressing smallness, youth, unimportance, or endearment."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"diminutive-us","text":"/dəˈmɪn.jə.tɪv/"}]},{"word":"TRANSCENDENCE","idx":50848,"count":323783,"meanings":[{"definitions":[{"definition":"The act of surpassing usual limits."},{"definition":"The state of being beyond the range of normal perception."},{"definition":"The state of being free from the constraints of the material world, as in the case of a deity."},{"definition":"Superior excellence; supereminence."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"transcendence-us","text":"/tɹæn(t)ˈsɛndəns/"}]},{"word":"SURAH","idx":50849,"count":323774,"meanings":[{"definitions":[{"definition":"Any of the 114 chapters of the Qur'an."},{"definition":"Soft twilled silk"}],"partOfSpeech":"n"}]},{"word":"STATISTICIANS","idx":50852,"count":323763,"meanings":[{"definitions":[{"definition":"A person who compiles, interprets, or studies statistics."},{"definition":"A mathematician with a specialty of statistics."}],"partOfSpeech":"n"}]},{"word":"SWATCHES","idx":50853,"count":323756,"meanings":[{"definitions":[{"definition":"A piece, pattern, or sample, generally of cloth or a similar material.","example":"He held a swatch of the wallpaper up to see if the colors would match the room."},{"definition":"A selection of such samples bound together."},{"definition":"A clump or portion of something."},{"definition":"A demonstration, an example, a proof."},{"definition":"A tag or other small object attached to another item as a means of identifying its owner; a tally; specifically the counterfoil of a tally."},{"definition":"A channel or passage of water between sandbanks, or between a sandbank and a seashore."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create a swatch, especially a sample of knitted fabric.","example":"Swatching is important in knitting to obtain the correct gauge."}],"partOfSpeech":"ve"}]},{"word":"PERIOPERATIVE","idx":50854,"count":323754,"meanings":[{"definitions":[{"definition":"Relating to the period around an operation, including immediate preoperative preparation and postoperative recovery."}],"partOfSpeech":"j"}]},{"word":"LILANGENI","idx":50857,"count":323703,"meanings":[{"definitions":[{"definition":"The currency of Swaziland."}],"partOfSpeech":"n"}]},{"word":"TRAPEZE","idx":50858,"count":323700,"meanings":[{"definitions":[{"definition":"A trapezium."},{"definition":"A swinging horizontal bar, suspended at each end by a rope; — used by gymnasts."},{"definition":"The trapezium bone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To swing on a trapeze"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɹəˈpiːz/"}]},{"word":"LEMMINGS","idx":50859,"count":323695,"meanings":[{"definitions":[{"definition":"A small Arctic and Subarctic rodent from any of six genera of similar rodents."},{"definition":"Any member of a group given to conformity or groupthink, especially a group poised to follow a leader off a cliff."}],"partOfSpeech":"n"}]},{"word":"EXTENTS","idx":50860,"count":323681,"meanings":[{"definitions":[{"definition":"A range of values or locations."},{"definition":"The space, area, volume, etc., to which something extends.","example":"The extent of his knowledge of the language is a few scattered words."},{"definition":"A contiguous area of storage in a file system."},{"definition":"The valuation of property."},{"definition":"A writ directing the sheriff to seize the property of a debtor, for the recovery of debts of record due to the Crown."}],"partOfSpeech":"n"}]},{"word":"SPAMS","idx":50861,"count":323676,"meanings":[{"definitions":[{"definition":"(rarely countable) Unsolicited bulk electronic messages.","example":"I get far too much spam."},{"definition":"Any undesired electronic content automatically generated for commercial purposes."},{"definition":"A type of tinned meat made mainly from ham."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send spam (i.e. unsolicited electronic messages.)"},{"definition":"To send spam (i.e. unsolicited electronic messages) to a person or entity."},{"definition":"(by extension) To use (a spell or ability) rapidly and repeatedly.","example":"Stop spamming that special attack!"},{"definition":"To post the same text repeatedly with disruptive effect; to flood."}],"partOfSpeech":"ve"}]},{"word":"SUNBIRD","idx":50864,"count":323631,"meanings":[{"definitions":[{"definition":"A bird belonging to any of several species in the family Nectariniidae."},{"definition":"A person, usually one who is retired, who travels from a warm climate to a colder one in the summer."}],"partOfSpeech":"n"}]},{"word":"CELLOPHANE","idx":50865,"count":323621,"meanings":[{"definitions":[{"definition":"Any of a variety of transparent plastic films, especially one made of processed cellulose."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wrap or package in cellophane."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cellophane-uk","text":"/ˈsɛləfeɪn/"}]},{"word":"PARING","idx":50866,"count":323609,"meanings":[{"definitions":[{"definition":"To remove the outer covering or skin of something with a cutting device, typically a knife","example":"Victor pared some apples in preparation to make a tart."},{"definition":"(often with down or back) to reduce, diminish or trim gradually something as if by cutting off","example":"Albert had to pare his options down by disregarding anything beyond his meager budget."},{"definition":"To trim the hoof of a horse"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A fragment or shaving that has been pared."},{"definition":"The cutting off of the surface of grassland for tillage."}],"partOfSpeech":"n"}]},{"word":"DAMNING","idx":50870,"count":323558,"meanings":[{"definitions":[{"definition":"To condemn to hell.","example":"I damn you eternally, fiend!"},{"definition":"To condemn; to declare guilty; to doom; to adjudge to punishment."},{"definition":"To put out of favor; to ruin; to label negatively.","example":"I’m afraid that if I speak out on this, I’ll be damned as a troublemaker."},{"definition":"To condemn as unfit, harmful, invalid, immoral or illegal."},{"definition":"To curse; put a curse upon.","example":"That man stole my wallet. Damn him!"},{"definition":"To invoke damnation; to curse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A condemnation."},{"definition":"An act of swearing with the word \"damn\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Condemning.","example":"damning evidence was clear for all to see"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdæmɪŋ/"}]},{"word":"CARDHOLDERS","idx":50871,"count":323533,"meanings":[{"definitions":[{"definition":"A case for holding cards, as credit cards, bankcards, or business cards."},{"definition":"An authorized user of a card used for financial transactions, etc."}],"partOfSpeech":"n"}]},{"word":"MATRIMONY","idx":50878,"count":323431,"meanings":[{"definitions":[{"definition":"Marriage; the state of being married."},{"definition":"The ceremony of marriage."},{"definition":"A particular solitaire card game using two decks of cards."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmætɹɪmoʊni/"},{"text":"/ˈmatɹɪməni/"}]},{"word":"HUMBUG","idx":50881,"count":323395,"meanings":[{"definitions":[{"definition":"A hoax, jest, or prank."},{"definition":"A fraud or sham (countable); hypocrisy (uncountable)."},{"definition":"A fraudster, cheat, or hypocrite."},{"definition":"Nonsense."},{"definition":"A type of hard sweet (candy), usually peppermint flavoured with a striped pattern."},{"definition":"Anything complicated, offensive, troublesome, unpleasant or worrying; a misunderstanding, especially if trivial."},{"definition":"(African American Vernacular) A fight."},{"definition":"(African American Vernacular) A gang."},{"definition":"A false arrest on trumped-up charges."},{"definition":"(Perhaps by extension) The piglet of the wild boar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play a trick on someone, to cheat, to swindle, to deceive."},{"definition":"(African American Vernacular) To fight; to act tough."},{"definition":"To waste time talking."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Balderdash!, nonsense!, rubbish!"}],"partOfSpeech":"i"}],"phonetics":[{"text":"/ˈhəmˌbəɡ/"},{"text":"/ˈhʌmbʌɡ/"},{"audio":"humbug-au"}]},{"word":"SIGNALLED","idx":50886,"count":323343,"meanings":[{"definitions":[{"definition":"To indicate; to convey or communicate by a signal."},{"definition":"To communicate with (a person or system) by a signal.","example":"Seeing the flames, he ran to the control room and signalled headquarters."}],"partOfSpeech":"ve"}]},{"word":"HYPERBARIC","idx":50890,"count":323299,"meanings":[{"definitions":[{"definition":"Of, relating to, or utilizing greater than normal pressure (as of oxygen)."}],"partOfSpeech":"j"}]},{"word":"GRANULATED","idx":50891,"count":323296,"meanings":[{"definitions":[{"definition":"To segment into tiny grains or particles."},{"definition":"To collect or be formed into grains.","example":"Cane juice granulates into sugar."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Formed into, or composed of granules"}],"partOfSpeech":"j"}]},{"word":"NANNOFOSSIL","idx":50892,"count":323268,"meanings":[{"definitions":[{"definition":"A nanosized fossil"}],"partOfSpeech":"n"}]},{"word":"BULLDOZER","idx":50894,"count":323263,"meanings":[{"definitions":[{"definition":"A tractor with an attached blade for pushing earth and building debris for coarse preliminary surface grading, demolishing building structures, etc."},{"definition":"One who bulldozes."},{"definition":"(chiefly in the plural) A member of a self-identified group of white US Southerners who colluded to influence outcomes of post-Reconstruction elections by intimidating, coercing and bullying black voters and legislators, including burning down houses and churches, flogging and murdering opponents."},{"definition":"(by extension) A bully; an overbearing individual."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bulldoze (push through forcefully)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbʊldoʊzɚ/"}]},{"word":"AILMENT","idx":50895,"count":323256,"meanings":[{"definitions":[{"definition":"Something which ails one; a disease; sickness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ailment-us","text":"/ˈeɪlmənt/"}]},{"word":"HOMELY","idx":50896,"count":323224,"meanings":[{"definitions":[{"definition":"Lacking in beauty or elegance, plain in appearance, physically unattractive."},{"definition":"Cozy, befitting a home."},{"definition":"Characteristic of or belonging to home; domestic."},{"definition":"On intimate or friendly terms with (someone); familiar; at home (with a person); intimate."},{"definition":"(of animals) Domestic; tame."},{"definition":"Personal; private."},{"definition":"Friendly; kind; gracious; cordial."},{"definition":"Conservative and family-oriented.","example":"I am seeking a beautiful homely girl for marriage."},{"definition":"Simple; plain; familiar; unelaborate; unadorned.","example":"a homely garment"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"homely-uk","text":"/ˈhəʊmli/"}]},{"word":"SUBPRIME","idx":50898,"count":323200,"meanings":[{"definitions":[{"definition":"A subprime loan."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Less than prime; inferior."},{"definition":"(now worldwide) Designating a loan (typically at a greater than usual rate of interest) offered to a borrower who is not qualified for other loans (for example, because of a poor credit history)."},{"definition":"Designating a type of commercial lending rate, less than the prime rate, offered to desirable borrowers."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsʌb.pɹaɪm/"},{"text":"/ˈsʌb.pɹʌɪm/"}]},{"word":"OVERPAYMENTS","idx":50899,"count":323189,"meanings":[{"definitions":[{"definition":"Payment exceeding the amount actually due.","example":"The employer sued to recover overpayment of wages."}],"partOfSpeech":"n"}]},{"word":"SHARPIE","idx":50900,"count":323182,"meanings":[{"definitions":[{"definition":"Accipiter striatus, the smallest hawk to reside in USA and Canada, which preys on songbirds."},{"definition":"An alert person."},{"definition":"A knowledgeable fisherman."},{"definition":"A swindler."},{"definition":"A long, narrow fishing boat used in shallow waters."},{"definition":"A member of a violent, fashionably dressed youth gang of the 1960s and 1970s."},{"definition":"A Sharpie or other brand of felt-tipped marker pen."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sharpie-au"}]},{"word":"PERPETUITY","idx":50904,"count":323119,"meanings":[{"definitions":[{"definition":"The quality or state of being perpetual; endless duration; uninterrupted existence."},{"definition":"Something that is perpetual."},{"definition":"A limitation intended to be unalterable and of indefinite duration; a disposition of property which attempts to make it inalienable beyond certain limits fixed or conceived as being fixed by the general law."},{"definition":"An annuity in which the periodic payments begin on a fixed date and continue indefinitely."}],"partOfSpeech":"n"}]},{"word":"STEPFATHER","idx":50905,"count":323082,"meanings":[{"definitions":[{"definition":"The husband of one's biological mother, other than one's biological father, especially following the divorce or death of the father."}],"partOfSpeech":"n"}]},{"word":"CURRIER","idx":50906,"count":323075,"meanings":[{"definitions":[{"definition":"A specialist in the leather processing industry, who dresses the leather by beating, rubbing, scraping and colouring."},{"definition":"One who grooms a horse with a curry comb."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkʌɹɪə/"}]},{"word":"TAPROOT","idx":50907,"count":323062,"meanings":[{"definitions":[{"definition":"A long, tapering root possessed by many plants (such as carrots and dandelions)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtæpˌɹuːt/"}]},{"word":"DISPROVE","idx":50910,"count":323054,"meanings":[{"definitions":[{"definition":"To prove to be false or erroneous; to confute; to refute."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪsˈpɹuːv/"}]},{"word":"URBANISM","idx":50914,"count":322984,"meanings":[{"definitions":[{"definition":"The study of cities, their geographic, economic, political, social and cultural environment."},{"definition":"The culture or way of life of people who live in cities."},{"definition":"Urbanization."},{"definition":"Urban planning."}],"partOfSpeech":"n"}]},{"word":"COLLOQUIA","idx":50915,"count":322950,"meanings":[{"definitions":[{"definition":"A colloquy; a meeting for discussion."},{"definition":"An academic meeting or seminar usually led by a different lecturer and on a different topic at each meeting."},{"definition":"An address to an academic meeting or seminar."},{"definition":"That part of the complaint or declaration in an action for defamation which shows that the words complained of were spoken concerning the plaintiff."}],"partOfSpeech":"n"}]},{"word":"INCURABLE","idx":50919,"count":322902,"meanings":[{"definitions":[{"definition":"One who cannot be cured."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of an illness, condition, etc, that is unable to be cured; healless."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɪnˈkjʊɹəbl/"},{"text":"/ˌɪnˈkjʊəɹəbl/"}]},{"word":"CAPILLARIES","idx":50920,"count":322891,"meanings":[{"definitions":[{"definition":"A narrow tube."},{"definition":"Any of the small blood vessels that connect arteries to veins."}],"partOfSpeech":"n"}]},{"word":"MOUNTAINSIDE","idx":50922,"count":322833,"meanings":[{"definitions":[{"definition":"The sloping side of a mountain."}],"partOfSpeech":"n"}]},{"word":"SHOVING","idx":50923,"count":322832,"meanings":[{"definitions":[{"definition":"To push, especially roughly or with force."},{"definition":"To move off or along by an act of pushing, as with an oar or pole used in a boat; sometimes with off."},{"definition":"(by ellipsis) To make an all-in bet."},{"definition":"To pass (counterfeit money)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who shoves.","example":"We were soon separated by the pushings and shovings of the crowd."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʃʌvɪŋ/"}]},{"word":"FURNISHES","idx":50924,"count":322828,"meanings":[{"definitions":[{"definition":"To provide a place with furniture, or other equipment."},{"definition":"To supply or give (something)."},{"definition":"To supply (somebody) with something."}],"partOfSpeech":"ve"}]},{"word":"MENTHOL","idx":50925,"count":322824,"meanings":[{"definitions":[{"definition":"A cyclic monoterpene alcohol; the major component of the essential oil of peppermint; used in pharmaceutical preparations as an antitussive and antipruritic agent, as a nasal decongestant, and in menthol cigarettes"},{"definition":"A menthol cigarette."}],"partOfSpeech":"n"}]},{"word":"BLACKOUTS","idx":50926,"count":322815,"meanings":[{"definitions":[{"definition":"A temporary loss of consciousness."},{"definition":"A temporary loss of memory."},{"definition":"An instance of censorship, especially a temporary one.","example":"media blackout"},{"definition":"A large-scale power failure, and resulting loss of electricity to consumers.","example":"\"The repairs at the Koeberg Power Station in the Western Cape were on schedule for completion in the third week of May. This follows huge blackouts related to the problems at the power supplier since November. Weekend Argus May 13/14 2006 p.5."},{"definition":"The mandatory blocking of all light emanating from buildings as imposed during World War II."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈblækaʊts/"}]},{"word":"EVES","idx":50928,"count":322799,"meanings":[{"definitions":[{"definition":"The day or night before, usually used for holidays, such as Christmas Eve."},{"definition":"Evening, night."},{"definition":"The period of time when something is just about to happen or to be introduced","example":"the eve of a scientific discovery"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/iːvz/"}]},{"word":"DRAGONFLIES","idx":50931,"count":322790,"meanings":[{"definitions":[{"definition":"An insect of the suborder Epiprocta or, more strictly, the infraorder Anisoptera, having four long transparent wings held perpendicular to a long body when perched."}],"partOfSpeech":"n"}]},{"word":"ANOINTING","idx":50934,"count":322763,"meanings":[{"definitions":[{"definition":"To smear or rub over with oil or an unctuous substance; also, to spread over, as oil."},{"definition":"To apply oil to or to pour oil upon, etc., as a sacred rite, especially for consecration."},{"definition":"To choose or nominate somebody for a leading or otherwise important position, especially formally or officially, or as an intended successor."},{"definition":"To mark somebody as an official ruler, especially a king or queen, as a part of a religious ceremony."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Anointment","example":"the anointings of Jesus"}],"partOfSpeech":"n"}]},{"word":"WEBZINE","idx":50939,"count":322703,"meanings":[{"definitions":[{"definition":"A magazine published on the World Wide Web."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɛbˌziːn/"}]},{"word":"PROPRANOLOL","idx":50941,"count":322694,"meanings":[{"definitions":[{"definition":"A synthetic compound which acts as a beta blocker and is used mainly in the treatment of cardiac arrhythmia."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɹoʊˈpɹæn.əˌlɔl/"},{"text":"/pɹəʊˈpɹæn.əl.ɒl/"}]},{"word":"INESCAPABLE","idx":50942,"count":322688,"meanings":[{"definitions":[{"definition":"Impossible (unable) to avoid or escape; not escapable."}],"partOfSpeech":"j"}]},{"word":"SWABS","idx":50943,"count":322684,"meanings":[{"definitions":[{"definition":"A small piece of soft, absorbent material, such as gauze, used to clean wounds, apply medicine, or take samples of body fluids. Often attached to a stick or wire to aid access."},{"definition":"A sample taken with a swab (piece of absorbent material)."},{"definition":"A piece of material used for cleaning or sampling other items like musical instruments or guns."},{"definition":"A mop, especially on a ship."},{"definition":"A sailor; a swabby."},{"definition":"A naval officer's epaulet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a swab on something, or clean something with a swab.","example":"swab the deck of a ship"}],"partOfSpeech":"ve"}]},{"word":"STRICTEST","idx":50944,"count":322647,"meanings":[{"definitions":[{"definition":"Strained; drawn close; tight.","example":"strict embrace"},{"definition":"Tense; not relaxed.","example":"strict fiber"},{"definition":"Exact; accurate; precise; rigorously particular.","example":"to keep strict watch"},{"definition":"Governed or governing by exact rules; observing exact rules; severe; rigorous.","example":"very strict in observing the Sabbath"},{"definition":"Rigidly interpreted; exactly limited; confined; restricted.","example":"to understand words in a strict sense"},{"definition":"Upright, or straight and narrow; — said of the shape of the plants or their flower clusters."},{"definition":"Severe in discipline.","example":"It was a very strict lesson."},{"definition":"Irreflexive; if the described object is defined to be reflexive, that condition is overridden and replaced with irreflexive."}],"partOfSpeech":"j"}]},{"word":"DOMICILED","idx":50945,"count":322638,"meanings":[{"definitions":[{"definition":"To have a domicile in a particular place.","example":"The answer depends on which state he was domiciled in at his death."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Living, residing or (of a company) based (in a particular place)."}],"partOfSpeech":"j"}]},{"word":"ABSORBANCE","idx":50946,"count":322619,"meanings":[{"definitions":[{"definition":"A logarithmic measure of the amount of light that is absorbed when passing through a substance; the capacity of a substance to absorb light of a given wavelength; optical density."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əbˈsɔɹ.bn̩s/"}]},{"word":"MINX","idx":50947,"count":322604,"meanings":[{"definitions":[{"definition":"A mink."}],"partOfSpeech":"n"}]},{"word":"LBW","idx":50948,"count":322603,"meanings":[{"definitions":[{"definition":"Lutheran Book of Worship (hymnal)"},{"definition":"An instance of a batsman being out due to the leg before wicket law."}],"partOfSpeech":"n"}]},{"word":"ECLIPSES","idx":50950,"count":322569,"meanings":[{"definitions":[{"definition":"An alignment of astronomical objects whereby one object comes between the observer (or notional observer) and another object, thus obscuring the latter."},{"definition":"Especially, an alignment whereby a planetary object (for example, the Moon) comes between the Sun and another planetary object (for example, the Earth), resulting in a shadow being cast by the middle planetary object onto the other planetary object."},{"definition":"A seasonal state of plumage in some birds, notably ducks, adopted temporarily after the breeding season and characterised by a dull and scruffy appearance."},{"definition":"Obscurity, decline, downfall"},{"definition":"An omission of words needed to fully express the sense of a phrase"},{"definition":"A line or dash used to show that text has been omitted"},{"definition":"(Irish grammar) A mutation of the initial sound of a word by which voiceless sounds become voiced, voiced stops become nasal consonants, and vowels acquire a prothetic nasal consonant: see Appendix:Irish mutations#Eclipsis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of astronomical bodies, to cause an eclipse.","example":"The Moon eclipsed the Sun."},{"definition":"To overshadow; to be better or more noticeable than."},{"definition":"(Irish grammar) To undergo eclipsis."}],"partOfSpeech":"ve"}]},{"word":"PRISE","idx":50951,"count":322565,"meanings":[{"definitions":[{"definition":"The cost required to gain possession of something."},{"definition":"The cost of an action or deed.","example":"I paid a high price for my folly."},{"definition":"Value; estimation; excellence; worth."},{"definition":"An enterprise or adventure."},{"definition":"That which is taken from another; something captured; a thing seized by force, stratagem, or superior power."},{"definition":"Anything captured by a belligerent using the rights of war; especially, property captured at sea in virtue of the rights of war, as a vessel."},{"definition":"An honour or reward striven for in a competitive contest; anything offered to be competed for, or as an inducement to, or reward of, effort."},{"definition":"That which may be won by chance, as in a lottery."},{"definition":"Anything worth striving for; a valuable possession held or in prospect."},{"definition":"A contest for a reward; competition."},{"definition":"A lever; a pry; also, the hold of a lever."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To force (open) with a lever; to pry."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɹaɪz/"}]},{"word":"MISDEMEANORS","idx":50954,"count":322549,"meanings":[{"definitions":[{"definition":"A crime usually punishable upon conviction by a small fine or by a short term of imprisonment. In the USA, misdemeanants usually are incarcerated in county jail for less than one year, but felons usually are incarcerated in state or federal prison for more than one year. Crimes which are punishable by large fines or by longer imprisonment are sometimes called felonies."}],"partOfSpeech":"n"}]},{"word":"CORNBREAD","idx":50957,"count":322505,"meanings":[{"definitions":[{"definition":"Bread made from cornmeal."}],"partOfSpeech":"n"}]},{"word":"APPENDIXES","idx":50959,"count":322496,"meanings":[{"definitions":[{"definition":"Something attached to something else; an attachment or accompaniment."},{"definition":"A text added to the end of a book or an article, containing additional information."},{"definition":"The vermiform appendix, an inner organ that can become inflamed."},{"definition":"Any process, prolongation or projection."}],"partOfSpeech":"n"}]},{"word":"SUPREMELY","idx":50961,"count":322466,"meanings":[{"definitions":[{"definition":"To the greatest, highest, or utmost degree.","example":"They were supremely confident at the beginning of the season."}],"partOfSpeech":"v"}]},{"word":"KEYNOTES","idx":50963,"count":322462,"meanings":[{"definitions":[{"definition":"The note on which a musical key is based; the tonic."},{"definition":"The main theme of a speech, a written work, or a conference."},{"definition":"A speech that sets the main theme of a conference or other gathering; a keynote speech or keynote address."}],"partOfSpeech":"n"}]},{"word":"SUBNETS","idx":50965,"count":322429,"meanings":[{"definitions":[{"definition":"The abstraction of a sequence."},{"definition":"A portion of a network that shares a network address in which each component is identified by a number."}],"partOfSpeech":"n"}]},{"word":"MENSCH","idx":50966,"count":322422,"meanings":[{"definitions":[{"definition":"A person (chiefly male) of strength, integrity and honor or compassion."},{"definition":"A gentleman."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mensch-uk","text":"/mɛn(t)ʃ/"}]},{"word":"HASTENED","idx":50968,"count":322417,"meanings":[{"definitions":[{"definition":"To move or act in a quick fashion."},{"definition":"To make someone speed up or make something happen quicker."},{"definition":"To cause some scheduled event to happen earlier."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hastened-us","text":"/ˈheɪsn̩d/"}]},{"word":"PERPETUATING","idx":50971,"count":322384,"meanings":[{"definitions":[{"definition":"To make perpetual; to preserve from extinction or oblivion."},{"definition":"To prolong the existence of."}],"partOfSpeech":"ve"}]},{"word":"FROGGY","idx":50972,"count":322368,"meanings":[{"definitions":[{"definition":"A frog."},{"definition":"A Frenchman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Froglike."},{"definition":"Suffering from a frog in one's throat; hoarse."},{"definition":"Inclined to fight; aggressive."},{"definition":"Energetic or strong."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɹɑɡi/"}]},{"word":"DECARBOXYLASE","idx":50973,"count":322349,"meanings":[{"definitions":[{"definition":"Any enzyme that catalyzes the hydrolysis of a carboxyl group, effectively removing carbon dioxide from a compound."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/diːkɑːˈbɒksɪleɪz/"}]},{"word":"PRIORITISE","idx":50976,"count":322325,"meanings":[{"definitions":[{"definition":"To arrange or list a group of things in order of priority or importance."},{"definition":"To rank something as having high priority."}],"partOfSpeech":"ve"}]},{"word":"BAGPIPE","idx":50979,"count":322308,"meanings":[{"definitions":[{"definition":"To play the bagpipes."},{"definition":"To lay (the mizzen) aback by bringing the sheet to the mizzen rigging."},{"definition":"To masturbate a person's penis in one's armpit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A musical wind instrument of Celtic origin, possessing a flexible bag inflated by bellows, a double-reed melody pipe and up to four drone pipes; any aerophone that produces sound using air from a reservoir to vibrate enclosed reeds.","example":"Bagpipes are traditionally played in most Celtic regions and many former parts of the British Empire."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbæɡˌpaɪp/"}]},{"word":"TERNS","idx":50980,"count":322293,"meanings":[{"definitions":[{"definition":"Any of various sea birds of the family Sternidae that are similar to gulls but are smaller and have a forked tail."},{"definition":"That which consists of, or pertains to, three things or numbers together."},{"definition":"A lottery prize resulting from the favourable combination of three numbers in the draw."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"terns-uk","text":"/ˈtɜː(ɹ)nz/"}]},{"word":"PROSTRATE","idx":50982,"count":322274,"meanings":[{"definitions":[{"definition":"To lie flat or face-down."},{"definition":"To throw oneself down in submission."},{"definition":"To cause to lie down, to flatten."},{"definition":"To overcome or overpower."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lying flat, face-down."},{"definition":"Emotionally devastated."},{"definition":"Physically incapacitated from environmental exposure or debilitating disease.","example":"He was prostrate from the extreme heat."},{"definition":"Trailing on the ground; procumbent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"prostrate-uk","text":"/ˈpɹɒstɹeɪt/"}]},{"word":"EXCITATORY","idx":50984,"count":322261,"meanings":[{"definitions":[{"definition":"Stimulating, exciting or causing excitation; excitative"}],"partOfSpeech":"j"}]},{"word":"PROVISIONALLY","idx":50989,"count":322209,"meanings":[{"definitions":[{"definition":"In a provisional way; temporarily."}],"partOfSpeech":"v"}]},{"word":"COCKED","idx":50990,"count":322191,"meanings":[{"definitions":[{"definition":"To lift the cock of a firearm or crossbow; to prepare (a gun or crossbow) to be fired."},{"definition":"To be prepared to be triggered by having the cock lifted.","example":"In the darkness, the gun cocked loudly."},{"definition":"To erect; to turn up."},{"definition":"To copulate with."},{"definition":"To turn or twist something upwards or to one side; to lift or tilt (e.g. headwear) boastfully.","example":"He cocked his hat jauntily."},{"definition":"To turn (the eye) obliquely and partially close its lid, as an expression of derision or insinuation."},{"definition":"To strut; to swagger; to look big, pert, or menacing."},{"definition":"To make a nestle-cock of, to pamper or spoil (of children)"},{"definition":"To form into piles."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Drunk"},{"definition":"(in combination) Having a specified form or penis or a specific number of penises","example":"The large-cocked man entered the dressing room."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kɑkt/"},{"text":"/kɒkt/"}]},{"word":"DRIBBLE","idx":50991,"count":322187,"meanings":[{"definitions":[{"definition":"Drool; saliva."},{"definition":"A weak, unsteady stream; a trickle."},{"definition":"A small amount of a liquid."},{"definition":"In sport(s), the act of moving (with) a ball by kicking or bouncing it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(basketball, soccer) In various ball games, to move (with) the ball, controlling its path by kicking or bouncing it repeatedly"},{"definition":"To let saliva drip from the mouth, to drool"},{"definition":"To fall in drops or an unsteady stream, to trickle"},{"definition":"To let something fall in drips."},{"definition":"To live or pass one's time in a trivial fashion."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dribble-us","text":"/ˈdɹɪ.b(ə)l/"}]},{"word":"RAGED","idx":50992,"count":322172,"meanings":[{"definitions":[{"definition":"To act or speak in heightened anger."},{"definition":"(sometimes figurative) To move with great violence, as a storm etc."},{"definition":"To enrage."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"raged-us"}]},{"word":"HARDWIRED","idx":50993,"count":322166,"meanings":[{"definitions":[{"definition":"To connect components by means of permanent electrical wires."},{"definition":"To implement a feature in hardware rather than in software so that it cannot easily be changed."},{"definition":"(by extension) To make a pattern of behaviour automatic."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Designed to perform a specific task."},{"definition":"(electronic communications) Of devices, closely or tightly coupled."},{"definition":"Having a fixed placement (on a screen format for example.)"},{"definition":"Not changeable."},{"definition":"In humans and animals, describing genetically determined, instinctive behavior, as opposed to learned behavior."}],"partOfSpeech":"j"}]},{"word":"HOSTA","idx":50994,"count":322160,"meanings":[{"definitions":[{"definition":"Any of several herbaceous Asiatic plants of the genus Hosta."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhoʊ stə/"},{"text":"/ˈhɒstə/"}]},{"word":"INTERCONNECTING","idx":51001,"count":322101,"meanings":[{"definitions":[{"definition":"To connect to one another.","example":"The Internet interconnects a set of networks."}],"partOfSpeech":"ve"}]},{"word":"SINGULARLY","idx":51004,"count":322048,"meanings":[{"definitions":[{"definition":"Strangely; oddly.","example":"He behaved most singularly when we met him last night."},{"definition":"Extremely; remarkably."},{"definition":"In the singular number; in terms of a single thing."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"singularly-us","text":"/ˈsɪŋɡjəlɚli/"}]},{"word":"UNDERPINNINGS","idx":51006,"count":322013,"meanings":[{"definitions":[{"definition":"A support or foundation, especially as a structure of masonry that supports a wall.","example":"This house's underpinning is not up to standard."},{"definition":"A basis for something.","example":"I would like to know more about the underpinning of this political theory."},{"definition":"The lower body or legs."}],"partOfSpeech":"n"}]},{"word":"GOBBLE","idx":51007,"count":322005,"meanings":[{"definitions":[{"definition":"Fellatio; blowjob"},{"definition":"An act of eating hastily or greedily."},{"definition":"The sound of a turkey."},{"definition":"A rapid straight putt so strongly played that, if the ball had not gone into the hole, it would have gone a long way past."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat hastily or greedily; to scoff or scarf (often used with up)","example":"He gobbled four hot dogs in three minutes."},{"definition":"To make the sound of a turkey."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gobble-us","text":"/ˈɡɑbl̩/"}]},{"word":"PREPOSTEROUS","idx":51008,"count":321999,"meanings":[{"definitions":[{"definition":"Absurd, or contrary to common sense."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"preposterous-us"}]},{"word":"LAZAR","idx":51009,"count":321985,"meanings":[{"definitions":[{"definition":"A sufferer of an infectious disease, especially leprosy."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈleɪzə/"}]},{"word":"LAXATIVES","idx":51010,"count":321978,"meanings":[{"definitions":[{"definition":"Any substance, such as a food or in the form of a medicine which has a laxative effect."}],"partOfSpeech":"n"}]},{"word":"MYTHOS","idx":51011,"count":321954,"meanings":[{"definitions":[{"definition":"Anything transmitted by word of mouth, such as a fable, legend, narrative, story, or tale (especially a poetic tale)."},{"definition":"A story or set of stories relevant to or having a significant truth or meaning for a particular culture, religion, society, or other group; a myth, a mythology."},{"definition":"(by extension) A set of assumptions or beliefs about something."},{"definition":"A recurring theme; a motif."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mythos-uk","text":"/ˈmɪθɒs/"}]},{"word":"COLLOID","idx":51013,"count":321935,"meanings":[{"definitions":[{"definition":"A stable system of two phases, one of which is dispersed in the other in the form of very small droplets or particles."},{"definition":"An intimate mixture of two substances one of which, called the dispersed phase (or colloid), is uniformly distributed in a finely divided state throughout the second substance, called the dispersion medium (or dispersing medium)."},{"definition":"A particle less than 1 micron in diameter, following the Wentworth scale"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Glue-like; gelatinous.","example":"colloid tumours"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɒlɔɪd/"}]},{"word":"HIKED","idx":51014,"count":321931,"meanings":[{"definitions":[{"definition":"To take a long walk for pleasure or exercise.","example":"Don't forget to bring the map when we go hiking tomorrow."},{"definition":"To unfairly or suddenly raise a price."},{"definition":"To snap the ball to start a play."},{"definition":"To lean out to the windward side of a sailboat in order to counterbalance the effects of the wind on the sails."},{"definition":"To pull up or tug upwards sharply.","example":"She hiked her skirt up."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/haɪkt/"}]},{"word":"DEFRAG","idx":51015,"count":321909,"meanings":[{"definitions":[{"definition":"To run a process that collects fragments of files and sorts them into contiguous sections on one or more hard disks or hard disk partitions, thus speeding up file management."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"defrag-uk","text":"/diːˈfɹæɡ/"}]},{"word":"SYMBOLIZED","idx":51016,"count":321895,"meanings":[{"definitions":[{"definition":"To be symbolic of; to represent."},{"definition":"To use symbols; to represent ideas symbolically."},{"definition":"To resemble each other in qualities or properties; to correspond; to harmonize."},{"definition":"To hold the same faith; to agree."}],"partOfSpeech":"ve"}]},{"word":"BREECH","idx":51018,"count":321860,"meanings":[{"definitions":[{"definition":"(now only in the plural) A garment whose purpose is to cover or clothe the buttocks."},{"definition":"The buttocks or backside."},{"definition":"The part of a cannon or other firearm behind the chamber."},{"definition":"The external angle of knee timber, the inside of which is called the throat."},{"definition":"A breech birth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dress in breeches. (especially) To dress a boy in breeches or trousers for the first time."},{"definition":"To beat or spank on the buttocks."},{"definition":"To fit or furnish with a breech.","example":"to breech a gun"},{"definition":"To fasten with breeching."},{"definition":"To cover as if with breeches."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Born, or having been born, breech."}],"partOfSpeech":"j"},{"definitions":[{"definition":"With the hips coming out before the head."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"breech-uk","text":"/bɹiːtʃ/"}]},{"word":"RIPENING","idx":51019,"count":321833,"meanings":[{"definitions":[{"definition":"To grow ripe; to become mature (said of grain, fruit, flowers etc.)","example":"Grapes ripen in the sun."},{"definition":"To approach or come to perfection."},{"definition":"To cause to mature; to make ripe","example":"The warm sun ripened the corn."},{"definition":"To mature; to fit or prepare; to bring to perfection","example":"ripen the judgment"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of becoming ripe."}],"partOfSpeech":"n"}]},{"word":"OXIDANT","idx":51020,"count":321825,"meanings":[{"definitions":[{"definition":"An oxidizing agent"}],"partOfSpeech":"n"}]},{"word":"PYRAMIDAL","idx":51021,"count":321821,"meanings":[{"definitions":[{"definition":"One of the carpal bones"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pyramid-shaped."},{"definition":"Tetragonal."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɪˈɹæm.ɪ.dl̩/"}]},{"word":"UMBRA","idx":51022,"count":321800,"meanings":[{"definitions":[{"definition":"The fully shaded inner region of a shadow cast by an opaque object."},{"definition":"The central region of a sunspot."},{"definition":"A shadow."},{"definition":"An uninvited guest brought along by one who was invited."},{"definition":"One of the family Umbridae of mudminnows."},{"definition":"A sciaenoid fish, the umbrine."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʌmbɹə/"}]},{"word":"CHORUSES","idx":51025,"count":321768,"meanings":[{"definitions":[{"definition":"A group of singers and dancers in the religious festivals of ancient Greece."},{"definition":"A group of people in a play or performance who recite together."},{"definition":"A group of singers; singing group who perform together.","example":"The performance of the chorus was awe-inspiring and exhilarating."},{"definition":"A repeated part of a song.","example":"The catchiest part of most songs is the chorus."},{"definition":"The improvised solo section in a small group performance."},{"definition":"A setting or feature in electronic music that makes one voice sound like many."},{"definition":"A group of people or animals who make sounds together","example":"a chorus of crickets"},{"definition":"The noise made by such a group.","example":"a chorus of shouts and catcalls"},{"definition":"An actor who reads the opening and closing lines of a play."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sing or recite in chorus."},{"definition":"To say in unison; to express in unison."},{"definition":"To echo (a particular sentiment)."},{"definition":"To sing the chorus (of a song)."},{"definition":"To speak as if in chorus (about something)."},{"definition":"To echo in unison another person's words."},{"definition":"(of animals) To make their cry together."}],"partOfSpeech":"ve"}]},{"word":"TREBUCHET","idx":51026,"count":321762,"meanings":[{"definitions":[{"definition":"A medieval siege engine consisting of a large pivoting arm heavily weighted on one end.","example":"Medieval trebuchets are said to have been capable of launching 90kg projectiles over distances of more than 300 meters, making them more powerful than most pre-modern types of catapult."},{"definition":"A torture device for dunking suspected witches by means of a chair attached to the end of a long pole."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɹɛb.juˌʃɛt/"},{"text":"/ˈtɹɛb.ju.ʃeɪ/"}]},{"word":"PYRITE","idx":51027,"count":321759,"meanings":[{"definitions":[{"definition":"The common mineral iron disulfide (FeS2), of a pale brass-yellow color and brilliant metallic luster, crystallizing in the isometric system."},{"definition":"(usually as a plural: pyrites) Any metallic-looking sulphide, such as the above, which is the most common."},{"definition":"(usually as a plural: pyrites) Any metal dichalcogenide that is isostructural to the common mineral.","example":"Copper diselenide can occur both as a marcasite and a pyrite."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpaɪ.ɹaɪt/"}]},{"word":"DRUNKS","idx":51029,"count":321756,"meanings":[{"definitions":[{"definition":"One who is intoxicated with alcohol."},{"definition":"A habitual drinker, especially one who is frequently intoxicated."},{"definition":"A drinking-bout; a period of drunkenness."},{"definition":"A drunken state."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɹʌŋks/"}]},{"word":"SUBMITTERS","idx":51030,"count":321755,"meanings":[{"definitions":[{"definition":"A person who submits (e.g. a paper for publication)."},{"definition":"A person who submits to the authority of another."}],"partOfSpeech":"n"}]},{"word":"BRANES","idx":51031,"count":321751,"meanings":[{"definitions":[{"definition":"A hypothetical object extending across a number of (often specified) spatial dimensions, with strings in string theory seen as one-dimensional examples."}],"partOfSpeech":"n"}]},{"word":"OBSTRUCTING","idx":51034,"count":321706,"meanings":[{"definitions":[{"definition":"To block or fill (a passage) with obstacles or an obstacle."},{"definition":"To impede, retard, or interfere with; hinder.","example":"They obstructed my progress."},{"definition":"To get in the way of so as to hide from sight."}],"partOfSpeech":"ve"}]},{"word":"KIDDER","idx":51038,"count":321643,"meanings":[{"definitions":[{"definition":"One who kids, or teases light-heartedly."},{"definition":"A term of endearment/address for a child or young adult, usually male."},{"definition":"A forestaller or huckster."},{"definition":"A kidderminster (carpet)"}],"partOfSpeech":"n"}]},{"word":"HOTKEY","idx":51039,"count":321643,"meanings":[{"definitions":[{"definition":"A keyboard shortcut."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To navigate by means of a keyboard shortcut."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhɒtkiː/"}]},{"word":"PHOSPHORIC","idx":51040,"count":321632,"meanings":[{"definitions":[{"definition":"Of or pertaining to phosphorus."},{"definition":"Resembling phosphorus."},{"definition":"Of a compound, containing phosphorus in a higher oxidation number than phosphorous compounds, especially with one of 5."}],"partOfSpeech":"j"}]},{"word":"CREDITING","idx":51043,"count":321604,"meanings":[{"definitions":[{"definition":"To believe; to put credence in.","example":"Someone said there were over 100,000 people there, but I can't credit that."},{"definition":"To add to an account.","example":"Credit accounts receivable with the amount of the invoice."},{"definition":"To acknowledge the contribution of.","example":"Credit the point guard with another assist."},{"definition":"To bring honour or repute upon; to do credit to; to raise the estimation of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of making a credit in accounting."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹɛdɪtɪŋ/"}]},{"word":"PARQUET","idx":51045,"count":321589,"meanings":[{"definitions":[{"definition":"A wooden floor made of parquetry."},{"definition":"The part of a theatre between the orchestra and the parquet circle."},{"definition":"In some European countries, the branch of the administrative government that handles prosecutions."},{"definition":"In some European bourses or stock exchanges, the railed-in space within which the agents de change, or privileged brokers, conduct business; also, the business conducted by them, distinguished from the coulisse, or outside market."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lay or fit such a floor."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɑːɹˈkeɪ/"},{"text":"/ˈpɑːkeɪ/"}]},{"word":"VINT","idx":51046,"count":321577,"meanings":[{"definitions":[{"definition":"To make wine from fruit"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A Russian card game similar to bridge and whist"}],"partOfSpeech":"n"}]},{"word":"REPARATION","idx":51049,"count":321496,"meanings":[{"definitions":[{"definition":"(usually in the plural) A payment of time, effort or money to undo past transgression(s)."},{"definition":"The act of renewing, restoring, etc., or the state of being renewed or repaired.","example":"the reparation of a bridge or of a highway"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"reparation-uk","text":"/ˌɹɛpəˈɹeɪʃən/"}]},{"word":"AMPLY","idx":51051,"count":321480,"meanings":[{"definitions":[{"definition":"In an ample manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈæmp.li/"}]},{"word":"CREATIONISTS","idx":51053,"count":321422,"meanings":[{"definitions":[{"definition":"A proponent or supporter of creationism."}],"partOfSpeech":"n"}]},{"word":"DAMASK","idx":51055,"count":321405,"meanings":[{"definitions":[{"definition":"An ornate silk fabric originating from Damascus.","example":"True damasks are pure silk."},{"definition":"Linen so woven that a pattern is produced by the different directions of the thread, without contrast of colour."},{"definition":"A heavy woolen or worsted stuff with a pattern woven in the same way as the linen damask; made for furniture covering and hangings."},{"definition":"Damascus steel"},{"definition":"The peculiar markings or water of such steel."},{"definition":"A damask rose, Rosa × damascena."},{"definition":"A grayish-pink color, like that of the damask rose."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate or weave in damascene patterns"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a grayish-pink color, like that of the damask rose."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"damask-uk","text":"/ˈdæm.əsk/"}]},{"word":"BATTED","idx":51056,"count":321390,"meanings":[{"definitions":[{"definition":"To hit with a bat or (figuratively) as if with a bat.","example":"He batted the ball away with a satisfying thwack."},{"definition":"To take a turn at hitting a ball with a bat in sports like cricket, baseball and softball, as opposed to fielding."},{"definition":"To strike or swipe as though with a bat.","example":"The cat batted at the toy."},{"definition":"To flutter","example":"bat one's eyelashes"},{"definition":"To wink."},{"definition":"To bate or flutter, as a hawk."},{"definition":"(usually with 'around' or 'about') To flit quickly from place to place.","example":"I've spent all week batting around the country."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbætɪd/"}]},{"word":"SCRAPERS","idx":51057,"count":321388,"meanings":[{"definitions":[{"definition":"An instrument with which anything is scraped."},{"definition":"One who scrapes horns."},{"definition":"One who plays a violin incompetently, producing cacophonous sounds."},{"definition":"One who acquires avariciously and saves penuriously."},{"definition":"A cocked hat."}],"partOfSpeech":"n"}]},{"word":"REJOINED","idx":51058,"count":321380,"meanings":[{"definitions":[{"definition":"To join again; to unite after separation."},{"definition":"To come, or go, again into the presence of; to join the company of again."},{"definition":"To state in reply; -- followed by an object clause."},{"definition":": To answer to a reply."},{"definition":"To answer, as the defendant to the plaintiff's replication."},{"definition":"In US patent law To re-insert a patent claim, typically after allowance of a patent application, applied to patent claims that had been withdrawn from examination under a restriction requirement, based on rejoinder ."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːˈd͡ʒɔɪnd/"}]},{"word":"HOVERCRAFT","idx":51060,"count":321362,"meanings":[{"definitions":[{"definition":"A vehicle supported on a cushion of air, able to traverse many different types of terrain and travel over water, used for transport."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɒv.ə.kɹæft/"},{"text":"/ˈhɑvɚ.kɹæft/"}]},{"word":"NIGHTHAWK","idx":51062,"count":321323,"meanings":[{"definitions":[{"definition":"A nightjar, especially Caprimulgus europaeus."},{"definition":"A New World nightjar of the genus Chordeiles, especially Chordeiles minor."},{"definition":"A person whose preference or custom is to remain awake and active during the night and the early morning hours."},{"definition":"A nighthawker."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnaɪthɑk/"},{"text":"/ˈnʌɪthɔːk/"}]},{"word":"IMPOTENT","idx":51064,"count":321310,"meanings":[{"definitions":[{"definition":"A man who has erectile dysfunction"},{"definition":"An impotent or powerless person"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Lacking physical strength or vigor; weak"},{"definition":"Lacking in power, as to act effectively; helpless"},{"definition":"Incapable of sexual intercourse, often because of an inability to achieve or sustain an erection"},{"definition":"(of a male) sterile"},{"definition":"Lacking self-restraint"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɪm.pə.tənt/"}]},{"word":"SPITS","idx":51066,"count":321273,"meanings":[{"definitions":[{"definition":"A sudden impact or blow."},{"definition":"The shock and noise produced by violently closing a door or other object."},{"definition":"A slam dunk."},{"definition":"An insult.","example":"I don't mean this as a slam, but you can be really impatient sometimes."},{"definition":"The yellow iron silicate produced in alum works as a waste product."},{"definition":"A poetry slam."},{"definition":"A slambook."},{"definition":"The refuse of alum works."},{"definition":"A subgenre of death metal with elements of hardcore punk focusing on midtempo rhythms, breakdowns and palm-muted riffs"},{"definition":"A type of card game, also called ruff and honours."},{"definition":"A card game, played all at once without separate turns, in which players attempt to get rid of their cards as quickly as possible according to certain rules."},{"definition":"Losing or winning all the tricks in a game."},{"definition":"A bid of six (small slam) or seven (grand slam) in a suit or no trump."},{"definition":"Winning all (or all but one) of the available, major or specified events in a given year or sports season."},{"definition":"A shambling fellow."},{"definition":"A thin metal or wooden rod on which meat is skewered for cooking, often over a fire."},{"definition":"A generally low, narrow, pointed, usually sandy peninsula."},{"definition":"Saliva, especially when expectorated.","example":"There was spit all over the washbasin."},{"definition":"An instance of spitting; specifically, a light fall of rain or snow."},{"definition":"A person who exactly resembles someone else (usually in set phrases; see spitting image)"},{"definition":"The depth to which the blade of a spade goes into the soil when it is used for digging; a layer of soil of the depth of a spade's blade."},{"definition":"The amount of soil that a spade holds; a spadeful."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To impale on a spit; to pierce with a sharp object.","example":"to spit a loin of veal"},{"definition":"To use a spit to cook; to attend to food that is cooking on a spit.","example":"She’s spitting the roast in the kitchen."},{"definition":"To evacuate (saliva or another substance) from the mouth, etc."},{"definition":"To emit or expel in a manner similar to evacuating saliva from the mouth; specifically, to rain or snow slightly.","example":"a hot pan spitting droplets of fat"},{"definition":"To utter (something) violently."},{"definition":"(hip-hop) To rap, to utter."},{"definition":"To make a spitting sound, like an angry cat."},{"definition":"To dig (something) using a spade; also, to turn (the soil) using a plough."},{"definition":"To plant (something) using a spade."},{"definition":"To dig, to spade."}],"partOfSpeech":"ve"}]},{"word":"EMOTIVE","idx":51068,"count":321269,"meanings":[{"definitions":[{"definition":"(grammar) A word or construct that expresses an emotion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to emotion."},{"definition":"Appealing to the emotions."},{"definition":"(grammar) Expressing an emotion."}],"partOfSpeech":"j"}]},{"word":"PAPACY","idx":51069,"count":321266,"meanings":[{"definitions":[{"definition":"The office of the pope.","example":"The papacy represents the head of the Catholic Church."},{"definition":"The period of a particular pope's reign.","example":"The papacy of John Paul II ended in 2005, after the pope's long battle with illness ended."},{"definition":"Roman Catholicism generally."}],"partOfSpeech":"n"}]},{"word":"CURMUDGEON","idx":51071,"count":321233,"meanings":[{"definitions":[{"definition":"A miser."},{"definition":"An ill-tempered person full of stubborn ideas or opinions.","example":"John Doe's old age and stubborn aversion to new ideas make him a curmudgeon of a candidate."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"curmudgeon-us","text":"/kɚˈmʌdʒən/"}]},{"word":"FRESHENER","idx":51072,"count":321208,"meanings":[{"definitions":[{"definition":"(often in combination) Something that freshens"},{"definition":"Air freshener","example":"I sprayed freshener around the bathroom."}],"partOfSpeech":"n"}]},{"word":"THIMBLE","idx":51075,"count":321166,"meanings":[{"definitions":[{"definition":"A pitted, now usually metal, cap for the fingers, used in sewing to push the needle."},{"definition":"A similarly shaped socket in machinery."},{"definition":"A thimbleful."},{"definition":"A ring of metal or rope used in a ship's rigging; it is a protection against chafing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"thimble-us","text":"/ˈθɪmbəl/"}]},{"word":"RACISTS","idx":51076,"count":321146,"meanings":[{"definitions":[{"definition":"A person who believes in or supports racism; a person who believes that a particular race is superior to others."}],"partOfSpeech":"n"}]},{"word":"LACQUERED","idx":51079,"count":321105,"meanings":[{"definitions":[{"definition":"To apply a lacquer to something or to give something a smooth, glossy finish."}],"partOfSpeech":"ve"}]},{"word":"ABLAZE","idx":51080,"count":321096,"meanings":[{"definitions":[{"definition":"Burning fiercely; in a blaze; on fire."},{"definition":"Radiant with bright light and color."},{"definition":"In a state of glowing excitement or ardent desire."}],"partOfSpeech":"j"},{"definitions":[{"definition":"On fire; in a blaze, gleaming."},{"definition":"Lit up brightly and with color."},{"definition":"In a state of glowing excitement or ardent desire."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"ablaze-us","text":"/əˈbleɪz/"}]},{"word":"ASSASSINATIONS","idx":51081,"count":321091,"meanings":[{"definitions":[{"definition":"The murder of a person, especially for political reasons or for personal gain.","example":"The assassination of the king occurred at night."}],"partOfSpeech":"n"}]},{"word":"GRAMOPHONE","idx":51082,"count":321087,"meanings":[{"definitions":[{"definition":"A record player."}],"partOfSpeech":"n"}]},{"word":"SPOTTY","idx":51083,"count":321064,"meanings":[{"definitions":[{"definition":"A common New Zealand fish, Notolabrus celidotus"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having spots; spotted."},{"definition":"Of inconsistent quality","example":"Many of the buyers had a spotty credit history."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"spotty-au"}]},{"word":"LECH","idx":51084,"count":321052,"meanings":[{"definitions":[{"definition":"A strong, lecherous desire or craving."},{"definition":"A lecher."},{"definition":"The capstone of a cromlech."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To behave lecherously"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lech-1-uk","text":"/lɛtʃ/"}]},{"word":"SIMMERING","idx":51085,"count":321050,"meanings":[{"definitions":[{"definition":"To cook or undergo heating slowly at or below the boiling point.","example":"The soup simmered on the stove."},{"definition":"To cause to cook or to cause to undergo heating slowly at or below the boiling point.","example":"Simmer the soup for five minutes, then serve."},{"definition":"To be on the point of breaking out into anger; to be agitated."},{"definition":"To remain angry with someone or something past the point of exhaustion; to resign oneself to holding a grudge, especially after some failed attempts to resolve a situation.","example":"I tried to get through to him; all that's left for me to do is simmer."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of something that simmers."}],"partOfSpeech":"n"}]},{"word":"TANNOY","idx":51088,"count":321021,"meanings":[{"definitions":[{"definition":"A public address system"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transmit, or communicate with, by means of a public address system."}],"partOfSpeech":"ve"}]},{"word":"CYCLOSPORINE","idx":51089,"count":321013,"meanings":[{"definitions":[{"definition":"A cyclic oligopeptide, obtained from soil fungi, used as an immunosuppressive drug after an organ transplant"}],"partOfSpeech":"n"}]},{"word":"GRASSHOPPERS","idx":51091,"count":321004,"meanings":[{"definitions":[{"definition":"A mostly herbivorous insect of the order Orthoptera, noted for its ability to jump long distances and for the habit of some species communicating by stridulation; they are related to but distinct from crickets."},{"definition":"A cocktail made with crème de menthe and optionally with crème de cacao."},{"definition":"A young student in initial stages of training who has been chosen on account of their obvious talent."},{"definition":"In ordinary square or upright pianos of London make, the escapement lever or jack, so made that it can be taken out and replaced with the key."}],"partOfSpeech":"n"}]},{"word":"INTERNATIONALISATION","idx":51092,"count":320999,"meanings":[{"definitions":[{"definition":"The conversion of something in order to make it international"},{"definition":"The act or process of making a product suitable for international markets, typically by making text messages easily translatable and ensuring support of non-Latin character sets, languages, and regions."}],"partOfSpeech":"n"}]},{"word":"CRAWLERS","idx":51102,"count":320912,"meanings":[{"definitions":[{"definition":"A person who is abused, physically or verbally, and returns to the abuser a supplicant."},{"definition":"A sycophant."},{"definition":"A child who is able to creep using his hands and knees but is not able to walk."},{"definition":"A crawl swimmer."},{"definition":"A tractor crawler, a motorized vehicle that uses caterpillar tracks instead of wheels."},{"definition":"A software bot that autonomously follows connected paths such as webpage links."},{"definition":"A mobile stage in the development of stationary hemipteran insects such as scale insects- generally the first instar"}],"partOfSpeech":"n"}]},{"word":"SENATORIAL","idx":51103,"count":320903,"meanings":[{"definitions":[{"definition":"Relating to a senator."},{"definition":"Relating to a senate.","example":"The senatorial investigation involved subpoenas and testimony before Congress and, of course, went nowhere."},{"definition":"Entitled to elect a senator, or by senators.","example":"the senatorial districts of a State"}],"partOfSpeech":"j"}]},{"word":"THAWED","idx":51105,"count":320884,"meanings":[{"definitions":[{"definition":"To gradually melt, dissolve, or become fluid; to soften from frozen","example":"the ice thaws"},{"definition":"To become so warm as to melt ice and snow — said in reference to the weather, and used impersonally.","example":"It's beginning to thaw."},{"definition":"To grow gentle or genial.","example":"Her anger has thawed."},{"definition":"To gradually cause frozen things (such as earth, snow, ice) to melt, soften, or dissolve."}],"partOfSpeech":"ve"}]},{"word":"UNEXPLORED","idx":51106,"count":320877,"meanings":[{"definitions":[{"definition":"Which has not been explored."}],"partOfSpeech":"j"}]},{"word":"CHARACTERIZATIONS","idx":51107,"count":320874,"meanings":[{"definitions":[{"definition":"The act or process of characterizing."}],"partOfSpeech":"n"}]},{"word":"TRANSPIRED","idx":51108,"count":320870,"meanings":[{"definitions":[{"definition":"To give off (vapour, waste matter etc.); to exhale (an odour etc.)."},{"definition":"To perspire."},{"definition":"Of plants, to give off water and waste products through the stomata."},{"definition":"To become known; to escape from secrecy.","example":"It eventually transpired that the murder victim had been a notorious blackmailer."},{"definition":"To happen, take place."}],"partOfSpeech":"ve"}]},{"word":"DIETITIANS","idx":51109,"count":320866,"meanings":[{"definitions":[{"definition":"A person who studies or practices dietetics."}],"partOfSpeech":"n"}]},{"word":"BEECHWOOD","idx":51117,"count":320745,"meanings":[{"definitions":[{"definition":"The wood of beech trees (Fagus spp.)."},{"definition":"A wood largely populated with beech trees."}],"partOfSpeech":"n"}]},{"word":"EPISTEMOLOGICAL","idx":51118,"count":320686,"meanings":[{"definitions":[{"definition":"Of or pertaining to epistemology or theory of knowledge, as a field of study."},{"definition":"Of or pertaining to knowing or cognizing, as a mental activity."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪˌpɪstəməˈlɒd͡ʒɪkəl/"}]},{"word":"INFILTRATED","idx":51120,"count":320674,"meanings":[{"definitions":[{"definition":"To surreptitiously penetrate, enter or gain access to."},{"definition":"(of a liquid) To pass through something by filtration."},{"definition":"To cause (a liquid) to pass through something by filtration."},{"definition":"To invade or penetrate a tissue or organ.","example":"High-grade tumors often infiltrate surrounding structures."},{"definition":"To send (soldiers, spies etc.) through gaps in the enemy line."},{"definition":"(of an intravenous needle) To move from a vein, remaining in the body."}],"partOfSpeech":"ve"}]},{"word":"FORTIFICATIONS","idx":51122,"count":320616,"meanings":[{"definitions":[{"definition":"The act of fortifying; the art or science of fortifying places to strengthen defence against an enemy."},{"definition":"That which fortifies; especially, a work or works erected to defend a place against attack; a fortified place; a fortress; a fort; a castle."},{"definition":"An increase in effectiveness, as by adding ingredients."},{"definition":"A jagged pattern sometimes seen during an attack of migraine."}],"partOfSpeech":"n"}]},{"word":"CLOAKING","idx":51124,"count":320583,"meanings":[{"definitions":[{"definition":"To cover as with a cloak."},{"definition":"To hide or conceal."},{"definition":"To render or become invisible via futuristic technology.","example":"The ship cloaked before entering the enemy sector of space."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of wrapping or covering with a cloak."},{"definition":"The material from which cloaks are made."}],"partOfSpeech":"n"}]},{"word":"NOTS","idx":51125,"count":320581,"meanings":[{"definitions":[{"definition":"A unary operation on logical values that changes true to false, and false to true."}],"partOfSpeech":"n"}]}]