[{"word":"INSTALLMENT","idx":16620,"count":2192474,"meanings":[{"definitions":[{"definition":"One of a series of parts, whether equal or unequal to the other parts of the series, of a given entity or a given process, which part presents or is presented at a particular scheduled interval."},{"definition":"One member of a series of portions of a debt or sum of money, which portions may or may not be equated (depending in part on whether the interest rate is fixed or variable), payment of which portions are serially exacted at regularly scheduled intervals toward satisfaction of the total. Payments of installments are generally mensual, quarterly, triannual, biannual, or annual."},{"definition":"A part of a published or broadcast serial."},{"definition":"The act of installing; installation."},{"definition":"The seat in which one is placed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"installment-uk","text":"/ɪnˈstɔːlmənt/"}]},{"word":"SPINDLE","idx":16622,"count":2192023,"meanings":[{"definitions":[{"definition":"(spinning) A rod used for spinning and then winding natural fibres (especially wool), usually consisting of a shaft and a circular whorl positioned at either the upper or lower end of the shaft when suspended vertically from the forming thread."},{"definition":"A rod which turns, or on which something turns.","example":"the spindle of a vane"},{"definition":"A rotary axis of a machine tool or power tool."},{"definition":"Certain of the species of the genus Euonymus, originally used for making the spindles used for spinning wool."},{"definition":"An upright spike for holding paper documents by skewering."},{"definition":"The fusee of a watch."},{"definition":"A long and slender stalk resembling a spindle."},{"definition":"A yarn measure containing, in cotton yarn, 15,120 yards; in linen yarn, 14,400 yards."},{"definition":"A solid generated by the revolution of a curved line about its base or double ordinate or chord."},{"definition":"Any marine univalve shell of the genus Tibia; a spindle stromb."},{"definition":"Any marine gastropod with a spindle-shaped shell formerly in one of the three invalid genera called Fusus."},{"definition":"A cytoskeletal structure formed during mitosis"},{"definition":"(coastal New Jersey) a dragonfly, calque of Swedish slända (dragonfly/spindle), introduced by New Sweden settlers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make into a long tapered shape."},{"definition":"To take on a long tapered shape."},{"definition":"To impale on a device for holding paper documents.","example":"Do not fold, spindle or mutilate this document."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈspɪndəl/"}]},{"word":"HEAVENS","idx":16623,"count":2191944,"meanings":[{"definitions":[{"definition":"The sky, specifically:"},{"definition":"The abode of God or the gods, traditionally conceived as beyond the sky; especially:"},{"definition":"The afterlife of the blessed dead, traditionally conceived as opposed to an afterlife of the wicked and unjust (compare hell); specifically:"},{"definition":"(by extension) Any paradise; any blissful place or experience."},{"definition":"(by extension) A state of bliss; a peaceful ecstasy."},{"definition":"(with a modifier) Similarly blissful afterlives, places, or states for particular people, animals, or objects."},{"definition":"(often with 'the') The distant sky of the sun, moon, and stars."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transport to the abode of God, the gods, or the blessed."},{"definition":"To beatify, enchant, or please greatly."},{"definition":"To beautify, to make into a paradise."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An expression of surprise, contempt, outrage, disgust, boredom, or frustration."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"heavens-us","text":"/ˈhɛvənz/"}]},{"word":"INKS","idx":16624,"count":2191859,"meanings":[{"definitions":[{"definition":"A pigment (or dye)-based fluid used for writing, printing etc."},{"definition":"A particular type, color or container of this fluid."},{"definition":"The black or dark-colored fluid ejected by squid, octopus etc, as a protective strategy."},{"definition":"Publicity.","example":"The TSA has been getting a lot of ink lately."},{"definition":"Tattoo work."},{"definition":"Cheap red wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply ink to; to cover or smear with ink."},{"definition":"To sign (a contract or similar document)."},{"definition":"To apply a tattoo to (someone)."},{"definition":"(of a squid or octopus) to eject ink (sense 3)"}],"partOfSpeech":"ve"}]},{"word":"WINK","idx":16625,"count":2191452,"meanings":[{"definitions":[{"definition":"An act of winking (a blinking of only one eye), or a message sent by winking."},{"definition":"A brief period of sleep; especially forty winks."},{"definition":"A brief time; an instant."},{"definition":"The smallest possible amount."},{"definition":"A subtle allusion.","example":"The film includes a wink to wartime rationing."},{"definition":"A disc used in the game of tiddlywinks."},{"definition":"(Chiefly British) Periwinkle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To close one's eyes in sleep."},{"definition":"To close one's eyes."},{"definition":"Usually followed by at: to look the other way, to turn a blind eye."},{"definition":"To close one's eyes quickly and involuntarily; to blink."},{"definition":"To blink with only one eye as a message, signal, or suggestion, usually with an implication of conspiracy. (When transitive, the object may be the eye being winked, or the message being conveyed.)","example":"He winked at me. She winked her eye. He winked his assent."},{"definition":"To gleam fitfully or intermitently; to twinkle; to flicker."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wink-us","text":"/ˈwɪŋk/"}]},{"word":"DIARRHEA","idx":16626,"count":2191254,"meanings":[{"definitions":[{"definition":"A gastrointestinal disorder characterized by frequent and very fluid or watery bowel movements."},{"definition":"The watery or very soft excrement that comes from such bowel movements."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"diarrhea-us"},{"text":"/ˌdaɪ.əˈɹiː.ə/"}]},{"word":"MISTER","idx":16628,"count":2191168,"meanings":[{"definitions":[{"definition":"A title conferred on an adult male, usually when the name is unknown. Also used as a term of address, often by a parent to a young child.","example":"You may sit here, mister."},{"definition":"Someone's business or function; an occupation, employment, trade."},{"definition":"A kind, type of."},{"definition":"Need (of something)."},{"definition":"Necessity; the necessary time."},{"definition":"A device that makes or sprays mist.","example":"Odessa D. uses a mister Sunday to fight the 106-degree heat at a NASCAR race in Fontana, California."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To address by the title of \"mister\"."},{"definition":"To be necessary; to matter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mister-us","text":"[ˈmɪstɚ]"}]},{"word":"ROUNDING","idx":16629,"count":2191014,"meanings":[{"definitions":[{"definition":"To shape something into a curve.","example":"The carpenter rounded the edges of the table."},{"definition":"To become shaped into a curve."},{"definition":"(with \"out\") To finish; to complete; to fill out.","example":"She rounded out her education with only a single mathematics class."},{"definition":"To approximate a number, especially a decimal number by the closest whole number.","example":"Ninety-five rounds up to one hundred."},{"definition":"To turn past a boundary.","example":"Helen watched him until he rounded the corner."},{"definition":"To turn and attack someone or something (used with on).","example":"As a group of policemen went past him, one of them rounded on him, grabbing him by the arm."},{"definition":"To advance to home plate.","example":"And the runners round the bases on the double by Jones."},{"definition":"To go round, pass, go past."},{"definition":"To encircle; to encompass."},{"definition":"To grow round or full; hence, to attain to fullness, completeness, or perfection."},{"definition":"To do ward rounds."},{"definition":"To go round, as a guard; to make the rounds."},{"definition":"To go or turn round; to wheel about."},{"definition":"To speak in a low tone; whisper; speak secretly; take counsel."},{"definition":"To address or speak to in a whisper, utter in a whisper."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which a numerical value is rounded."},{"definition":"The numerical value obtained by this process."},{"definition":"The act of making anything round, as the lips in pronouncing some vowels."},{"definition":"A rounded surface; a curve."},{"definition":"In bookbinding, the shaping of the folded and sewed sheets into a convex form at the back."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Round or nearly round; becoming round; roundish."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹaʊndɪŋ/"}]},{"word":"INORGANIC","idx":16630,"count":2190780,"meanings":[{"definitions":[{"definition":"An inorganic compound"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to a compound that does not contain carbon"},{"definition":"That does not originate in a living organism"}],"partOfSpeech":"j"}]},{"word":"FLARE","idx":16631,"count":2190533,"meanings":[{"definitions":[{"definition":"A sudden bright light."},{"definition":"A source of brightly burning light or intense heat.","example":"solar flare"},{"definition":"A sudden eruption or outbreak; a flare-up."},{"definition":"A widening of an object with an otherwise roughly constant width.","example":"During assembly of a flare tube fitting, a flare nut is used to secure the flared tubing’s tapered end to the also tapered fitting, producing a pressure-resistant, leak-tight seal."},{"definition":"(in plural) Bell-bottom trousers."},{"definition":"The transition from downward flight to level flight just before landing.","example":"The captain executed the flare perfectly, and we lightly touched down."},{"definition":"A low fly ball that is hit in the region between the infielders and the outfielders.","example":"Jones hits a little flare to left that falls for a single."},{"definition":"A route run by the running back, releasing toward the sideline and then slightly arcing upfield looking for a short pass."},{"definition":"Short for lens flare."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to burn."},{"definition":"To cause inflammation; to inflame."},{"definition":"To open outward in shape.","example":"The building flared from the third through the seventh floors to occupy the airspace over the entrance plaza. (intransitive)"},{"definition":"To (operate an aircraft to) transition from downward flight to level flight just before landing."},{"definition":"To blaze brightly.","example":"The blast furnace flared in the night."},{"definition":"To shine out with a sudden and unsteady light; to emit a dazzling or painfully bright light.","example":"The candle flared in a sudden draught."},{"definition":"To shine out with gaudy colours; to be offensively bright or showy."},{"definition":"To suddenly happen or intensify."},{"definition":"To suddenly erupt in anger."},{"definition":"To be exposed to too much light."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/flɛɚ̯/"},{"text":"/flɛə̯/"},{"audio":"flare-au"}]},{"word":"SCHOLASTIC","idx":16632,"count":2190315,"meanings":[{"definitions":[{"definition":"A member of the medieval philosophical school of scholasticism; a medieval Christian Aristotelian."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to school; academic","example":"This award is for the greatest scholastic achievement by a graduating student."},{"definition":"Of or relating to the philosophical tradition of scholasticism"},{"definition":"Characterized by excessive subtlety, or needlessly minute subdivisions; pedantic; formal."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/skəˈlæstɪk/"}]},{"word":"WIGHT","idx":16633,"count":2190271,"meanings":[{"definitions":[{"definition":"A living creature, especially a human being."},{"definition":"A being of one of the Nine Worlds of Heathen belief, especially a nature spirit, elf or ancestor."},{"definition":"A ghost, deity or other supernatural entity."},{"definition":"A wraith-like creature."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(except in dialects) Brave, valorous, strong."},{"definition":"Strong; stout; active."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/waɪt/"}]},{"word":"WITHHOLDING","idx":16635,"count":2189743,"meanings":[{"definitions":[{"definition":"To keep (a physical object that one has obtained) to oneself rather than giving it back to its owner."},{"definition":"To keep (information, assent etc) to oneself rather than revealing it."},{"definition":"To stay back."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The deduction of taxes from an employee's salary."},{"definition":"The tax so deducted, and paid to local or national government."}],"partOfSpeech":"n"}]},{"word":"INSERTIONS","idx":16636,"count":2188802,"meanings":[{"definitions":[{"definition":"The act of inserting, or something inserted."},{"definition":"The distal end of attachment of a muscle to a bone that will be moved by the muscle."},{"definition":"The addition of a nucleotide to a chromosome by mutation."}],"partOfSpeech":"n"}]},{"word":"COUTURE","idx":16639,"count":2188659,"meanings":[{"definitions":[{"definition":"The production of high-end, custom-made clothing"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kuˈtʊɚ/"},{"text":"/kuːˈtjʊə/"}]},{"word":"FOLIAGE","idx":16640,"count":2188270,"meanings":[{"definitions":[{"definition":"The leaves of plants."},{"definition":"(short for) Fall foliage."},{"definition":"An architectural ornament representing foliage."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfoʊliɪdʒ/"},{"text":"/ˈfəʊliɪdʒ/"}]},{"word":"NOD","idx":16641,"count":2188223,"meanings":[{"definitions":[{"definition":"An instance of inclining the head up and down, as to indicate agreement, or as a cursory greeting."},{"definition":"A reference or allusion to something."},{"definition":"A nomination.","example":"For the fifth time in her career she received a Grammy nod, she has yet to win the award."},{"definition":"Approval.","example":"The plan is expected to get the nod from councillors at the next meeting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To incline the head up and down, as to indicate agreement."},{"definition":"To briefly incline the head downwards as a cursory greeting."},{"definition":"To sway, move up and down."},{"definition":"To gradually fall asleep."},{"definition":"To signify by a nod.","example":"They nodded their assent."},{"definition":"To make a mistake by being temporarily inattentive or tired"},{"definition":"To head; to strike the ball with one's head.","example":"Jones nods the ball back to his goalkeeper."},{"definition":"To allude to something."},{"definition":"To fall asleep while under the influence of opiates."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"nod-us","text":"/nɑd/"}]},{"word":"FIFE","idx":16644,"count":2186988,"meanings":[{"definitions":[{"definition":"A small shrill pipe, resembling the piccolo flute, used chiefly to accompany the drum in military music"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play this instrument."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Used instead of five in radio communications to avoid confusion."}],"partOfSpeech":"nu"}]},{"word":"GENERALS","idx":16645,"count":2186641,"meanings":[{"definitions":[{"definition":"A general fact or proposition; a generality.","example":"We have dealt with the generals; now let us turn to the particulars."},{"definition":"The holder of a senior military title, originally designating the commander of an army and now a specific rank falling under field marshal (in the British army) and below general of the army or general of the air force in the US army and air forces."},{"definition":"A great strategist or tactician.","example":"Hannibal was one of the greatest generals of the ancient world."},{"definition":"The head of certain religious orders, especially Dominicans or Jesuits."},{"definition":"A commander of naval forces; an admiral."},{"definition":"A general servant; a maid with no specific duties."},{"definition":"A general anesthetic."},{"definition":"General anesthesia."},{"definition":"The general insurance industry.","example":"I work in general."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lead (soldiers) as a general."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"generals-us","text":"/ˈd͡ʒɛn(ə)ɹəlz/"}]},{"word":"CRANK","idx":16646,"count":2185208,"meanings":[{"definitions":[{"definition":"A bent piece of an axle or shaft, or an attached arm perpendicular, or nearly so, to the end of a shaft or wheel, used to impart a rotation to a wheel or other mechanical device; also used to change circular into reciprocating motion, or reciprocating into circular motion.","example":"I grind my coffee by hand with a coffee grinder with a crank handle."},{"definition":"The act of converting power into motion, by turning a crankshaft.","example":"Yes, a crank was all it needed to start."},{"definition":"Any bend, turn, or winding, as of a passage."},{"definition":"An ill-tempered or nasty person.","example":"Billy-Bob is a nasty old crank! He chased my cat away."},{"definition":"A twist or turn of the mind; caprice; whim;"},{"definition":"A fit of temper or passion."},{"definition":"(dated in US) A person who is considered strange or odd by others. They may behave in unconventional ways.","example":"John is a crank because he talks to himself."},{"definition":"(1800s) A baseball fan."},{"definition":"An advocate of a pseudoscience movement.","example":"That crank next door thinks he’s created cold fusion in his garage."},{"definition":"A twist or turn in speech; word play consisting in a change of the form or meaning of a word."},{"definition":"A sick person; an invalid."},{"definition":"A penis."},{"definition":"A highly addictive phenethylamine stimulant drug, similar to cocaine. Its systematic (IUPAC) name is (S)-N-methyl-1-phenylpropan-2-amine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To turn by means of a crank.","example":"Motorists had to crank their engine by hand."},{"definition":"To turn a crank.","example":"He's been cranking all day and yet it refuses to crank."},{"definition":"(of a crank or similar) To turn.","example":"He's been cranking all day and yet it refuses to crank."},{"definition":"To cause to spin via other means, as though turned by a crank.","example":"Crank it up!"},{"definition":"To act in a cranky manner; to behave unreasonably and irritably, especially through complaining.","example":"Quit cranking about your spilt milk!"},{"definition":"To be running at a high level of output or effort.","example":"By one hour into the shift, the boys were really cranking."},{"definition":"To run with a winding course; to double; to crook; to wind and turn."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Strange, weird, odd."},{"definition":"Sick; unwell"},{"definition":"(of a ship) Liable to capsize because of poorly stowed cargo or insufficient ballast."},{"definition":"Full of spirit; brisk; lively; sprightly; overconfident; opinionated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"crank-us","text":"/kɹæŋk/"}]},{"word":"GOATS","idx":16647,"count":2184919,"meanings":[{"definitions":[{"definition":"A mammal, Capra aegagrus hircus, and similar species of the genus Capra."},{"definition":"A lecherous man."},{"definition":"A scapegoat."},{"definition":"A Pontiac GTO car."},{"definition":"(speech recognition) A person who is not easily understood by a speech recognition system; contrasted with sheep."},{"definition":"A fool, loser, or object of ridicule."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To allow goats to feed on."},{"definition":"To scapegoat."}],"partOfSpeech":"ve"}]},{"word":"AUTOGRAPHS","idx":16648,"count":2184662,"meanings":[{"definitions":[{"definition":"A person’s own handwriting, especially the signature of a famous or admired person."},{"definition":"A manuscript in the author’s handwriting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sign, or write one’s name or signature on a book etc"},{"definition":"To write something in one's own handwriting"}],"partOfSpeech":"ve"}]},{"word":"SUMMARIZE","idx":16649,"count":2184649,"meanings":[{"definitions":[{"definition":"To prepare a summary of (something).","example":"Jim was asked to summarize the document by Wednesday."},{"definition":"To give a recapitulation of the salient facts; to recapitulate or review.","example":"After the meeting, Jim summarized the major decisions made."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"summarize-us","text":"/ˈsʌməˌɹaɪz/"}]},{"word":"STUB","idx":16650,"count":2184616,"meanings":[{"definitions":[{"definition":"Something blunted, stunted, or cut short, such as stubble or a stump."},{"definition":"A piece of certain paper items, designed to be torn off and kept for record or identification purposes.","example":"check stub, ticket stub, payment stub"},{"definition":"A placeholder procedure that has the signature of the planned procedure but does not yet implement the intended behavior.","example":"http//books.google.com/books?vid=ISBN8120324455&id=K6BloOqIssQC&pg=RA29-PA8-IA9&lpg=RA29-PA8-IA9&dq=stub+procedure+-remote&sig=_Bm9HlXBRIsDwwCy0tqUOcXomL4, http//books.google.com/books?vid=ISBN185233570X&id=t4ZkqmbLHMMC&pg=PA53&lpg=PA53&dq=stub+procedure+-remote&sig=SZtMm8JhyE9HUVlKbp-U_TG2-hY, http//books.google.com/books?vid=ISBN0763707929&id=X_VlpfGoQRgC&pg=PA352&lpg=PA352&dq=stub+procedure+-remote&sig=oppYeiiRBcoPAkpkxZcbpcyaXIA"},{"definition":"A procedure that translates requests from external systems into a format suitable for processing and then submits those requests for processing.","example":"http//books.google.com/books?vid=ISBN0387238395&id=_pYyEgj0fX8C&pg=PA152&lpg=PA152&dq=stub+procedure&sig=1xdBGyhc6WYeJtLNWrzzGF0jRXo, http//books.google.com/books?vid=ISBN3540419454&id=mH4MFwHDRB4C&pg=PA716&lpg=PA716&dq=stub+procedure&sig=r3IGw__iPlskg9HCllA6I4lqX-M, http//books.google.com/books?vid=ISBN0849312728&id=Gc886KgsdcsC&pg=PA7&lpg=PA7&dq=stub+procedure&sig=x-txczr_KTmgepfZBsxPHy7Vncw"},{"definition":"(wikis) A page providing only minimal information and intended for later development."},{"definition":"The remaining part of the docked tail of a dog"},{"definition":"An unequal first or last interest calculation period, as a part of a financial swap contract"},{"definition":"A log or block of wood."},{"definition":"A blockhead."},{"definition":"A pen with a short, blunt nib."},{"definition":"An old and worn horseshoe nail."},{"definition":"Stub iron."},{"definition":"The smallest remainder of a smoked cigarette; a butt."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove most of a tree, bush, or other rooted plant by cutting it close to the ground."},{"definition":"To remove a plant by pulling it out by the roots."},{"definition":"To jam, hit, or bump, especially a toe.","example":"I stubbed my toe trying to find the light switch in the dark."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stub-us","text":"/stʌb/"}]},{"word":"FUNDAMENTALLY","idx":16651,"count":2184344,"meanings":[{"definitions":[{"definition":"In a fundamental or basic sense; reaching the very core of the matter."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"fundamentally-us"}]},{"word":"CREAMY","idx":16652,"count":2184127,"meanings":[{"definitions":[{"definition":"A horse with a cream-coloured coat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Containing cream.","example":"creamy milk"},{"definition":"Of food or drink, having the rich taste or thick, smooth texture of cream, whether or not it actually contains cream.","example":"creamy chocolate"},{"definition":"Of any liquid, having the thick texture of cream.","example":"a creamy lotion"},{"definition":"Having the colour of cream."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹiːmi/"}]},{"word":"EXPOSITION","idx":16653,"count":2184050,"meanings":[{"definitions":[{"definition":"The action of exposing something to something, such as skin to the sunlight."},{"definition":"(authorship) The act or process of declaring or describing something through either speech or writing; the portions and aspects of a piece of writing that exist mainly to describe the setting, characters and other non-plot elements.","example":"My reviewer said she couldn't picture the setting for my story, so I'm improving the exposition."},{"definition":"The act of expulsion, or being expelled, from a place."},{"definition":"An event at which goods, artwork and cultural displays are exhibited for the public to view.","example":"The first prototype was unveiled at an exposition."},{"definition":"(authorship) An essay or speech in which any topic is discussed in detail.","example":"I turned my research into an exposition on the traditional music of Borneo."},{"definition":"(authorship) An opening section in fiction, in which background information about the characters, events or setting is conveyed."},{"definition":"The opening section of a fugue; the opening section of a movement in sonata form"},{"definition":"The abandonment of an unwanted child."},{"definition":"The action of putting something out to public view; for example in a display or show."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɛkspəˈzɪʃən/"}]},{"word":"RAINS","idx":16655,"count":2183544,"meanings":[{"definitions":[{"definition":"Condensed water falling from a cloud.","example":"The rains came late that year."},{"definition":"Any matter moving or falling, usually through air, and especially if liquid or otherwise figuratively identifiable with raindrops."},{"definition":"An instance of particles or larger pieces of matter moving or falling through air.","example":"A rain of mortar fire fell on our trenches."},{"definition":"A rainy season.","example":"The rains came early this year."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have rain fall from the sky.","example":"It will rain today."},{"definition":"To fall as or like rain.","example":"Bombs rained from the sky."},{"definition":"To issue (something) in large quantities.","example":"The boxer rained punches on his opponent's head."},{"definition":"To reign."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rains-us","text":"/ɹeɪnz/"}]},{"word":"LAMINATED","idx":16658,"count":2183151,"meanings":[{"definitions":[{"definition":"To assemble from thin sheets glued together.","example":"We'll laminate the piece of wood with grain going in different directions to make a really strong hull for the boat."},{"definition":"To cover something flat, usually paper, in adhesive protective plastic."},{"definition":"To form, as metal, into a thin plate, as by rolling."},{"definition":"To cause to separate into thin plates or layers; to divide into thin plates."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made by lamination."},{"definition":"Consisting of many thin layers.","example":"A laminated arch is a timber arch made of layers of bent planks secured by treenails."},{"definition":"(of rocks) Splitting into thin layers parallel to bedding.","example":"Shale is laminated."}],"partOfSpeech":"j"}]},{"word":"ORGANISE","idx":16659,"count":2183137,"meanings":[{"definitions":[{"definition":"To arrange in working order."},{"definition":"To constitute in parts, each having a special function, act, office, or relation; to systematize."},{"definition":"(chiefly used in the past participle) To furnish with organs; to give an organic structure to; to endow with capacity for the functions of life","example":"an organized being"},{"definition":"To sing in parts.","example":"to organize an anthem"},{"definition":"To band together into a group or union that can bargain and act collectively; to unionize.","example":"the workers decided to organize; their next task was to organize the workers at the steel mill"}],"partOfSpeech":"ve"}]},{"word":"TORT","idx":16661,"count":2182973,"meanings":[{"definitions":[{"definition":"An injury or wrong."},{"definition":"A wrongful act, whether intentional or negligent, which causes an injury and can be remedied in civil court, usually through the awarding of damages."},{"definition":"(only in the plural torts) Tort law (the area of law dealing with such wrongful acts)."},{"definition":"A tortoise."},{"definition":"A tortoiseshell (animal with coloured markings on fur)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Tart; sharp."},{"definition":"Stretched tight; taut."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tort-us","text":"/tɔ(ə)ɹt/"},{"audio":"tort-uk","text":"/tɔːt/"}]},{"word":"BRACE","idx":16662,"count":2182960,"meanings":[{"definitions":[{"definition":"Armor for the arm; vambrace."},{"definition":"A measurement of length, originally representing a person's outstretched arms."},{"definition":"A curved instrument or handle of iron or wood, for holding and turning bits, etc.; a bitstock."},{"definition":"That which holds anything tightly or supports it firmly; a bandage or a prop."},{"definition":"A cord, ligament, or rod, for producing or maintaining tension."},{"definition":"A thong used to regulate the tension of a drum."},{"definition":"The state of being braced or tight; tension."},{"definition":"Harness; warlike preparation."},{"definition":"A curved, pointed line, also known as \"curly bracket\": { or } connecting two or more words or lines, which are to be considered together, such as in {role, roll}; in music, used to connect staves."},{"definition":"A pair, a couple; originally used of dogs, and later of animals generally (e.g., a brace of conies) and then other things, but rarely human persons. (The plural in this sense is unchanged.) In British use (as plural), this is a particularly common reference to game birds."},{"definition":"A piece of material used to transmit, or change the direction of, weight or pressure; any one of the pieces, in a frame or truss, which divide the structure into triangular parts. It may act as a tie, or as a strut, and serves to prevent distortion of the structure, and transverse strains in its members. A boiler brace is a diagonal stay, connecting the head with the shell."},{"definition":"A rope reeved through a block at the end of a yard, by which the yard is moved horizontally; also, a rudder gudgeon."},{"definition":"The mouth of a shaft."},{"definition":"(chiefly in the plural) Straps or bands to sustain trousers; suspenders."},{"definition":"(plural in North America, singular or plural in the UK) A system of wires, brackets, and elastic bands used to correct crooked teeth or to reduce overbite."},{"definition":"Two goals scored by one player in a game."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prepare for something bad, such as an impact or blow.","example":"All hands, brace for impact!"},{"definition":"To place in a position for resisting pressure; to hold firmly.","example":"He braced himself against the crowd."},{"definition":"To swing round the yards of a square rigged ship, using braces, to present a more efficient sail surface to the direction of the wind.","example":"to brace the yards"},{"definition":"To stop someone for questioning, usually said of police."},{"definition":"To confront with questions, demands or requests."},{"definition":"To furnish with braces; to support; to prop.","example":"to brace a beam in a building"},{"definition":"To draw tight; to tighten; to put in a state of tension; to strain; to strengthen.","example":"to brace the nerves"},{"definition":"To bind or tie closely; to fasten tightly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"brace-uk","text":"/bɹeɪs/"}]},{"word":"BACKUPS","idx":16663,"count":2182568,"meanings":[{"definitions":[{"definition":"A reserve or substitute.","example":"If the goalkeeper is injured, we have a backup."},{"definition":"A copy of a file or record, stored separately from the original, that can be used to recover the original if it is destroyed or damaged.","example":"After the power failure, we had to restore the database from backup."},{"definition":"An accumulation of material caused by a (partial) obstruction or (complete) blockage of the flow or movement of the material, or an accumulation of material that causes an overflow due to the flow being greater than the maximum possible flow.","example":"The accident caused a mile-long backup on the highway."},{"definition":"(law enforcement) reinforcements","example":"He's got a gun! You'd better send for backup."}],"partOfSpeech":"n"}]},{"word":"NOVELTIES","idx":16664,"count":2182172,"meanings":[{"definitions":[{"definition":"The state of being new or novel; newness."},{"definition":"A new product; an innovation."},{"definition":"A small mass-produced trinket."},{"definition":"In novelty theory, newness, density of complexification, and dynamic change as opposed to static habituation."}],"partOfSpeech":"n"}]},{"word":"GIGANTIC","idx":16666,"count":2182100,"meanings":[{"definitions":[{"definition":"Very large."},{"definition":"In the manner of a giant."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dʒaɪˈɡæntɪk/"}]},{"word":"MAYHEM","idx":16671,"count":2180898,"meanings":[{"definitions":[{"definition":"A state or situation of great confusion, disorder, trouble or destruction; chaos.","example":"In all the mayhem, some children were separated from their partners."},{"definition":"Infliction of violent injury on a person or thing.","example":"The fighting dogs created mayhem in the flower beds."},{"definition":"The maiming of a person by depriving him of the use of any of his limbs which are necessary for defense or protection."},{"definition":"The crime of damaging things or harming people on purpose."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mayhem-us","text":"/ˈmeɪhɛm/"}]},{"word":"WASHERS","idx":16672,"count":2180888,"meanings":[{"definitions":[{"definition":"Something that washes; especially an appliance such as a washing machine or dishwasher."},{"definition":"A person who washes (especially clothes) for a living; a washerman or washerwoman."},{"definition":"A flat disk, placed beneath a nut or at some joint, to distribute pressure, alleviate friction or prevent leakage."},{"definition":"A face cloth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fit (a mechanical device) with a washer."}],"partOfSpeech":"ve"}]},{"word":"POLYMERASE","idx":16675,"count":2180425,"meanings":[{"definitions":[{"definition":"Any of various enzymes that catalyze the formation of polymers of DNA or RNA using an existing strand of RNA or DNA respectively as a template."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"polymerase-ca"}]},{"word":"OPTIMISATION","idx":16676,"count":2180387,"meanings":[{"definitions":[{"definition":"The design and operation of a system or process to make it as good as possible in some defined sense."}],"partOfSpeech":"n"}]},{"word":"OCTAVE","idx":16677,"count":2180280,"meanings":[{"definitions":[{"definition":"An interval of twelve semitones spanning eight degrees of the diatonic scale, representing a doubling or halving in pitch frequency.","example":"The melody jumps up an octave at the beginning, then later drops back down an octave."},{"definition":"The pitch an octave higher than a given pitch.","example":"The bass starts on a low E, and the tenor comes in on the octave."},{"definition":"A coupler on an organ which allows the organist to sound the note an octave above the note of the key pressed (cf sub-octave)"},{"definition":"A poetic stanza consisting of eight lines; usually used as one part of a sonnet."},{"definition":"The eighth defensive position, with the sword hand held at waist height, and the tip of the sword out straight at knee level."},{"definition":"The day that is one week after a feast day in the Latin rite of the Catholic Church."},{"definition":"An eight-day period beginning on a feast day in the Latin rite of the Catholic Church."},{"definition":"An octonion."},{"definition":"Any of a number of coherent-noise functions of differing frequency that are added together to form Perlin noise."},{"definition":"The subjective vibration of a planet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Consisting of eight; eight in number."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"octave-uk","text":"/ˈɒkteɪv/"}]},{"word":"STRUTS","idx":16678,"count":2180214,"meanings":[{"definitions":[{"definition":"Protuberance, air pressure"},{"definition":"A proud step or walk, with the head erect; affected dignity in walking."},{"definition":"A support rod."},{"definition":"An instrument for adjusting the pleats of a ruff."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To swell; protuberate; bulge or spread out."},{"definition":"(originally said of fowl) To stand or walk stiffly, with the tail erect and spread out."},{"definition":"To walk proudly or haughtily.","example":"He strutted about the yard, thinking himself master of all he surveyed."},{"definition":"To cause to swell; enlarge; give more importance to."},{"definition":"To protrude; cause to bulge."},{"definition":"To brace or support by a strut or struts; hold in place or strengthen by an upright, diagonal, or transverse support."}],"partOfSpeech":"ve"}]},{"word":"SUPPRESS","idx":16682,"count":2179050,"meanings":[{"definitions":[{"definition":"To put an end to, especially with force, to crush, do away with; to prohibit, subdue.","example":"Political dissent was brutally suppressed."},{"definition":"To restrain or repress, such as laughter or an expression.","example":"I struggled to suppress my smile."},{"definition":"To exclude undesirable thoughts from one's mind.","example":"He unconsciously suppressed his memories of abuse."},{"definition":"To prevent publication.","example":"The government suppressed the findings of their research about the true state of the economy."},{"definition":"To stop a flow or stream.","example":"Hot blackcurrant juice mixed with honey may suppress cough."},{"definition":"To forbid the use of evidence at trial because it is improper or was improperly obtained."},{"definition":"To reduce unwanted frequencies in a signal."},{"definition":"To hold in place, to keep low."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"suppress-us","text":"/səˈpɹɛs/"}]},{"word":"DAMS","idx":16684,"count":2178745,"meanings":[{"definitions":[{"definition":"A structure placed across a flowing body of water to stop the flow or part of the flow, generally for purposes such as retaining or diverting some of the water or retarding the release of accumulated water to avoid abrupt flooding.","example":"A dam is often an essential source of water to farmers of hilly country."},{"definition":"The water reservoir resulting from placing such structure.","example":"Boats may only be used at places set aside for boating on the dam."},{"definition":"A device to prevent a tooth from getting wet during dental work, consisting of a rubber sheet held with a band."},{"definition":"A reservoir."},{"definition":"A firebrick wall, or a stone, which forms the front of the hearth of a blast furnace."},{"definition":"Female parent, mother, generally regarding breeding of animals (correlative to sire)."},{"definition":"A kind of crowned piece in the game of draughts."},{"definition":"An obsolete Indian copper coin, equal to a fortieth of a rupee."},{"definition":"A former coin of Nepal, 128 of which were worth one mohar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To block the flow of water."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dæmz/"}]},{"word":"DESERVED","idx":16685,"count":2178581,"meanings":[{"definitions":[{"definition":"To be entitled to, as a result of past actions; to be worthy to have.","example":"After playing so well, the team really deserved their win."},{"definition":"To earn, win."},{"definition":"To reward, to give in return for service."},{"definition":"To serve; to treat; to benefit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"deserved-us","text":"/dɪˈzɝvd/"}]},{"word":"VIOLATES","idx":16686,"count":2178320,"meanings":[{"definitions":[{"definition":"To break or disregard (a rule or convention).","example":"Accessing unauthorized files violates security protocol."},{"definition":"To rape."},{"definition":"To cite (a person) for a parole violation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"violates-us"}]},{"word":"DIALUP","idx":16688,"count":2177773,"meanings":[{"definitions":[{"definition":"A network connection that requires a telephone number to be dialed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a connection to a network, especially to the Internet) that requires a telephone number to be dialed"}],"partOfSpeech":"j"}]},{"word":"AFRO","idx":16692,"count":2177296,"meanings":[{"definitions":[{"definition":"A hairstyle characterized by a tightly curled locks and a rounded shape."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæf.ɹoʊ/"}]},{"word":"SEPARATES","idx":16693,"count":2177004,"meanings":[{"definitions":[{"definition":"(usually in the plural) Anything that is sold by itself, especially an article of clothing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide (a thing) into separate parts.","example":"Separate the articles from the headings."},{"definition":"To disunite from a group or mass; to disconnect."},{"definition":"To cause (things or people) to be separate.","example":"If the kids get too noisy, separate them for a few minutes."},{"definition":"To divide itself into separate pieces or substances.","example":"The sauce will separate if you don't keep stirring."},{"definition":"To set apart; to select from among others, as for a special use or service."}],"partOfSpeech":"ve"}]},{"word":"PROOFS","idx":16694,"count":2176910,"meanings":[{"definitions":[{"definition":"An effort, process, or operation designed to establish or discover a fact or truth; an act of testing; a test; a trial."},{"definition":"The degree of evidence which convinces the mind of any truth or fact, and produces belief; a test by facts or arguments which induce, or tend to induce, certainty of the judgment; conclusive evidence; demonstration."},{"definition":"The quality or state of having been proved or tried; firmness or hardness which resists impression, or does not yield to force; impenetrability of physical bodies."},{"definition":"Experience of something."},{"definition":"Firmness of mind; stability not to be shaken."},{"definition":"A proof sheet; a trial impression, as from type, taken for correction or examination."},{"definition":"A sequence of statements consisting of axioms, assumptions, statements already demonstrated in another proof, and statements that logically follow from previous statements in the sequence, and which concludes with a statement that is the object of the proof."},{"definition":"A process for testing the accuracy of an operation performed. Compare prove, transitive verb, 5."},{"definition":"Armour of excellent or tried quality, and deemed impenetrable; properly, armour of proof."},{"definition":"A measure of the alcohol content of liquor. Originally, in Britain, 100 proof was defined as 57.1% by volume (no longer used). In the US, 100 proof means that the alcohol content is 50% of the total volume of the liquid; thus, absolute alcohol would be 200 proof."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To proofread."},{"definition":"To make resistant, especially to water."},{"definition":"To allow yeast-containing dough to rise."},{"definition":"To test the activeness of yeast."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"proofs-us","text":"/pɹuːfs/"}]},{"word":"PRECEDENT","idx":16695,"count":2176695,"meanings":[{"definitions":[{"definition":"An act in the past which may be used as an example to help decide the outcome of similar instances in the future."},{"definition":"A decided case which is cited or used as an example to justify a judgment in a subsequent case."},{"definition":"An established habit or custom."},{"definition":"(with definite article) The aforementioned (thing)."},{"definition":"The previous version."},{"definition":"A rough draught of a writing which precedes a finished copy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide precedents for."},{"definition":"To be a precedent for."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Happening or taking place earlier in time; previous or preceding."},{"definition":"Coming before in a particular order or arrangement; preceding, foregoing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹɪˈsiː.dənt/"}]},{"word":"BIOSYNTHESIS","idx":16696,"count":2176610,"meanings":[{"definitions":[{"definition":"The synthesis of organic compounds within a living organism, especially the synthesis of large compounds from small ones."}],"partOfSpeech":"n"}]},{"word":"PROSECUTORS","idx":16697,"count":2176534,"meanings":[{"definitions":[{"definition":"A prosecuting attorney.","example":"Annie Jay was the Wisconsin government prosecutor in the trial of a man for forging his client's signature."},{"definition":"A person, as a complainant, victim, or chief witness, who institutes prosecution in a criminal proceeding.","example":"The prosecutor got the witness to admit he was lying."}],"partOfSpeech":"n"}]},{"word":"CONFIRMING","idx":16698,"count":2176371,"meanings":[{"definitions":[{"definition":"To strengthen; to make firm or resolute."},{"definition":"To administer the sacrament of confirmation on (someone)."},{"definition":"To assure the accuracy of previous statements."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of confirmation."}],"partOfSpeech":"n"}]},{"word":"GARTH","idx":16699,"count":2176273,"meanings":[{"definitions":[{"definition":"A grassy quadrangle surrounded by cloisters"},{"definition":"A close; a yard; a croft; a garden.","example":"a cloister garth"},{"definition":"A clearing in the woods; as such, part of many placenames in northern England"},{"definition":"A group or a household dedicated to the pagan faith Heathenry."},{"definition":"A location or sacred space, in ritual and poetry in modern Heathenry."},{"definition":"A dam or weir for catching fish."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡɑː(ɹ)θ/"}]},{"word":"ALLOYS","idx":16701,"count":2175171,"meanings":[{"definitions":[{"definition":"A metal that is a combination of two or more elements, at least one of which is a metal."},{"definition":"A metal of lesser value, mixed with a metal of greater value.","example":"gold without alloy"},{"definition":"An admixture; something added which stains, taints etc."},{"definition":"Fusion, marriage, combination."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mix or combine; often used of metals."},{"definition":"To reduce the purity of by mixing with a less valuable substance.","example":"to alloy gold with silver or copper, or silver with copper"},{"definition":"To impair or debase by mixture.","example":"to alloy pleasure with misfortunes"}],"partOfSpeech":"ve"}]},{"word":"GETAWAYS","idx":16703,"count":2174538,"meanings":[{"definitions":[{"definition":"A means of escape."},{"definition":"The effecting of an escape."},{"definition":"A vacation or holiday, or the destination for one."}],"partOfSpeech":"n"}]},{"word":"FACILITATED","idx":16704,"count":2174363,"meanings":[{"definitions":[{"definition":"To make easy or easier."},{"definition":"To help bring about."},{"definition":"To preside over (a meeting, a seminar)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made easier"}],"partOfSpeech":"j"}]},{"word":"METAPHOR","idx":16707,"count":2174119,"meanings":[{"definitions":[{"definition":"The use of a word or phrase to refer to something that it is not, invoking a direct similarity between the word or phrase used and the thing described (but in the case of English without the words like or as, since use of those words would imply a simile); the word or phrase used in this way; an implied comparison."},{"definition":"The use of an everyday object or concept to represent an underlying facet of the computer and thus aid users in performing tasks.","example":"desktop metaphor; wastebasket metaphor"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a metaphor."},{"definition":"To describe by means of a metaphor."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"metaphor-us","text":"/ˈme.tə.fɚ/"},{"audio":"metaphor-uk","text":"/ˈmɛt.ə.fɔː(ɹ)/"}]},{"word":"WONDERLAND","idx":16709,"count":2173907,"meanings":[{"definitions":[{"definition":"An imaginary or real place full of wonder or marvels."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwʌndɚˌlænd/"},{"text":"/ˈwʌndəˌlænd/"}]},{"word":"INFUSION","idx":16710,"count":2173865,"meanings":[{"definitions":[{"definition":"A product consisting of a liquid which has had other ingredients steeped in it to extract useful qualities.","example":"An extract of rooibos and chamomile makes a refreshing infusion."},{"definition":"The act of steeping or soaking a substance in liquid so as to extract medicinal or herbal qualities."},{"definition":"The act of installing a quality into a person."},{"definition":"The act of dipping into a fluid."},{"definition":"(medicine) The administration of liquid substances directly into a vein for medical purposes; perfusion."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈfjuːʒən/"}]},{"word":"JESSIE","idx":16711,"count":2173750,"meanings":[{"definitions":[{"definition":"(sometimes uncapitalized) A cowardly person, especially a man; an effeminate man."}],"partOfSpeech":"n"}]},{"word":"ORGANISING","idx":16712,"count":2173646,"meanings":[{"definitions":[{"definition":"The act or process by which something is organised."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To arrange in working order."},{"definition":"To constitute in parts, each having a special function, act, office, or relation; to systematize."},{"definition":"(chiefly used in the past participle) To furnish with organs; to give an organic structure to; to endow with capacity for the functions of life","example":"an organized being"},{"definition":"To sing in parts.","example":"to organize an anthem"},{"definition":"To band together into a group or union that can bargain and act collectively; to unionize.","example":"the workers decided to organize; their next task was to organize the workers at the steel mill"}],"partOfSpeech":"ve"}]},{"word":"ZINE","idx":16713,"count":2172576,"meanings":[{"definitions":[{"definition":"A low-circulation, non-commercial publication of original or appropriated texts and images, especially one of minority interest."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ziːn/"}]},{"word":"CONN","idx":16714,"count":2172390,"meanings":[{"definitions":[{"definition":"The duty of directing a ship, usually used with the verb to have or to take and accompanied by the article \"the.\"","example":"The officer of the deck has the conn of the vessel; the captain took the conn when she reached the bridge."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To direct a ship; to superintend the steering of (a vessel); to watch the course of (a vessel) and direct the helmsman how to steer (especially through a channel, etc, rather than steer a compass direction).","example":"The pilot conned the ship safely into the harbor."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɑn/"},{"text":"/kɒn/"}]},{"word":"ARGUS","idx":16716,"count":2172332,"meanings":[{"definitions":[{"definition":"A watchful guardian."},{"definition":"An alert, observant person."},{"definition":"Either of two species of pheasant of Southeast Asia having large ocellated tails."},{"definition":"Any of various nymphalid butterflies of the genus Junonia. Also called pansies."}],"partOfSpeech":"n"}]},{"word":"MANGO","idx":16718,"count":2171900,"meanings":[{"definitions":[{"definition":"A tropical Asian fruit tree, Mangifera indica."},{"definition":"The fruit of the mango tree."},{"definition":"A pickled vegetable or fruit with a spicy stuffing; a vegetable or fruit which has been mangoed."},{"definition":"(chiefly southern Midwest US) A green bell pepper suitable for pickling."},{"definition":"A type of muskmelon, Cucumis melo."},{"definition":"Any of various hummingbirds of the genus Anthracothorax."},{"definition":"A yellow-orange color, like that of mango flesh."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stuff and pickle (a fruit)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mango-us","text":"/ˈmæŋɡoʊ/"}]},{"word":"SPUR","idx":16719,"count":2171795,"meanings":[{"definitions":[{"definition":"A rigid implement, often roughly y-shaped, that is fixed to one's heel for the purpose of prodding a horse. Often worn by, and emblematic of, the cowboy or the knight."},{"definition":"A jab given with the spurs."},{"definition":"Anything that inspires or motivates, as a spur does a horse."},{"definition":"An appendage or spike pointing rearward, near the foot, for instance that of a rooster."},{"definition":"Any protruding part connected at one end, for instance a highway that extends from another highway into a city."},{"definition":"Roots, tree roots."},{"definition":"A mountain that shoots from another mountain or range and extends some distance in a lateral direction, or at right angles."},{"definition":"A spiked iron worn by seamen upon the bottom of the boot, to enable them to stand upon the carcass of a whale to strip off the blubber."},{"definition":"A brace strengthening a post and some connected part, such as a rafter or crossbeam; a strut."},{"definition":"The short wooden buttress of a post."},{"definition":"A projection from the round base of a column, occupying the angle of a square plinth upon which the base rests, or bringing the bottom bed of the base to a nearly square form. It is generally carved in leafage."},{"definition":"Ergotized rye or other grain."},{"definition":"A wall in a fortification that crosses a part of a rampart and joins to an inner wall."},{"definition":"A piece of timber fixed on the bilgeways before launching, having the upper ends bolted to the vessel's side."},{"definition":"A curved piece of timber serving as a half to support the deck where a whole beam cannot be placed."},{"definition":"A branch of a vein."},{"definition":"A very short branch line of a railway line."},{"definition":"A short thin side shoot from a branch, especially one that bears fruit or, in conifers, the shoots that bear the leaves."},{"definition":"A tern."},{"definition":"A spurious tone, one that interferes with a signal in a circuit and is often masked underneath that signal."},{"definition":"The track of an animal, such as an otter; a spoor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prod (especially a horse) on the side or flank, with the intent to urge motion or haste, to gig."},{"definition":"To urge or encourage to action, or to a more vigorous pursuit of an object"},{"definition":"To put spurs on.","example":"to spur boots"},{"definition":"To press forward; to travel in great haste."},{"definition":"To ask, to inquire"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spur-us","text":"/spɝ/"}]},{"word":"JUBILEE","idx":16720,"count":2171646,"meanings":[{"definitions":[{"definition":"(Jewish history) A special year of emancipation supposed to be kept every fifty years, when farming was abandoned and Hebrew slaves were set free."},{"definition":"A 25th, 40th, 50th, 60th or 70th anniversary."},{"definition":"A special year (originally held every hundred years, then fifty, and then fewer) in which remission from sin could be granted as well as indulgences upon making a pilgrimage to Rome."},{"definition":"A time of celebration or rejoicing."},{"definition":"An occasion of mass manumission from slavery."},{"definition":"A period of fifty years; a half-century."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dʒuːbɪˈliː/"}]},{"word":"LANDMARKS","idx":16721,"count":2171203,"meanings":[{"definitions":[{"definition":"An object that marks the boundary of a piece of land (usually a stone, or a tree)."},{"definition":"A recognizable natural or man-made feature used for navigation."},{"definition":"A notable location with historical, cultural, or geographical significance."},{"definition":"A major event or discovery.","example":"a landmark paper in neurosurgery"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To officially designate a site or building as a landmark."}],"partOfSpeech":"ve"}]},{"word":"POLITE","idx":16722,"count":2171161,"meanings":[{"definitions":[{"definition":"To polish; to refine; to render polite."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Well-mannered, civilized.","example":"It's not polite to use a mobile phone in a restaurant."},{"definition":"Smooth, polished, burnished."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"polite","text":"/pəˈlaɪt/"}]},{"word":"THIGH","idx":16724,"count":2171107,"meanings":[{"definitions":[{"definition":"The upper leg of a human, between the hip and the knee."},{"definition":"That part of the leg of vertebrates (or sometimes other animals) which corresponds to the human thigh in position or function; the tibia of a horse, the tarsus of a bird; the third leg-section of an insect."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"thigh-us","text":"/θaɪ/"}]},{"word":"ASYNCHRONOUS","idx":16725,"count":2169827,"meanings":[{"definitions":[{"definition":"Not synchronous; occurring at different times."},{"definition":"(of a request or a message) Allowing the client to continue during processing."},{"definition":"(communication) Having many actions occurring at a time, in any order, without waiting for each other."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"asynchronous-uk","text":"/eɪˈsɪŋkɹənəs/"}]},{"word":"PAVING","idx":16726,"count":2169814,"meanings":[{"definitions":[{"definition":"To cover something with paving slabs."},{"definition":"To cover with stone, concrete, blacktop or other solid covering, especially to aid travel."},{"definition":"To pave the way for; to make easy and smooth."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The hard durable surface placed directly atop the ground, as on a street or sidewalk."},{"definition":"Interior pavement, as in a cathedral."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to the material used for pavement, or to the surface itself."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpeɪvɪŋ/"}]},{"word":"CYCLONE","idx":16727,"count":2169364,"meanings":[{"definitions":[{"definition":"(broad sense) A weather phenomenon consisting of a system of winds rotating around a center of low atmospheric pressure"},{"definition":"(narrow sense) Such weather phenomenon occurring in the South Pacific and Indian Ocean"},{"definition":"A low pressure system."},{"definition":"The more or less violent, small-scale circulations such as tornadoes, waterspouts, and dust devils."},{"definition":"A strong wind."},{"definition":"A cyclone separator; the cylindrical vortex tube within such a separator"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cyclone-us","text":"/ˈsaɪ.kloʊn/"}]},{"word":"PERENNIAL","idx":16728,"count":2169281,"meanings":[{"definitions":[{"definition":"A perennial plant; a plant that is active throughout the year or survives for more than two growing seasons."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Lasting or remaining active throughout the year, or all the time.","example":"a perennial stream"},{"definition":"(of a plant) Having a life cycle of more than two years."},{"definition":"Continuing without cessation or intermission; perpetual; never failing."},{"definition":"Enduring; lasting; timeless.","example":"His artwork has a perennial beauty."},{"definition":"Recurrent; appearing or recurring again and again.","example":"Change is a perennial theme in politics."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"perennial-us","text":"/pəˈɹɛni.əl/"}]},{"word":"SEVENTEEN","idx":16731,"count":2168961,"meanings":[{"definitions":[{"definition":"The cardinal number occurring after sixteen and before eighteen, represented in Roman numerals as XVII and in Arabic numerals as 17."}],"partOfSpeech":"nu"}],"phonetics":[{"audio":"seventeen-us"},{"text":"/ˈsɛv.ən.tiːn/"}]},{"word":"MEATS","idx":16733,"count":2168286,"meanings":[{"definitions":[{"definition":"The flesh (muscle tissue) of an animal used as food.","example":"A large portion of domestic meat production comes from animals raised on factory farms."},{"definition":"A type of meat, by anatomic position and provenance.","example":"The butchery's profit rate on various meats varies greatly."},{"definition":"Food, for animals or humans, especially solid food. See also meat and drink."},{"definition":"A type of food, a dish."},{"definition":"A meal."},{"definition":"Meal; flour."},{"definition":"Any relatively thick, solid part of a fruit, nut etc.","example":"The apple looked fine on the outside, but the meat was not very firm."},{"definition":"A penis."},{"definition":"The best or most substantial part of something.","example":"We recruited him right from the meat of our competitor."},{"definition":"The sweet spot of a bat or club (in cricket, golf, baseball etc.).","example":"He hit it right on the meat of the bat."},{"definition":"A meathead.","example":"Throw it in here, meat."},{"definition":"(Australian Aboriginal) A totem, or (by metonymy) a clan or clansman which uses it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/miːts/"}]},{"word":"CLEARINGHOUSE","idx":16734,"count":2168182,"meanings":[{"definitions":[{"definition":"A central point where clearing banks and other financial firms exchange checks, settle accounts, etc."},{"definition":"(by extension) A hub of goods traffic"},{"definition":"(GIS) A repository structure, physical or virtual, that collects, stores, and disseminates information, metadata, and data"}],"partOfSpeech":"n"}]},{"word":"BULLDOG","idx":16737,"count":2167341,"meanings":[{"definitions":[{"definition":"A breed of dog developed in England by the crossing of the bullbaiting dog and the Pug to produce a ladies companion dog. Having a very smooth coat, a flattened face, wrinkly cheeks, powerful front legs and smaller hind legs."},{"definition":"British bulldog"},{"definition":"A stubborn person."},{"definition":"A refractory material used as a furnace lining, obtained by calcining the cinder or slag from the puddling furnace of a rolling mill."},{"definition":"(Oxford University slang) One of the proctors' officers."},{"definition":"(pro wrestling) Any move in which the wrestler grabs an opponent's head and jumps forward, so that the wrestler lands, often in a sitting position, and drives the opponent's face into the mat."},{"definition":"A bulldog edition."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To chase (a steer) on horseback and wrestle it to the ground by twisting its horns (as a rodeo performance)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bulldog-uk","text":"/ˈbʊldɒɡ/"}]},{"word":"CLEAVAGE","idx":16738,"count":2166872,"meanings":[{"definitions":[{"definition":"The act of cleaving or the state of being cleft."},{"definition":"The hollow or separation between a woman's breasts, especially as revealed by a low neckline."},{"definition":"(by extension) Any similar separation between two body parts, such as the buttocks or toes."},{"definition":"The repeated division of a cell into daughter cells after mitosis."},{"definition":"The splitting of a large molecule into smaller ones."},{"definition":"The tendency of a crystal to split along specific planes."},{"definition":"The division of voters into voting blocs."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈklivɪdʒ/"},{"text":"/ˈkliːvɪdʒ/"},{"audio":"cleavage-au"}]},{"word":"ANALYSED","idx":16739,"count":2166678,"meanings":[{"definitions":[{"definition":"To subject to analysis."},{"definition":"To resolve (anything complex) into its elements."},{"definition":"To separate into the constituent parts, for the purpose of an examination of each separately."},{"definition":"To examine in such a manner as to ascertain the elements or nature of the thing examined; as, to analyze a fossil substance, to analyze a sentence or a word, or to analyze an action to ascertain its morality."}],"partOfSpeech":"ve"}]},{"word":"GRADUAL","idx":16741,"count":2166399,"meanings":[{"definitions":[{"definition":"An antiphon or responsory after the epistle, in the Mass, which was sung on the steps, or while the deacon ascended the steps."},{"definition":"A service book containing the musical portions of the Mass."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Proceeding or advancing by small, slow, regular steps or degrees","example":"a gradual increase of knowledge; a gradual decline"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gradual-us","text":"/ˈɡɹædʒuəl/"}]},{"word":"BRETHREN","idx":16742,"count":2165812,"meanings":[{"definitions":[{"definition":"Of or akin to; related; like"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Son of the same parents as another person."},{"definition":"A male having at least one parent in common with another (see half-brother, stepbrother)."},{"definition":"A male fellow member of a religious community, church, trades union etc.","example":"I would like to thank the brother who just spoke."},{"definition":"A form of address to a man.","example":"Listen, brother, I don't know what you want, but I'm not interested."},{"definition":"A black male."},{"definition":"Somebody, usually male, connected by a common cause or situation."},{"definition":"Someone who is a peer, whether male or female."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"brethren-us","text":"/ˈbɹɛðɹən/"}]},{"word":"FACILITATES","idx":16743,"count":2165802,"meanings":[{"definitions":[{"definition":"To make easy or easier."},{"definition":"To help bring about."},{"definition":"To preside over (a meeting, a seminar)."}],"partOfSpeech":"ve"}]},{"word":"EMBODIMENT","idx":16744,"count":2165658,"meanings":[{"definitions":[{"definition":"The process of embodying."},{"definition":"A physical entity typifying an abstract concept.","example":"You are the very embodiment of beauty."}],"partOfSpeech":"n"}]},{"word":"SPECIALISED","idx":16745,"count":2165541,"meanings":[{"definitions":[{"definition":"To make distinct or separate, particularly:"},{"definition":"To become distinct or separate, particularly:"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Highly skilled in a specific field."}],"partOfSpeech":"j"}]},{"word":"VIOLATING","idx":16748,"count":2165306,"meanings":[{"definitions":[{"definition":"To break or disregard (a rule or convention).","example":"Accessing unauthorized files violates security protocol."},{"definition":"To rape."},{"definition":"To cite (a person) for a parole violation."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈvaɪəˌleɪtɪŋ/"}]},{"word":"RECRUITED","idx":16749,"count":2164551,"meanings":[{"definitions":[{"definition":"To enroll or enlist new members or potential employees on behalf of an employer, organization, sports team, the military, etc.","example":"We need to recruit more admin staff to deal with the massive surge in popularity of our products"},{"definition":"To supply with new men, as an army; to fill up or make up by enlistment; also, to muster","example":"the army was recruited for a campaign"},{"definition":"To replenish, renew, or reinvigorate by fresh supplies; to remedy a lack or deficiency in."},{"definition":"To recuperate; to gain health, flesh, spirits, or the like.","example":"Go to the country to recruit."},{"definition":"To prompt a protein, leucocyte. etc. to intervene in a given region of the body."}],"partOfSpeech":"ve"}]},{"word":"SKIS","idx":16751,"count":2164527,"meanings":[{"definitions":[{"definition":"One of a pair of long flat runners designed for gliding over snow or water"},{"definition":"One of a pair of long flat runners under some flying machines, used for landing"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move on skis"},{"definition":"To travel over (a slope etc.) on skis; to travel on skis at (a place), (especially as a sport)"}],"partOfSpeech":"ve"}]},{"word":"CALC","idx":16752,"count":2164428,"meanings":[{"definitions":[{"definition":"The act or process of calculating."},{"definition":"The result of calculating."},{"definition":"Reckoning, estimate.","example":"By my calculation, we should be there by midnight."},{"definition":"An expectation based on circumstances."},{"definition":"A mechanical or electronic device that performs mathematical calculations."},{"definition":"A person who performs mathematical calculation"},{"definition":"A person who calculates (in the sense of scheming)."},{"definition":"A set of mathematical tables."},{"definition":"Calculation; computation."},{"definition":"Any formal system in which symbolic expressions are manipulated according to fixed rules.","example":"lambda calculus"},{"definition":"(often definite, the calculus) Differential calculus and integral calculus considered as a single subject; analysis."},{"definition":"A stony concretion that forms in a bodily organ.","example":"renal calculus ( = kidney stone)"},{"definition":"Deposits of calcium phosphate salts on teeth."},{"definition":"A decision-making method, especially one appropriate for a specialised realm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kælk/"}]},{"word":"MARKETERS","idx":16753,"count":2164086,"meanings":[{"definitions":[{"definition":"One who designs and executes marketing campaigns."},{"definition":"One who sells goods at a market."}],"partOfSpeech":"n"}]},{"word":"TRAILING","idx":16755,"count":2163754,"meanings":[{"definitions":[{"definition":"To follow behind (someone or something); to tail (someone or something).","example":"The hunters trailed their prey deep into the woods."},{"definition":"To drag (something) behind on the ground.","example":"You'll get your coat all muddy if you trail it around like that."},{"definition":"To leave (a trail of).","example":"He walked into the house, soaking wet, and trailed water all over the place."},{"definition":"To show a trailer of (a film, TV show etc.); to release or publish a preview of (a report etc.) in advance of the full publication.","example":"His new film was trailed on TV last night."},{"definition":"To hang or drag loosely behind; to move with a slow sweeping motion.","example":"The bride's long dress trailed behind her as she walked down the aisle."},{"definition":"To run or climb like certain plants."},{"definition":"To drag oneself lazily or reluctantly along.","example":"Our parents marched to church and we trailed behind."},{"definition":"To be losing, to be behind in a competition."},{"definition":"To carry (a firearm) with the breech near the ground and the upper part inclined forward, the piece being held by the right hand near the middle."},{"definition":"To flatten (grass, etc.) by walking through it; to tread down."},{"definition":"To take advantage of the ignorance of; to impose upon."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fabric or other material that trails."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of points and crossovers) That converges in the direction of travel."},{"definition":"That which is attached and pulled behind."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"trailing-us"}]},{"word":"PACT","idx":16756,"count":2163660,"meanings":[{"definitions":[{"definition":"An agreement; a compact; a covenant."},{"definition":"An agreement between two or more nations"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a pact; to agree formally."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pækt/"}]},{"word":"LIPSTICK","idx":16758,"count":2163155,"meanings":[{"definitions":[{"definition":"Makeup for the lips.","example":"Are you wearing any lipstick today?"},{"definition":"A stick of this make-up.","example":"I'd like three lipsticks in this shade."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply lipstick to; to paint with lipstick."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lipstick-us","text":"/ˈlɪpˌstɪk/"}]},{"word":"HONOURABLE","idx":16759,"count":2163115,"meanings":[{"definitions":[{"definition":"Worthy of respect; respectable."},{"definition":"A courtesy title, given in Britain and the Commonwealth to a cabinet minister, minister of state, or senator, and in the United States to the president, vice president, congresspeople, state governors and legislators, and mayors."}],"partOfSpeech":"j"}]},{"word":"LULU","idx":16760,"count":2162895,"meanings":[{"definitions":[{"definition":"A remarkable person, object or idea."},{"definition":"A very attractive or alluring person."},{"definition":"A very bad mistake or error."},{"definition":"A fixed allowance paid to a legislator in lieu of reimbursement for actual expenses."}],"partOfSpeech":"n"}]},{"word":"WINDY","idx":16761,"count":2162674,"meanings":[{"definitions":[{"definition":"Fart"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Accompanied by wind.","example":"It was a long and windy night."},{"definition":"Unsheltered and open to the wind.","example":"They made love in a windy bus shelter."},{"definition":"Empty and lacking substance.","example":"They made windy promises they would not keep."},{"definition":"Long-winded; orally verbose."},{"definition":"Flatulent."},{"definition":"Nervous, frightened."},{"definition":"(of a path etc) Having many bends; winding, twisting or tortuous."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"windy-1-au","text":"/ˈwɪndi/"}]},{"word":"PUNISHED","idx":16764,"count":2162545,"meanings":[{"definitions":[{"definition":"To cause to suffer for crime or misconduct, to administer disciplinary action.","example":"If a prince violates the law, then he must be punished like an ordinary person."},{"definition":"To treat harshly and unfairly."},{"definition":"To handle or beat severely; to maul."},{"definition":"To consume a large quantity of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been the object of punishment."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpʌnɪʃt/"}]},{"word":"SATURATION","idx":16765,"count":2162437,"meanings":[{"definitions":[{"definition":"The act of saturating or the process of being saturated"},{"definition":"The condition in which, after a sufficient increase in a causal force, no further increase in the resultant effect is possible; e.g. the state of a ferromagnetic material that cannot be further magnetized"},{"definition":"The state of a saturated solution"},{"definition":"The state of an organic compound that has no double or triple bonds"},{"definition":"The state of the atmosphere when it is saturated with water vapour; 100% humidity"},{"definition":"The intensity or vividness of a colour."},{"definition":"(color) Chromatic purity; freedom from dilution with white."},{"definition":"Intense bombing of a military target with the aim of destroying it"},{"definition":"The flooding of a market with all of a product that can be sold"},{"definition":"An effect on the sound of an electric guitar, used primarily in heavy metal music"},{"definition":"The condition at which a component of the system has reached its maximum traffic-handling capacity, i.e. one erlang per circuit."},{"definition":"The point at which the output of a linear device, such as a linear amplifier, deviates significantly from being a linear function of the input when the input signal is increased.","example":"Modulation often requires that amplifiers operate below saturation."}],"partOfSpeech":"n"}]},{"word":"CHRONOLOGY","idx":16768,"count":2161984,"meanings":[{"definitions":[{"definition":"The science of determining the order in which events occurred."},{"definition":"An arrangement of events into chronological order; called a timeline when involving graphical elements."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɹəˈnɒl.ə.dʒi/"}]},{"word":"MASTERY","idx":16769,"count":2161704,"meanings":[{"definitions":[{"definition":"The position or authority of a master; dominion; command; supremacy; superiority."},{"definition":"Superiority in war or competition; victory; triumph; preeminence."},{"definition":"Contest for superiority."},{"definition":"A masterly operation; a feat."},{"definition":"The philosopher's stone."},{"definition":"The act or process of mastering; the state of having mastered; expertise."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mastery-uk","text":"/ˈmɑːst(ə)ɹi/"}]},{"word":"THERMOMETER","idx":16770,"count":2161420,"meanings":[{"definitions":[{"definition":"An apparatus used to measure temperature."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"thermometer-us","text":"/θɚˈmɑmɪtɚ/"}]},{"word":"CRANBERRY","idx":16771,"count":2161233,"meanings":[{"definitions":[{"definition":"A shrub belonging to the section Vaccinium sect. Oxycoccus of the genus Vaccinium."},{"definition":"The edible red berry of that shrub."},{"definition":"An intense red colour, like that of a cranberry"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of the intense red colour of a cranberry."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹænb(ə)ɹɪ/"}]},{"word":"KAN","idx":16772,"count":2160933,"meanings":[{"definitions":[{"definition":"A ruler over various Turkish, Tatar and Mongol peoples in the Middle Ages."},{"definition":"An Ottoman sultan."},{"definition":"A noble or man of rank in various Muslim countries of Central Asia, including Afghanistan."},{"definition":"A caravanserai; a resting-place for a travelling caravan."},{"definition":"A Japanese unit of weight, approximately 8.267 lb."}],"partOfSpeech":"n"}]},{"word":"DOWNHILL","idx":16773,"count":2160921,"meanings":[{"definitions":[{"definition":"The fastest of the disciplines of alpine skiing."},{"definition":"A rapid descent of a hill in related sports, especially in alpine skiing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in downhill skiing."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Located down a slope or hill."},{"definition":"Going down a slope or a hill."},{"definition":"(by extension) Easy."},{"definition":"(by extension) Deteriorating, getting worse.","example":"After Don made those tasteless remarks, our relationship with him went downhill."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Down a slope.","example":"Because we got to the summit of the mountain, we could only go downhill from there."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˌdaʊnˈhɪl/"},{"text":"/ˈdaʊnˌhɪl/"}]},{"word":"VITA","idx":16774,"count":2160856,"meanings":[{"definitions":[{"definition":"A curriculum vitae."}],"partOfSpeech":"n"}]},{"word":"STEER","idx":16777,"count":2159937,"meanings":[{"definitions":[{"definition":"A suggestion about a course of action."},{"definition":"A helmsman; a pilot."},{"definition":"The castrated male of cattle, especially one raised for beef production."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To guide the course of a vessel, vehicle, aircraft etc. (by means of a device such as a rudder, paddle, or steering wheel).","example":"I steered homeward."},{"definition":"To guide the course of a vessel, vehicle, aircraft etc. (by means of a device such as a rudder, paddle, or steering wheel).","example":"I find it very difficult to steer a skateboard."},{"definition":"To be directed and governed; to take a direction, or course; to obey the helm.","example":"The boat steers easily."},{"definition":"To direct a group of animals."},{"definition":"To maneuver or manipulate a person or group into a place or course of action.","example":"Hume believes that principles of association steer the imagination of artists."},{"definition":"To direct a conversation."},{"definition":"To conduct oneself; to take or pursue a course of action."},{"definition":"To castrate (a male calf)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"steer-us","text":"/stɪə(ɹ)/"}]},{"word":"NESTING","idx":16778,"count":2159830,"meanings":[{"definitions":[{"definition":"(of animals) To build or settle into a nest."},{"definition":"To settle into a home.","example":"We loved the new house and were nesting there in two days!"},{"definition":"To successively neatly fit inside another.","example":"I bought a set of nesting mixing bowls for my mother."},{"definition":"To place in, or as if in, a nest."},{"definition":"To place one thing neatly inside another, and both inside yet another (and so on).","example":"There would be much more room in the attic if you had nested all the empty boxes."},{"definition":"To hunt for birds' nests or their contents (usually \"go nesting\")."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which a bird nests."},{"definition":"The enclosure of one loop, block, etc. of code inside another."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnɛstɪŋ/"}]},{"word":"VOGUE","idx":16779,"count":2159792,"meanings":[{"definitions":[{"definition":"The prevailing fashion or style.","example":"Miniskirts were the vogue in the '60s."},{"definition":"Popularity or a current craze.","example":"Hula hoops are no longer in vogue."},{"definition":"A highly stylized modern dance that evolved out of the Harlem ballroom scene in the 1960s."},{"definition":"A cigarette."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dance in the vogue dance style."},{"definition":"To light a cigarette.","example":"Vogue me up."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/vəʊɡ/"}]},{"word":"AIRED","idx":16780,"count":2159611,"meanings":[{"definitions":[{"definition":"To bring (something) into contact with the air, so as to freshen or dry it."},{"definition":"To let fresh air into a room or a building, to ventilate."},{"definition":"To discuss varying viewpoints on a given topic."},{"definition":"To broadcast (a television show etc.)."},{"definition":"To be broadcast.","example":"This game show first aired in the 1990s and is still going today."},{"definition":"To ignore."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a complaint or problem) Having been uttered or spoken of, such that certain persons are aware."},{"definition":"(of a show) Having been broadcast, such as on television or radio."}],"partOfSpeech":"j"}]},{"word":"ATTN","idx":16781,"count":2159197,"meanings":[{"definitions":[{"definition":"Mental focus.","example":"Please direct your attention to the following words."},{"definition":"An action or remark expressing concern for or interest in someone or something, especially romantic interest."},{"definition":"A state of alertness in the standing position.","example":"The company will now come to attention."}],"partOfSpeech":"n"}]},{"word":"SPAGHETTI","idx":16782,"count":2158989,"meanings":[{"definitions":[{"definition":"A type of pasta made in the shape of long thin strings."},{"definition":"A dish that has spaghetti as a main part of it, such as spaghetti bolognese."},{"definition":"Any type of pasta."},{"definition":"Electrical insulating tubing."},{"definition":"Anything tangled or confusing."},{"definition":"A spaghetti western."},{"definition":"Spaghetti code."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become, or appear to become longer and thinner.","example":"The cables spaghettied onto the shoulder of the technician."},{"definition":"To stretch to become longer and thinner.","example":"He spaghettied the referee when he landed on him."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"[spəˈɡɛɾi]"}]},{"word":"OUTWARD","idx":16783,"count":2158902,"meanings":[{"definitions":[{"definition":"Outer; located towards the outside"},{"definition":"Visible, noticeable","example":"By all outward indications, he's a normal happy child, but if you talk to him, you will soon realize he has some psychological problems."},{"definition":"Tending to the exterior or outside."},{"definition":"Foreign; not civil or intestine.","example":"an outward war"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Towards the outside; away from the centre.","example":"We are outward bound."},{"definition":"Outwardly, in outer appearances; publicly."}],"partOfSpeech":"v"},{"definitions":[{"definition":"To ward off; to keep out."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A ward in a detached building connected with a hospital."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"outward-1-us","text":"/ˈaʊt.wɚd/"}]},{"word":"WHISPER","idx":16784,"count":2158715,"meanings":[{"definitions":[{"definition":"The act of speaking in a quiet voice, especially, without vibration of the vocal cords."},{"definition":"(usually in the plural) A rumor.","example":"There are whispers of rebellion all around."},{"definition":"A faint trace or hint (of something).","example":"The soup had just a whisper of basil."},{"definition":"A low rustling sound, like that of the wind in leaves."},{"definition":"A private message to an individual in a chat room."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To speak softly, or under the breath, so as to be heard only by one near at hand; to utter words without sonant breath; to talk without that vibration in the larynx which gives sonorous, or vocal, sound."},{"definition":"To mention privately and confidentially, or in a whisper."},{"definition":"To make a low, sibilant sound."},{"definition":"To speak with suspicion or timorous caution; to converse in whispers, as in secret plotting."},{"definition":"To address in a whisper, or low voice."},{"definition":"To prompt secretly or cautiously; to inform privately."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"whisper-us","text":"/ˈ(h)wɪspɚ/"}]},{"word":"BOOGIE","idx":16787,"count":2157978,"meanings":[{"definitions":[{"definition":"A piece of solid or semisolid mucus in or removed from the nostril cavity."},{"definition":"A black person."},{"definition":"Dancing usually prominently exhibiting movements of the buttocks."},{"definition":"(skydiving) A large, organised skydiving event."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dance a boogie."},{"definition":"To move, walk, leave, exit.","example":"Let's boogie on out of here."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbuːɡi/"}]},{"word":"EAN","idx":16789,"count":2157566,"meanings":[{"definitions":[{"definition":"To bring forth young; to yean."}],"partOfSpeech":"ve"}]},{"word":"COMPROMISED","idx":16791,"count":2156859,"meanings":[{"definitions":[{"definition":"To bind by mutual agreement."},{"definition":"To adjust and settle by mutual concessions; to compound."},{"definition":"To find a way between extremes."},{"definition":"To pledge by some act or declaration; to endanger the life, reputation, etc., of, by some act which can not be recalled; to expose to suspicion."},{"definition":"To cause impairment of."},{"definition":"To breach (a security system).","example":"He tried to compromise the security in the computer by guessing the password."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been compromised."}],"partOfSpeech":"j"}]},{"word":"UTILIZES","idx":16792,"count":2156760,"meanings":[{"definitions":[{"definition":"To make use of; to use."},{"definition":"To make useful; to find a practical use for."},{"definition":"To make best use of; to use to its fullest extent, potential, or ability."},{"definition":"To make do with; to use in manner different from that originally intended"}],"partOfSpeech":"ve"}]},{"word":"CONFESSION","idx":16793,"count":2156622,"meanings":[{"definitions":[{"definition":"The open admittance of having done something (especially something bad).","example":"Without the real murderer's confession, an innocent person will go to jail."},{"definition":"A formal document providing such an admission.","example":"He forced me to sign a confession!"},{"definition":"The disclosure of one's sins to a priest for absolution. In the Roman Catholic Church, it is now termed the sacrament of reconciliation.","example":"I went to confession and now I feel much better about what I had done."},{"definition":"Acknowledgment of belief; profession of one's faith."},{"definition":"A formula in which the articles of faith are comprised; a creed to be assented to or signed, as a preliminary to admission to membership of a church; a confession of faith."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"confession-us","text":"/kənˈfɛʃən/"}]},{"word":"DEPRIVED","idx":16794,"count":2155999,"meanings":[{"definitions":[{"definition":"To take something away from (someone) and keep it away; to deny someone something."},{"definition":"To degrade (a clergyman) from office."},{"definition":"To bereave."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Subject to deprivation; poor."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈpɹaɪvd/"}]},{"word":"LESBOS","idx":16796,"count":2155731,"meanings":[{"definitions":[{"definition":"Lesbian."}],"partOfSpeech":"n"}]},{"word":"VODKA","idx":16797,"count":2155662,"meanings":[{"definitions":[{"definition":"A clear distilled alcoholic liquor made from grain mash."},{"definition":"A serving of the above beverage."},{"definition":"Neutral spirits distilled (or treated after distillation) so as to have no distinctive character, aroma, taste or color."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vodka-us","text":"/ˈvɑdkə/"}]},{"word":"MOLDING","idx":16798,"count":2154964,"meanings":[{"definitions":[{"definition":"To shape in or on a mold; to form into a particular shape; to give shape to."},{"definition":"To guide or determine the growth or development of; influence"},{"definition":"To fit closely by following the contours of."},{"definition":"To make a mold of or from (molten metal, for example) before casting."},{"definition":"To ornament with moldings."},{"definition":"To be shaped in or as if in a mold.","example":"These shoes gradually molded to my feet."},{"definition":"To cause to become moldy; to cause mold to grow upon."},{"definition":"To become moldy; to be covered or filled, in whole or in part, with a mold."},{"definition":"To cover with mold or soil."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process of shaping in or on a mold, or of making molds; the art or occupation of a molder."},{"definition":"Anything cast in a mold, or which appears to be so, as grooved or ornamental bars of wood or metal."},{"definition":"A plane, or curved, narrow surface, either sunk or projecting, used for decoration by means of the lights and shades upon its surface and to conceal joints, especially between unlike materials."},{"definition":"(woodwork) A planing machine for making moldings."},{"definition":"(founding) A machine to assist in making molds for castings."},{"definition":"(milling) A mill for shaping timber."},{"definition":"(founding) A kind of sand containing clay, used in making molds."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmoʊl.dɪŋ/"},{"text":"/ˈməʊl.dɪŋ/"}]},{"word":"ZAIRE","idx":16799,"count":2154891,"meanings":[{"definitions":[{"definition":"The unit of currency of Zaire."}],"partOfSpeech":"n"}]},{"word":"FASTENERS","idx":16800,"count":2154203,"meanings":[{"definitions":[{"definition":"Something or someone that fastens."},{"definition":"Mechanically, any device that fastens; especially, a collective term for items such as screws, nuts, washers, clasps, bolts and the like."}],"partOfSpeech":"n"}]},{"word":"BRICKS","idx":16801,"count":2154059,"meanings":[{"definitions":[{"definition":"A hardened rectangular block of mud, clay etc., used for building.","example":"This wall is made of bricks."},{"definition":"Such hardened mud, clay, etc. considered collectively, as a building material.","example":"This house is made of brick."},{"definition":"Something shaped like a brick.","example":"a plastic explosive brick"},{"definition":"A helpful and reliable person.","example":"Thanks for helping me wash the car. You're a brick."},{"definition":"A shot which misses, particularly one which bounces directly out of the basket because of a too-flat trajectory, as if the ball were a heavier object.","example":"We can't win if we keep throwing up bricks from three-point land."},{"definition":"A power brick; an external power supply consisting of a small box with an integral male power plug and an attached electric cord terminating in another power plug."},{"definition":"An electronic device, especially a heavy box-shaped one, that has become non-functional or obsolete."},{"definition":"A carton of 500 rimfire cartridges, which forms the approximate size and shape of a brick."},{"definition":"A community card (usually the turn or the river) which does not improve a player's hand.","example":"The two of clubs was a complete brick on the river."},{"definition":"The colour brick red."},{"definition":"One kilo of cocaine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To build with bricks."},{"definition":"To make into bricks."},{"definition":"To hit someone or something with a brick."},{"definition":"To make an electronic device nonfunctional and usually beyond repair, essentially making it no more useful than a brick.","example":"My VCR was bricked during the lightning storm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bricks-us","text":"/bɹɪks/"}]},{"word":"COMMUNISM","idx":16802,"count":2153825,"meanings":[{"definitions":[{"definition":"Any political ideology or philosophy advocating holding the production of resources collectively."},{"definition":"Any political social system that implements a communist political philosophy."},{"definition":"The international socialist society where classes, money, and the state no longer exist."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɒm.juˌnɪzm̩/"}]},{"word":"LEOPARD","idx":16803,"count":2153753,"meanings":[{"definitions":[{"definition":"Panthera pardus, a large wild cat with a spotted coat native to Africa and Asia, especially the male of the species (in contrast to leopardess)."},{"definition":"(inexact) A similar-looking, large wild cat named after the leopard."},{"definition":"A lion passant guardant."},{"definition":"Any of various nymphalid butterflies of the genus Phalanta, having black markings on an orange base."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"leopard-us","text":"/ˈlɛpɚd/"}]},{"word":"FLOWERING","idx":16806,"count":2151998,"meanings":[{"definitions":[{"definition":"To put forth blooms.","example":"This plant flowers in June."},{"definition":"To decorate with pictures of flowers."},{"definition":"To reach a state of full development or achievement."},{"definition":"To froth; to ferment gently, as new beer."},{"definition":"To come off as flowers by sublimation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to flower."},{"definition":"The period of time during which a plant is in flower."},{"definition":"The period of time during which someone or something is at its peak."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(used only before the noun) Of a plant, that produces flowers.","example":"Azaleas are flowering plants."},{"definition":"Aflower, in bloom"}],"partOfSpeech":"j"}]},{"word":"WIG","idx":16807,"count":2151939,"meanings":[{"definitions":[{"definition":"A head of real or synthetic hair worn on the head to disguise baldness, for cultural or religious reasons, for fashion, or by actors to help them better resemble the character they are portraying."},{"definition":"(among fishermen) An old seal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put on a wig; to provide with a wig (especially of an actor etc.)."},{"definition":"To upbraid, reprimand."},{"definition":"To become extremely emotional or excitable; to lose control of one's emotions."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wig-us","text":"/wɪɡ/"}]},{"word":"JINGLE","idx":16808,"count":2151886,"meanings":[{"definitions":[{"definition":"The sound of metal or glass clattering against itself.","example":"He heard the jingle of her keys in the door and turned off the screen."},{"definition":"A small piece of metal attached to a musical instrument, such as a tambourine, so as to make a jangling sound when the instrument is played.","example":"Her tambourine didn't come with any jingles attached."},{"definition":"A memorable short song, or in some cases a snippet of a popular song with its lyrics modified, used for the purposes of advertising a product or service in a TV or radio commercial.","example":"That used-car dealership's jingle has been stuck in my head since we heard that song."},{"definition":"A carriage drawn by horses."},{"definition":"A brief phone call; a ring.","example":"Give me a jingle when you find out something."},{"definition":"A jingle shell."},{"definition":"Coin money."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a noise of metal or glass clattering against itself.","example":"The beads jingled as she walked."},{"definition":"To cause to make a noise of metal or glass clattering against itself.","example":"She jingled the beads as she walked."},{"definition":"To rhyme or sound with a jingling effect."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jingle-us","text":"/ˈdʒɪŋɡəl/"}]},{"word":"BOUNTY","idx":16809,"count":2151873,"meanings":[{"definitions":[{"definition":"Generosity; also an act of generosity."},{"definition":"Something given liberally; a gift."},{"definition":"A reward for some specific act, especially one given by an authority or a government."},{"definition":"An abundance or wealth."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bounty-uk","text":"/ˈbaʊnti/"}]},{"word":"FISHES","idx":16811,"count":2151535,"meanings":[{"definitions":[{"definition":"A cold-blooded vertebrate animal that lives in water, moving with the help of fins and breathing with gills.","example":"Salmon is a fish."},{"definition":"Any animal (or any vertebrate) that lives exclusively in water."},{"definition":"The flesh of the fish used as food.","example":"The seafood pasta had lots of fish but not enough pasta."},{"definition":"A card game in which the object is to obtain cards in pairs or sets of four (depending on the variation), by asking the other players for cards of a particular rank."},{"definition":"A woman."},{"definition":"An easy victim for swindling."},{"definition":"A bad poker player. Compare shark (a good poker player)."},{"definition":"A makeshift overlapping longitudinal brace, originally shaped roughly like a fish, used to temporarily repair or extend a spar or mast of a ship."},{"definition":"A purchase used to fish the anchor."},{"definition":"A torpedo."},{"definition":"A paraphyletic grouping of the following extant taxonomic groups:"},{"definition":"The thirty-fourth Lenormand card."},{"definition":"A period of time spent fishing.","example":"The fish at the lake didn't prove successful."},{"definition":"An instance of seeking something.","example":"Merely two fishes for information told the whole story."},{"definition":"A counter, used in various games."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hunt fish or other aquatic animals.","example":"She went to the river to fish for trout."},{"definition":"To search (a body of water) for something other than fish.","example":"They fished the surrounding lakes for the dead body."},{"definition":"To use as bait when fishing."},{"definition":"To (attempt to) find or get hold of an object by searching among other objects.","example":"He was fishing for the keys in his pocket."},{"definition":"(followed by \"for\" or \"around for\") To talk to people in an attempt to get them to say something, or seek to obtain something by artifice.","example":"The actors loitered at the door, fishing for compliments."},{"definition":"Of a batsman, to attempt to hit a ball outside off stump and miss it."},{"definition":"To repair (a spar or mast) by fastening a beam or other long object (often called a fish) over the damaged part (see Noun above)."},{"definition":"To hoist the flukes of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fishes-uk","text":"/ˈfɪʃɪz/"}]},{"word":"RINGING","idx":16812,"count":2151327,"meanings":[{"definitions":[{"definition":"To enclose or surround.","example":"The inner city was ringed with dingy industrial areas."},{"definition":"To make an incision around; to girdle.","example":"They ringed the trees to make the clearing easier next year."},{"definition":"To attach a ring to, especially for identification.","example":"We managed to ring 22 birds this morning."},{"definition":"To surround or fit with a ring, or as if with a ring.","example":"to ring a pig’s snout"},{"definition":"To rise in the air spirally."},{"definition":"To steal and change the identity of (cars) in order to resell them."},{"definition":"Of a bell, etc., to produce a resonant sound.","example":"The bells were ringing in the town."},{"definition":"To make (a bell, etc.) produce a resonant sound.","example":"The deliveryman rang the doorbell to drop off a parcel."},{"definition":"To produce (a sound) by ringing.","example":"They rang a Christmas carol on their handbells."},{"definition":"To produce the sound of a bell or a similar sound.","example":"Whose mobile phone is ringing?"},{"definition":"Of something spoken or written, to appear to be, to seem, to sound.","example":"That does not ring true."},{"definition":"To telephone (someone).","example":"I will ring you when we arrive."},{"definition":"To resound, reverberate, echo."},{"definition":"To produce music with bells."},{"definition":"To repeat often, loudly, or earnestly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The sound of something that rings."},{"definition":"The quality of being resonant."},{"definition":"A technique used in the study of wild birds, by attaching a small, individually numbered, metal or plastic tag to their legs or wings."},{"definition":"The theft of cars and illegally changing their identities for resale."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Loud and clear."},{"definition":"Made forcefully; powerful."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹɪŋɪŋ/"}]},{"word":"KNOBS","idx":16813,"count":2151258,"meanings":[{"definitions":[{"definition":"A rounded protuberance, especially one arising from a flat surface; a fleshy lump or caruncle."},{"definition":"A rounded control switch that can be turned on its axis, designed to be operated by the fingers."},{"definition":"A ball-shaped part of a handle, lever, etc., designed to be grabbed by the hand."},{"definition":"A rounded ornament on the hilt of an edged weapon; a pommel."},{"definition":"A prominent, rounded bump along a mountain ridge."},{"definition":"A prominent rounded hill."},{"definition":"(chiefly in the plural) A woman's breast."},{"definition":"The penis."},{"definition":"The head of the penis; the glans."},{"definition":"(by analogy with above) A contemptible person."},{"definition":"A dollop, an amount just larger than a spoonful (usually referring to butter)."},{"definition":"A chunky branch-like piece, especially of a ginger rhizome."},{"definition":"A bulb of the garlic plant consisting of multiple cloves."}],"partOfSpeech":"n"}]},{"word":"WHISKEY","idx":16816,"count":2149429,"meanings":[{"definitions":[{"definition":"A liquor distilled from the fermented mash of grain (as rye, corn, or barley)."},{"definition":"A drink of whiskey."},{"definition":"A light gig or carriage; a tim-whiskey."},{"definition":"The letter W in the ICAO spelling alphabet."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɪski/"}]},{"word":"ABSURD","idx":16817,"count":2148981,"meanings":[{"definitions":[{"definition":"An absurdity."},{"definition":"(often preceded by the) The opposition between the human search for meaning in life and the inability to find any; the state or condition in which man exists in an irrational universe and his life has no meaning outside of his existence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Contrary to reason or propriety; obviously and flatly opposed to manifest truth; inconsistent with the plain dictates of common sense; logically contradictory; nonsensical; ridiculous; silly."},{"definition":"Inharmonious; dissonant."},{"definition":"Having no rational or orderly relationship to people's lives; meaningless; lacking order or value."},{"definition":"Dealing with absurdism."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"absurd-us","text":"/æbˈsɝd/"}]},{"word":"COMMITTING","idx":16818,"count":2148886,"meanings":[{"definitions":[{"definition":"To give in trust; to put into charge or keeping; to entrust; to consign; used with to or formerly unto."},{"definition":"To put in charge of a jailer; to imprison."},{"definition":"To have (a person) enter an establishment, such as a hospital or asylum, as a patient.","example":"Tony should be committed to a nuthouse!"},{"definition":"To do (something bad); to perpetrate, as a crime, sin, or fault.","example":"to commit a series of heinous crimes"},{"definition":"To join a contest; to match; followed by with."},{"definition":"To pledge or bind; to compromise, expose, or endanger by some decisive act or preliminary step. (Traditionally used only reflexively but now also without oneself etc.)","example":"to commit oneself to a certain action"},{"definition":"To make a set of changes permanent."},{"definition":"(Latinism) To confound."},{"definition":"To commit an offence; especially, to fornicate."},{"definition":"To be committed or perpetrated; to take place; to occur."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is committed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"committing-us","text":"/kəˈmɪtɪŋ/"}]},{"word":"TOLERANT","idx":16819,"count":2148096,"meanings":[{"definitions":[{"definition":"Tending to permit, allow, understand, or accept something","example":"He's pretty tolerant of different political views, but don't ask him about religion."},{"definition":"Tending to withstand or survive","example":"These plants are tolerant of drought and sunlight."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɑːləɹənt/"},{"text":"/ˈtɒləɹənt/"}]},{"word":"STOVES","idx":16820,"count":2147560,"meanings":[{"definitions":[{"definition":"A heater, a closed apparatus to burn fuel for the warming of a room."},{"definition":"A device for heating food, (UK) a cooker."},{"definition":"A hothouse (heated greenhouse)."},{"definition":"A house or room artificially warmed or heated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To heat or dry, as in a stove.","example":"to stove feathers"},{"definition":"To keep warm, in a house or room, by artificial heat.","example":"to stove orange trees"}],"partOfSpeech":"ve"}]},{"word":"ENACTMENT","idx":16822,"count":2146865,"meanings":[{"definitions":[{"definition":"The act of enacting, or the state of being enacted.","example":"The actors' powerful enactment of the play was breathtaking."},{"definition":"A piece of legislation that has been properly authorized by a legislative body.","example":"The enactments passed by the council that year included sweeping reforms."}],"partOfSpeech":"n"}]},{"word":"LAMINATE","idx":16823,"count":2146858,"meanings":[{"definitions":[{"definition":"Material formed of thin sheets glued together."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To assemble from thin sheets glued together.","example":"We'll laminate the piece of wood with grain going in different directions to make a really strong hull for the boat."},{"definition":"To cover something flat, usually paper, in adhesive protective plastic."},{"definition":"To form, as metal, into a thin plate, as by rolling."},{"definition":"To cause to separate into thin plates or layers; to divide into thin plates."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Consisting of, or covered with, laminae, or thin plates, scales, or layers, one over another; laminated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"laminate-uk","text":"/ˈlæmɪneɪt/"}]},{"word":"EARRING","idx":16824,"count":2146830,"meanings":[{"definitions":[{"definition":"A piece of jewelry worn on the ear."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪɹɪŋ/"},{"text":"/ˈɪəɹɪŋ/"}]},{"word":"AGGREGATOR","idx":16825,"count":2146684,"meanings":[{"definitions":[{"definition":"Someone or something which aggregates"},{"definition":"An online feed reader used to keep track of updates to blogs, etc."}],"partOfSpeech":"n"}]},{"word":"DATATYPE","idx":16826,"count":2146632,"meanings":[{"definitions":[{"definition":"A classification or category of various types of data, that states the possible values that can be taken, how they are stored, and what range of operations are allowed on them"}],"partOfSpeech":"n"}]},{"word":"EMBRYO","idx":16827,"count":2146623,"meanings":[{"definitions":[{"definition":"In the reproductive cycle, the stage after the fertilization of the egg that precedes the development into a fetus."},{"definition":"An organism in the earlier stages of development before it emerges from the egg, or before metamorphosis."},{"definition":"In viviparous animals, the young animal's earliest stages in the mother's body"},{"definition":"In humans, usually the cell growth up to the end of the seventh week in the mother's body"},{"definition":"A rudimentary plant contained in the seed."},{"definition":"The beginning; the first stage of anything."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"embryo-uk","text":"/ˈɛmbɹi.əʊ/"}]},{"word":"SKA","idx":16829,"count":2145956,"meanings":[{"definitions":[{"definition":"A style of Jamaican dance music combining elements of Caribbean calypso and mento with American jazz and rhythm and blues."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ska-uk","text":"/skɑː/"}]},{"word":"SALTS","idx":16831,"count":2144773,"meanings":[{"definitions":[{"definition":"A common substance, chemically consisting mainly of sodium chloride (NaCl), used extensively as a condiment and preservative."},{"definition":"One of the compounds formed from the reaction of an acid with a base, where a positive ion replaces a hydrogen of the acid."},{"definition":"A salt marsh, a saline marsh at the shore of a sea."},{"definition":"A sailor (also old salt)."},{"definition":"Randomly chosen bytes added to a plaintext message prior to encrypting or hashing it, in order to render brute-force decryption more difficult."},{"definition":"A person who seeks employment at a company in order to (once employed by it) help unionize it."},{"definition":"Flavour; taste; seasoning."},{"definition":"Piquancy; wit; sense.","example":"Attic salt"},{"definition":"A dish for salt at table; a salt cellar."},{"definition":"Skepticism and common sense."},{"definition":"Indignation; outrage; arguing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add salt to.","example":"to salt fish, beef, or pork; to salt the city streets in the winter"},{"definition":"To deposit salt as a saline solution.","example":"The brine begins to salt."},{"definition":"To fill with salt between the timbers and planks, as a ship, for the preservation of the timber."},{"definition":"To insert or inject something into an object to give it properties it would not naturally have."},{"definition":"To include colorful language in."},{"definition":"To add filler bytes before encrypting, in order to make brute-force decryption more resource-intensive."}],"partOfSpeech":"ve"}]},{"word":"ERGONOMIC","idx":16833,"count":2144410,"meanings":[{"definitions":[{"definition":"Of or relating to the science of ergonomics."},{"definition":"Designed for comfort or to minimize fatigue."}],"partOfSpeech":"j"}]},{"word":"FURIOUS","idx":16834,"count":2144253,"meanings":[{"definitions":[{"definition":"Feeling great anger; raging; violent.","example":"a furious animal; parent furious at their child's behaviour"},{"definition":"Rushing with impetuosity; moving with violence.","example":"a furious stream; a furious wind or storm"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"furious-us","text":"/ˈfjɝ.i.əs/"}]},{"word":"ITERATION","idx":16836,"count":2144069,"meanings":[{"definitions":[{"definition":"Recital or performance a second time; repetition."},{"definition":"A variation or version.","example":"The architect drafted several iterations of the floorplan before deciding on his final design."},{"definition":"The use of repetition in a computer program, especially in the form of a loop."},{"definition":"A single repetition of the code within such a repetitive process.","example":"The code calculates the appropriate value at each iteration."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪtəɹˈeɪʃən/"}]},{"word":"CEILINGS","idx":16838,"count":2143491,"meanings":[{"definitions":[{"definition":"The overhead closure of a room.","example":"the dining room had an ornate ceiling"},{"definition":"The upper limit of an object or action."},{"definition":"The highest altitude at which an aircraft can safely maintain flight."},{"definition":"The measurement of visible distance from ground or sea level to an overcast cloud cover; under a clear sky, the ceiling measurement is identified as \"unlimited.\""},{"definition":"The smallest integer greater than or equal to a given number.","example":"the ceiling of 4.5 is 5, the ceiling of -4.5 is -4"},{"definition":"The inner planking of a vessel."}],"partOfSpeech":"n"}]},{"word":"DISPENSER","idx":16839,"count":2143467,"meanings":[{"definitions":[{"definition":"Something or someone that dispenses things."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈspɛnsə/"}]},{"word":"RESPECTING","idx":16840,"count":2143341,"meanings":[{"definitions":[{"definition":"To have respect for.","example":"She is an intellectual giant, and I respect her greatly."},{"definition":"To have regard for something, to observe a custom, practice, rule or right.","example":"I respect your right to hold that belief, although I think it is nonsense."},{"definition":"To abide by an agreement.","example":"They failed to respect the treaty they had signed, and invaded."},{"definition":"To take notice of; to regard as worthy of special consideration; to heed."},{"definition":"(dated except in \"respecting\") To relate to; to be concerned with."},{"definition":"To regard; to consider; to deem."},{"definition":"To look toward; to face."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Regarding; considering","example":"I wrote to him respecting the proposed lawsuit."}],"partOfSpeech":"pr"}],"phonetics":[{"text":"/ɹɪˈspɛktɪŋ/"}]},{"word":"APPROVING","idx":16842,"count":2142483,"meanings":[{"definitions":[{"definition":"To sanction officially; to ratify; to confirm; to set as satisfactory.","example":"Although we may disagree with it, we must nevertheless approve the sentence handed down by the court-martial."},{"definition":"To regard as good; to commend; to be pleased with; to think well of.","example":"We approve the measure of the administration, for it is an excellent decision."},{"definition":"To make proof of; to demonstrate; to prove or show practically."},{"definition":"(followed by \"of\") To consider worthy (to); to be pleased (with); to accept.","example":"Her mother never approves of any of her boyfriends. She thinks nobody is good enough for her little girl."},{"definition":"To show to be worthy; to demonstrate the merits of."},{"definition":"(English law) To make profit of; to convert to one's own profit — said especially of waste or common land appropriated by the lord of the manor."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Expressing approbation; commending","example":"She flashed an approving smile."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌˈpɹuv.ɪŋ/"}]},{"word":"UNSAFE","idx":16844,"count":2142475,"meanings":[{"definitions":[{"definition":"Not safe (various senses); dangerous."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈseɪf/"}]},{"word":"REFILLS","idx":16845,"count":2141889,"meanings":[{"definitions":[{"definition":"A filling after the first.","example":"Today it is $2 for a coffee, with free refills throughout the day."},{"definition":"A repeat of a prescription."},{"definition":"A product containing materials to replace those used up by a piece of equipment.","example":"We're cutting back. No new printers or pens, just refills."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fill up once again.","example":"Can you refill my cup please? I've finished my coffee."},{"definition":"To repeat a prescription."}],"partOfSpeech":"ve"}]},{"word":"IBIS","idx":16846,"count":2141847,"meanings":[{"definitions":[{"definition":"Any of various long-legged wading birds in the family Threskiornithidae, having long downcurved bills used to probe the mud for prey such as crustaceans."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈaɪ.bɪs/"}]},{"word":"SEPARATING","idx":16848,"count":2141749,"meanings":[{"definitions":[{"definition":"To divide (a thing) into separate parts.","example":"Separate the articles from the headings."},{"definition":"To disunite from a group or mass; to disconnect."},{"definition":"To cause (things or people) to be separate.","example":"If the kids get too noisy, separate them for a few minutes."},{"definition":"To divide itself into separate pieces or substances.","example":"The sauce will separate if you don't keep stirring."},{"definition":"To set apart; to select from among others, as for a special use or service."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An instance of separating."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(zipper) Capable of being opened and having its two sided completely detached from one another rather than just being opened for most of its length."}],"partOfSpeech":"j"}]},{"word":"SOUPS","idx":16849,"count":2141445,"meanings":[{"definitions":[{"definition":"Any of various dishes commonly made by combining liquids, such as water or stock with other ingredients, such as meat and vegetables, that contribute flavor and texture.","example":"Pho is a traditional Vietnamese soup."},{"definition":"Any mixture or substance suggestive of soup consistency."},{"definition":"Alternative form of sup"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feed: to provide with soup or a meal."},{"definition":"To develop (film) in a (chemical) developing solution."},{"definition":"Alternative form of sup"},{"definition":"To sup or swallow."},{"definition":"To breathe out; to draw out."},{"definition":"To sweep."}],"partOfSpeech":"ve"}]},{"word":"RESIDING","idx":16850,"count":2141368,"meanings":[{"definitions":[{"definition":"To dwell permanently or for a considerable time; to have a settled abode for a time; to remain for a long time."},{"definition":"To have a seat or fixed position; to inhere; to lie or be as in attribute or element."},{"definition":"To sink; to settle, as sediment."}],"partOfSpeech":"ve"}]},{"word":"UNIDENTIFIED","idx":16851,"count":2141331,"meanings":[{"definitions":[{"definition":"Not identified; having an unknown or unnamed identity."}],"partOfSpeech":"j"}]},{"word":"MARKINGS","idx":16854,"count":2140739,"meanings":[{"definitions":[{"definition":"The action of the verb to mark."},{"definition":"A mark."},{"definition":"The characteristic colouration and patterning of an animal."},{"definition":"Any configuration of a Petri net with a number of marks or tokens distributed across it."}],"partOfSpeech":"n"}]},{"word":"MOIST","idx":16856,"count":2140516,"meanings":[{"definitions":[{"definition":"To moisten."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Slightly wet; characterised by the presence of moisture, not dry; damp."},{"definition":"Of eyes: tearful, wet with tears."},{"definition":"Of weather, climate etc.: rainy, damp."},{"definition":"Pertaining to one of the four essential qualities formerly believed to be present in all things, characterised by wetness."},{"definition":"Watery, liquid, fluid."},{"definition":"Characterised by the presence of pus, mucus etc."},{"definition":"Sexually lubricated (of the vagina); sexually aroused, turned on (of a woman)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"moist-us","text":"/mɔɪst/"},{"audio":"moist-uk","text":"/mɔɪst/"}]},{"word":"TRACTORS","idx":16857,"count":2140424,"meanings":[{"definitions":[{"definition":"A vehicle used in farms e.g. for pulling farm equipment and preparing the fields."},{"definition":"A truck (or lorry) for pulling a semi-trailer or trailer."},{"definition":"Any piece of machinery that pulls something."},{"definition":"An airplane where the propeller is located in front of the fuselage"},{"definition":"(rail transportation) A British Rail Class 37 locomotive."},{"definition":"A metal rod used in tractoration, or Perkinism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prepare (land) with a tractor."},{"definition":"To move with a tractor beam."},{"definition":"To treat by means of tractoration, or Perkinism."}],"partOfSpeech":"ve"}]},{"word":"DRAINED","idx":16859,"count":2139571,"meanings":[{"definitions":[{"definition":"To lose liquid.","example":"The clogged sink drained slowly."},{"definition":"To flow gradually.","example":"The water of low ground drains off."},{"definition":"To cause liquid to flow out of.","example":"Please drain the sink. It's full of dirty water."},{"definition":"To convert a perennially wet place into a dry one.","example":"They had to drain the swampy land before the parking lot could be built."},{"definition":"To deplete of energy or resources.","example":"The stress of this job is really draining me."},{"definition":"To draw off by degrees; to cause to flow gradually out or off; hence, to exhaust."},{"definition":"To filter."},{"definition":"To fall off the bottom of the playfield."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lacking motivation and energy; very tired; knackered.","example":"I felt so drained after that three-hour exam that I wanted to sleep for the next week."},{"definition":"Of a battery, empty of charge; discharged."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"drained-us","text":"/dɹeɪnd/"}]},{"word":"COED","idx":16862,"count":2139346,"meanings":[{"definitions":[{"definition":"A young woman who attends college."},{"definition":"A (generally young) woman, especially on the campus of a college or other educational institute."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of an educational institution, that teaches both males and females."},{"definition":"Of any location, that mixes males and females.","example":"A co-ed band."}],"partOfSpeech":"j"}]},{"word":"AUDIOBOOKS","idx":16863,"count":2139009,"meanings":[{"definitions":[{"definition":"A recording, usually made available for sale, of a reading of the full text or of an abridgement of a book."}],"partOfSpeech":"n"}]},{"word":"MULE","idx":16864,"count":2138641,"meanings":[{"definitions":[{"definition":"The generally sterile male or female hybrid offspring of a male donkey and a female horse."},{"definition":"The generally sterile hybrid offspring of any two species of animals."},{"definition":"A hybrid plant."},{"definition":"A stubborn person."},{"definition":"A person paid to smuggle drugs."},{"definition":"A coin or medal minted with obverse and reverse designs not normally seen on the same piece, either intentionally or in error."},{"definition":"A MMORPG character, or NPC companion in a tabletop RPG, used mainly to store extra inventory for the owner's primary character."},{"definition":"Any of a group of cocktails involving ginger ale or ginger beer, citrus juice, and various liquors."},{"definition":"A kind of triangular sail for a yacht."},{"definition":"A kind of cotton-spinning machine."},{"definition":"A shoe that has no fitting or strap around the heel, but which covers the foot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To smuggle (illegal drugs)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/mjuːl/"},{"audio":"mule-au"}]},{"word":"SHEIKH","idx":16866,"count":2138230,"meanings":[{"definitions":[{"definition":"The leader of an Arab village, family or small tribe."},{"definition":"An Islamic religious cleric; the leader of an Islamic religious order."},{"definition":"(some Arab Gulf countries) An official title for members of the royal family as well as some prominent families."},{"definition":"(1920s) A romantic lover. (from the 1921 film The Sheik)"},{"definition":"An Arab, especially one dressed in traditional clothing."},{"definition":"An honorific for specialists in spirituality."}],"partOfSpeech":"n"}]},{"word":"KIWI","idx":16869,"count":2137471,"meanings":[{"definitions":[{"definition":"A New Zealander."},{"definition":"A flightless bird of the genus Apteryx native to New Zealand."},{"definition":"A New Zealand dollar."},{"definition":"A kiwi fruit."},{"definition":"A green-yellow colour, like that of kiwi flesh (also called kiwi green)."},{"definition":"A member of the air force who does not fly."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"kiwi-au","text":"/ˈkiːwi/"}]},{"word":"OHM","idx":16870,"count":2137321,"meanings":[{"definitions":[{"definition":"In the International System of Units, the derived unit of electrical resistance; the electrical resistance of a device across which a potential difference of one volt causes a current of one ampere. Symbol: Ω"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ohm-uk","text":"/əʊm/"}]},{"word":"CESSATION","idx":16871,"count":2137188,"meanings":[{"definitions":[{"definition":"A ceasing or discontinuance, for example of an action, whether temporary or final."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɛˈseɪʃən/"},{"audio":"cessation-uk"}]},{"word":"APPEND","idx":16873,"count":2136979,"meanings":[{"definitions":[{"definition":"An instance of writing more data to the end of an existing file."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hang or attach to, as by a string, so that the thing is suspended","example":"An inscription was appended to the column."},{"definition":"To add, as an accessory to the principal thing; to annex","example":"notes appended to a book chapter"},{"definition":"To write more data to the end of a pre-existing file, string, or other object."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"append-us","text":"/ʌˈpɛnd/"}]},{"word":"MOTIVE","idx":16874,"count":2136857,"meanings":[{"definitions":[{"definition":"An idea or communication that makes one want to act, especially from spiritual sources; a divine prompting."},{"definition":"An incentive to act in a particular way; a reason or emotion that makes one want to do something; anything that prompts a choice of action."},{"definition":"A limb or other bodily organ that can move."},{"definition":"Something which causes someone to want to commit a crime; a reason for criminal behaviour.","example":"No-one could understand why she had hidden the shovel; her motives were obscure at best."},{"definition":"A motif."},{"definition":"A motif; a theme or subject, especially one that is central to the work or often repeated.","example":"If you listen carefully, you can hear the flutes mimicking the cello motive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prompt or incite by a motive or motives; to move."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Causing motion; having power to move, or tending to move","example":"a motive argument"},{"definition":"Relating to motion and/or to its cause"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"motive-us","text":"/ˈmoʊtɪv/"}]},{"word":"PESTS","idx":16875,"count":2136804,"meanings":[{"definitions":[{"definition":"A plague, pestilence, epidemic"},{"definition":"Any destructive insect or caterpillar that attacks crops or livestock; an agricultural pest."},{"definition":"An annoying person, a nuisance."},{"definition":"An animal regarded as a nuisance, destructive, or a parasite, vermin."},{"definition":"An invasive weed."}],"partOfSpeech":"n"}]},{"word":"ACREAGE","idx":16876,"count":2136630,"meanings":[{"definitions":[{"definition":"Size, as measured in acres."},{"definition":"An area of land measured in acres."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈeɪk(ə)ɹɪd͡ʒ/"}]},{"word":"SEASONED","idx":16877,"count":2136568,"meanings":[{"definitions":[{"definition":"To make fit for any use by time or habit; to habituate; to accustom; to inure.","example":"to season oneself to a climate"},{"definition":"(by extension) To prepare by drying or hardening, or removal of natural juices.","example":"The timber needs to be seasoned."},{"definition":"To become mature; to grow fit for use; to become adapted to a climate."},{"definition":"To become dry and hard, by the escape of the natural juices, or by being penetrated with other substance.","example":"The wood has seasoned in the sun."},{"definition":"To mingle: to moderate, temper, or qualify by admixture."},{"definition":"To copulate with; to impregnate."},{"definition":"To flavour food with spices, herbs or salt."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Experienced, especially in terms of a profession or a hobby"},{"definition":"Of a food, often a liquid: containing seasonings"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsiːzənd/"}]},{"word":"SUNFLOWER","idx":16878,"count":2136497,"meanings":[{"definitions":[{"definition":"Any plant of the genus Helianthus, so called probably from the form and color of its floral head, having the form of a large disk surrounded by yellow ray flowers."},{"definition":"A bright yellow, like that of the flower petals."},{"definition":"Any flat, radially symmetric organic compound such as coronene"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsʌnˌflaʊ.ɚ/"},{"text":"/ˈsʌnˌflaʊə/"}]},{"word":"DUEL","idx":16879,"count":2136368,"meanings":[{"definitions":[{"definition":"Arranged, regular combat between two private persons, often over a matter of honor."},{"definition":"Historically, the wager of battle (judicial combat)"},{"definition":"Any struggle between two contending persons, groups or ideas."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To engage in a battle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"duel-us","text":"/ˈd(j)uəl/"}]},{"word":"FINGERPRINT","idx":16881,"count":2136190,"meanings":[{"definitions":[{"definition":"The natural pattern of ridges on the tips of human fingers, unique to each individual."},{"definition":"The patterns left on surfaces where uncovered fingertips have touched, especially as used to identify the person who touched the surface."},{"definition":"Unique identification for public key in asymmetric cryptosystem."},{"definition":"A unique combination of features that serves as an identification of something."},{"definition":"A trace that gives evidence of someone's involvement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take somebody's fingerprints.","example":"The jail staff fingerprints its inmates routinely"},{"definition":"To identify something uniquely by a combination of measurements."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fingerprint-us","text":"/ˈfɪŋɡɚˌpɹɪnt/"}]},{"word":"STOCKED","idx":16883,"count":2135627,"meanings":[{"definitions":[{"definition":"To have on hand for sale.","example":"The store stocks all kinds of dried vegetables."},{"definition":"To provide with material requisites; to store; to fill; to supply.","example":"to stock a farm, i.e. to supply it with cattle and tools"},{"definition":"To allow (cows) to retain milk for twenty-four hours or more prior to sale."},{"definition":"To put in the stocks as punishment."},{"definition":"To fit (an anchor) with a stock, or to fasten the stock firmly in place."},{"definition":"To arrange cards in a certain manner for cheating purposes; to stack the deck."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been replenished with stock.","example":"a well-stocked fridge"}],"partOfSpeech":"j"}]},{"word":"SORORITY","idx":16884,"count":2135042,"meanings":[{"definitions":[{"definition":"A group of girls or women associated for a common purpose; a sisterhood."},{"definition":"A social organization of female students at a college or university; usually identified by Greek letters."}],"partOfSpeech":"n"}]},{"word":"AUDITION","idx":16887,"count":2134610,"meanings":[{"definitions":[{"definition":"A performance, by an aspiring performer, to demonstrate suitability or talent.","example":"I've been to five auditions this week."},{"definition":"The sense of hearing.","example":"His audition was poor."},{"definition":"An act of hearing; being heard."},{"definition":"Something heard."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To evaluate one or more performers in through an audition.","example":"We auditioned several actors for the part."},{"definition":"To take part in such a performance.","example":"Several actors auditioned for the part."}],"partOfSpeech":"ve"}]},{"word":"MOTIVES","idx":16893,"count":2132803,"meanings":[{"definitions":[{"definition":"An idea or communication that makes one want to act, especially from spiritual sources; a divine prompting."},{"definition":"An incentive to act in a particular way; a reason or emotion that makes one want to do something; anything that prompts a choice of action."},{"definition":"A limb or other bodily organ that can move."},{"definition":"Something which causes someone to want to commit a crime; a reason for criminal behaviour.","example":"No-one could understand why she had hidden the shovel; her motives were obscure at best."},{"definition":"A motif."},{"definition":"A motif; a theme or subject, especially one that is central to the work or often repeated.","example":"If you listen carefully, you can hear the flutes mimicking the cello motive."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"motives-us","text":"/ˈmoʊtɪvz/"}]},{"word":"REINFORCEMENT","idx":16894,"count":2132508,"meanings":[{"definitions":[{"definition":"The act, process, or state of reinforcing or being reinforced."},{"definition":"A thing that reinforces."},{"definition":"(in the plural) Additional troops or materiel sent to support a military action."},{"definition":"The process whereby a behavior with desirable consequences comes to be repeated."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"reinforcement-us","text":"/ˌɹiːɪnˈfɔː(ɹ)smənt/"}]},{"word":"LEVERAGING","idx":16897,"count":2131493,"meanings":[{"definitions":[{"definition":"To use; to exploit; to manipulate in order to take full advantage (of something).","example":"They plan to leverage off the publicity to get a good distribution agreement."}],"partOfSpeech":"ve"}]},{"word":"PSYCHOTHERAPY","idx":16898,"count":2131314,"meanings":[{"definitions":[{"definition":"The treatment of people diagnosed with mental and emotional disorders using dialogue and a variety of psychological techniques."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌsaɪkoʊˈθɛɹəpi/"}]},{"word":"PROVOST","idx":16899,"count":2131303,"meanings":[{"definitions":[{"definition":"One placed in charge: a head, a chief, particularly:"},{"definition":"A senior deputy, a superintendent, particularly:"},{"definition":"A provost cell: a military cell or prison."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(used in passive) To be delivered to a provost marshal for punishment."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɹoʊvoʊst/"}]},{"word":"GUESSING","idx":16901,"count":2131003,"meanings":[{"definitions":[{"definition":"The act of making a guess; estimate or prediction; foresight."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reach a partly (or totally) unqualified conclusion."},{"definition":"To solve by a correct conjecture; to conjecture rightly.","example":"He who guesses the riddle shall have the ring."},{"definition":"To suppose (introducing a proposition of uncertain plausibility).","example":"That album is quite hard to find, but I guess you could try ordering it online."},{"definition":"To think, conclude, or decide (without a connotation of uncertainty). Usually in first person: \"I guess\".","example":"\"I guess I'll go to bed.\""},{"definition":"To hit upon or reproduce by memory."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡɛsɪŋ/"}]},{"word":"STOKES","idx":16903,"count":2130793,"meanings":[{"definitions":[{"definition":"To poke, pierce, thrust."},{"definition":"To feed, stir up, especially, a fire or furnace."},{"definition":"(by extension) To encourage a behavior or emotion."},{"definition":"To attend to or supply a furnace with fuel; to act as a stoker or fireman."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A unit of kinematic viscosity in the CGS system of units. 1 stokes = 1 cm2/s"}],"partOfSpeech":"n"}]},{"word":"LAKERS","idx":16904,"count":2130619,"meanings":[{"definitions":[{"definition":"One engaged in sport; a player; an actor."},{"definition":"A wharfman who resides near a lake."},{"definition":"A ship used on the Great Lakes."}],"partOfSpeech":"n"}]},{"word":"ATS","idx":16905,"count":2130612,"meanings":[{"definitions":[{"definition":"The at sign (@)."},{"definition":"A subdivision of currency, equal to one hundredth of a Lao kip."}],"partOfSpeech":"n"}]},{"word":"SAXOPHONE","idx":16906,"count":2130007,"meanings":[{"definitions":[{"definition":"A single-reed instrument musical instrument of the woodwind family, usually made of brass and with a distinctive loop bringing the bell upwards."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"saxophone-us","text":"/ˈsæksəfoʊn/"}]},{"word":"COCKTAILS","idx":16907,"count":2129998,"meanings":[{"definitions":[{"definition":"A mixed alcoholic beverage."},{"definition":"A mixture of other substances or things.","example":"Scientists found a cocktail of pollutants in the river downstream from the chemical factory."},{"definition":"A horse, not of pure breed, but having only one eighth or one sixteenth impure blood in its veins."},{"definition":"A mean, half-hearted fellow; a coward."},{"definition":"A species of rove beetle, so called from its habit of elevating the tail."}],"partOfSpeech":"n"}]},{"word":"MEAD","idx":16909,"count":2129480,"meanings":[{"definitions":[{"definition":"An alcoholic drink fermented from honey and water."},{"definition":"A drink composed of syrup of sarsaparilla or other flavouring extract, and water, and sometimes charged with carbon dioxide."},{"definition":"A meadow."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mead-us","text":"/miːd/"}]},{"word":"THROTTLE","idx":16911,"count":2129057,"meanings":[{"definitions":[{"definition":"A valve that regulates the supply of fuel-air mixture to an internal combustion engine and thus controls its speed; a similar valve that controls the air supply to an engine."},{"definition":"The lever or pedal that controls this valve."},{"definition":"The windpipe or trachea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut back on the speed of (an engine, person, organization, network connection, etc.)."},{"definition":"To strangle or choke someone."},{"definition":"To have the throat obstructed so as to be in danger of suffocation; to choke; to suffocate."},{"definition":"To breathe hard, as when nearly suffocated."},{"definition":"To utter with breaks and interruption, in the manner of a person half suffocated."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"throttle-uk","text":"/ˈθɹɒtəl/"}]},{"word":"STEROID","idx":16912,"count":2128756,"meanings":[{"definitions":[{"definition":"A class of organic compounds having a structure of 17 carbon atoms arranged in four rings; they are lipids, and occur naturally as sterols, bile acids, adrenal and sex hormones, and some vitamins; many drugs are synthetic steroids."},{"definition":"Any anabolic hormone used to promote muscle growth."},{"definition":"Any chemical compound used to enhance athletic performance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"steroid-us","text":"/ˈstɛɹɔɪd/"}]},{"word":"GONG","idx":16913,"count":2128445,"meanings":[{"definitions":[{"definition":"A percussion instrument consisting of a metal disk that emits a sonorous sound when struck with a soft hammer."},{"definition":"A medal or award, particularly Knight Bachelor."},{"definition":"An outhouse: an outbuilding used as a lavatory."},{"definition":"The contents of an outhouse pit: shit."},{"definition":"A kind of cultivation energy, more powerful than qi."},{"definition":"An advanced practice that cultivates such energy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make the sound of a gong; to ring a gong."},{"definition":"To send a signal to, using a gong or similar device."},{"definition":"To give an award or medal to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gong-uk"}]},{"word":"BER","idx":16914,"count":2128430,"meanings":[{"definitions":[{"definition":"A fruit-bearing tree, Ziziphus mauritiana; the jujube."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bɛə/"}]},{"word":"COMMUNICATOR","idx":16915,"count":2128091,"meanings":[{"definitions":[{"definition":"Someone who, or something that communicates.","example":"We'll let Nick give the presentation next week: he's a good communicator."},{"definition":"Any of several electronic devices that allow people with various disabilities to communicate via displays or artificial speech."},{"definition":"A usually portable communications device."}],"partOfSpeech":"n"}]},{"word":"HORTICULTURE","idx":16916,"count":2128038,"meanings":[{"definitions":[{"definition":"The art or science of cultivating gardens; gardening."},{"definition":"Small-scale agriculture."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɔɹ.tɪˌkʌl.tʃɚ/"},{"text":"/ˈhɔː.tɪˌkʌl.tʃə(ɹ)/"}]},{"word":"RESETS","idx":16918,"count":2127923,"meanings":[{"definitions":[{"definition":"To set back to the initial state."},{"definition":"To set to zero."},{"definition":"To adjust; to set or position differently."},{"definition":"To receive and hide (stolen goods, or a criminal, etc.)"}],"partOfSpeech":"ve"}]},{"word":"SYMPATHETIC","idx":16920,"count":2127529,"meanings":[{"definitions":[{"definition":"Of, related to, showing, or characterized by sympathy","example":"John looked very upset. I gave him a sympathetic look."},{"definition":"Relating to similarity","example":"Sympathetic magic is based on imitation or correspondence."},{"definition":"Relating to the sympathetic nervous system","example":"Sympathetic innervation involves epinephrine."},{"definition":"Relating to sounds induced by vibrations conveyed through a fluid or gas from a body already in vibration."},{"definition":"Of magic, a supernatural connection or power resulting from two items having the same form or some other correspondence."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sympathetic-us","text":"/ˌsɪmpəˈθɛtɪk/"}]},{"word":"ISOLATE","idx":16924,"count":2127204,"meanings":[{"definitions":[{"definition":"Something that has been isolated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To set apart or cut off from others."},{"definition":"To place in quarantine or isolation."},{"definition":"To separate a substance in pure form from a mixture."},{"definition":"To insulate, or make free of external influence."},{"definition":"To separate a pure strain of bacteria etc. from a mixed culture."},{"definition":"To insulate an electrical component from a source of electricity."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"isolate-us"}]},{"word":"UNCONSCIOUS","idx":16925,"count":2126950,"meanings":[{"definitions":[{"definition":"Unconscious mind"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not awake; having no awareness.","example":"After the anesthetist administered the general anesthetic the patient was unconscious."},{"definition":"Without directed thought or awareness.","example":"My sudden fright was an unconscious response."},{"definition":"Engaged in skilled performance without conscious control."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unconscious-us","text":"/ˌʌnˈkɑnʃəs/"}]},{"word":"BAYS","idx":16926,"count":2126514,"meanings":[{"definitions":[{"definition":"A berry."},{"definition":"Laurus nobilis, a tree or shrub of the family Lauraceae, having dark green leaves and berries."},{"definition":"Bay leaf, the leaf of this or certain other species of tree or shrub, used as a herb."},{"definition":"(in the plural) The leaves of this shrub, woven into a garland used to reward a champion or victor; hence, fame, victory."},{"definition":"A tract covered with bay trees."},{"definition":"A kind of mahogany obtained from Campeche in Mexico."},{"definition":"A body of water (especially the sea) more or less three-quarters surrounded by land."},{"definition":"A bank or dam to keep back water."},{"definition":"An opening in a wall, especially between two columns."},{"definition":"An internal recess; a compartment or area surrounded on three sides."},{"definition":"The distance between two supports in a vault or building with a pitched roof."},{"definition":"Each of the spaces, port and starboard, between decks, forward of the bitts, in sailing warships."},{"definition":"A bay platform."},{"definition":"A bay window."},{"definition":"The excited howling of dogs when hunting or being attacked."},{"definition":"(by extension) The climactic confrontation between hunting-dogs and their prey."},{"definition":"A state of being obliged to face an antagonist or a difficulty, when escape has become impossible."},{"definition":"A brown colour/color of the coat of some horses."},{"definition":"A horse of this color."},{"definition":"Baize."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To howl."},{"definition":"To bark at; hence, to follow with barking; to bring or drive to bay.","example":"to bay the bear"},{"definition":"To pursue noisily, like a pack of hounds."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/beɪz/"}]},{"word":"ACRONYM","idx":16927,"count":2125641,"meanings":[{"definitions":[{"definition":"An abbreviation formed by the initial letters of other words, sometimes exclusively such abbreviations when pronounced as a word (as \"laser\") rather than as individual letters (initialisms such as \"TNT\")."},{"definition":"An abbreviation formed by the beginning letters or syllables of other words (as \"Benelux\")."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into an acronym."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"acronym-uk","text":"/ˈæk.ɹə.nɪm/"}]},{"word":"FAULTY","idx":16929,"count":2125277,"meanings":[{"definitions":[{"definition":"Having or displaying faults; not perfect; not adequate or acceptable.","example":"I don't think you can infer that from the premise. It's a faulty argument."},{"definition":"At fault, to blame; guilty."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"faulty-us","text":"/ˈfɔːlti/"}]},{"word":"AFFIDAVIT","idx":16930,"count":2125205,"meanings":[{"definitions":[{"definition":"A signed document wherein an affiant makes a sworn statement.","example":"He submitted his affidavit rather than appearing to testify in court."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"affidavit","text":"/ˌæfɪˈdeɪvɪt/"}]},{"word":"BREATHTAKING","idx":16931,"count":2124735,"meanings":[{"definitions":[{"definition":"Stunningly beautiful; amazing","example":"He went to the Grand Canyon and spent a week taking in the breathtaking scenery all around him."},{"definition":"Very surprising or shocking; to such a degree as to cause astonishment.","example":"breathtaking stupidity or rudeness"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"breathtaking-us","text":"/ˈbɹɛθˌteɪ.kɪŋ/"}]},{"word":"STREAMLINE","idx":16932,"count":2124680,"meanings":[{"definitions":[{"definition":"A line that is tangent to the velocity of flow of a fluid; equivalent to the path of a specific particle in that flow."},{"definition":"On a weather chart, a line that is tangent to the flow of the wind."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To design and construct the contours of a vehicle etc. so as to offer the least resistance to its flow through a fluid."},{"definition":"(by extension) To simplify or organize a process in order to increase its efficiency."},{"definition":"To modernise."}],"partOfSpeech":"ve"}]},{"word":"MESSIAH","idx":16934,"count":2124191,"meanings":[{"definitions":[{"definition":"(Abrahamic tradition) The one who is ordained by God to lead the people of Israel, believed by Christians and Muslims to be Jesus Christ."},{"definition":"A similar religious figure or awaited divine ruler, such as the Islamic Mahdi."},{"definition":"An extremely powerful figure."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/məˈsaɪ.ə/"}]},{"word":"BRUNCH","idx":16935,"count":2123970,"meanings":[{"definitions":[{"definition":"A meal eaten later in the day than breakfast and earlier than lunch, and often consisting of typical foods from both of those meals."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat brunch."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bɹʌntʃ/"}]},{"word":"INFAMOUS","idx":16936,"count":2123711,"meanings":[{"definitions":[{"definition":"Having a bad reputation, disreputable; notoriously bad, unpleasant or evil; widely known, especially for something bad.","example":"He was an infamous perjurer."},{"definition":"Causing infamy; disgraceful.","example":"This infamous deed tarnishes all involved."},{"definition":"Subject to a judicial punishment that deprived the infamous person of certain rights; this included a prohibition against holding public office, exercising the franchise, receiving a public pension, serving on a jury, or giving testimony in a court of law."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"infamous-us","text":"/ˈɪnfəməs/"}]},{"word":"PUNDIT","idx":16937,"count":2123572,"meanings":[{"definitions":[{"definition":"An expert in a particular field, especially as called upon to provide comment or opinion in the media; a commentator, a critic."},{"definition":"A learned person in India; someone with knowledge of Sanskrit, philosophy, religion and law; a Hindu scholar."},{"definition":"A native surveyor in British India, trained to carry out clandestine surveillance beyond British borders."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pundit-us","text":"/ˈpʌn.dɪt/"}]},{"word":"PLEASING","idx":16938,"count":2123373,"meanings":[{"definitions":[{"definition":"To make happy or satisfy; to give pleasure to.","example":"Her presentation pleased the executives."},{"definition":"To desire; to will; to be pleased by.","example":"Just do as you please."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Agreeable; giving pleasure, cheer, enjoyment or gratification."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Pleasure or satisfaction, as in the phrase \"to my pleasing.\""}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pleasing-us","text":"/ˈplizɪŋ/"}]},{"word":"SEIZURES","idx":16939,"count":2123353,"meanings":[{"definitions":[{"definition":"The act of taking possession, as by force or right of law.","example":"The search warrant permitted the seizure of evidence."},{"definition":"A sudden attack or convulsion, (e.g. an epileptic seizure).","example":"He fell to the floor and convulsed when the epileptic seizure occurred."},{"definition":"A sudden onset of pain or emotion.","example":"He felt the sudden seizure of pain as the heart attack began."},{"definition":"That which is seized, or taken possession of; a thing laid hold of, or possessed."},{"definition":"Retention within one's grasp or power; possession; ownership."}],"partOfSpeech":"n"}]},{"word":"APPEALED","idx":16940,"count":2123326,"meanings":[{"definitions":[{"definition":"To call upon another to decide a question controverted, to corroborate a statement, to vindicate one's rights, etc."},{"definition":"To call on (someone) for aid","example":"I appeal to all of you to help the orphans."},{"definition":"(informal elsewhere) To apply for the removal of a cause from an inferior to a superior judge or court for the purpose of reexamination or for decision."},{"definition":"To be attractive.","example":"That idea appeals to me."},{"definition":"To ask an umpire for a decision on whether a batsman is out or not, usually by saying \"How's that\" or \"Howzat\"."},{"definition":"To accuse (someone of something)."},{"definition":"To summon; to challenge."},{"definition":"To invoke (used with to)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"appealed-us","text":"/əˈpiːld/"}]},{"word":"FIGURINE","idx":16941,"count":2123179,"meanings":[{"definitions":[{"definition":"A small carved or molded figure; a statuette."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fɪɡ(j)əˈɹin/"},{"text":"/fɪɡəˈɹin/"}]},{"word":"SURVEYORS","idx":16942,"count":2123090,"meanings":[{"definitions":[{"definition":"A person occupied with surveying -- the process of determining positions on the earth's surface."},{"definition":"A person charged with inspecting something for the purpose of determining its condition, value, etc.","example":"Other costs associated with selling a home include surveyor's fees, legal fees, estate agent's commission, stamp duty and the VAT."}],"partOfSpeech":"n"}]},{"word":"MUTANTS","idx":16943,"count":2123025,"meanings":[{"definitions":[{"definition":"Something which has mutated, which has one or more new characteristics from a mutation.","example":"Your plaid fish are mutants."},{"definition":"Someone or something that seems strange, abnormal, or bizarre.","example":"Your neighbor seems to be a mutant; he’s so cringy!"},{"definition":"An object in a program that serves as a lock, used to negotiate mutual exclusion among threads."}],"partOfSpeech":"n"}]},{"word":"CYBERSPACE","idx":16944,"count":2122840,"meanings":[{"definitions":[{"definition":"A world of information accessed through the Internet."},{"definition":"(by extension, somewhat obsolete) The Internet as a whole."},{"definition":"A three-dimensional representation of virtual space in a computer network."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsaɪ.bə(ɹ)ˌspeɪs/"}]},{"word":"TENACIOUS","idx":16945,"count":2122528,"meanings":[{"definitions":[{"definition":"Clinging to an object or surface; adhesive."},{"definition":"Unwilling to yield or give up; dogged."},{"definition":"Holding together; cohesive."},{"definition":"Having a good memory; retentive."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tenacious-us","text":"/təˈneɪʃəs/"},{"audio":"tenacious-au","text":"/təˈneɪʃəs/"}]},{"word":"EXPIRY","idx":16946,"count":2122063,"meanings":[{"definitions":[{"definition":"A date by which an object either should not be used or loses its value, depending upon the item.","example":"credit card expiration date"},{"definition":"End; termination; expiration."},{"definition":"Death."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"expiry-au","text":"/ɛkˈspaɪ.əɹ.i/"}]},{"word":"WATERFALL","idx":16948,"count":2121717,"meanings":[{"definitions":[{"definition":"A flow of water over the edge of a cliff."},{"definition":"A waterfall-like outpouring of liquid, smoke, etc.","example":"A waterfall of mist came from the open freezer."},{"definition":"Waterfall model"},{"definition":"The action of drinking from a vessel without touching it with the lips, considered more sanitary for a shared vessel.","example":"Hey man, can I take a waterfall from your bottle?"},{"definition":"A necktie."},{"definition":"A chignon."},{"definition":"A beard.","example":"I found home a dreary place after my long absence; for half the children I had known were now wearing whiskers or waterfalls... (Mark Twain, Roughing It)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fall like a waterfall."},{"definition":"To drink (something) from a container by pouring it from a height so as not to touch one's lips to the rim."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"waterfall-us","text":"/ˈwɔtɚfɔl/"}]},{"word":"SENSUAL","idx":16949,"count":2121425,"meanings":[{"definitions":[{"definition":"Inducing pleasurable or erotic sensations.","example":"That massage was a very sensual experience!"},{"definition":"Of or pertaining to the physical senses; sensory.","example":"Plato believed that this sensual world in which we live is inferior to the heavenly realm."},{"definition":"Provoking or exciting a strong response in the senses."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sensual-uk","text":"/ˈsɛnsjuːəl/"}]},{"word":"PERSECUTION","idx":16950,"count":2121168,"meanings":[{"definitions":[{"definition":"The act of persecuting."},{"definition":"A program or campaign to subjugate or eliminate a specific group of people, often based on race, religion, sexuality, or social beliefs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"persecution-us","text":"/ˌpɝsəˈkjuʃən/"}]},{"word":"PETIT","idx":16952,"count":2120813,"meanings":[{"definitions":[{"definition":"(usually in the plural) A little schoolboy."},{"definition":"A kind of pigeon."},{"definition":"The size of type between minion and bourgeois, standardized as 8-point."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of size) Petite: small, little."},{"definition":"Petty, in its various senses:"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pəˈti/"},{"text":"/pəˈtiː/"}]},{"word":"BURGESS","idx":16953,"count":2120777,"meanings":[{"definitions":[{"definition":"An inhabitant of a borough with full rights; a citizen."},{"definition":"A town magistrate."},{"definition":"A representative of a borough in the Parliament."},{"definition":"A member of the House of Burgesses, a legislative body in colonial America, established by the Virginia Company to provide civil rule in the colonies."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"burgess-us"},{"text":"/ˈbɜːdʒɪs/"}]},{"word":"INNING","idx":16955,"count":2119847,"meanings":[{"definitions":[{"definition":"A period of play in which members of a visiting baseball team attempt to hit a baseball pitched by the opposing home team until three players are called out, followed by a similar attempt by members of the home baseball team against the visiting team's pitching. There are nine or more innings in a regulation baseball game.","example":"It is a baseball tradition to sing \"Take Me Out To the Ball Game\" during the seventh inning stretch."},{"definition":"A similar period of play.","example":"We batted around in our half of the inning."},{"definition":"A player (or team)'s turn at the table to make shots until ended by a miss or a foul."},{"definition":"A chance or opportunity to perform some deed or act.","example":"We are in just the second inning of our quest to enter this new market."},{"definition":"The gathering of a crop; harvesting."},{"definition":"Lands recovered from the sea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To house; to lodge."},{"definition":"To take lodging; to lodge."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"inning-1-uk","text":"/ˈɪnɪŋ/"}]},{"word":"GAZE","idx":16956,"count":2119763,"meanings":[{"definitions":[{"definition":"A fixed look; a look of eagerness, wonder, or admiration; a continued look of attention."},{"definition":"The object gazed on."},{"definition":"In Lacanian psychoanalysis, the relationship of the subject with the desire to look and awareness that one can be viewed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stare intently or earnestly.","example":"In fact, for Antonioni this gazing is probably the most fundamental of all cognitive activities ... (from Thinking in the Absence of Image)"},{"definition":"To stare at."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gaze-us","text":"/ɡeɪz/"}]},{"word":"FRIES","idx":16957,"count":2119656,"meanings":[{"definitions":[{"definition":"(usually in the plural, fries) A fried strip of potato."},{"definition":"A meal of fried sausages, bacon, eggs, etc."},{"definition":"A state of excitement.","example":"to be in a fry"},{"definition":"A kind of sieve."},{"definition":"A drain."}],"partOfSpeech":"n"},{"definitions":[{"definition":"A method of cooking food."},{"definition":"To be affected by extreme heat or current."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɹaɪz/"}]},{"word":"CHLORINE","idx":16958,"count":2119419,"meanings":[{"definitions":[{"definition":"A toxic, green, gaseous chemical element (symbol Cl) with an atomic number of 17."},{"definition":"A single atom of this element."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"chlorine-us","text":"/ˈklɔɹin/"}]},{"word":"FRESHLY","idx":16959,"count":2119331,"meanings":[{"definitions":[{"definition":"Recently, newly.","example":"The freshly picked flowers will wilt in a few days but for now are still fragrant."},{"definition":"In a rude or impertinent manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈfɹɛʃli/"}]},{"word":"INITIALIZE","idx":16960,"count":2119091,"meanings":[{"definitions":[{"definition":"To assign initial values to something"},{"definition":"To assign an initial value to a variable"},{"definition":"To format a storage medium prior to use"},{"definition":"To prepare any hardware (such as a printer or scanner) for use"}],"partOfSpeech":"ve"}]},{"word":"RYE","idx":16964,"count":2118455,"meanings":[{"definitions":[{"definition":"A grain used extensively in Europe for making bread, beer, and (now generally) for animal fodder."},{"definition":"The grass Secale cereale from which the grain is obtained."},{"definition":"Rye bread."},{"definition":"Rye whiskey."},{"definition":"Caraway (from the mistaken assumption that the whole seeds, often used to season rye bread, are the rye itself)"},{"definition":"Ryegrass, any of the species of Lolium."},{"definition":"A disease of hawks."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rye-us","text":"/ɹaɪ/"}]},{"word":"ISABELLA","idx":16966,"count":2117892,"meanings":[{"definitions":[{"definition":"A pale grey-yellow, fawn, cream-brown or parchment colour."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"isabella-us"}]},{"word":"FOUNDRY","idx":16967,"count":2117706,"meanings":[{"definitions":[{"definition":"A facility that melts metals in special furnaces and pours the molten metal into molds to make products. Foundries are usually specified according to the type of metal dealt with: iron foundry, brass foundry, etc."},{"definition":"The act, process, or art of casting metals; founding."},{"definition":"A semiconductor fabrication plant in the microelectronics industry."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/faʊndɹi/"}]},{"word":"TOXICOLOGY","idx":16968,"count":2117705,"meanings":[{"definitions":[{"definition":"The branch of pharmacology that deals with the nature, effect, detection and treatment of poisons and poisoning."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"toxicology-uk","text":"/ˌtɒksɪˈkɒlədʒi/"}]},{"word":"MONIES","idx":16970,"count":2117267,"meanings":[{"definitions":[{"definition":"A legally or socially binding conceptual contract of entitlement to wealth, void of intrinsic value, payable for all debts and taxes, and regulated in supply."},{"definition":"A generally accepted means of exchange and measure of value.","example":"Before colonial times cowry shells imported from Mauritius were used as money in Western Africa."},{"definition":"A currency maintained by a state or other entity which can guarantee its value (such as a monetary union).","example":"money supply;  money market"},{"definition":"Hard cash in the form of banknotes and coins, as opposed to cheques/checks, credit cards, or credit more generally."},{"definition":"The total value of liquid assets available for an individual or other economic unit, such as cash and bank deposits."},{"definition":"Wealth; a person, family or class that possesses wealth","example":"He married money."},{"definition":"An item of value between two or more parties used for the exchange of goods or services."},{"definition":"A person who funds an operation."}],"partOfSpeech":"n"}]},{"word":"BODYBUILDING","idx":16971,"count":2117113,"meanings":[{"definitions":[{"definition":"A sport in which the aesthetics of muscular development is the basis for competition."},{"definition":"Work done to construct or repair the body of an automobile."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bodybuilding-us","text":"/ˈbɑːdiˌbɪldɪŋ/"}]},{"word":"ASSASSINATION","idx":16973,"count":2116496,"meanings":[{"definitions":[{"definition":"The murder of a person, especially for political reasons or for personal gain.","example":"The assassination of the king occurred at night."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˌsæs.ɪ.ˈneɪ.ʃən/"}]},{"word":"NOSTALGIA","idx":16974,"count":2115900,"meanings":[{"definitions":[{"definition":"A longing for home or familiar surroundings; homesickness."},{"definition":"A bittersweet yearning for the things of the past."},{"definition":"Reminiscence of the speaker's childhood or younger years."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/nɑˈstældʒə/"},{"text":"/nɒˈstaldʒə/"}]},{"word":"REMARKABLY","idx":16975,"count":2115679,"meanings":[{"definitions":[{"definition":"(manner) In a remarkable manner.","example":"He performed the piece remarkably, offering novel interpretations to its nearly cliched passages."},{"definition":"(degree) To a noteworthy extent.","example":"That dog is remarkably fierce."},{"definition":"(evaluative) Used to draw special attention to a proposition.","example":"Remarkably, three State assembly elections were decided by a total of fewer than one hundred votes."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"remarkably-us","text":"/ɹɪˈmɑɹkəbli/"}]},{"word":"ACETATE","idx":16976,"count":2115668,"meanings":[{"definitions":[{"definition":"Any salt or ester of acetic acid."},{"definition":"Cellulose acetate."},{"definition":"A transparent sheet used for overlays."},{"definition":"Ellipsis of acetate disc: a disc of aluminium covered in a wax used to make demonstration copies of a phonograph record."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"acetate-us"}]},{"word":"POINTE","idx":16977,"count":2114811,"meanings":[{"definitions":[{"definition":"The tip of the toe; a ballet position executed with the tip of the toe.","example":"2007: Classical dance manages to get along without too many momentous events shuddering beneath its pointe work. — The Guardian 5th Jan 2007, p. 3"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pwɑnt/"},{"text":"/pwæ̃t/"}]},{"word":"STALL","idx":16978,"count":2114252,"meanings":[{"definitions":[{"definition":"A compartment for a single animal in a stable or cattle shed."},{"definition":"A stable; a place for cattle."},{"definition":"A bench or table on which small articles of merchandise are exposed for sale."},{"definition":"A small open-fronted shop, for example in a market, food court, etc."},{"definition":"A very small room used for a shower or a toilet."},{"definition":"A seat in a theatre close to and (about) level with the stage; traditionally, a seat with arms, or otherwise partly enclosed, as distinguished from the benches, sofas, etc."},{"definition":"Loss of lift due to an airfoil's critical angle of attack being exceeded."},{"definition":"An Heathen altar, typically an indoor one, as contrasted with a more substantial outdoor harrow."},{"definition":"A seat in a church, especially one next to the chancel or choir, reserved for church officials and dignitaries."},{"definition":"A church office that entitles the incumbent to the use of a church stall."},{"definition":"A sheath to protect the finger."},{"definition":"The space left by excavation between pillars."},{"definition":"A parking stall; a space for a vehicle in a parking lot or parkade."},{"definition":"An action that is intended to cause or actually causes delay.","example":"His encounters with security, reception, the secretary, and the assistant were all stalls until the general manager's attorney arrived."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put (an animal, etc.) in a stall.","example":"to stall an ox"},{"definition":"To fatten.","example":"to stall cattle"},{"definition":"To come to a standstill."},{"definition":"To cause to stop making progress, to hinder, to slow down, to delay or forestall."},{"definition":"To plunge into mire or snow so as not to be able to get on; to set; to fix.","example":"to stall a cart"},{"definition":"(of an engine) To stop suddenly."},{"definition":"To cause the engine of a manual-transmission car to stop by going too slowly for the selected gear."},{"definition":"To exceed the critical angle of attack, resulting in loss of lift."},{"definition":"To live in, or as if in, a stall; to dwell."},{"definition":"To be stuck, as in mire or snow; to stick fast."},{"definition":"To be tired of eating, as cattle."},{"definition":"To place in an office with the customary formalities; to install."},{"definition":"To forestall; to anticipate."},{"definition":"To keep close; to keep secret."},{"definition":"To employ delaying tactics against.","example":"He stalled the creditors as long as he could."},{"definition":"To employ delaying tactics.","example":"Soon it became clear that she was stalling to give him time to get away."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stall-uk","text":"/stɔːl/"}]},{"word":"PLS","idx":16979,"count":2114116,"meanings":[{"definitions":[{"definition":"Used to make a polite request.","example":"Could you tell me the time, please?"},{"definition":"Used as an affirmative to an offer.","example":"—May I help you? —Please."},{"definition":"An expression of annoyance or impatience.","example":"Oh, please, do we have to hear that again?"},{"definition":"(Cincinnati) Said as a request to repeat information."}],"partOfSpeech":"v"}]},{"word":"ENTIRETY","idx":16983,"count":2112980,"meanings":[{"definitions":[{"definition":"The whole; the complete or amount.","example":"Due to the early rainout, the game will be replayed in its entirety on Friday."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɛn-/"},{"text":"/-ˈtaɪ.ə.ti/"}]},{"word":"DESTINED","idx":16984,"count":2112859,"meanings":[{"definitions":[{"definition":"To preordain"},{"definition":"To assign something (especially finance) for a particular use"},{"definition":"To have a particular destination"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Confined to a predetermined fate or destiny; certain.","example":"He is sure he is destined for fame."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"destined-us"},{"text":"/ˈdɛstɪnd/"}]},{"word":"MARCEL","idx":16985,"count":2112634,"meanings":[{"definitions":[{"definition":"A hairstyle characterized by deep waves made by a curling iron."},{"definition":"A marcel wave."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wave (hair) by the marcel method."},{"definition":"To wave."}],"partOfSpeech":"ve"}]},{"word":"TERMINATOR","idx":16986,"count":2112514,"meanings":[{"definitions":[{"definition":"Someone who terminates or ends something, especially (in later use) an assassin or exterminator."},{"definition":"The line between the day side and the night side of a moon, planet or other celestial body."},{"definition":"A DNA sequence which causes RNA transcription to cease and an mRNA transcript to break off."},{"definition":"An electrical device that absorbs reflection at the end of a transmission line."},{"definition":"An intelligent android created to destroy humans (after the 1984 film The Terminator)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɝ.mɪ.neɪ.dɚ/"},{"text":"/ˈtəː.mɪ.neɪ.tə/"}]},{"word":"LAD","idx":16987,"count":2112499,"meanings":[{"definitions":[{"definition":"A boy or young man."},{"definition":"A Jack the lad; a boyo.","example":"I think he reckons he's a bit of a lad."},{"definition":"A familiar term of address for a young man.","example":"Come here, lad, and help me shift these boxes."},{"definition":"A groom who works with horses (also called stable-lad)."},{"definition":"The penis."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lad-us","text":"/læd/"}]},{"word":"HULK","idx":16988,"count":2112390,"meanings":[{"definitions":[{"definition":"A non-functional but floating ship, usually stripped of rigging and equipment, and often put to other uses such as storage or accommodation."},{"definition":"Any large ship that is difficult to maneuver."},{"definition":"A large structure with a dominating presence."},{"definition":"A big (and possibly clumsy) person."},{"definition":"An excessively muscled person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reduce (a ship) to a (nonfunctional) hulk."},{"definition":"To be a hulk, a large (hulking) and often imposing presence."},{"definition":"To move (one's large, hulking body)."},{"definition":"To remove the entrails of; to disembowel.","example":"to hulk a hare"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hulk-1-us","text":"/hʌlk/"}]},{"word":"BADMINTON","idx":16989,"count":2111283,"meanings":[{"definitions":[{"definition":"A racquet sport played indoors on a court by two opposing players (singles) or two opposing pairs of players (doubles), in which a shuttlecock is volleyed over a net and the competitions are presided by an umpire in British English and a referee in American English."},{"definition":"A cooling summer drink made with claret, sugar and soda water."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"badminton-us","text":"/ˈbæd.mɪn.tən/"}]},{"word":"CYAN","idx":16990,"count":2111144,"meanings":[{"definitions":[{"definition":"A vibrant pale greenish-blue colour between blue and green in the visible spectrum; the complementary colour of red; the colour obtained by subtracting red from white light."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of the colour cyan."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsaɪ.ən/"}]},{"word":"ORA","idx":16991,"count":2111128,"meanings":[{"definitions":[{"definition":"A mouth; an opening."},{"definition":"In particular, either end of the cervix, internal (to the uterus) or external (to the vagina)."},{"definition":"A unit of money among the Anglo-Saxons."}],"partOfSpeech":"n"}]},{"word":"PORTAGE","idx":16996,"count":2109768,"meanings":[{"definitions":[{"definition":"An act of carrying, especially the carrying of a boat overland between two waterways."},{"definition":"The route used for such carrying."},{"definition":"A charge made for carrying something."},{"definition":"Carrying capacity; tonnage."},{"definition":"The wages paid to a sailor when in port, or for a voyage."},{"definition":"A porthole."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To carry a boat overland"}],"partOfSpeech":"ve"}]},{"word":"SERIF","idx":16998,"count":2109334,"meanings":[{"definitions":[{"definition":"A short line added to the end of a stroke in traditional typefaces, such as Times New Roman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a typeface, provided with serifs."}],"partOfSpeech":"j"}]},{"word":"DWELLINGS","idx":16999,"count":2109333,"meanings":[{"definitions":[{"definition":"A house or place in which a person lives; a habitation, a home.","example":"The old house served as a dwelling for Albert."}],"partOfSpeech":"n"}]},{"word":"INFORMING","idx":17000,"count":2108822,"meanings":[{"definitions":[{"definition":"To instruct, train (usually in matters of knowledge)."},{"definition":"To communicate knowledge to."},{"definition":"To impart information or knowledge."},{"definition":"To act as an informer; denounce."},{"definition":"To give form or character to; to inspire (with a given quality); to affect, influence (with a pervading principle, idea etc.).","example":"His sense of religion informs everything he writes."},{"definition":"To make known, wisely and/or knowledgeably."},{"definition":"To direct, guide."},{"definition":"To take form; to become visible or manifest; to appear."}],"partOfSpeech":"ve"}]},{"word":"PORTABILITY","idx":17002,"count":2107820,"meanings":[{"definitions":[{"definition":"The quality of being portable."},{"definition":"The ability of a program (or software system) to execute properly on multiple hardware platforms."},{"definition":"The ability of an employee to move between different social security schemes without losing their contributions."},{"definition":"The ability of a telephone subscriber to keep his/her number when switching to a different network."}],"partOfSpeech":"n"}]},{"word":"CHARACTERIZE","idx":17003,"count":2107717,"meanings":[{"definitions":[{"definition":"To depict someone or something a particular way (often negative)."},{"definition":"To be typical of."},{"definition":"To determine the characteristics of."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkæɹəktəɹaɪz/"}]},{"word":"YOURSELVES","idx":17005,"count":2107575,"meanings":[{"definitions":[{"definition":"You (plural), used as the object of a verb or preposition, referring to the people being spoken to, previously mentioned.","example":"You shouldn't blame yourselves."}],"partOfSpeech":"p"}],"phonetics":[{"text":"/jɔɹˈsɛlvz/"},{"text":"/jɔːˈsɛlvz/"}]},{"word":"YEARBOOK","idx":17007,"count":2106514,"meanings":[{"definitions":[{"definition":"A reference book, published annually."},{"definition":"A publication compiled by the graduating class of a high school or college, recording the year's events and containing photographs of students and faculty."},{"definition":"A school subject in which students learn journalistic skills by compiling a yearbook."}],"partOfSpeech":"n"}]},{"word":"LUBRICANTS","idx":17009,"count":2106029,"meanings":[{"definitions":[{"definition":"A substance used to reduce friction between objects or surfaces."},{"definition":"A personal lubricant."}],"partOfSpeech":"n"}]},{"word":"ALAMEDA","idx":17012,"count":2105485,"meanings":[{"definitions":[{"definition":"A tree-lined avenue in Spain or Portugal."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌæləˈmeɪdə/"}]},{"word":"AEROSOL","idx":17013,"count":2105024,"meanings":[{"definitions":[{"definition":"A mixture of fine solid particles or liquid droplets suspended in a gaseous medium."},{"definition":"An aerosol can."},{"definition":"The payload (e.g. insecticide, paint, oil, cosmetics) and propellant contained by an aerosol can."},{"definition":"A colloidal system in which the dispersed phase is composed of either solid or liquid particles and in which the dispersal medium is some gas, usually air."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To spray with an aerosol."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɛɹəsɔl/"},{"text":"/ˈɛəɹəsɒl/"}]},{"word":"HOSTAGE","idx":17016,"count":2103928,"meanings":[{"definitions":[{"definition":"A person given as a pledge or security for the performance of the conditions of a treaty or similar agreement, such as to ensure the status of a vassal."},{"definition":"A person seized in order to compel another party to act (or refrain from acting) in a certain way, because of the threat of harm to the hostage."},{"definition":"Something that constrains one's actions because it is at risk."},{"definition":"One who is compelled by something, especially something that poses a threat; one who is not free to choose their own course of action."},{"definition":"The condition of being held as security or to compel someone else to act or not act in a particular way."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(possibly nonstandard) To give (someone or something) as a hostage to (someone or something else)."},{"definition":"(possibly nonstandard) To hold (someone or something) hostage, especially in a way that constrains or controls the person or thing held, or in order to exchange for something else."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hostage-us","text":"/ˈhɑstɪdʒ/"}]},{"word":"CRACKER","idx":17017,"count":2103875,"meanings":[{"definitions":[{"definition":"A dry, thin, crispy baked bread (usually salty or savoury, but sometimes sweet, as in the case of graham crackers and animal crackers)."},{"definition":"A short piece of twisted string tied to the end of a whip that creates the distinctive sound when the whip is thrown or cracked."},{"definition":"A firecracker."},{"definition":"A person or thing that cracks, or that cracks a thing (e.g. whip cracker; nutcracker)."},{"definition":"A Christmas cracker."},{"definition":"Refinery equipment used to pyrolyse organic feedstocks. If catalyst is used to aid pyrolysis it is informally called a cat-cracker"},{"definition":"A fine thing or person (crackerjack).","example":"She's an absolute cracker!"},{"definition":"An ambitious or hard-working person (i.e. someone who arises at the 'crack' of dawn)."},{"definition":"One who cracks (i.e. overcomes) computer software or security restrictions."},{"definition":"A noisy boaster; a swaggering fellow."},{"definition":"(racial slur) An impoverished white person from the southeastern United States, originally associated with Georgia and parts of Florida; (by extension) any white person."},{"definition":"(Florida) A police officer."},{"definition":"A northern pintail, species of dabbling duck."},{"definition":"A pair of fluted rolls for grinding caoutchouc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cracker-au","text":"/ˈkɹækə(ɹ)/"}]},{"word":"MONKS","idx":17019,"count":2103722,"meanings":[{"definitions":[{"definition":"A male member of a monastic order who has devoted his life for religious service."},{"definition":"In earlier usage, an eremite or hermit devoted to solitude, as opposed to a cenobite, who lived communally."},{"definition":"A male who leads an isolated life; a loner, a hermit."},{"definition":"An unmarried man who does not have sexual relationships."},{"definition":"A judge."},{"definition":"A blotch or spot of ink on a printed page, caused by the ink not being properly distributed; distinguished from a friar, or white spot caused by a deficiency of ink."},{"definition":"A piece of tinder made of agaric, used in firing the powder hose or train of a mine."},{"definition":"A South American monkey (Pithecia monachus); also applied to other species, as Cebus xanthosternos."},{"definition":"The bullfinch, common bullfinch, European bullfinch, or Eurasian bullfinch (Pyrrhula pyrrhula)."},{"definition":"The monkfish."},{"definition":"A fuse for firing mines."},{"definition":"A monkey."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be a monk."},{"definition":"To act like a monk; especially to be contemplative."},{"definition":"To monkey or meddle; to behave in a manner that is not systematic."},{"definition":"To be intoxicated or confused."},{"definition":"To be attached in a way that sticks out."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"monks-us","text":"/mʌŋks/"}]},{"word":"COMPLIMENT","idx":17020,"count":2103716,"meanings":[{"definitions":[{"definition":"An expression of praise, congratulation, or respect."},{"definition":"Complimentary language; courtesy, flattery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pay a compliment (to); to express a favorable opinion (of)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"compliment-us","text":"/ˈkɑmpləmənt/"}]},{"word":"STOREY","idx":17022,"count":2103431,"meanings":[{"definitions":[{"definition":"A building; an edifice."},{"definition":"A floor or level of a building or ship.","example":"For superstitious reasons, many buildings number their 13th storey as 14, bypassing 13 entirely."},{"definition":"A vertical level in certain letters, such as a and g.","example":"The IPA symbol for a voiced velar stop is the single-storey , not the double-storey ."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈstɔːɹi/"}]},{"word":"SCOTCH","idx":17023,"count":2103280,"meanings":[{"definitions":[{"definition":"A surface cut or abrasion."},{"definition":"A line drawn on the ground, as one used in playing hopscotch."},{"definition":"A block for a wheel or other round object; a chock, wedge, prop, or other support, to prevent slipping.","example":"a scotch for a wheel or a log on inclined ground"},{"definition":"(as a plural noun, the Scotch) The people of Scotland.","example":"The Scotch are a hardy bunch."},{"definition":"Whisky distilled in Scotland, especially from malted barley.","example":"Paul has drunk a lot of Scotch."},{"definition":"Any variety of Scotch.","example":"My favorite Scotches are Glenlivet and Laphroaig."},{"definition":"A glass of Scotch.","example":"Gimme a Scotch."},{"definition":"Scotch tape"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut or score; to wound superficially."},{"definition":"To prevent (something) from being successful.","example":"The rain scotched his plans of going to the beach."},{"definition":"To debunk or discredit an idea or rumor.","example":"The prime minister scotched rumors of his resignation."},{"definition":"To block a wheel or other round object.","example":"The workers stopped the rig on an incline and scotched the wheels."},{"definition":"To dress (stone) with a pick or pointed instrument."},{"definition":"To beat yarn in order to break up slugs and align the threads.","example":"Yarn is scotched immediately after it has been dried and while it is still warm. http//www.google.com/patents?id=DXdGAAAAEBAJ&pg=PP3&vq=scotched&dq=scotching"},{"definition":"To clothe or cover up."},{"definition":"(Australian rhyming slang) To rape."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or from Scotland; Scottish."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"scotch-us","text":"/skɑtʃ/"}]},{"word":"SERMONS","idx":17024,"count":2103017,"meanings":[{"definitions":[{"definition":"Religious discourse; a written or spoken address on a religious or moral matter."},{"definition":"A lengthy speech of reproval."}],"partOfSpeech":"n"}]},{"word":"REMEMBERS","idx":17027,"count":2102056,"meanings":[{"definitions":[{"definition":"To reconstitute or reassemble that which has been dismembered.","example":"1998, David Germano, “Re-Membering the Dismembered Body of Tibet: Contemporary Tibetan Visionary Movements in the People's Republic of China”, in Buddhism in Contemporary Tibet, edited by Melvyn C. Goldstein and Matthew Kapstein, pages 53–94"},{"definition":"To recall from one's memory; to have an image in one's memory."},{"definition":"To memorize; to put something into memory.","example":"Please remember this formula!"},{"definition":"To keep in mind, be mindful of","example":"Remember what I've said."},{"definition":"To not forget (to do something required)","example":"Remember to lock the door when you go out."},{"definition":"To convey greetings from.","example":"Please remember me to your brother."},{"definition":"To put in mind; to remind (also used reflexively)"},{"definition":"To engage in the process of recalling memories.","example":"You don't have to remind him; he remembers very well."},{"definition":"To give (a person) money as a token of appreciation of past service or friendship.","example":"My aunt remembered me in her will, leaving me several thousand pounds."},{"definition":"To commemorate, to have a remembrance ceremony"}],"partOfSpeech":"ve"}]},{"word":"COOLERS","idx":17028,"count":2101965,"meanings":[{"definitions":[{"definition":"Anything which cools."},{"definition":"An insulated bin or box used with ice or freezer packs to keep food or beverages cold while picnicking or camping."},{"definition":"A device for refrigerating dead bodies in a morgue."},{"definition":"A mixed drink, especially one served chilled.","example":"They served wine coolers in the afternoon."},{"definition":"A prison."},{"definition":"A cold deck."},{"definition":"A bouncer or doorman."}],"partOfSpeech":"n"}]},{"word":"MULTILATERAL","idx":17029,"count":2101916,"meanings":[{"definitions":[{"definition":"A group with representatives from three or more parties or nations."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having many sides or points of view."},{"definition":"Involving three or more parties or nations.","example":"a multilateral negotiation"}],"partOfSpeech":"j"}]},{"word":"CONTENTION","idx":17031,"count":2101748,"meanings":[{"definitions":[{"definition":"Argument, contest, debate, strife, struggle."},{"definition":"A point maintained in an argument, or a line of argument taken in its support; the subject matter of discussion of strife; a position taken or contended for.","example":"It is my contention that state lotteries are taxes on stupid people."},{"definition":"Competition by parts of a system or its users for a limited resource."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kənˈtɛnʃən/"}]},{"word":"AUDITED","idx":17033,"count":2100803,"meanings":[{"definitions":[{"definition":"To examine and adjust (e.g. an account).","example":"to audit the accounts of a treasure, or of parties who have a suit depending in court"},{"definition":"To conduct an independent review and examination of system records and activities in order to test the adequacy and effectiveness of data security and data integrity procedures, to ensure compliance with established policy and operational procedures, and to recommend any necessary changes"},{"definition":"To counsel spiritually."},{"definition":"To attend an academic class on a not-for-academic-credit basis."}],"partOfSpeech":"ve"}]},{"word":"ADJUNCT","idx":17035,"count":2100139,"meanings":[{"definitions":[{"definition":"An appendage; something attached to something else in a subordinate capacity."},{"definition":"A person associated with another, usually in a subordinate position; a colleague."},{"definition":"An unmalted grain or grain product that supplements the main mash ingredient."},{"definition":"A quality or property of the body or mind, whether natural or acquired, such as colour in the body or judgement in the mind."},{"definition":"A key or scale closely related to another as principal; a relative or attendant key."},{"definition":"(grammar) A dispensable phrase in a clause or sentence that amplifies its meaning, such as \"for a while\" in \"I typed for a while\"."},{"definition":"(X-bar theory) A constituent which is both the daughter and the sister of an X-bar."},{"definition":"Symploce."},{"definition":"One of a pair of morphisms which relate to each other through a pair of adjoint functors."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Connected in a subordinate function."},{"definition":"Added to a faculty or staff in a secondary position."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"adjunct-us","text":"/ˈædʒ.ʌŋkt/"}]},{"word":"GUERNSEY","idx":17036,"count":2099491,"meanings":[{"definitions":[{"definition":"A seaman's knitted woolen sweater, similar to a jersey."},{"definition":"The shirt worn by the players."},{"definition":"(slang: as in \"get a guernsey\") [receive] praise, admiration, recognition, credit, etc"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɝnzi/"},{"text":"/ˈɡɜːnzi/"},{"audio":"guernsey-au"}]},{"word":"GALORE","idx":17037,"count":2099185,"meanings":[{"definitions":[{"definition":"An abundance; plenty."}],"partOfSpeech":"n"},{"definitions":[{"definition":"In abundance.","example":"After the shipwreck there was whisky galore to be had for the taking."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"galore-us","text":"/ɡəˈlɔɹ/"}]},{"word":"ALOHA","idx":17038,"count":2099181,"meanings":[{"definitions":[{"definition":"Good wishes, love."},{"definition":"An utterance of aloha (see Interjection, below)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Expressing good wishes when greeting or parting from someone; hello; goodbye."}],"partOfSpeech":"i"}],"phonetics":[{"text":"/əˈloʊ.ə/"},{"text":"/əˈləʊ.(h)ə/"}]},{"word":"DEHYDROGENASE","idx":17039,"count":2098738,"meanings":[{"definitions":[{"definition":"Any of several enzymes that catalyze the removal of hydrogen (a proton) from biological compounds."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/diːˌhaɪdˈɹɒdʒəneɪz/"}]},{"word":"AXES","idx":17044,"count":2097942,"meanings":[{"definitions":[{"definition":"A tool for felling trees or chopping wood etc. consisting of a heavy head flattened to a blade on one side, and a handle attached to it."},{"definition":"An ancient weapon consisting of a head that has one or two blades and a long handle."},{"definition":"A dismissal or rejection.","example":"His girlfriend/boss/schoolmaster gave him the axe."},{"definition":"A gigging musician's particular instrument, especially a guitar in rock music or a saxophone in jazz."},{"definition":"A position, interest, or reason in buying and selling stock, often with ulterior motives.","example":"A financial dealer has an axe in a stock that his buyers don't know about, giving him an advantage in making the most profit."},{"definition":"The axle of a wheel."},{"definition":"An imaginary line around which an object spins (an axis of rotation) or is symmetrically arranged (an axis of symmetry).","example":"The Earth rotates once a day on its axis"},{"definition":"A fixed one-dimensional figure, such as a line or arc, with an origin and orientation and such that its points are in one-to-one correspondence with a set of numbers; an axis forms part of the basis of a space or is used to position and locate data in a graph (a coordinate axis)"},{"definition":"The second cervical vertebra of the spine"},{"definition":"A form of classification and descriptions of mental disorders or disabilities used in manuals such as the DSM (Diagnostic and Statistical Manual of Mental Disorders)"},{"definition":"The main stem or central part about which organs or plant parts such as branches are arranged"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To request (information, or an answer to a question).","example":"I asked her age."},{"definition":"To put forward (a question) to be answered.","example":"to ask a question"},{"definition":"To interrogate or enquire of (a person).","example":"I'm going to ask this lady for directions."},{"definition":"To request or petition; usually with for.","example":"to ask for a second helping at dinner"},{"definition":"To request permission to do something.","example":"Did you ask to use the car?"},{"definition":"To require, demand, claim, or expect, whether by way of remuneration or return, or as a matter of necessity.","example":"What price are you asking for the house?"},{"definition":"To invite.","example":"Don't ask them to the wedding."},{"definition":"To publish in church for marriage; said of both the banns and the persons."},{"definition":"To take (a person's situation) as an example."},{"definition":"To fell or chop with an axe."},{"definition":"To lay off, terminate or drastically reduce, especially in a rough or ruthless manner; to cancel.","example":"He got axed in the last round of firings."},{"definition":"To furnish with an axle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"axes-1-uk","text":"/ˈæksəz/"}]},{"word":"POSTFIX","idx":17045,"count":2097877,"meanings":[{"definitions":[{"definition":"Suffix."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To suffix."},{"definition":"To subject a sample to postfixation"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpoʊstfɪks/"},{"text":"/ˈpəʊst.fɪks/"}]},{"word":"STIRRING","idx":17046,"count":2097850,"meanings":[{"definitions":[{"definition":"To incite to action"},{"definition":"To disturb the relative position of the particles of, as of a liquid, by passing something through it; to agitate.","example":"She stirred the pudding with a spoon."},{"definition":"To agitate the content of (a container), by passing something through it.","example":"Would you please stand here and stir this pot so that the chocolate doesn't burn?"},{"definition":"To bring into debate; to agitate; to moot."},{"definition":"To change the place of in any manner; to move."},{"definition":"To move; to change one’s position."},{"definition":"To be in motion; to be active or bustling; to exert or busy oneself."},{"definition":"To become the object of notice; to be on foot."},{"definition":"To rise, or be up and about, in the morning."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(gerund of stir) An occasion on which something stirs or is stirred"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Invigorating or inspiring"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stirring-us","text":"/ˈstɝɪŋ/"}]},{"word":"HAZE","idx":17050,"count":2097119,"meanings":[{"definitions":[{"definition":"Very fine solid particles (smoke, dust) or liquid droplets (moisture) suspended in the air, slightly limiting visibility."},{"definition":"A reduction of transparency of a clear gas or liquid."},{"definition":"An analogous dullness on a surface that is ideally highly reflective or transparent.","example":"The furniture has a haze, possibly from some kind of wax."},{"definition":"Any state suggestive of haze in the atmosphere, such as mental confusion or vagueness of memory."},{"definition":"(packaging) The degree of cloudiness or turbidity in a clear glass or plastic, measured in percent."},{"definition":"Any substance causing turbidity in beer or wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be or become hazy, or thick with haze."},{"definition":"To perform an unpleasant initiation ritual upon a usually non-consenting individual, especially freshmen to a closed community such as a college or military unit."},{"definition":"To oppress or harass by forcing to do hard and unnecessary work."},{"definition":"In a rodeo, to assist the bulldogger by keeping (the steer) running in a straight line."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"haze-uk","text":"/heɪz/"}]},{"word":"PITS","idx":17051,"count":2096761,"meanings":[{"definitions":[{"definition":"A hole in the ground.","example":"The meadow around the town is full of old pits."},{"definition":"An area at a racetrack used for refueling and repairing the vehicles during a race.","example":"Two drivers have already gone into the pit this early in the race."},{"definition":"A section of the marching band containing mallet percussion instruments and other large percussion instruments too large to march, such as the tam tam. Also, the area on the sidelines where these instruments are placed."},{"definition":"A mine."},{"definition":"A hole or trench in the ground, excavated according to grid coordinates, so that the provenance of any feature observed and any specimen or artifact revealed may be established by precise measurement."},{"definition":"A trading pit."},{"definition":"The bottom part of something.","example":"I felt pain in the pit of my stomach."},{"definition":"Armpit."},{"definition":"A luggage hold."},{"definition":"A small surface hole or depression, a fossa."},{"definition":"The indented mark left by a pustule, as in smallpox."},{"definition":"The grave, or underworld."},{"definition":"An enclosed area into which gamecocks, dogs, and other animals are brought to fight, or where dogs are trained to kill rats."},{"definition":"Formerly, that part of a theatre, on the floor of the house, below the level of the stage and behind the orchestra; now, in England, commonly the part behind the stalls; in the United States, the parquet; also, the occupants of such a part of a theatre."},{"definition":"Part of a casino which typically holds tables for blackjack, craps, roulette, and other games."},{"definition":"A pit bull terrier.","example":"I'm taking one of my pits to the vet on Thursday."},{"definition":"A mosh pit.","example":"Because the museum was closed for renovation, the school decided to bring its fourth-graders to the pit at a Cannibal Corpse gig instead."},{"definition":"(law enforcement, usually used with \"maneuver\") A maneuver by which a police officer, by use of a police car, nudges the vehicle of a fleeing suspect enough for the suspect's vehicle to lose control and become disabled so the police officer can catch and apprehend the suspect."},{"definition":"The fissile core of a nuclear weapon, commonly made of plutonium surrounded by high-explosive lenses."},{"definition":"(hospital slang) The emergency department."},{"definition":"A seed inside a fruit; a stone or pip inside a fruit."},{"definition":"A shell in a drupe containing a seed."},{"definition":"The core of an implosion weapon, consisting of the fissile material and any neutron reflector or tamper bonded to it."},{"definition":"A pit bull terrier."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pits-uk","text":"/pɪts/"}]},{"word":"EXPONENTIAL","idx":17052,"count":2096725,"meanings":[{"definitions":[{"definition":"Any function that has an exponent as an independent variable."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to an exponent."},{"definition":"Expressed in terms of a power of e."},{"definition":"Characterised by a rate of change that is proportional to the value of the varying quantity, or, equivalently, by a doubling or halving over successive fixed intervals of time or other parameter.","example":"There were two deaths on Monday, four on Tuesday, and eight on Wednesday. The rate of increase seems exponential."},{"definition":"Characterised by a very rapid rate of change, especially increase."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"exponential-us","text":"/ˌɛk.spoʊ.ˈnɛn.tʃəl/"}]},{"word":"UTTER","idx":17053,"count":2096533,"meanings":[{"definitions":[{"definition":"Outer; furthest out, most remote."},{"definition":"Outward."},{"definition":"Absolute, unconditional, total, complete.","example":"utter ruin; utter darkness"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To produce (speech or other sounds) with one's voice.","example":"Don't you utter another word!"},{"definition":"To reveal or express (an idea, thought, desire, etc.) with speech."},{"definition":"To produce (a noise) (of an inanimate object).","example":"Sally's car uttered a hideous shriek when she applied the brakes."},{"definition":"To spit or blow (something) out of one's mouth."},{"definition":"To emit or give off (breath)."},{"definition":"To shed (a tear or tears)."},{"definition":"To offer (something) for sale; to sell."},{"definition":"To put (currency) into circulation."},{"definition":"To show (something that has been hidden); to reveal the identity of (someone)."},{"definition":"To send or put (something) out."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"utter-us","text":"/ˈʌtɚ/"}]},{"word":"BOTTLED","idx":17055,"count":2095983,"meanings":[{"definitions":[{"definition":"To seal (a liquid) into a bottle for later consumption. Also fig.","example":"This plant bottles vast quantities of spring water every day."},{"definition":"To feed (an infant) baby formula.","example":"Because of complications she can't breast feed her baby and so she bottles him."},{"definition":"To refrain from doing (something) at the last moment because of a sudden loss of courage.","example":"The rider bottled the big jump."},{"definition":"To throw away a leading position.","example":"Liverpool bottled the Premier League."},{"definition":"To strike (someone) with a bottle.","example":"He was bottled at a nightclub and had to have facial surgery."},{"definition":"To pelt (a musical act on stage, etc.) with bottles as a sign of disapproval.","example":"Meat Loaf was once bottled at Reading Festival."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Packaged in a bottle."},{"definition":"Drunk"},{"definition":"Shaped or protuberant like a bottle."},{"definition":"Kept in restraint; bottled up."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bottled-au"}]},{"word":"ANTS","idx":17056,"count":2095946,"meanings":[{"definitions":[{"definition":"Any of various insects in the family Formicidae in the order Hymenoptera, typically living in large colonies composed almost entirely of flightless females."},{"definition":"A Web spider."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rub insects, especially ants, on one's body, perhaps to control parasites or clean feathers."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ænts/"}]},{"word":"GASTRIC","idx":17058,"count":2095401,"meanings":[{"definitions":[{"definition":"Of or relating to the stomach."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡæstɹɪk/"}]},{"word":"SECRETARIAL","idx":17059,"count":2095099,"meanings":[{"definitions":[{"definition":"Pertaining to a secretary."},{"definition":"Connected with a secretary's work."}],"partOfSpeech":"j"}]},{"word":"INFLUENCING","idx":17060,"count":2094933,"meanings":[{"definitions":[{"definition":"To have an effect on by using gentle or subtle action; to exert an influence upon; to modify, bias, or sway; to persuade or induce.","example":"I must admit that this book influenced my outlook on life."},{"definition":"To exert, make use of one's influence."},{"definition":"To cause to flow in or into; infuse; instill."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Influence"}],"partOfSpeech":"n"}]},{"word":"RENTS","idx":17061,"count":2094682,"meanings":[{"definitions":[{"definition":"A payment made by a tenant at intervals in order to occupy a property."},{"definition":"A similar payment for the use of equipment or a service."},{"definition":"A profit from possession of a valuable right, as a restricted license to engage in a trade or business.","example":"A New York city taxicab license earns more than $10,000 a year in rent."},{"definition":"An object for which rent is charged or paid."},{"definition":"Income; revenue."},{"definition":"A tear or rip in some surface."},{"definition":"A division or schism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To occupy premises in exchange for rent.","example":"I rented a house from my friend's parents for a year."},{"definition":"To grant occupation in return for rent.","example":"We rented our house to our son's friend for a year."},{"definition":"To obtain or have temporary possession of an object (e.g. a movie) in exchange for money."},{"definition":"To be leased or let for rent.","example":"The house rents for five hundred dollars a month."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rents-us"}]},{"word":"THEIRS","idx":17063,"count":2094103,"meanings":[{"definitions":[{"definition":"That which belongs to them; the possessive case of they, used without a following noun."}],"partOfSpeech":"p"}],"phonetics":[{"audio":"theirs-us","text":"/ðɛɚz/"}]},{"word":"MATTRESSES","idx":17064,"count":2093868,"meanings":[{"definitions":[{"definition":"A pad on which a person can recline and sleep, usually having an inner section of coiled springs covered with foam or other cushioning material then enclosed with cloth fabric."},{"definition":"A form of retaining wall used to support foundations or an embankment"}],"partOfSpeech":"n"}]},{"word":"LAX","idx":17067,"count":2093131,"meanings":[{"definitions":[{"definition":"A salmon."},{"definition":"Lacrosse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Lenient and allowing for deviation; not strict.","example":"The rules are fairly lax, but you have to know which ones you can bend."},{"definition":"Loose; not tight or taut.","example":"The rope fell lax."},{"definition":"Lacking care; neglectful, negligent."},{"definition":"Having a looseness of the bowels; diarrheal."},{"definition":"Describing an associative monoidal functor."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lax-us","text":"/læks/"}]},{"word":"TOASTER","idx":17068,"count":2092936,"meanings":[{"definitions":[{"definition":"One who toasts (cooks lightly by browning)."},{"definition":"One who toasts (engages in salute while drinking alcohol)."},{"definition":"A toasting fork."},{"definition":"A rapier or similar weapon."},{"definition":"An electrical device for toasting bread, English muffins, crumpets, etc."},{"definition":"A self-contained software package (or appliance) distributable over the Internet or by burning onto CDs."},{"definition":"An electronic organ, especially a crude one that uses analog technology."},{"definition":"Any of several small, box-like automobiles exemplified by the Scion xB and Honda Element."},{"definition":"A fish ready for toasting."},{"definition":"A firearm, especially a pistol."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"toaster-uk","text":"/ˈtəʊstə/"}]},{"word":"CATER","idx":17069,"count":2092828,"meanings":[{"definitions":[{"definition":"Caterer"},{"definition":"A person employed to obtain and maintain the storage of provisions, especially food."},{"definition":"A person or company hired to provide and serve food, usually for a large group and at a location separate from where the food is prepared."},{"definition":"Someone who supplies what is needed, especially food.","example":"The merchants are the purveyors of fine selections."},{"definition":"An officer who provided provisions for the king's household."},{"definition":"A procurer; a pimp."},{"definition":"Four."},{"definition":"The four of cards or dice."},{"definition":"A method of ringing nine bells in four pairs with a ninth tenor bell."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide, particularly:"},{"definition":"To place, set, move, or cut diagonally or rhomboidally."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Diagonally."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"cater-1-us","text":"/ˈkeɪdɚ/"}]}]