[{"word":"SCRATCHING","idx":22046,"count":1351529,"meanings":[{"definitions":[{"definition":"To rub a surface with a sharp object, especially by a living creature to remove itching with nails, claws, etc.","example":"Could you please scratch my back?"},{"definition":"To rub the skin with rough material causing a sensation of irritation; to cause itching.","example":"I don't like that new scarf because it scratches my neck."},{"definition":"To mark a surface with a sharp object, thereby leaving a scratch (noun).","example":"A real diamond can easily scratch a pane of glass."},{"definition":"To cross out, strike out, strike through some text on a page."},{"definition":"To produce a distinctive sound on a turntable by moving a vinyl record back and forth while manipulating the crossfader (see also scratching)."},{"definition":"To commit a foul in pool, as where the cue ball is put into a pocket or jumps off the table.","example":"Embarrassingly, he scratched on the break, popping the cue completely off the table."},{"definition":"To score, not by skillful play but by some fortunate chance of the game."},{"definition":"To write or draw hastily or awkwardly; scrawl."},{"definition":"To dig or excavate with the claws.","example":"Some animals scratch holes, in which they burrow."},{"definition":"To dig or scrape (a person's skin) with claws or fingernails in self-defense or with the intention to injure.","example":"The cat scratched the little girl."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or sound of something being scratched.","example":"We heard further scratchings at the door as the dog whined to be let in."},{"definition":"A pork scratching."},{"definition":"Record scratching, a technique of starting and stopping a vinyl record from playing to produce music in hip hop."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈskɹætʃɪŋ/"}]},{"word":"IODINE","idx":22049,"count":1351488,"meanings":[{"definitions":[{"definition":"A chemical element (symbol: I) with an atomic number of 53; one of the halogens."},{"definition":"An antiseptic incorporating the element."},{"definition":"An iodide."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat with iodine."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"iodine-us","text":"/ˈaɪ.əˌdaɪn, -dɪn, -diːn/"},{"audio":"iodine-uk","text":"/ˈaɪ.əˌdaɪn, -dɪn, -diːn/"}]},{"word":"PHOEBE","idx":22050,"count":1351263,"meanings":[{"definitions":[{"definition":"Any of several birds of the genus Sayornis."}],"partOfSpeech":"n"}]},{"word":"SALINAS","idx":22052,"count":1351166,"meanings":[{"definitions":[{"definition":"A salt marsh, or salt pond, enclosed from the sea."}],"partOfSpeech":"n"}]},{"word":"LEGGED","idx":22053,"count":1351011,"meanings":[{"definitions":[{"definition":"(in combinations) Someone or something having a certain number or type of legs","example":"Humans are not the only two-leggeds in the world."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having legs, or a certain type or number of legs","example":"A robot which runs at a speed of over 29mph has set a new land-speed record for legged robots"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To remove the legs from an animal carcass."},{"definition":"To build legs onto a platform or stage for support."},{"definition":"To put a series of three or more options strikes into the stock market."},{"definition":"To apply force using the leg (as in 'to leg a horse')."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈlɛɡd/"}]},{"word":"UNILATERAL","idx":22054,"count":1350929,"meanings":[{"definitions":[{"definition":"Done by one side only."},{"definition":"Affecting only one side of the body."},{"definition":"Binding or affecting one party only."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[ˌjʉː.nəˈɫæɾ.ɚ.ɻɫ̩]"},{"text":"[ˌjʉː.nɪˈlæt.ə.ɹɫ̩]"}]},{"word":"WIPES","idx":22055,"count":1350866,"meanings":[{"definitions":[{"definition":"The act of wiping something.","example":"multiple wipes of a computer's hard disk"},{"definition":"A soft piece of cloth or cloth-like material used for wiping."},{"definition":"A kind of film transition where one shot replaces another by travelling from one side of the frame to another or with a special shape."},{"definition":"A sarcastic remark; a reproof, a jibe."},{"definition":"A lapwing, especially a northern lapwing (Vanellus vanellus)."},{"definition":"An instance of all members of a party dying in a single campaign, event, or battle; a wipeout."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move an object over, maintaining contact, with the intention of removing some substance from the surface. (Compare rub.)","example":"I wiped the sweat from my brow with the back of my hand."},{"definition":"To remove by rubbing; to rub off; to obliterate; usually followed by away, off, or out."},{"definition":"To cheat; to defraud; to trick; usually followed by out."},{"definition":"To erase.","example":"I accidentally wiped my hard drive."},{"definition":"To make (a joint, as between pieces of lead pipe), by surrounding the junction with a mass of solder, applied in a plastic condition by means of a rag with which the solder is shaped by rubbing."},{"definition":"To remove an expression from one's face.","example":"You should wipe that smirk off your face before the boss comes in."},{"definition":"To deperm (a ship)."},{"definition":"To have all members of a party die in a single campaign, event, or battle; to be wiped out.","example":"If you try to fight that boss underprepared, you're definitely gonna wipe."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/waɪps/"}]},{"word":"FRO","idx":22056,"count":1350640,"meanings":[{"definitions":[{"definition":"From; away; back or backward."}],"partOfSpeech":"v"},{"definitions":[{"definition":"A hairstyle characterized by a tightly curled locks and a rounded shape."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[fɹəʊ]"},{"audio":"fro-au"}]},{"word":"KRONE","idx":22057,"count":1350253,"meanings":[{"definitions":[{"definition":"The currency of Iceland, Denmark (including Greenland and the Faroe Islands) and Norway, divided into 100 øre, except in Iceland where 1 króna = 100 aurar."}],"partOfSpeech":"n"}]},{"word":"URGENTLY","idx":22059,"count":1350180,"meanings":[{"definitions":[{"definition":"With great haste, with a sense of urgency, because it is very important.","example":"Funds are urgently required if this work is to be completed as planned."},{"definition":"Continuously. With insistence.","example":"He pleaded urgently for release from what he considered to be an unjust imprisonment."}],"partOfSpeech":"v"}]},{"word":"EXPOSES","idx":22061,"count":1349895,"meanings":[{"definitions":[{"definition":"To reveal, uncover, make visible, bring to light, introduce to."},{"definition":"To subject photographic film to light thereby recording an image."},{"definition":"To abandon, especially an unwanted baby in the wilderness."},{"definition":"To submit to an active (mostly dangerous) substance like an allergen, ozone, nicotine, solvent, or to any other stress, in order to test the reaction, resistance, etc."},{"definition":"To make available to other parts of a program, or to other programs."}],"partOfSpeech":"ve"}]},{"word":"AEGIS","idx":22062,"count":1349788,"meanings":[{"definitions":[{"definition":"A mythological shield associated with the Greek deities Zeus and Athena (and their Roman counterparts Jupiter and Minerva) shown as a short cloak made of goatskin worn on the shoulders, more as an emblem of power and protection than a military shield. The aegis of Athena or Minerva is usually shown with a border of snakes and with the head of Medusa in the center."},{"definition":"Usually as under the aegis: guidance, protection; endorsement, sponsorship."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"aegis-uk","text":"/ˈiːdʒɪs/"}]},{"word":"NATURES","idx":22063,"count":1349681,"meanings":[{"definitions":[{"definition":"The natural world; that which consists of all things unaffected by or predating human technology, production, and design. (Compare ecosystem.)","example":"Nature never lies (i.e. tells untruths)."},{"definition":"The innate characteristics of a thing. What something will tend by its own constitution, to be or do. Distinct from what might be expected or intended."},{"definition":"The summary of everything that has to do with biological, chemical and physical states and events in the physical universe."},{"definition":"Conformity to that which is natural, as distinguished from that which is artificial, or forced, or remote from actual experience."},{"definition":"Kind, sort; character; quality."},{"definition":"Physical constitution or existence; the vital powers; the natural life."},{"definition":"Natural affection or reverence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To endow with natural qualities."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"natures-us"}]},{"word":"COLLOQUIUM","idx":22064,"count":1349618,"meanings":[{"definitions":[{"definition":"A colloquy; a meeting for discussion."},{"definition":"An academic meeting or seminar usually led by a different lecturer and on a different topic at each meeting."},{"definition":"An address to an academic meeting or seminar."},{"definition":"That part of the complaint or declaration in an action for defamation which shows that the words complained of were spoken concerning the plaintiff."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kəˈləʊkwiːəm/"}]},{"word":"LIBERALISM","idx":22066,"count":1349410,"meanings":[{"definitions":[{"definition":"The quality of being liberal."},{"definition":"Any political movement founded on the autonomy and personal freedom of the individual, progress and reform, and government by law with the consent of the governed."},{"definition":"An economic ideology in favour of laissez faire and the free market (related to economic liberalism)."}],"partOfSpeech":"n"}]},{"word":"FATALITIES","idx":22070,"count":1348842,"meanings":[{"definitions":[{"definition":"The state proceeding from destiny; invincible necessity, superior to, and independent of, free and rational control."},{"definition":"Tendency to death, destruction or danger, as if by decree of fate."},{"definition":"That which is decreed by fate or which is fatal; a fatal event."},{"definition":"Death."},{"definition":"An accident that causes death."},{"definition":"A person killed."},{"definition":"A move where one character kills another."}],"partOfSpeech":"n"}]},{"word":"SUPPLEMENTATION","idx":22071,"count":1348734,"meanings":[{"definitions":[{"definition":"The act of supplementing"},{"definition":"Something added as a supplement"}],"partOfSpeech":"n"}]},{"word":"EMBODIED","idx":22075,"count":1348384,"meanings":[{"definitions":[{"definition":"To represent in a physical or concrete form; to incarnate or personify.","example":"As the car salesman approached, wearing a plaid suit and slicked-back hair, he seemed to embody sleaze."},{"definition":"To represent in some other form, such as a code of laws.","example":"The US Constitution aimed to embody the ideals of diverse groups of people, from Puritans to Deists."},{"definition":"To comprise or include as part of a cohesive whole; to be made up of."},{"definition":"To unite in a body or mass."}],"partOfSpeech":"ve"}]},{"word":"VERBOSE","idx":22080,"count":1347618,"meanings":[{"definitions":[{"definition":"Abounding in words, containing more words than necessary; long-winded."},{"definition":"Producing unusually detailed output for diagnostic purposes."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"verbose-us","text":"/və˞ˈboʊs/"}]},{"word":"HEIR","idx":22081,"count":1347595,"meanings":[{"definitions":[{"definition":"Someone who inherits, or is designated to inherit, the property of another."},{"definition":"One who inherits, or has been designated to inherit, a hereditary title or office."},{"definition":"A successor in a role, representing continuity with the predecessor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To inherit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"heir-us","text":"/ɛəɹ/"}]},{"word":"SUCCESSORS","idx":22083,"count":1347505,"meanings":[{"definitions":[{"definition":"A person or thing that immediately follows another in holding an office or title.","example":"George W. Bush was successor to Bill Clinton as President of the US."},{"definition":"The next heir in order or succession."},{"definition":"A person who inherits a title or office."},{"definition":"The integer, ordinal number or cardinal number immediately following another.","example":"A limit ordinal is not the successor of any ordinal."}],"partOfSpeech":"n"}]},{"word":"ECCENTRIC","idx":22084,"count":1347362,"meanings":[{"definitions":[{"definition":"One who does not behave like others."},{"definition":"A kook; a person of bizarre habits or beliefs."},{"definition":"A circle not having the same centre as another."},{"definition":"A disk or wheel with its axis off centre, giving a reciprocating motion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not at or in the centre; away from the centre."},{"definition":"Not perfectly circular; elliptical.","example":"As of 2008, Margaret had the most eccentric orbit of any moon in the solar system, though Nereid's mean eccentricity is greater."},{"definition":"Having a different center; not concentric."},{"definition":"(of a person) Deviating from the norm; behaving unexpectedly or differently; unconventional and slightly strange."},{"definition":"(of a motion) Against or in the opposite direction of contraction of a muscle (e.g., such as results from flexion of the lower arm (bending of the elbow joint) by an external force while contracting the triceps and other elbow extensor muscles to control that movement; opening of the jaw while flexing the masseter)."},{"definition":"Having different goals or motives."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"eccentric-us","text":"/ɛkˈsɛntɹɪk/"}]},{"word":"TRANSPORTS","idx":22087,"count":1347066,"meanings":[{"definitions":[{"definition":"An act of transporting; conveyance.","example":"The transport of goods is not included in the price given on the website."},{"definition":"The state of being transported by emotion; rapture."},{"definition":"A vehicle used to transport (passengers, mail, freight, troops etc.)"},{"definition":"A tractor-trailer."},{"definition":"The system of transporting passengers, etc. in a particular region; the vehicles used in such a system.","example":"The local transport received a big boost as part of the mayor's infrastructural plans."},{"definition":"A device that moves recording tape across the read/write heads of a tape recorder or video recorder etc."},{"definition":"A deported convict."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To carry or bear from one place to another; to remove; to convey.","example":"to transport goods; to transport troops"},{"definition":"To deport to a penal colony."},{"definition":"To move (someone) to strong emotion; to carry away.","example":"Music transports the soul."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"transports-us"}]},{"word":"STH","idx":22088,"count":1347033,"meanings":[{"definitions":[{"definition":"An uncertain or unspecified thing; one thing.","example":"I have a feeling something good is going to happen today."},{"definition":"(of someone or something) A quality to a moderate degree.","example":"That child is something of a genius."},{"definition":"(of a person) A talent or quality that is difficult to specify.","example":"She has a certain something."},{"definition":"(often with really or quite) Somebody who or something that is superlative or notable in some way.","example":"- Some marmosets are less than six inches tall.\n- Well, isn't that something?"}],"partOfSpeech":"p"}]},{"word":"AMOUR","idx":22089,"count":1346779,"meanings":[{"definitions":[{"definition":"Love, affection."},{"definition":"Courtship; flirtation."},{"definition":"A love affair."},{"definition":"A lover."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɑːˈmʊr/"},{"text":"/æˈmʊər/"}]},{"word":"DETERMINISTIC","idx":22094,"count":1346097,"meanings":[{"definitions":[{"definition":"Of, or relating to determinism."},{"definition":"(of a Turing machine) Having at most one instruction associated with any given internal state."},{"definition":"(of a system) Having exactly predictable time evolution."},{"definition":"(of an algorithm) Having each state depend only on the immediately previous state, as opposed to having some states depend on backtracking where there may be multiple possible next actions and no way to choose between them except by trying each one and backtracking upon failure."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈtɜːmɪnɪstɪk/"}]},{"word":"PREDICTOR","idx":22096,"count":1345907,"meanings":[{"definitions":[{"definition":"Something that anticipates, predicts or foretells.","example":"The predictor in the traffic-light control circuit tries to figure out how fast to change the lights."},{"definition":"An independent variable."}],"partOfSpeech":"n"}]},{"word":"SALMONELLA","idx":22097,"count":1345832,"meanings":[{"definitions":[{"definition":"Any of several rod-shaped bacteria, of the genus Salmonella, that cause food poisoning and other diseases","example":"Everyone got sick from salmonella in the undercooked meat."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌsæl.məˈnɛl.ə/"}]},{"word":"VIEWABLE","idx":22100,"count":1345812,"meanings":[{"definitions":[{"definition":"Able to be viewed."},{"definition":"Able to be seen; visible."},{"definition":"(of a webpage or component) Able to be rendered correctly by a particular browser."}],"partOfSpeech":"j"}]},{"word":"SUBNET","idx":22101,"count":1345624,"meanings":[{"definitions":[{"definition":"The abstraction of a sequence."},{"definition":"A portion of a network that shares a network address in which each component is identified by a number."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To break (a network) into subnets."}],"partOfSpeech":"ve"}]},{"word":"MAXIMISE","idx":22102,"count":1345439,"meanings":[{"definitions":[{"definition":"To make as large as possible"},{"definition":"To expand (a window) to fill the main display area"}],"partOfSpeech":"ve"}]},{"word":"ILLUSTRATIVE","idx":22103,"count":1345429,"meanings":[{"definitions":[{"definition":"Demonstrative, exemplative, showing an example or demonstrating.","example":"This latest incident is illustrative of his continued bad behavior."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪˈlʌs.tɹə.tɪv/"}]},{"word":"PROSECUTED","idx":22105,"count":1345345,"meanings":[{"definitions":[{"definition":"To start criminal proceedings against.","example":"to prosecute a man for trespass, or for a riot"},{"definition":"To charge, try."},{"definition":"To seek to obtain by legal process.","example":"to prosecute a right or a claim in a court of law"},{"definition":"To pursue something to the end.","example":"to prosecute a scheme, hope, or claim"}],"partOfSpeech":"ve"}]},{"word":"SAILED","idx":22106,"count":1345188,"meanings":[{"definitions":[{"definition":"To be impelled or driven forward by the action of wind upon sails, as a ship on water; to be impelled on a body of water by steam or other power."},{"definition":"To move through or on the water; to swim, as a fish or a waterfowl."},{"definition":"To ride in a boat, especially a sailboat."},{"definition":"To set sail; to begin a voyage.","example":"We sail for Australia tomorrow."},{"definition":"To move briskly and gracefully through the air."},{"definition":"To move briskly.","example":"The duchess sailed haughtily out of the room."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a specified kind or number of sail.","example":"a three-sailed ship"},{"definition":"Having the sails set."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sailed-us","text":"/seɪld/"}]},{"word":"CHALETS","idx":22108,"count":1344986,"meanings":[{"definitions":[{"definition":"An alpine style of wooden building with a sloping roof and overhanging eaves."}],"partOfSpeech":"n"}]},{"word":"REIMBURSED","idx":22109,"count":1344886,"meanings":[{"definitions":[{"definition":"To compensate with payment; especially, to repay money spent on one's behalf.","example":"The company will reimburse you for your expenses for the business trip."}],"partOfSpeech":"ve"}]},{"word":"CRAVING","idx":22111,"count":1344800,"meanings":[{"definitions":[{"definition":"A strong desire; yearning."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To desire strongly, so as to satisfy an appetite; to long or yearn for.","example":"to crave after wealth"},{"definition":"To ask for earnestly; to beg; to claim.","example":"I humbly crave your indulgence to read this letter until the end."},{"definition":"To call for; to require as a course of action."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"craving-us","text":"/ˈkɹeɪ.vɪŋ/"}]},{"word":"ADVOCATING","idx":22112,"count":1344667,"meanings":[{"definitions":[{"definition":"To plead in favour of; to defend by argument, before a tribunal or the public; to support, vindicate, or recommend publicly."},{"definition":"To encourage support for something.","example":"I like trees, but I do not advocate living in them."},{"definition":"(with for) To engage in advocacy.","example":"We have been advocating for changes in immigration law."}],"partOfSpeech":"ve"}]},{"word":"LEAKING","idx":22114,"count":1344431,"meanings":[{"definitions":[{"definition":"To allow fluid or gas to pass through an opening that should be sealed.","example":"The faucet has been leaking since last month."},{"definition":"(of a fluid or gas) To pass through an opening that should be sealed.","example":"No one realized that propane gas was leaking from a rusty tank in the concession area, slowly filling the unventilated room."},{"definition":"To disclose secret information surreptitiously or anonymously.","example":"Someone must have leaked it to our competitors that the new product will be out soon."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something leaks."},{"definition":"(in the plural) That which leaks out."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈliːkɪŋ/"}]},{"word":"WATERMARK","idx":22115,"count":1344334,"meanings":[{"definitions":[{"definition":"A translucent design impressed on the surface of paper and visible when the paper is held to the light."},{"definition":"(by extension) A logo superimposed on a digital image, a television broadcast, etc."},{"definition":"A value stored in a datafile to ensure its integrity, so that if the file's contents are changed then the watermark will no longer match the contents."},{"definition":"A mark indicating the level to which water has risen."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark paper with a watermark."},{"definition":"To mark a datafile with a digital watermark."}],"partOfSpeech":"ve"}]},{"word":"ESCAPING","idx":22116,"count":1344327,"meanings":[{"definitions":[{"definition":"To get free; to free oneself.","example":"The factory was evacuated after toxic gases escaped from a pipe."},{"definition":"To avoid (any unpleasant person or thing); to elude, get away from.","example":"He only got a fine and so escaped going to jail."},{"definition":"To avoid capture; to get away with something, avoid punishment.","example":"Luckily, I escaped with only a fine."},{"definition":"To elude the observation or notice of; to not be seen or remembered by.","example":"The name of the hotel escapes me at present."},{"definition":"To cause (a single character, or all such characters in a string) to be interpreted literally, instead of with any special meaning it would usually have in the same context, often by prefixing with another character.","example":"Brion escaped the double quote character on Windows by adding a second double quote within the literal."},{"definition":"To halt a program or command by pressing a key (such as the \"Esc\" key) or combination of keys."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who escapes; an escape."},{"definition":"That which escapes or leaks out; an emission."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əsˈkeɪpɪŋ/"}]},{"word":"TOTES","idx":22117,"count":1344312,"meanings":[{"definitions":[{"definition":"A tote bag."},{"definition":"A heavy burden."},{"definition":"(logistics) A kind of plastic box used for transporting goods."},{"definition":"A pari-mutuel machine; a totalizator."},{"definition":"Pari-mutuel betting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To the fullest extent or degree.","example":"They've totally demolished the bank on Main Street."},{"definition":"(degree) Very; extremely.","example":"That was totally wicked!"},{"definition":"(modal) Definitely; for sure.","example":"That was totally not what happened."}],"partOfSpeech":"v"}]},{"word":"POSSESSING","idx":22118,"count":1344167,"meanings":[{"definitions":[{"definition":"To have; to have ownership of.","example":"He does not even possess a working telephone."},{"definition":"To take control of someone's body or mind, especially in a supernatural manner.","example":"They thought he was possessed by evil spirits."},{"definition":"(chiefly with of) To vest ownership in (someone, or oneself); to give someone power or knowledge; to acquaint; to inform."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"possessing-us"}]},{"word":"SUICIDAL","idx":22119,"count":1344100,"meanings":[{"definitions":[{"definition":"Someone suicidal, someone likely to kill themselves"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to suicide.","example":"He is an authority on the precursors of suicidal behavior."},{"definition":"(of a person) Likely to commit, or to attempt to commit, suicide.","example":"After losing his job, his wife, and his leg in a single week, he became suicidal."},{"definition":"Extremely reckless.","example":"His driving habits are utterly suicidal."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌsuɪˈsaɪdl̩/"},{"text":"/ˌs(j)uːɪˈsaɪdl̩/"}]},{"word":"CRUISERS","idx":22120,"count":1343786,"meanings":[{"definitions":[{"definition":"One who attends cruises."},{"definition":"A kind of bicycle that usually combines balloon tires, an upright seating posture, a single-speed drivetrain, and straightforward steel construction with expressive styling."},{"definition":"(in the days of sail) A frigate or other vessel, detached from the fleet, to cruise independently in search of the enemy or its merchant ships."},{"definition":"A class of fast warships of medium tonnage, having a long cruising range but less armour and firepower than a battleship."},{"definition":"A miniature aircraft carrier carrying VTOL aircraft."},{"definition":"A passenger ship used for pleasure voyages, where the voyage itself and the ship's amenities are considered an essential part of the experience; also cruise ship."},{"definition":"Any of several yachts designed for cruising."},{"definition":"(law enforcement) A police patrol vehicle."},{"definition":"Any of various nymphalid butterflies of the genus Vindula."},{"definition":"Someone who cruises bars and neighborhoods looking for \"action\"."}],"partOfSpeech":"n"}]},{"word":"MASONIC","idx":22121,"count":1343624,"meanings":[{"definitions":[{"definition":"Of or pertaining to stonemasons or masonry."},{"definition":"Of or pertaining to freemasonry."}],"partOfSpeech":"j"}]},{"word":"FORAGE","idx":22122,"count":1343473,"meanings":[{"definitions":[{"definition":"Fodder for animals, especially cattle and horses."},{"definition":"An act or instance of foraging."},{"definition":"The demand for fodder etc by an army from the local population"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To search for and gather food for animals, particularly cattle and horses."},{"definition":"To rampage through, gathering and destroying as one goes."},{"definition":"To rummage."},{"definition":"(of an animal) To seek out and eat food."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"forage-us","text":"/ˈfɑɹɪdʒ/"}]},{"word":"DYSLEXIA","idx":22124,"count":1343235,"meanings":[{"definitions":[{"definition":"A learning disability characterized by reading and writing difficulties."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪsˈlɛksi.ə/"}]},{"word":"THUGS","idx":22126,"count":1343168,"meanings":[{"definitions":[{"definition":"Someone with an intimidating and unseemly appearance and mannerisms, who treats others violently and roughly, often for hire."},{"definition":"One of a band of assassins formerly active in northern India who worshipped Kali and offered their victims to her."},{"definition":"In gardening, an over-vigorous plant that spreads and dominates the flowerbed."},{"definition":"A punk; a hoodlum; a hooligan."}],"partOfSpeech":"n"}]},{"word":"LOCO","idx":22127,"count":1343167,"meanings":[{"definitions":[{"definition":"A direction in written or printed music to be returning to the proper pitch after having played an octave higher or lower."}],"partOfSpeech":"v"},{"definitions":[{"definition":"A certain species of Astragalus or Oxytropis, capable of causing locoism."},{"definition":"A locomotive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To poison with the loco plant; to affect with locoism."},{"definition":"(by extension) To render insane."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Crazy."},{"definition":"Intoxicated by eating locoweed."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈləʊ.kəʊ/"}]},{"word":"ORGANICS","idx":22129,"count":1343136,"meanings":[{"definitions":[{"definition":"An organic compound."},{"definition":"An organic food."},{"definition":"A living organism, as opposed to a robot or hologram."}],"partOfSpeech":"n"}]},{"word":"FEDS","idx":22131,"count":1342978,"meanings":[{"definitions":[{"definition":"A federal government officer or official, especially FBI, CIA, NSA, ATF, and DEA agents.","example":"That corrupt fed was caught taking bribes from a mobster!"},{"definition":"A police officer."},{"definition":"A “federation” in which powerlifters organize to compete."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"feds-au","text":"/fɛdz/"}]},{"word":"DOPAMINE","idx":22135,"count":1342414,"meanings":[{"definitions":[{"definition":"A neurotransmitter associated with movement, attention, learning, and the brain’s pleasure and reward system."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dopamine-uk","text":"/ˈdəʊpəmiːn/"}]},{"word":"MULTIPLIER","idx":22136,"count":1342155,"meanings":[{"definitions":[{"definition":"A number by which another (the multiplicand) is to be multiplied.","example":"In the expression 5 × 7, the \"5\" is a multiplier."},{"definition":"(grammar) An adjective indicating the number of times something is to be multiplied.","example":"English multipliers include \"double\" and \"triple\"."},{"definition":"A ratio used to estimate total economic effect for a variety of economic activities."},{"definition":"Any of several devices used to enhance a signal"},{"definition":"A multiplier onion."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[ˈmʌɫ.tɪ.ˌplaɪ.ɚ]"},{"text":"[ˈmʌɫ.tɪ.ˌplaɪ.ə(ɹ)]"}]},{"word":"PAYOFF","idx":22139,"count":1341939,"meanings":[{"definitions":[{"definition":"A payment."},{"definition":"A reward."},{"definition":"A bribe."},{"definition":"A resolution or justification of an event that has already occurred, especially in fiction."},{"definition":"Short for payoff pitch."}],"partOfSpeech":"n"}]},{"word":"DISTINCTLY","idx":22140,"count":1341851,"meanings":[{"definitions":[{"definition":"In a distinct manner."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"distinctly-us","text":"/dɪsˈtɪŋktli/"}]},{"word":"SONAR","idx":22142,"count":1341822,"meanings":[{"definitions":[{"definition":"Echolocation"},{"definition":"A device that uses hydrophones (in the same manner as radar) to locate objects underwater."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sonar-us"}]},{"word":"ASSERTIONS","idx":22143,"count":1341764,"meanings":[{"definitions":[{"definition":"The act of asserting; positive declaration or averment."},{"definition":"Something which is asserted; a declaration; a statement asserted.","example":"You're a man of strong assertions!"},{"definition":"A statement or declaration which lacks support or evidence.","example":"That's just a bare assertion."},{"definition":"Maintenance; vindication","example":"the assertion of one's rights or prerogatives"},{"definition":"A statement in a program asserting a condition expected to be true at a particular point, used in debugging."}],"partOfSpeech":"n"}]},{"word":"BABA","idx":22144,"count":1341717,"meanings":[{"definitions":[{"definition":"A kind of sponge cake soaked in rum-flavoured syrup."},{"definition":"(esp. among people of East European ancestry) A grandmother."},{"definition":"An old woman, especially a traditional old woman from an eastern European culture."},{"definition":"(esp. among people of Indian ancestry) A father."},{"definition":"(Hinduism, Islam, Sikhism) A holy man, a spiritual leader."},{"definition":"A baby, child."},{"definition":"In baby talk, often used for a variety of words beginning with b, such as bottle or blanket."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbæbə/"}]},{"word":"PEBBLE","idx":22145,"count":1341583,"meanings":[{"definitions":[{"definition":"A small stone, especially one rounded by the action of water."},{"definition":"A particle from 4 to 64 mm in diameter, following the Wentworth scale."},{"definition":"A small droplet of water intentionally sprayed on the ice that cause irregularities on the surface."},{"definition":"Transparent and colourless rock crystal.","example":"Brazilian pebble"},{"definition":"A form of slow-burning gunpowder in large cubical grains."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pave with pebbles."},{"definition":"To deposit water droplets on the ice.","example":"to pebble the ice between games"},{"definition":"To give (leather) a rough appearance with small rounded prominences."},{"definition":"To place a pebble at (a vertex of a graph) according to certain rules; see pebble game."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɛb.əl/"}]},{"word":"FLASHER","idx":22147,"count":1341269,"meanings":[{"definitions":[{"definition":"Anything that flashes, especially a device that switches a light on and off."},{"definition":"An indicator or turn signal."},{"definition":"A person who exposes their genitals or female nipples."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"flasher-au"}]},{"word":"STAFFS","idx":22148,"count":1341238,"meanings":[{"definitions":[{"definition":"(plural staffs or staves) A long, straight, thick wooden rod or stick, especially one used to assist in walking."},{"definition":"(plural staves) A series of horizontal lines on which musical notes are written; a stave."},{"definition":"(plural staff or staffs) The employees of a business.","example":"The company employed 10 new members of staff this month."},{"definition":"A mixture of plaster and fibre used as a temporary exterior wall covering.W"},{"definition":"A pole, stick, or wand borne as an ensign of authority; a badge of office.","example":"a constable's staff"},{"definition":"A pole upon which a flag is supported and displayed."},{"definition":"The rung of a ladder."},{"definition":"A series of verses so disposed that, when it is concluded, the same order begins again; a stanza; a stave."},{"definition":"An arbor, as of a wheel or a pinion of a watch."},{"definition":"The grooved director for the gorget, or knife, used in cutting for stone in the bladder."},{"definition":"An establishment of officers in various departments attached to an army, to a section of an army, or to the commander of an army. The general's staff consists of those officers about his person who are employed in carrying his commands into execution."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply (a business, volunteer organization, etc.) with employees or staff members."}],"partOfSpeech":"ve"}]},{"word":"SUBCONTRACTORS","idx":22149,"count":1341210,"meanings":[{"definitions":[{"definition":"A contractor hired by a general contractor employed by the contractor rather than directly hired by the customer."}],"partOfSpeech":"n"}]},{"word":"EVANGELISM","idx":22151,"count":1340905,"meanings":[{"definitions":[{"definition":"Sharing news of something in order to convince someone to join or otherwise accept it."},{"definition":"The process of evangelizing."}],"partOfSpeech":"n"}]},{"word":"DENOMINATION","idx":22153,"count":1340584,"meanings":[{"definitions":[{"definition":"The act of naming or designating."},{"definition":"That by which anything is denominated or styled; an epithet; a name, designation, or title; especially, a general name indicating a class of like individuals"},{"definition":"A class, or society of individuals, called by the same name; a sect or religious subgroup.","example":"She follows the Ahmadiyya denomination of Islam."},{"definition":"A unit in a series of units of weight, money, etc.","example":"What denomination is that money? They are all 50 euro notes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˌnɒmɪˈneɪʃən/"}]},{"word":"ABORTIONS","idx":22154,"count":1340486,"meanings":[{"definitions":[{"definition":"The expulsion from the womb of a foetus or embryo before it is fully developed, with loss of the foetus; either naturally as a spontaneous abortion (now usually called a miscarriage), or deliberately as an induced abortion."},{"definition":"An aborted foetus; an abortus."},{"definition":"A misshapen person or thing; a monstrosity."},{"definition":"Failure or abandonment of a project, promise, goal etc."},{"definition":"Arrest of development of any organ, so that it remains an imperfect formation or is absorbed."},{"definition":"The cessation of an illness or disease at a very early stage."}],"partOfSpeech":"n"}]},{"word":"PATCHED","idx":22155,"count":1340483,"meanings":[{"definitions":[{"definition":"To mend by sewing on a piece or pieces of cloth, leather, or the like","example":"My coat needs patching."},{"definition":"To mend with pieces; to repair by fastening pieces on."},{"definition":"To make out of pieces or patches, like a quilt."},{"definition":"To join or unite the pieces of; to patch the skirt."},{"definition":"To employ a temporary, removable electronic connection, as one between two components in a communications system."},{"definition":"(generally with the particle \"up\") To repair or arrange in a hasty or clumsy manner","example":"The truce between the two countries has been patched up."},{"definition":"To make the changes a patch describes; to apply a patch to the files in question. Hence:"},{"definition":"To connect two pieces of electrical equipment using a cable.","example":"I'll need to patch the preamp output to the mixer."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been repaired with a patch or patches."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pætʃt/"}]},{"word":"PATRIOTISM","idx":22156,"count":1340427,"meanings":[{"definitions":[{"definition":"Love of one's country; devotion to the welfare of one's compatriots; passion which inspires one to serve one's country."},{"definition":"The actions of a patriot"},{"definition":"The desire to compete with other nations; nationalism."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"patriotism-us","text":"/ˈpeɪtɹi.əˌtɪzəm/"}]},{"word":"BATTLING","idx":22157,"count":1340424,"meanings":[{"definitions":[{"definition":"A growing fat, or the process of causing to grow fat; a fattening."},{"definition":"That which nourishes or fattens, as food, or feed for animals, or manure for soil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Nourishing; fattening."},{"definition":"Fertile."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To join in battle; to contend in fight","example":"Scientists always battle over theories."},{"definition":"To fight or struggle; to enter into a battle with.","example":"She has been battling cancer for years."},{"definition":"To nourish; feed."},{"definition":"To render (for example soil) fertile or fruitful"}],"partOfSpeech":"ve"}]},{"word":"LESION","idx":22158,"count":1340294,"meanings":[{"definitions":[{"definition":"A wound or injury."},{"definition":"An infected or otherwise injured or diseased organ or part, especially such on a patch of skin."},{"definition":"Any compound formed from damage to a nucleic acid."},{"definition":"Injury or an unfair imbalance in a commutative contract wherein the consideration is less than half of the market value, which then serves as a basis for the injured party to sue to rescind the agreement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wound or injure, especially in an experiment or other controlled procedure."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈliːʒən/"}]},{"word":"TICKLE","idx":22159,"count":1340122,"meanings":[{"definitions":[{"definition":"The act of tickling."},{"definition":"An itchy feeling resembling the result of tickling.","example":"I have a persistent tickle in my throat."},{"definition":"A light tap of the ball."},{"definition":"A narrow strait."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To touch repeatedly or stroke delicately in a manner which causes laughter, pleasure and twitching.","example":"He tickled Nancy's tummy, and she started to giggle."},{"definition":"To unexpectedly touch or stroke delicately in a manner which causes displeasure or withdrawal.","example":"A stranger tickled Nancy's tummy, causing her to scream in fear."},{"definition":"(of a body part) To feel as if the body part in question is being tickled.","example":"My nose tickles, and I'm going to sneeze!"},{"definition":"To appeal to someone's taste, curiosity etc."},{"definition":"To cause delight or amusement in.","example":"He was tickled to receive such a wonderful gift."},{"definition":"To feel titillation."},{"definition":"To catch fish in the hand (usually in rivers or smaller streams) by manually stimulating the fins."},{"definition":"To be excited or heartened."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Changeable, capricious; insecure."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tickle-us","text":"/ˈtɪkl̩/"}]},{"word":"BANDIT","idx":22160,"count":1339877,"meanings":[{"definitions":[{"definition":"One who robs others in a lawless area, especially as part of a group."},{"definition":"An outlaw."},{"definition":"One who cheats others."},{"definition":"An enemy aircraft."},{"definition":"A runner who covertly joins a race without having registered as a participant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rob, or steal from, in the manner of a bandit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bandit-au","text":"/ˈbændɪt/"}]},{"word":"PROGESTERONE","idx":22162,"count":1339832,"meanings":[{"definitions":[{"definition":"A steroid hormone, secreted by the ovaries, whose function is to prepare the uterus for the implantation of a fertilized ovum and to maintain pregnancy."},{"definition":"(steroid drug) A synthetic version of the compound, used in contraceptive pills and other pharmaceutical products."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɹoʊˈdʒɛstəˌɹoʊn/"},{"text":"/pɹəˈdʒɛstəɹəʊn/"}]},{"word":"ACQUAINTANCE","idx":22163,"count":1339448,"meanings":[{"definitions":[{"definition":"A state of being acquainted with a person; originally indicating friendship, intimacy, but now suggesting a slight knowledge less deep than that of friendship; acquaintanceship.","example":"I know of the man; but have no acquaintance with him."},{"definition":"A person or persons with whom one is acquainted."},{"definition":"Such people collectively; one's circle of acquaintances (with plural concord)."},{"definition":"Personal knowledge (with a specific subject etc.)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"acquaintance-us","text":"/ʌˈkweɪn.təns/"}]},{"word":"ETHYL","idx":22164,"count":1339385,"meanings":[{"definitions":[{"definition":"The univalent hydrocarbon radical, C2H5, formally derived from ethane by the loss of a hydrogen atom."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ethyl-ca","text":"/ˈɛθəl/"}]},{"word":"LAMBS","idx":22165,"count":1339048,"meanings":[{"definitions":[{"definition":"A young sheep."},{"definition":"The flesh of a lamb or sheep used as food."},{"definition":"A person who is meek, docile and easily led."},{"definition":"A simple, unsophisticated person."},{"definition":"One who ignorantly speculates on the stock exchange and is victimized."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a sheep, to give birth."},{"definition":"To assist (sheep) to give birth.","example":"The shepherd was up all night, lambing her young ewes."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/læmz/"}]},{"word":"CARAMEL","idx":22167,"count":1339028,"meanings":[{"definitions":[{"definition":"A smooth, chewy, sticky confection made by heating sugar and other ingredients until the sugars polymerize and become sticky."},{"definition":"A (sometimes hardened) piece of this confection."},{"definition":"A yellow-brown color, like that of caramel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To caramelize."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a yellow-brown color."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"caramel-us","text":"/ˈkæ.ɹə.məl/"}]},{"word":"IMMUNODEFICIENCY","idx":22168,"count":1339002,"meanings":[{"definitions":[{"definition":"A depletion in the body's natural immune system, or in some component of it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪˌmjuːnəʊdɪˈfɪʃənsi/"}]},{"word":"CAPITALIZED","idx":22171,"count":1338350,"meanings":[{"definitions":[{"definition":"In writing or editing, to write (something: either an entire word or text, or just the initial letter(s) thereof) in capital letters, in upper case.","example":"In German, all nouns are capitalized."},{"definition":"To contribute or acquire capital (money or other resources) for.","example":"Some states require proof that a new venture is properly capitalized before the state will issue a certificate of incorporation."},{"definition":"To convert into capital, i.e., to get cash or similar immediately fungible resources for some less fungible property or source of future income.","example":"If we obtain a loan using the business as collateral, the effect will be to capitalize our next ten years of income, giving us cash today that we can use to buy out our competitor."},{"definition":"To treat as capital, not as an expense."},{"definition":"To profit or to obtain an advantage.","example":"The home team took several shots on goal but was unable to capitalize until late in the game."},{"definition":"(followed by on) To seize, as an opportunity; to obtain a benefit; to invest on something profitable.","example":"The home team appeared to have the advantage throughout the game, and finally capitalized on their opponents' weakness with just two minutes remaining, scoring several points in quick succession."}],"partOfSpeech":"ve"}]},{"word":"PANCREAS","idx":22174,"count":1337924,"meanings":[{"definitions":[{"definition":"A gland near the stomach which secretes a fluid into the duodenum to help with food digestion. The fluid contains protease, carbohydrase and lipase, which breaks down larger molecules into smaller pieces. The pancreas also produces the hormones insulin and glucagon which regulate blood sugar. These hormones are released into the cardiovascular system."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpæŋkɹɪəs/"}]},{"word":"LOOM","idx":22175,"count":1337864,"meanings":[{"definitions":[{"definition":"A utensil; tool; a weapon; (usually in compound) an article in general."},{"definition":"A frame or machine of wood or other material, in which a weaver forms cloth out of thread; a machine for interweaving yarn or threads into a fabric, as in knitting or lace making."},{"definition":"The part of an oar which is between the grip or handle and the blade, the shaft."},{"definition":"Loon (bird of order Gaviiformes)"},{"definition":"A distorted appearance of something as seen indistinctly or from afar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To appear indistinctly, eg. when seen on the horizon or through the murk.","example":"The clouds loomed over the mountains."},{"definition":"To appear in an exaggerated or threatening form; to be imminent."},{"definition":"To rise and to be eminent; to be elevated or ennobled, in a moral sense."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"loom-us","text":"/lum/"}]},{"word":"BLOUSE","idx":22176,"count":1337862,"meanings":[{"definitions":[{"definition":"A shirt, typically loose and reaching from the neck to the waist."},{"definition":"A shirt for women, particularly a shirt with buttons; a dress shirt tailored for women."},{"definition":"A loose-fitting uniform jacket."},{"definition":"A prostitute."},{"definition":"A prostitute; a courtesan."},{"definition":"A ruddy, fat-faced woman; a wench."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hang a garment in loose folds."},{"definition":"To tuck one's pants/trousers (into one's boots)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/blaʊs/"}]},{"word":"OCTOPUS","idx":22177,"count":1337780,"meanings":[{"definitions":[{"definition":"Any of several marine molluscs of the family Octopodidae, having no internal or external protective shell or bone (unlike the nautilus, squid and cuttlefish) and eight arms each covered with suckers."},{"definition":"The flesh of these marine molluscs eaten as food."},{"definition":"An organization that has many powerful branches controlled from the centre."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put (or attempt to put) one's fingers, hands or arms in many things or places at roughly the same time."},{"definition":"To spread out in long arms or legs in many directions."},{"definition":"To plug a large number of devices into a single electric outlet."},{"definition":"(by extension) To grow in use vastly beyond what was originally intended."},{"definition":"To hunt and catch octopuses."},{"definition":"To behave like an octopus."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"octopus-us","text":"/ˈɑːk.tə.pəs/"}]},{"word":"ARA","idx":22180,"count":1337611,"meanings":[{"definitions":[{"definition":"The great blue and yellow macaw (Ara ararauna)."},{"definition":"A traditional alcoholic beverage consumed in Bhutan, made from rice, maize, millet, or wheat, either fermented or distilled. The beverage is usually a clear, creamy, or white color."},{"definition":"Saw-edged perch, Niphon spinosus"}],"partOfSpeech":"n"}]},{"word":"RECEPTIONIST","idx":22181,"count":1337492,"meanings":[{"definitions":[{"definition":"An employee (such as a secretary) who works in reception (receiving visitors and/or calls) for a person or business, especially an office."},{"definition":"A proponent of receptionism."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪˈsɛpʃənɪst/"}]},{"word":"HEIGHTENED","idx":22182,"count":1337473,"meanings":[{"definitions":[{"definition":"To make high; to raise higher; to elevate."},{"definition":"To advance, increase, augment, make larger, more intense, stronger etc.","example":"to heighten a flavor or a tint"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Increased in intensity or concentration; elevated, stepped-up"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"heightened-uk"}]},{"word":"CHESTS","idx":22183,"count":1337446,"meanings":[{"definitions":[{"definition":"A box, now usually a large strong box with a secure convex lid.","example":"The clothes are kept in a chest."},{"definition":"A coffin."},{"definition":"The place in which public money is kept; a treasury.","example":"You can take the money from the chest."},{"definition":"A chest of drawers."},{"definition":"The portion of the front of the human body from the base of the neck to the top of the abdomen; the thorax. Also the analogous area in other animals.","example":"She had a sudden pain in her chest."},{"definition":"A hit or blow made with one's chest.","example":"He scored with a chest into the goal."},{"definition":"Debate; quarrel; strife; enmity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit with one's chest (front of one's body)"},{"definition":"To deposit in a chest."},{"definition":"To place in a coffin."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tʃɛsts/"}]},{"word":"AMBITIONS","idx":22185,"count":1337349,"meanings":[{"definitions":[{"definition":"Eager or inordinate desire for some object that confers distinction, as preferment, honor, superiority, political power, or literary fame; desire to distinguish one's self from other people.","example":"My son, John, wants to be a firefighter very much. He has a lot of ambition."},{"definition":"An object of an ardent desire.","example":"My ambition is to own a helicopter."},{"definition":"A desire, as in (sense 1), for another person to achieve these things."},{"definition":"A personal quality similar to motivation, not necessarily tied to a single goal."},{"definition":"The act of going about to solicit or obtain an office, or any other object of desire; canvassing."}],"partOfSpeech":"n"}]},{"word":"FELINE","idx":22187,"count":1337137,"meanings":[{"definitions":[{"definition":"Of or pertaining to cats."},{"definition":"Catlike (resembling a cat)"}],"partOfSpeech":"j"},{"definitions":[{"definition":"A cat; member of the cat family Felidae."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"feline-uk","text":"/ˈfiːlaɪn/"}]},{"word":"ZOMBIES","idx":22188,"count":1337112,"meanings":[{"definitions":[{"definition":"A snake god or fetish in religions of West Africa and elsewhere."},{"definition":"(voodoo, superstition) A person, usually undead, animated by unnatural forces (such as magic), with no soul or will of his/her own."},{"definition":"A deceased person who becomes reanimate to attack the living."},{"definition":"An apathetic person."},{"definition":"A human being in a state of extreme mental exhaustion.","example":"After working for 18 hours on the computer, I was a zombie."},{"definition":"An information worker who has signed a nondisclosure agreement."},{"definition":"A process or task which has terminated but has not been removed from the list of processes, typically because it has an unresponsive parent process."},{"definition":"A computer affected by malware which causes it to do whatever the attacker wants it to do without the user's knowledge."},{"definition":"A cocktail of rum and fruit juices."},{"definition":"A conscripted member of the Canadian military during World War II who was assigned to home defence rather than to combat in Europe."},{"definition":"Marijuana, or similar drugs."},{"definition":"A hypothetical being that is indistinguishable from a normal human being except in that it lacks conscious experience, qualia, or sentience."}],"partOfSpeech":"n"}]},{"word":"GRUB","idx":22189,"count":1337005,"meanings":[{"definitions":[{"definition":"An immature stage in the life cycle of an insect; a larva."},{"definition":"Food."},{"definition":"A short, thick man; a dwarf."},{"definition":"A dirty person."},{"definition":"A despicable person; a lowlife."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To scavenge or in some way scrounge, typically for food."},{"definition":"To dig; to dig up by the roots; to root out by digging; often followed by up.","example":"to grub up trees, rushes, or sedge"},{"definition":"To supply with food."},{"definition":"To eat."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"grub-us","text":"/ɡɹʌb/"},{"audio":"grub-au","text":"/ɡɹʌb/"}]},{"word":"ULCER","idx":22190,"count":1336605,"meanings":[{"definitions":[{"definition":"An open sore of the skin, eyes or mucous membrane, often caused by an initial abrasion and generally maintained by an inflammation and/or an infection."},{"definition":"Peptic ulcer"},{"definition":"Anything that festers and corrupts like an open sore; a vice in character."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ʌlsɚ/"},{"text":"/ʌlsə/"}]},{"word":"INTERAGENCY","idx":22192,"count":1336501,"meanings":[{"definitions":[{"definition":"Intermediate agency"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Between or among agencies."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪntəˈɹeɪd͡ʒənsi/"}]},{"word":"SLEW","idx":22193,"count":1336497,"meanings":[{"definitions":[{"definition":"The act, or process of slewing."},{"definition":"A device used for slewing."},{"definition":"A change of position."},{"definition":"A wet place; a river inlet."},{"definition":"A large amount.","example":"She has a slew of papers and notebooks strewn all over her desk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rotate or turn something about its axis."},{"definition":"To veer a vehicle."},{"definition":"To insert extra ticks or skip some ticks of a clock to slowly correct its time."},{"definition":"To pivot."},{"definition":"To skid."},{"definition":"To move something (usually a railway line) sideways","example":"The single line was slewed onto the disused up formation to make way for the future redoubling."},{"definition":"To make a public mockery of someone through insult or wit."},{"definition":"To kill, murder.","example":"Our foes must all be slain."},{"definition":"To eradicate or stamp out.","example":"You must slay these thoughts."},{"definition":"(by extension) To defeat, overcome (in a competition or contest).","example":"1956, “Giants Slay Bears in Pro Title Battle”, in Lodi News-Sentinel, 1956 December 31, page 8."},{"definition":"To delight or overwhelm, especially with laughter.","example":"Ha ha! You slay me!"},{"definition":"To amaze, stun or otherwise incapacitate by awesomeness; to be awesome at something; to kill (slang sense)."},{"definition":"To have sex with"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slew-au","text":"/sluː/"}]},{"word":"SYNCHRONIZE","idx":22195,"count":1336374,"meanings":[{"definitions":[{"definition":"To cause two or more events or actions to happen at exactly the same time or same rate, or in a time-coordinated way."},{"definition":"To set (a clock or watch) to display the same time as another.","example":"We synchronized our watches and agreed to meet at four o'clock precisely."},{"definition":"To cause (a set of files, data, or settings) on one computer or device to be (and try to remain) the same as on another."},{"definition":"(of inanimate entities) To agree, be coordinated with, or complement well."},{"definition":"To coordinate or combine."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"synchronize-us"},{"text":"/ˈsɪŋ.kɹə.naɪz/"},{"text":"/ˈsɪŋ.kɹə.naɪːz/"},{"audio":"synchronize-au"}]},{"word":"TITTIES","idx":22198,"count":1336162,"meanings":[{"definitions":[{"definition":"A breast"},{"definition":"A nipple"},{"definition":"A kitten"},{"definition":"A sister or girl"}],"partOfSpeech":"n"}]},{"word":"HORNETS","idx":22200,"count":1336044,"meanings":[{"definitions":[{"definition":"A large wasp, of the genus Vespa, having a brown-and-yellow-striped body and the ability to inflict a serious sting."},{"definition":"A person who pesters with petty but ceaseless attacks."}],"partOfSpeech":"n"}]},{"word":"CROSSFIRE","idx":22201,"count":1335814,"meanings":[{"definitions":[{"definition":"Lines of fire from multiple positions that cross in a small region"},{"definition":"(by extension) A heated confrontation between opposing factions."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹɔːsfaɪɹ/"},{"text":"/ˈkɹɒsfaɪə/"}]},{"word":"MENSTRUAL","idx":22202,"count":1335681,"meanings":[{"definitions":[{"definition":"Of or relating to the menses."},{"definition":"Occurring once a month; monthly."},{"definition":"Lasting for a month.","example":"a menstrual flower"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"menstrual-us","text":"/ˈmɛn.stɹu.əl/"}]},{"word":"CANALS","idx":22203,"count":1335666,"meanings":[{"definitions":[{"definition":"An artificial waterway or artificially improved river used for travel, shipping, or irrigation."},{"definition":"A tubular channel within the body."},{"definition":"One of the faint, hazy markings resembling straight lines on early telescopic images of the surface of Mars."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dig an artificial waterway in or to (a place), especially for drainage"},{"definition":"To travel along a canal by boat"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"canals-us"}]},{"word":"NEGATIVES","idx":22204,"count":1335659,"meanings":[{"definitions":[{"definition":"Refusal or withholding of assents; prohibition, veto"},{"definition":"A right of veto."},{"definition":"An image in which dark areas represent light ones, and the converse."},{"definition":"(grammar) A word that indicates negation."},{"definition":"A negative quantity."},{"definition":": A rep performed with weight in which the muscle begins at maximum contraction and is slowly extended; a movement performed using only the eccentric phase of muscle movement."},{"definition":"The negative plate of a voltaic or electrolytic cell."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To refuse; to veto."},{"definition":"To contradict."},{"definition":"To disprove."},{"definition":"To make ineffective; to neutralize."}],"partOfSpeech":"ve"}]},{"word":"THREADING","idx":22206,"count":1335630,"meanings":[{"definitions":[{"definition":"To put thread through.","example":"thread a needle"},{"definition":"To pass (through a narrow constriction or around a series of obstacles).","example":"I think I can thread my way through here, but it’s going to be tight."},{"definition":"To screw on, to fit the threads of a nut on a bolt"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process by which something is threaded (in various senses)."},{"definition":"An ancient Eastern method for removing hair by means of a thread, which is rolled over the hair in order to pluck it out at the follicle level."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈθɹɛdɪŋ/"}]},{"word":"DUET","idx":22207,"count":1335288,"meanings":[{"definitions":[{"definition":"A musical composition in two parts, each performed by a single voice (singer, instrument or univoce ensemble)."},{"definition":"A song composed for and/or performed by a duo."},{"definition":"A pair or couple, especially one that is harmonious or elegant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform a duet."},{"definition":"(of pairs of animals) To communicate (warnings, mating calls, etc.) through song."},{"definition":"To perform (sing, play, etc.) as a duet."},{"definition":"(of two people) To say at the same time, to chorus."}],"partOfSpeech":"ve"}]},{"word":"INTOLERANCE","idx":22208,"count":1335075,"meanings":[{"definitions":[{"definition":"The state of being intolerant.","example":"Intolerance as a state policy must not be tolerated."},{"definition":"An intolerant word or action."},{"definition":"Extreme sensitivity to a food or drug; allergy."}],"partOfSpeech":"n"}]},{"word":"AMMONIUM","idx":22209,"count":1334961,"meanings":[{"definitions":[{"definition":"The univalent NH4+ cation, derived by the protonation of ammonia"},{"definition":"(especially in combination) Any similar cation formed by replacing one or more hydrogen atoms with alkyl or aryl radicals"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈmoʊni.əm/"}]},{"word":"SPANDEX","idx":22210,"count":1334917,"meanings":[{"definitions":[{"definition":"A synthetic fibre known for its exceptional elasticity."},{"definition":"Clothing made from such material."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈspændɛks/"}]},{"word":"ZEPHYR","idx":22211,"count":1334891,"meanings":[{"definitions":[{"definition":"A light wind from the west."},{"definition":"Any light refreshing wind; a gentle breeze."},{"definition":"Anything of fine, soft, or light quality, especially fabric."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To blow or move like a zephyr, or light breeze."},{"definition":"To blow or blow on gently like a zephyr; to cool or refresh with a gentle breeze."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"zephyr-us","text":"/zɛfɚ/"}]},{"word":"TEARING","idx":22216,"count":1334273,"meanings":[{"definitions":[{"definition":"To rend (a solid material) by holding or restraining in two places and pulling apart, whether intentionally or not; to destroy or separate.","example":"He tore his coat on the nail."},{"definition":"To injure as if by pulling apart.","example":"He has a torn ligament."},{"definition":"To destroy or reduce abstract unity or coherence, such as social, political or emotional.","example":"He was torn by conflicting emotions."},{"definition":"To make (an opening) with force or energy.","example":"A piece of debris tore a tiny straight channel through the satellite."},{"definition":"(often with off or out) To remove by tearing.","example":"Tear the coupon out of the newspaper."},{"definition":"(of structures, with down) To demolish","example":"The slums were torn down to make way for the new development."},{"definition":"To become torn, especially accidentally.","example":"My dress has torn."},{"definition":"To move or act with great speed, energy, or violence.","example":"He tore into the backlog of complaints."},{"definition":"To smash or enter something with great force.","example":"The chain shot tore into the approaching line of infantry."},{"definition":"To produce tears.","example":"Her eyes began to tear in the harsh wind."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is torn; a laceration."},{"definition":"Distortion of an animated display when the contents of the framebuffer are rendered while it contains portions of two or more frames."},{"definition":"Continuous shedding of tears; epiphora"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Enormous; of great size or impact","example":"a tearing great giant of a man"},{"definition":"Very hasty","example":"a tearing hurry"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tearing-1-us","text":"[ˈtɛə.ɹɪŋ]"}]},{"word":"MUFFINS","idx":22218,"count":1333924,"meanings":[{"definitions":[{"definition":"A type of flattish bun, usually cut in two horizontally, toasted and spread with butter, etc, before being eaten."},{"definition":"A type of individual bread such as corn, bran, banana or zucchini bread often sliced and spread with butter, etc before being eaten."},{"definition":"(especially US) (informally) A cupcake without frosting, but sometimes glazed."},{"definition":"A mechanism used in the Java Network Launching Protocol analogous to the cookie mechanism and which permits a program running in a browser to perform operations on a client machine."},{"definition":"Term of endearment.","example":"I love you, muffin!"},{"definition":"(sexual slang) A vulva."},{"definition":"A less talented player; one who muffs, or drops the ball."},{"definition":"A charming, attractive young man."},{"definition":"A small plate, smaller than a twiffler."}],"partOfSpeech":"n"}]},{"word":"HANDYMAN","idx":22223,"count":1333399,"meanings":[{"definitions":[{"definition":"A man who does small tasks and odd jobs"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"handyman-us","text":"/ˈhændimæn/"}]},{"word":"FOOTHILLS","idx":22225,"count":1333322,"meanings":[{"definitions":[{"definition":"A hill at the base of a mountain or mountain range."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfʊt.hɪlz/"}]},{"word":"ETHIC","idx":22226,"count":1333320,"meanings":[{"definitions":[{"definition":"A set of principles of right and wrong behaviour guiding, or representative of, a specific culture, society, group, or individual.","example":"I think the golden rule is a great ethic."},{"definition":"The morality of an action."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Moral, relating to morals."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɛθɪk/"}]},{"word":"TAXON","idx":22228,"count":1333053,"meanings":[{"definitions":[{"definition":"A group of one or more populations of an organism or organisms seen by taxonomists to form a unit."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"taxon-uk","text":"/ˈtæksɒn/"}]},{"word":"INDEFINITE","idx":22230,"count":1332966,"meanings":[{"definitions":[{"definition":"(grammar) A word or phrase that designates an unspecified or unidentified person or thing or group of persons or things."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Without limit; forever, or until further notice; not definite."},{"definition":"Vague or unclear."},{"definition":"Undecided or uncertain."},{"definition":"Being an integral without specified limits."},{"definition":"Designating an unspecified or unidentified person or thing or group of persons or things","example":"the indefinite article"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈdɛfɪnɪt/"}]},{"word":"COUGARS","idx":22232,"count":1332775,"meanings":[{"definitions":[{"definition":"A mountain lion; Puma concolor."},{"definition":"An older woman who actively seeks the casual, often sexual, companionship of younger men, by implication a female “sexual predator”.","example":"A cougar approached Warren at the Palomino Club and asked for a dance."}],"partOfSpeech":"n"}]},{"word":"ATRIUM","idx":22233,"count":1332575,"meanings":[{"definitions":[{"definition":"A central room or space in ancient Roman homes, open to the sky in the middle; a similar space in other buildings."},{"definition":"A square hall lit by daylight from above, into which rooms open at one or more levels."},{"definition":"A cavity, entrance, or passage."},{"definition":"Any enclosed sexine and nexine layers, widening toward the interior of the grain."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈeɪ.tɹi.əm/"}]},{"word":"THINE","idx":22234,"count":1332569,"meanings":[{"definitions":[{"definition":"Singular second person possessive pronoun; yours"}],"partOfSpeech":"p"}],"phonetics":[{"audio":"thine-us"},{"text":"/ðaɪn/"}]},{"word":"SUPERIORITY","idx":22235,"count":1332318,"meanings":[{"definitions":[{"definition":"The state of being superior.","example":"Many US colleges want to achieve superiority in the sport of football."},{"definition":"The right which the superior enjoys in the land held by the vassal."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"superiority-us"},{"text":"/ˈsʊu.pɪə(ɹ)ˌi.ɒ.ɹɪ.ti/"}]},{"word":"GESTURES","idx":22236,"count":1332261,"meanings":[{"definitions":[{"definition":"A motion of the limbs or body, especially one made to emphasize speech.","example":"The middle-finger gesture is really a nonverbal swear."},{"definition":"An act or a remark made as a formality or as a sign of attitude.","example":"We took flowers as a gesture of sympathy."},{"definition":"The manner of carrying the body; position of the body or limbs; posture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a gesture or gestures.","example":"My dad said to never gesture with my hands when I talk."},{"definition":"To express something by a gesture or gestures.","example":"He gestured his disgust."},{"definition":"To accompany or illustrate with gesture or action."}],"partOfSpeech":"ve"}]},{"word":"AMBIENCE","idx":22238,"count":1332141,"meanings":[{"definitions":[{"definition":"A particular mood or atmosphere of an environment or surrounding influence."},{"definition":"(3D models) A secondary color of a polygon that becomes more pronounced with shading."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæm.bi.əns/"}]},{"word":"GENET","idx":22239,"count":1332113,"meanings":[{"definitions":[{"definition":"Any of several Old World nocturnal, carnivorous mammals, of the genus Genetta in the family Viverridae, most of which have a spotted coat and a long, ringed tail."},{"definition":"The fur of this mammal, or any skin dressed in imitation of it."},{"definition":"A group of genetically identical individuals (plants, fungi, bacteria etc.) that have grown in a given location, all originating from asexual reproduction of a single ancestor; a group of ramets."},{"definition":"A small-sized, well-proportioned, Spanish horse; a jennet."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"genet-us","text":"/ˈdʒɛn.ɪt/"}]},{"word":"NEMESIS","idx":22240,"count":1332098,"meanings":[{"definitions":[{"definition":"An archenemy","example":"Batman is in constant conflict with his nemesis, The Joker."},{"definition":"(chiefly non-North American usage) A person or character who specifically brings about the downfall of another person or character."},{"definition":"The principle of retributive justice."},{"definition":"(usually in the singular) A punishment or defeat that is deserved and cannot be avoided."},{"definition":"The polar opposite of a character."},{"definition":"A righteous infliction of retribution manifested by an appropriate agent."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnɛməsɪs/"}]},{"word":"CONFESSIONAL","idx":22242,"count":1332052,"meanings":[{"definitions":[{"definition":"In the manner or style of a confession."},{"definition":"Officially practicing a particular religion, as a state or organization. See confessionalism 1."}],"partOfSpeech":"j"},{"definitions":[{"definition":"(Roman Catholic church) A small room where confession—the sacrament of reconciliation—is performed by a priest."},{"definition":"A confession."}],"partOfSpeech":"n"}]},{"word":"CARDIGAN","idx":22244,"count":1332008,"meanings":[{"definitions":[{"definition":"A type of sweater or jumper that fastens up the front with buttons or a zipper, usually machine- or hand-knitted from wool."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɑːdɪɡən/"}]},{"word":"NEURONAL","idx":22247,"count":1331665,"meanings":[{"definitions":[{"definition":"Of, or relating to a neuron"}],"partOfSpeech":"j"}]},{"word":"EVAPORATION","idx":22249,"count":1331645,"meanings":[{"definitions":[{"definition":"The process of a liquid converting to the gaseous state."},{"definition":"The process in which all or a portion of liquid (in a container) is turned into vapour, in order to increase the concentration of solid matter in the mixture."},{"definition":"That which is evaporated; vapor."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"evaporation-us"}]},{"word":"DEVISE","idx":22250,"count":1331534,"meanings":[{"definitions":[{"definition":"The act of leaving real property in a will."},{"definition":"Such a will, or a clause in such a will."},{"definition":"The real property left in such a will."},{"definition":"Design, devising."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use one's intellect to plan or design (something).","example":"to devise an argument; to devise a machine, or a new system of writing"},{"definition":"To leave (property) in a will."},{"definition":"To form a scheme; to lay a plan; to contrive; to consider."},{"definition":"To plan or scheme for; to plot to obtain."},{"definition":"To imagine; to guess."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"devise-us","text":"/dɪˈvaɪz/"}]},{"word":"ABOLISHED","idx":22252,"count":1331439,"meanings":[{"definitions":[{"definition":"To end a law, system, institution, custom or practice.","example":"Slavery was abolished in the nineteenth century."},{"definition":"To put an end to or destroy, as a physical object; to wipe out."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈbɑlɪʃt/"},{"text":"/əˈbɒlɪʃt/"}]},{"word":"CHECKERS","idx":22255,"count":1331147,"meanings":[{"definitions":[{"definition":"One who checks or verifies something."},{"definition":"One who makes a check mark."},{"definition":"The clerk who tallies cost of purchases and accepts payment.","example":"There was a long line at the grocery store because the checker was so slow."},{"definition":"One who hinders or stops something."},{"definition":"A playing piece in the game of checkers (British: draughts)."},{"definition":"A pattern of alternating colours as on a chessboard."},{"definition":"The fruit of the wild service tree or chequer tree, Photinia villosa, syn. Sorbus terminalis"},{"definition":"(in the singular) A game for two players played on a chessboard; the players have 12 pieces each, and the object is to capture all the opponent’s pieces by jumping over them. Other European varieties have larger boards and more playing pieces."},{"definition":"(in the plural) the playing pieces in the game of checkers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark in a pattern of alternating light and dark positions, like a checkerboard."},{"definition":"To develop markings in a pattern of alternating light and dark positions, like a checkerboard."}],"partOfSpeech":"ve"}]},{"word":"TOYING","idx":22258,"count":1331063,"meanings":[{"definitions":[{"definition":"To play (with) in an idle or desultory way.","example":"Figo is toying with the English defence."},{"definition":"To ponder or consider.","example":"I have been toying with the idea of starting my own business."},{"definition":"To stimulate with a sex toy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who toys."}],"partOfSpeech":"n"}]},{"word":"SPOKESWOMAN","idx":22261,"count":1330418,"meanings":[{"definitions":[{"definition":"A woman who speaks as the voice of a group of people."}],"partOfSpeech":"n"}]},{"word":"BACCALAUREATE","idx":22262,"count":1330383,"meanings":[{"definitions":[{"definition":"A bachelor's degree."},{"definition":"A high school completion exam and qualification awarded in many countries (e.g. Finland, France, Moldova, Romania), designed to enable students to go on to higher education."},{"definition":"A farewell address in the form of a sermon delivered to a graduating class."},{"definition":"The International Baccalaureate."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bækəˈlɔːɹɪət/"}]},{"word":"TRIPODS","idx":22263,"count":1330358,"meanings":[{"definitions":[{"definition":"A three-legged stand or mount.","example":"Recent cell phones offer tripod attachments to take steady photographs."},{"definition":"A man with macrophallism."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enter the tripod position showing signs of exhaustion or distress.","example":"I tripodded after my 6-mile run."}],"partOfSpeech":"ve"}]},{"word":"WREATH","idx":22264,"count":1330354,"meanings":[{"definitions":[{"definition":"Something twisted, intertwined, or curled.","example":"a wreath of smoke;  a wreath of clouds"},{"definition":"An ornamental circular band made, for example, of plaited flowers and leaves, and used as decoration; a garland or chaplet, especially one given to a victor."},{"definition":"An appendage to the shield, placed above it, and supporting the crest; an orle, a torse. It generally represents a twist of two cords of silk, one tinctured like the principal metal, the other like the principal color in the coat of arms."},{"definition":"A defect in glass."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place an entwined circle of flowers upon or around something."},{"definition":"To wrap around something in a circle.","example":"At the funeral, a circle of comrades wreathed the grave of the honored deceased."},{"definition":"To curl, writhe or spiral in the form of a wreath."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wreath-us","text":"/ɹiːθ/"}]},{"word":"PLIGHT","idx":22265,"count":1330333,"meanings":[{"definitions":[{"definition":"A dire or unfortunate situation."},{"definition":"A (neutral) condition or state."},{"definition":"Good health."},{"definition":"Responsibility for ensuing consequences; risk; danger; peril."},{"definition":"An instance of danger or peril; a dangerous moment or situation."},{"definition":"Blame; culpability; fault; wrong-doing; sin; crime."},{"definition":"One's office; duty; charge."},{"definition":"That which is exposed to risk; that which is plighted or pledged; security; a gage; a pledge."},{"definition":"A network; a plait; a fold; rarely a garment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To expose to risk; to pledge."},{"definition":"Specifically, to pledge (one's troth etc.) as part of a marriage ceremony."},{"definition":"To promise (oneself) to someone, or to do something."},{"definition":"To weave; to braid; to fold; to plait."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plight-us","text":"/plaɪt/"}]},{"word":"OPIUM","idx":22266,"count":1330299,"meanings":[{"definitions":[{"definition":"A yellow-brown, addictive narcotic drug obtained from the dried juice of unripe pods of the opium poppy, Papaver somniferum, and containing alkaloids such as morphine, codeine, and papaverine."},{"definition":"Anything that numbs or stupefies."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈoʊpi.əm/"},{"text":"/ˈəʊpi.əm/"}]},{"word":"LOGISTIC","idx":22267,"count":1330254,"meanings":[{"definitions":[{"definition":"A logistic function or graph of a logistic curve."},{"definition":"The art of calculation."},{"definition":"Sexagesimal arithmetic."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to symbolic logic."},{"definition":"Relating to the logistic function."},{"definition":"Using sexagesimal fractions, especially in arithmetic or logarithms."},{"definition":"Relating to basic arithmetic."},{"definition":"Skilled in calculating."},{"definition":"Proportional."},{"definition":"(operations) Relating to logistics."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/loʊˈdʒɪs.tɪk/"},{"text":"/lɒdʒˈɪs.tɪk/"}]},{"word":"PERSONALIZATION","idx":22269,"count":1330092,"meanings":[{"definitions":[{"definition":"The act of personalizing something, or adapting it for somebody's needs or tastes."},{"definition":"The act of personifying; personification."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-lɪˈzeɪʃən/"},{"text":"/ˌpɜːs(ə)nəlaɪˈzeɪʃən/"}]},{"word":"ENEMA","idx":22270,"count":1329511,"meanings":[{"definitions":[{"definition":"An injection of fluid into the large intestine by way of the rectum, usually for medical purposes."},{"definition":"The fluid so injected."},{"definition":"A device for administering such an injection."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛn.ə.mə/"}]},{"word":"EASEMENT","idx":22271,"count":1329506,"meanings":[{"definitions":[{"definition":"The legal right to use another person's real property (real estate), generally in order to cross a part of the property or to gain access to something on the property (right of way).","example":"The power company has an easement to put their electricity poles along the edge of this land."},{"definition":"An element such as a baseboard, handrail, etc., that is curved instead of abruptly changing direction."},{"definition":"Easing, relief."},{"definition":"The act of relieving oneself: defecating or urinating."},{"definition":"(model railroading) Transition spiral curve track between a straight or tangent track and a circular curved track of a certain radius or selected radius."},{"definition":"Assistance."},{"definition":"Support."},{"definition":"Gratification."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈizmənt/"},{"text":"/ˈiːzm(ə)nt/"},{"audio":"easement-au"}]},{"word":"GOALIE","idx":22272,"count":1329458,"meanings":[{"definitions":[{"definition":"A goalkeeper or goaltender."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a goalie, to tend the goals, to mind the net."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡəʊl.i/"},{"audio":"goalie-ca"}]},{"word":"DARKROOM","idx":22273,"count":1329388,"meanings":[{"definitions":[{"definition":"A dark room, where photographs are developed."},{"definition":"A darkened room where sexual activity can take place, especially one in a gay club."}],"partOfSpeech":"n"}]},{"word":"IRRATIONAL","idx":22274,"count":1329359,"meanings":[{"definitions":[{"definition":"A real number that can not be expressed as the quotient of two integers, an irrational number."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not rational; unfounded or nonsensical.","example":"an irrational decision"},{"definition":"Of a real number, that cannot be written as the ratio of two integers.","example":"The number π is irrational."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪˈɹæʃ.(ə.)nəl/"}]},{"word":"HYDROCARBONS","idx":22275,"count":1328870,"meanings":[{"definitions":[{"definition":"A compound consisting only of carbon and hydrogen atoms."}],"partOfSpeech":"n"}]},{"word":"ARCHES","idx":22277,"count":1328319,"meanings":[{"definitions":[{"definition":"An inverted U shape."},{"definition":"An arch-shaped arrangement of trapezoidal stones, designed to redistribute downward force outward."},{"definition":"An architectural element having the shape of an arch"},{"definition":"Any place covered by an arch; an archway.","example":"to pass into the arch of a bridge"},{"definition":"An arc; a part of a curve."},{"definition":"A natural arch-shaped opening in a rock mass."},{"definition":"Curved part of the bottom of a foot."},{"definition":"A chief."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into an arch shape","example":"The cat arched its back"},{"definition":"To cover with an arch or arches."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɑɹt͡ʃɪz/"},{"text":"/ˈɑːt͡ʃɪz/"}]},{"word":"NATURALIST","idx":22279,"count":1327928,"meanings":[{"definitions":[{"definition":"(except as merged with later senses) A natural philosopher; a scientist."},{"definition":"A person who believes in or advocates the tenets of philosophical or methodological naturalism."},{"definition":"An expert in natural history or the study of plants and animals."},{"definition":"A creative artist who attempts to faithfully represent nature; an adherent of artistic naturalism."}],"partOfSpeech":"n"}]},{"word":"ENCOMPASSING","idx":22280,"count":1327557,"meanings":[{"definitions":[{"definition":"To form a circle around; to encircle."},{"definition":"To include within its scope; to circumscribe or go round so as to surround; to enclose; to contain."},{"definition":"To include completely; to describe fully or comprehensively.","example":"This book on English grammar encompasses all irregular verbs."},{"definition":"To go around, especially, to circumnavigate.","example":"Drake encompassed the globe."}],"partOfSpeech":"ve"}]},{"word":"PENETRATING","idx":22282,"count":1327533,"meanings":[{"definitions":[{"definition":"To enter into; to make way into the interior of; to pierce.","example":"Light penetrates darkness."},{"definition":"To achieve understanding of, despite some obstacle; to comprehend; to understand.","example":"I could not penetrate Burke's opaque rhetoric."},{"definition":"To affect profoundly through the senses or feelings; to move deeply.","example":"to penetrate one's heart with pity"},{"definition":"To infiltrate an enemy to gather intelligence."},{"definition":"To insert the penis into an opening, such as a vagina or anus.","example":"a male elephant comes up and penetrates the female elephant"},{"definition":"To move a piece past the defending pieces of one's opponent."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Able to pierce or penetrate","example":"The skunk produces a penetrating odor."},{"definition":"Demonstrating acute or keen understanding","example":"His novel shows a penetrating insight into the criminal mind."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"penetrating-us","text":"/ˈpɛnɪtɹeɪtɪŋ/"}]},{"word":"DESTROYS","idx":22283,"count":1327503,"meanings":[{"definitions":[{"definition":"To damage beyond use or repair.","example":"Hooligans destroy unprovoked."},{"definition":"To neutralize, undo a property or condition.","example":"Smoking destroys the natural subtlety of the palate."},{"definition":"To put down or euthanize.","example":"Destroying a rabid dog is required by law."},{"definition":"To severely disrupt the well-being of (a person); ruin.","example":"Her divorce destroyed her; she had a nervous breakdown and was severely depressed for more than a year."},{"definition":"To defeat soundly."},{"definition":"To remove data.","example":"The memory leak happened because we forgot to destroy the temporary lists."},{"definition":"To sing a song poorly."},{"definition":"(antiphrasis) To exhaust duly and thus recreate or build up.","example":"This exercise is going to destroy all parts of your shoulders."},{"definition":"To penetrate sexually in an aggressive way.","example":"She got destroyed by her lover on the carpet."}],"partOfSpeech":"ve"}]},{"word":"LOWERS","idx":22286,"count":1326880,"meanings":[{"definitions":[{"definition":"To frown; to look sullen."},{"definition":"To be dark, gloomy, and threatening, as clouds; of the sky: to be covered with dark and threatening clouds; to show threatening signs of approach, as a tempest."},{"definition":"To let descend by its own weight, as something suspended; to let down","example":"lower a bucket into a well"},{"definition":"To pull down","example":"to lower a flag"},{"definition":"To reduce the height of","example":"lower a chimney or turret"},{"definition":"To depress as to direction","example":"lower the aim of a gun"},{"definition":"To make less elevated","example":"to lower one's ambition, aspirations, or hopes"},{"definition":"To reduce the degree, intensity, strength, etc., of","example":"lower distilled liquors"},{"definition":"To bring down; to humble","example":"lower one's pride"},{"definition":"(lower oneself) To humble oneself; to do something one considers to be beneath one's dignity.","example":"I could never lower myself enough to buy second-hand clothes."},{"definition":"To reduce (something) in value, amount, etc.","example":"lower the interest rate"},{"definition":"To fall; to sink; to grow less; to diminish; to decrease","example":"The river lowered as rapidly as it rose."},{"definition":"To decrease in value, amount, etc."}],"partOfSpeech":"ve"}]},{"word":"COOKERY","idx":22292,"count":1326261,"meanings":[{"definitions":[{"definition":"The art and practice of preparing food for consumption, especially by the application of heat; cooking.","example":"Henry was not very good at cookery and most of his meals ended up burned."},{"definition":"A delicacy; a dainty."},{"definition":"Cooking tools or apparatus."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkʊkəɹi/"}]},{"word":"UNIQUENESS","idx":22293,"count":1326240,"meanings":[{"definitions":[{"definition":"The state or quality of being unique or one of a kind."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"uniqueness-us"}]},{"word":"CASCADING","idx":22295,"count":1326136,"meanings":[{"definitions":[{"definition":"To fall as a waterfall or series of small waterfalls."},{"definition":"To arrange in a stepped series like a waterfall."},{"definition":"To occur as a causal sequence."},{"definition":"To vomit."}],"partOfSpeech":"ve"}]},{"word":"METROS","idx":22296,"count":1326055,"meanings":[{"definitions":[{"definition":"An underground railway."},{"definition":"A train that runs on such an underground railway."},{"definition":"An urban rapid transit light railway"},{"definition":"A train that runs on such a railway."},{"definition":"A metropolitan area"}],"partOfSpeech":"n"}]},{"word":"HANGERS","idx":22297,"count":1325872,"meanings":[{"definitions":[{"definition":"One who hangs, or causes to be hanged; a hangman, paper hanger, etc."},{"definition":"A person who attempts suicide by hanging."},{"definition":"That by which a thing is suspended."},{"definition":"A short and broad backsword, worn so to hang at the side, especially popular in the 18th century."},{"definition":"A steep, wooded slope."},{"definition":"A hanging pitch; a pitch (typically a breaking ball or slider) that is poorly executed, hence easy to hit."},{"definition":"A mark (or catch) that typically involves a player jumping up on the back of another player."}],"partOfSpeech":"n"}]},{"word":"POLICEMAN","idx":22300,"count":1325650,"meanings":[{"definitions":[{"definition":"One who enforces."},{"definition":"The member of a group, especially of a gang, charged with keeping dissident members obedient."},{"definition":"A player tasked with physically intimidating or confronting the opposition."},{"definition":"A member of a police force, especially one who is male."},{"definition":"A glass rod capped at one end with rubber, used in a chemistry laboratory for gravimetric analysis."},{"definition":"Any skipper of the genus Coeliades."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"policeman-us","text":"/pəˈliːsmən/"},{"audio":"policeman-uk","text":"/pəˈliːsmən/"}]},{"word":"CARTILAGE","idx":22301,"count":1325533,"meanings":[{"definitions":[{"definition":"A type of dense, non-vascular connective tissue, usually found at the end of joints, the rib cage, the ear, the nose, in the throat and between intervertebral disks."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cartilage-us","text":"/ˈkɑɹtəlɪd͡ʒ/"}]},{"word":"BROADCASTER","idx":22302,"count":1325424,"meanings":[{"definitions":[{"definition":"An organisation that engages in the activity of broadcasting."},{"definition":"A person whose job it is to broadcast."}],"partOfSpeech":"n"}]},{"word":"TURNPIKE","idx":22303,"count":1325099,"meanings":[{"definitions":[{"definition":"A frame consisting of two bars crossing each other at right angles and turning on a post or pin, to hinder the passage of animals, but admitting a person to pass between the arms; a turnstile."},{"definition":"A gate or bar set across a road to stop carriages, animals, and sometimes people, until a toll is paid,"},{"definition":"A winding stairway."},{"definition":"A beam filled with spikes to obstruct passage; a cheval de frise."},{"definition":"A toll road, especially a toll expressway."},{"definition":"(mathematical economics) A trajectory on a finite time interval that satisfies an optimality criterion which is associated with a cost function."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form (a road, etc.) in the manner of a turnpike road; into a rounded form, as the path of a road."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"turnpike-uk","text":"/ˈtɜː(ɹ)npaɪk/"}]},{"word":"MIGRATORY","idx":22304,"count":1324637,"meanings":[{"definitions":[{"definition":"(of birds, etc) Migrating."},{"definition":"Roving; wandering; nomadic.","example":"migratory habits; a migratory life"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌmaɪˈɡɹeɪ.tə.ɹi/"},{"text":"/ˈmaɪ.ɡɹəˌtɔ.ɹi/"}]},{"word":"JURORS","idx":22305,"count":1324485,"meanings":[{"definitions":[{"definition":"A member of a jury."}],"partOfSpeech":"n"}]},{"word":"ENUMERATED","idx":22307,"count":1324371,"meanings":[{"definitions":[{"definition":"To specify each member of a sequence individually in incrementing order."},{"definition":"To determine the amount of."}],"partOfSpeech":"ve"}]},{"word":"SHELTERED","idx":22308,"count":1324275,"meanings":[{"definitions":[{"definition":"To provide cover from damage or harassment; to shield; to protect."},{"definition":"To take cover.","example":"During the rainstorm, we sheltered under a tree."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Protected, as from wind or weather.","example":"The boat was much safer, during the storm, in the sheltered cove."},{"definition":"(Of a person) who grew up being overprotected by parents or other guardians; often implies a lack of social skills, worldly experience, etc."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sheltered-us","text":"/ˈʃɛltɚd/"}]},{"word":"DEGRADED","idx":22310,"count":1323960,"meanings":[{"definitions":[{"definition":"To lower in value or social position.","example":"Fred degrades himself by his behaviour."},{"definition":"To reduce in quality or purity.","example":"The DNA sample has degraded."},{"definition":"To reduce in altitude or magnitude, as hills and mountains; to wear down."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Feeling or having undergone degradation; deprived of dignity or self-respect."},{"definition":"Having the typical characters or organs in a partially developed condition, or lacking certain parts."},{"definition":"Having steps; said of a cross whose extremities end in steps growing larger as they leave the centre; on degrees."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈɡɹeɪdəd/"}]},{"word":"DOCTRINES","idx":22311,"count":1323892,"meanings":[{"definitions":[{"definition":"A belief or tenet, especially about philosophical or theological matters.","example":"The four noble truths summarise the main doctrines of Buddhism."},{"definition":"The body of teachings of an ideology, most often a religion, or of an ideological or religious leader, organization, group or text.","example":"What is the understanding of marriage and family in orthodox Marxist doctrine?"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"doctrines-us","text":"/ˈdɑktɹɪnz/"}]},{"word":"SEAMS","idx":22312,"count":1323885,"meanings":[{"definitions":[{"definition":"A folded-back and stitched piece of fabric; especially, the stitching that joins two or more pieces of fabric."},{"definition":"A suture."},{"definition":"A thin stratum, especially of an economically viable material such as coal or mineral."},{"definition":"The stitched equatorial seam of a cricket ball; the sideways movement of a ball when it bounces on the seam."},{"definition":"A joint formed by mating two separate sections of materials.","example":"Seams can be made or sealed in a variety of ways, including adhesive bonding, hot-air welding, solvent welding, using adhesive tapes, sealant, etc."},{"definition":"A line or depression left by a cut or wound; a scar; a cicatrix."},{"definition":"A line of junction; a joint."},{"definition":"An old English measure of grain, containing eight bushels."},{"definition":"An old English measure of glass, containing twenty-four weys of five pounds, or 120 pounds."},{"definition":"Grease; tallow; lard"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put together with a seam."},{"definition":"To make the appearance of a seam in, as in knitting a stocking; hence, to knit with a certain stitch, like that in such knitting."},{"definition":"To mark with a seam or line; to scar."},{"definition":"To crack open along a seam."},{"definition":"Of the ball, to move sideways after bouncing on the seam."},{"definition":"Of a bowler, to make the ball move thus."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/siːmz/"}]},{"word":"PLEADED","idx":22313,"count":1323774,"meanings":[{"definitions":[{"definition":"To present (an argument or a plea), especially in a legal case.","example":"The defendant has decided to plead not guilty."},{"definition":"To beg, beseech, or implore.","example":"He pleaded with me not to leave the house."},{"definition":"To offer by way of excuse.","example":"Not wishing to attend the banquet, I pleaded illness."},{"definition":"To discuss by arguments."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈplidəd/"}]},{"word":"ELASTICITY","idx":22315,"count":1323328,"meanings":[{"definitions":[{"definition":"The property by virtue of which a material deformed under load can regain its original dimensions when unloaded"},{"definition":"The sensitivity of changes in a quantity with respect to changes in another quantity.","example":"If the sales of an item drop by 5% when the price increases by 10%, its price elasticity is -0.5."},{"definition":"A measure of the flexibility of a data store's data model and clustering capabilities."},{"definition":"A system's ability to adapt to changes in workload by automatically provisioning and de-provisioning resources."},{"definition":"The ratio of the relative change in a function's output with respect to the relative change in its input, for infinitesimal changes at a certain point."},{"definition":"The quality of being elastic."},{"definition":"Adaptability.","example":"Her elasticity allowed her to recover quickly."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪ.læsˈtɪs.ɪ.ti/"}]},{"word":"TOPO","idx":22316,"count":1323260,"meanings":[{"definitions":[{"definition":"A topographic map."},{"definition":"A map or sketch of a climbing route."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Topographic."}],"partOfSpeech":"j"}]},{"word":"FLASHLIGHTS","idx":22319,"count":1322939,"meanings":[{"definitions":[{"definition":"A battery-powered hand-held light source."},{"definition":"A flashgun (device used to create flashes of light for photography)."}],"partOfSpeech":"n"}]},{"word":"CEL","idx":22320,"count":1322845,"meanings":[{"definitions":[{"definition":"A piece of celluloid on which has been drawn a frame of an animated film."},{"definition":"Abstaining from marriage; the state of being unmarried."},{"definition":"(by extension) Abstinence from sexual relations."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɛl/"}]},{"word":"GUTTER","idx":22321,"count":1322843,"meanings":[{"definitions":[{"definition":"A prepared channel in a surface, especially at the side of a road adjacent to a curb, intended for the drainage of water."},{"definition":"A ditch along the side of a road."},{"definition":"A duct or channel beneath the eaves of a building to carry rain water; eavestrough.","example":"The gutters must be cleared of leaves a few times a year."},{"definition":"A groove down the sides of a bowling lane."},{"definition":"A large groove (commonly behind animals) in a barn used for the collection and removal of animal excrement."},{"definition":"Any narrow channel or groove, such as one formed by erosion in the vent of a gun from repeated firing."},{"definition":"A space between printed columns of text."},{"definition":"One of a number of pieces of wood or metal, grooved in the centre, used to separate the pages of type in a form."},{"definition":"An unprinted space between rows of stamps."},{"definition":"A drainage channel."},{"definition":"The notional locus of things, acts, or events which are distasteful, ill bred or morally questionable."},{"definition":"A low, vulgar state.","example":"Get your mind out of the gutter."},{"definition":"The spaces between comic book panels"},{"definition":"One who or that which guts."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flow or stream; to form gutters."},{"definition":"(of a candle) To melt away by having the molten wax run down along the side of the candle."},{"definition":"(of a small flame) To flicker as if about to be extinguished."},{"definition":"To send (a bowling ball) into the gutter, not hitting any pins."},{"definition":"To supply with a gutter or gutters."},{"definition":"To cut or form into small longitudinal hollows; to channel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gutter-uk","text":"/ˈɡʌt.ə/"}]},{"word":"ULCERS","idx":22322,"count":1322752,"meanings":[{"definitions":[{"definition":"An open sore of the skin, eyes or mucous membrane, often caused by an initial abrasion and generally maintained by an inflammation and/or an infection."},{"definition":"Peptic ulcer"},{"definition":"Anything that festers and corrupts like an open sore; a vice in character."}],"partOfSpeech":"n"}]},{"word":"AFFORDABILITY","idx":22325,"count":1322617,"meanings":[{"definitions":[{"definition":"The extent to which something is affordable, as measured by its cost relative to the amount that the purchaser is able to pay.","example":"First-time home buyers are feeling the squeeze of higher interest rates with mortgage affordability at its worst level for 16 years."}],"partOfSpeech":"n"}]},{"word":"SLOPPY","idx":22326,"count":1322519,"meanings":[{"definitions":[{"definition":"Very wet; covered in or composed of slop.","example":"The dog tracked sloppy mud through the kitchen!"},{"definition":"Messy; not neat, elegant, or careful.","example":"The carpenter did a sloppy job of building the staircase."},{"definition":"Imprecise or loose.","example":"A sloppy measurement; a sloppy fit!"}],"partOfSpeech":"j"}]},{"word":"FLANNEL","idx":22328,"count":1322321,"meanings":[{"definitions":[{"definition":"A soft cloth material woven from wool, possibly combined with cotton or synthetic fibers.","example":"With the weather turning colder, it was time to dig out our flannel sheets and nightclothes."},{"definition":"A washcloth."},{"definition":"A flannel shirt."},{"definition":"Soothing, plausible untruth or half-truth; claptrap.","example":"Don't talk flannel!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rub with a flannel."},{"definition":"To wrap in flannel."},{"definition":"To flatter; to suck up to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made of flannel."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"flannel-au","text":"/ˈflænəl/"}]},{"word":"VOLCANOES","idx":22329,"count":1322196,"meanings":[{"definitions":[{"definition":"A vent or fissure on the surface of a planet (usually in a mountainous form) with a magma chamber attached to the mantle of a planet or moon, periodically erupting forth lava and volcanic gases onto the surface."},{"definition":"A form of firework."}],"partOfSpeech":"n"}]},{"word":"JAILED","idx":22330,"count":1322095,"meanings":[{"definitions":[{"definition":"To imprison."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dʒeɪld/"}]},{"word":"RIDDEN","idx":22331,"count":1322007,"meanings":[{"definitions":[{"definition":"Full of."},{"definition":"Oppressed, dominated or plagued by."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To transport oneself by sitting on and directing a horse, later also a bicycle etc."},{"definition":"To be transported in a vehicle; to travel as a passenger."},{"definition":"(chiefly US and South Africa) To transport (someone) in a vehicle.","example":"The cab rode him downtown."},{"definition":"Of a ship: to sail, to float on the water."},{"definition":"To be carried or supported by something lightly and quickly; to travel in such a way, as though on horseback.","example":"The witch cackled and rode away on her broomstick."},{"definition":"To traverse by riding."},{"definition":"To convey, as by riding; to make or do by riding.","example":"How many races have you ridden this year?"},{"definition":"To support a rider, as a horse; to move under the saddle.","example":"A horse rides easy or hard, slow or fast."},{"definition":"To mount (someone) to have sex with them; to have sexual intercourse with."},{"definition":"To nag or criticize; to annoy (someone)."},{"definition":"Of clothing: to gradually move (up) and crease; to ruckle."},{"definition":"To rely, depend (on)."},{"definition":"Of clothing: to rest (in a given way on a part of the body)."},{"definition":"To play defense on the defensemen or midfielders, as an attackman."},{"definition":"To manage insolently at will; to domineer over."},{"definition":"To overlap (each other); said of bones or fractured fragments."},{"definition":"To monitor (some component of an audiovisual signal) in order to keep it within acceptable bounds."},{"definition":"In jazz, a steady rhythmical style."},{"definition":"To free (something) from a hindrance or annoyance.","example":"We're trying to rid the world of poverty."},{"definition":"To banish."},{"definition":"To kill."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɹɪdn̩/"}]},{"word":"GRAPEFRUIT","idx":22333,"count":1321427,"meanings":[{"definitions":[{"definition":"The tree of the species Citrus paradisi, a hybrid of pomelo (Citrus maxima) and sweet orange."},{"definition":"The large spherical tart fruit produced by this tree."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"grapefruit-us","text":"/ˈɡɹeɪp.fɹuːt/"}]},{"word":"CONTRADICTORY","idx":22334,"count":1321302,"meanings":[{"definitions":[{"definition":"Either of a pair of propositions, that cannot both be true or both be false."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That contradicts something, such as an argument."},{"definition":"That is itself a contradiction."},{"definition":"That is diametrically opposed to something."},{"definition":"Mutually exclusive."},{"definition":"Tending to contradict or oppose, contrarious."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"contradictory-us","text":"/ˌkɑntɹəˈdɪktəɹi/"}]},{"word":"TRNA","idx":22335,"count":1321221,"meanings":[{"definitions":[{"definition":"A short-chain version of RNA that transfers individual amino acids to ribosomes during protein synthesis."}],"partOfSpeech":"n"}]},{"word":"MOTORBIKES","idx":22336,"count":1321203,"meanings":[{"definitions":[{"definition":"A motorcycle."},{"definition":"A small and light motorcycle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride a motorbike; to travel by motorbike.","example":"We motorbiked all over the US that summer."}],"partOfSpeech":"ve"}]},{"word":"MISUNDERSTOOD","idx":22339,"count":1320461,"meanings":[{"definitions":[{"definition":"To understand incorrectly, while believing one has understood correctly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"misunderstood-us","text":"/ˌmɪs.ʌn.dɚˈstʊd/"}]},{"word":"STEAMER","idx":22341,"count":1320395,"meanings":[{"definitions":[{"definition":"A device or object that works by the operation of steam."},{"definition":"A mode of transportation propelled by steam."},{"definition":"A babycino (frothy milk drink)."},{"definition":"A wetsuit with long sleeves and legs."},{"definition":"The name of various animals."},{"definition":"A racehorse the odds of which are becoming shorter (that is, decreasing) because bettors are backing it."},{"definition":"An act of fellatio."},{"definition":"A member of a youth gang who engages in steaming (robbing and escaping in a large group)."},{"definition":"A drinking session."},{"definition":"A dish made by cooking diced meat very slowly in a tightly sealed pot with a minimum of flavourings, allowing it to steam in its own juices; specifically such a dish made with kangaroo meat."},{"definition":"A kind of chest for luggage, having a flat or slightly curved top and usually covered in canvas, leather or patterned paper."},{"definition":"A mug."},{"definition":"A homosexual man with a preference for passive partners."},{"definition":"A prostitute's client."},{"definition":"A gambler who increases a wager after losing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel by steamer."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈstimɚ/"},{"text":"/ˈstiːmə(ɹ)/"},{"audio":"steamer-au"}]},{"word":"BAROMETER","idx":22343,"count":1320357,"meanings":[{"definitions":[{"definition":"An instrument for measuring atmospheric pressure."},{"definition":"(by extension) Anything used as a gauge or indicator."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"barometer-us","text":"/bəˈɹɑməɾɚ/"}]},{"word":"DECORATORS","idx":22344,"count":1320345,"meanings":[{"definitions":[{"definition":"Someone who decorates."},{"definition":"Painter and wallpaperer of buildings"}],"partOfSpeech":"n"}]},{"word":"JIZZ","idx":22346,"count":1320138,"meanings":[{"definitions":[{"definition":"The physical and behavioural characteristics of a bird that enable it to be immediately recognised by an experienced birder as a certain type of bird, especially to family or genus level."},{"definition":"Male ejaculate; sperm, semen."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ejaculate; to eject semen."},{"definition":"To ejaculate on, over, or into; to cover in semen."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jizz","text":"/ˈdʒɪz/"}]},{"word":"EXCLAIMED","idx":22348,"count":1320051,"meanings":[{"definitions":[{"definition":"To cry out suddenly, from some strong emotion."},{"definition":"To say suddenly and with strong emotion."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"exclaimed-us","text":"/ɛkskleɪmd/"}]},{"word":"BARGE","idx":22350,"count":1319916,"meanings":[{"definitions":[{"definition":"A large flat-bottomed towed or self-propelled boat used mainly for river and canal transport of heavy goods or bulk cargo."},{"definition":"A richly decorated ceremonial state vessel propelled by rowers for river processions."},{"definition":"A large flat-bottomed coastal trading vessel having a large spritsail and jib-headed topsail, a fore staysail and a very small mizen, and having leeboards instead of a keel."},{"definition":"One of the boats of a warship having fourteen oars"},{"definition":"The wooden disk in which bread or biscuit is placed on a mess table."},{"definition":"A double-decked passenger or freight vessel, towed by a steamboat."},{"definition":"A large omnibus used for excursions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To intrude or break through, particularly in an unwelcome or clumsy manner."},{"definition":"To push someone."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bɑɹdʒ/"},{"text":"/bɑːdʒ/"}]},{"word":"PSORIASIS","idx":22351,"count":1319757,"meanings":[{"definitions":[{"definition":"A noncontagious disease whose main symptom is gray or silvery flaky patches on the skin which are red and inflamed underneath when scratched."}],"partOfSpeech":"n"}]},{"word":"SPARTAN","idx":22352,"count":1319649,"meanings":[{"definitions":[{"definition":"Austere, frugal, characterized by self-denial.","example":"I went on the retreat to the monastery, thinking I would be sleeping in a spartan cell, only to discover a simple but comfortable bedroom."},{"definition":"Resolute in the face of danger or adversity.","example":"The spartan legionaries vowed to fight to the death."},{"definition":"Lacking in decoration and luxury.","example":"After ten years as a fashion designer in the rough-and-tumble Garment District, Eloise left New York for the spartan but serene life of a farmer's wife."}],"partOfSpeech":"j"}]},{"word":"MAVERICKS","idx":22353,"count":1319608,"meanings":[{"definitions":[{"definition":"An unbranded range animal."},{"definition":"(by extension) Anything dishonestly obtained."},{"definition":"(by extension) One who is unconventional or does not abide by rules."},{"definition":"(by extension) One who creates or uses controversial or unconventional ideas or practices."},{"definition":"A person in the military who became an officer by going to college while on active duty as an enlisted person."},{"definition":"A queen and a jack as a starting hand in Texas hold 'em."}],"partOfSpeech":"n"}]},{"word":"CRYSTALLINE","idx":22356,"count":1319380,"meanings":[{"definitions":[{"definition":"Any crystalline substance."},{"definition":"Aniline"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or composed of crystals."},{"definition":"Having a regular three-dimensional molecular structure."},{"definition":"Resembling crystal in being clear and transparent."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹɪst.əl.aɪn/"}]},{"word":"RUMOURS","idx":22357,"count":1319120,"meanings":[{"definitions":[{"definition":"A statement or claim of questionable accuracy, from no known reliable source, usually spread by word of mouth.","example":"There's a rumor going round that he's going to get married."},{"definition":"Information or misinformation of the kind contained in such claims.","example":"They say he used to be a thief, but that's just rumor."},{"definition":"A prolonged, indistinct noise."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually used in the passive voice) To tell a rumor about; to gossip.","example":"John is rumored to be next in line for a promotion."}],"partOfSpeech":"ve"}]},{"word":"FAMED","idx":22359,"count":1319098,"meanings":[{"definitions":[{"definition":"Having fame; famous or noted."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/feɪmd/"}]},{"word":"AMTRAK","idx":22363,"count":1318727,"meanings":[{"definitions":[{"definition":"An amphibious vehicle of a class introduced in World War II."}],"partOfSpeech":"n"}]},{"word":"LESSEE","idx":22366,"count":1318539,"meanings":[{"definitions":[{"definition":"An individual or a corporation who has the right of use of something of value, gained through a lease agreement with the real owner of the property."},{"definition":"The entity to whom a lease is given, or who takes an estate by lease."},{"definition":"Someone who is allowed to use a house, building, land etc. for a period of time in return for payment to the owner."}],"partOfSpeech":"n"}]},{"word":"RESPITE","idx":22367,"count":1318533,"meanings":[{"definitions":[{"definition":"A brief interval of rest or relief."},{"definition":"A reprieve, especially from a sentence of death."},{"definition":"The delay of appearance at court granted to a jury beyond the proper term."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To delay or postpone (an event)."},{"definition":"To allow (a person) extra time to fulfil some obligation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"respite-uk","text":"/ˈɹɛspɪt/"}]},{"word":"OVERCLOCKING","idx":22371,"count":1317894,"meanings":[{"definitions":[{"definition":"To run a processor (CPU), or any electronic logic device, at a speed higher than is recommended by the manufacturer."}],"partOfSpeech":"ve"}]},{"word":"PEACEKEEPING","idx":22375,"count":1317554,"meanings":[{"definitions":[{"definition":"The act of preserving peace, specifically between hostile groups or states, especially by a sanctioned military force."},{"definition":"(as a noun modifier) (for example) a peacekeeping force."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpiːskiːpɪŋ/"}]},{"word":"PROVOCATIVE","idx":22376,"count":1317415,"meanings":[{"definitions":[{"definition":"(obsolescent) Something that provokes an appetite, especially a sexual appetite; an aphrodisiac."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Serving or tending to elicit a strong, often negative sentiment in another person; exasperating."},{"definition":"Serving or tending to excite, stimulate or arouse sexual interest; sexy."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹəˈvɑk.ə.tɪv/"},{"text":"/pɹəˈvɒk.ə.tɪv/"}]},{"word":"GUIDO","idx":22377,"count":1317298,"meanings":[{"definitions":[{"definition":"Italian-American male; an American male of Italian extraction as a member of the working-class."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡwidoʊ/"},{"text":"/ˈɡwiːdəʊ/"},{"audio":"guido-au"}]},{"word":"INTERFERON","idx":22379,"count":1317188,"meanings":[{"definitions":[{"definition":"Any of a group of glycoproteins, produced by the immune system, that prevent viral replication in infected cells."}],"partOfSpeech":"n"}]},{"word":"JAS","idx":22385,"count":1316739,"meanings":[{"definitions":[{"definition":"Horny (desiring sexual activity)."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Synonym of Korean foot: a traditional unit of length equivalent to about 30.3 cm."}],"partOfSpeech":"n"}]},{"word":"INTERSECTIONS","idx":22386,"count":1316609,"meanings":[{"definitions":[{"definition":"The junction of two (or more) paths, streets, highways, or other thoroughfares."},{"definition":"Any overlap, confluence, or crossover."},{"definition":"The point or set of points common to two geometrical objects (such as the point where two lines meet or the line where two planes intersect)."},{"definition":"The set containing all the elements that are common to two or more sets."},{"definition":"The element where two or more straight lines of synchronized skaters pass through each other.http//www.isu.org/vsite/vcontent/content/transnews/0,10869,4844-128590-19728-18885-295370-3787-4771-layout160-129898-news-item,00.html"},{"definition":"The pullback of a corner of monics."}],"partOfSpeech":"n"}]},{"word":"TASTED","idx":22387,"count":1316517,"meanings":[{"definitions":[{"definition":"To sample the flavor of something orally."},{"definition":"To have a taste; to excite a particular sensation by which flavour is distinguished.","example":"The chicken tasted great, but the milk tasted like garlic."},{"definition":"To experience.","example":"I tasted in her arms the delights of paradise."},{"definition":"To take sparingly."},{"definition":"To try by eating a little; to eat a small quantity of."},{"definition":"To try by the touch; to handle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tasted-us","text":"/ˈteɪstɪd/"}]},{"word":"LICKED","idx":22389,"count":1316428,"meanings":[{"definitions":[{"definition":"To stroke with the tongue.","example":"The cat licked its fur."},{"definition":"To lap; to take in with the tongue.","example":"She licked the last of the honey off the spoon before washing it."},{"definition":"To beat with repeated blows."},{"definition":"To defeat decisively, particularly in a fight.","example":"My dad can lick your dad."},{"definition":"To overcome.","example":"I think I can lick this."},{"definition":"To perform cunnilingus."},{"definition":"To do anything partially."},{"definition":"(of flame, waves etc.) To lap."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/lɪkt/"}]},{"word":"CAPITALIZATION","idx":22390,"count":1316045,"meanings":[{"definitions":[{"definition":"The act or process of capitalising."},{"definition":"The state of being capitalised."},{"definition":"The total value of all outstanding shares for a publicly-traded company"}],"partOfSpeech":"n"}]},{"word":"BANGED","idx":22391,"count":1316034,"meanings":[{"definitions":[{"definition":"To make sudden loud noises, and often repeatedly, especially by exploding or hitting something.","example":"My head was banging after drinking all night at the concert."},{"definition":"To hit hard.","example":"David and Mary banged into each other."},{"definition":"To engage in sexual intercourse.","example":"We can hear the couple banging upstairs."},{"definition":"(with \"in\") To hammer or to hit anything hard.","example":"Hold the picture while I bang in this nail."},{"definition":"To cut squarely across, as the tail of a horse, or a person's forelock; to cut (the hair)."},{"definition":"To inject intravenously.","example":"Do you smoke meth? No, I bang it."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having the hair styled in bangs."}],"partOfSpeech":"j"}]},{"word":"EPI","idx":22392,"count":1315354,"meanings":[{"definitions":[{"definition":"A syringe or autoinjector filled with epinephrine, most frequently used for the treatment of acute allergic reactions to avoid or treat the onset of anaphylactic shock."},{"definition":"(medical jargon) epinephrine"},{"definition":"A morphism p such that for any other pair of morphisms f and g, if f \\circ p = g \\circ p, then f = g."},{"definition":"An injection of anaesthetic into the epidural space of the spine, especially associated with pain relief during childbirth."},{"definition":"A surgical incision through the perineum made to enlarge the vagina and assist childbirth."}],"partOfSpeech":"n"}]},{"word":"RESPONDER","idx":22393,"count":1315336,"meanings":[{"definitions":[{"definition":"One who responds."},{"definition":"A person who responds to an emergency situation or other summons.","example":"911 responders arrived at the scene within five minutes after the call."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹəˈspɑndɚ/"},{"text":"/ɹəˈspɒndə/"}]},{"word":"THORACIC","idx":22396,"count":1315168,"meanings":[{"definitions":[{"definition":"One of a group of fishes having the ventral fins placed beneath the thorax or beneath the pectoral fins."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of the thorax."}],"partOfSpeech":"j"}]},{"word":"PHASER","idx":22397,"count":1315140,"meanings":[{"definitions":[{"definition":"An electronic device that produces special effects on the sound produced by an electric guitar etc."},{"definition":"Fictional energy weapon, with multiple settings for degree of intensity, from the television series Star Trek (1966–69)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shoot with a phaser weapon."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfeɪzɚ/"}]},{"word":"FORENSICS","idx":22398,"count":1315107,"meanings":[{"definitions":[{"definition":"The study of formal debate; rhetoric"},{"definition":"Forensic science"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/fəˈɹɛn.zɪks/"}]},{"word":"HOPELESS","idx":22399,"count":1315103,"meanings":[{"definitions":[{"definition":"Without hope; despairing; not expecting anything positive."},{"definition":"Giving no ground of hope; promising nothing desirable; desperate.","example":"a hopeless cause"},{"definition":"Without talent, not skilled","example":"He's a hopeless writer, but can draw very well."},{"definition":"(of an adverse condition) Incurable.","example":"He is a hopeless idler."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hopeless-us","text":"/ˈhoʊplɪs/"}]},{"word":"INFILTRATION","idx":22400,"count":1314890,"meanings":[{"definitions":[{"definition":"The act or process of infiltrating, as of water into a porous substance, or of a fluid into the cells of an organ or part of the body."},{"definition":"The substance which has entered the pores or cavities of a body."},{"definition":"The act of secretly entering a physical location and/or organization."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnfɪlˈtɹeɪʃən/"}]},{"word":"SAFEST","idx":22402,"count":1314785,"meanings":[{"definitions":[{"definition":"Not in danger; out of harm's reach.","example":"You’ll be safe here."},{"definition":"Free from risk.","example":"It’s safe to eat this."},{"definition":"Providing protection from danger; providing shelter.","example":"We have to find a safe spot, where we can hide out until this is over."},{"definition":"When a batter successfully reaches first base, or when a baserunner successfully advances to the next base or returns to the base he last occupied; not out.","example":"The pitcher attempted to pick off the runner at first, but he was safe."},{"definition":"Properly secured.","example":"The documents are safe."},{"definition":"(used after a noun, often forming a compound) Not susceptible to a specified source of harm.","example":"dishwasher-safe"},{"definition":"Great, cool, awesome, respectable; a term of approbation, often as interjection."},{"definition":"Lenient, usually describing a teacher that is easy-going."},{"definition":"Reliable; trusty."},{"definition":"Cautious."},{"definition":"Of a programming language, type-safe or more generally offering well-defined behavior despite programming errors."}],"partOfSpeech":"j"}]},{"word":"DAPHNE","idx":22403,"count":1314777,"meanings":[{"definitions":[{"definition":"Any one of least 50 species of shrub in the genus Daphne of the family Thymelaeaceae, some of which are grown as ornamentals."}],"partOfSpeech":"n"}]},{"word":"SERINE","idx":22405,"count":1314674,"meanings":[{"definitions":[{"definition":"A nonessential amino acid, CH2OH.CH(NH2)COOH, found in most animal proteins, especially silk."}],"partOfSpeech":"n"}]},{"word":"BING","idx":22406,"count":1314612,"meanings":[{"definitions":[{"definition":"Prison solitary confinement, a term used by inmates."},{"definition":"(mostly Scotland) A slag heap, i.e. a man-made mound or heap formed with the waste material (slag) as a by-product of coal mining or the shale oil industry. Can also refer to the waste by-product from a foundry or furnace, formed into such a mound."},{"definition":"(mostly Scotland) A heap or pile."},{"definition":"The sound made by a bell, an onomatopœia"},{"definition":"A sound made by a bounce"},{"definition":"A bounce"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go; walk; come; run"},{"definition":"Making the sound of a bounce"},{"definition":"To bounce"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The sound made by a bounce, or by striking a metallic surface"}],"partOfSpeech":"i"}],"phonetics":[{"text":"/bɪŋ/"},{"audio":"bing-au"}]},{"word":"POLLOCK","idx":22407,"count":1314501,"meanings":[{"definitions":[{"definition":"Either of two lean, white marine food fishes, of the genus Pollachius, in the cod family."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for pollock."},{"definition":"To splatter, as with paint."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɑlək/"},{"text":"/ˈpɒlək/"}]},{"word":"METEOR","idx":22408,"count":1314334,"meanings":[{"definitions":[{"definition":"A fast-moving streak of light in the night sky caused by the entry of extraterrestrial matter into the earth's atmosphere: A shooting star or falling star."},{"definition":"Any atmospheric phenomenon. (Thus the derivation of meteorology.) These were sometimes classified as aerial or airy meteors (winds), aqueous or watery meteors (hydrometeors: clouds, rain, snow, hail, dew, frost), luminous meteors (rainbows and aurora), and igneous or fiery meteors (lightning and shooting stars)."},{"definition":"A prop similar to poi balls, in that it is twirled at the end of a cord or cable."},{"definition":"A striking weapon resembling a track and field hammer consisting of a weight swung at the end of a cable or chain."},{"definition":"Any short-lived source of wonderment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move at great speed."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"meteor-us","text":"/ˈmitiɚ/"}]},{"word":"SCHEMAS","idx":22409,"count":1314254,"meanings":[{"definitions":[{"definition":"An outline or image universally applicable to a general conception, under which it is likely to be presented to the mind (for example, a body schema)."},{"definition":"A formal description of the structure of a database: the names of the tables, the names of the columns of each table, and the data type and other attributes of each column."},{"definition":"(markup languages) A formal description of data, data types, and data file structures, such as XML schemas for XML files."},{"definition":"A formula in the metalanguage of an axiomatic system, in which one or more schematic variables appear, which stand for any term or subformula of the system, which may or may not be required to satisfy certain conditions."},{"definition":"A monastic habit in the Greek Orthodox Church."}],"partOfSpeech":"n"}]},{"word":"ORTHOGONAL","idx":22411,"count":1314156,"meanings":[{"definitions":[{"definition":"An orthogonal line"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of two objects, at right angles; perpendicular to each other.","example":"A chord and the radius that bisects it are orthogonal."},{"definition":"Of a pair of vectors: having a zero inner product; perpendicular.","example":"The normal vector and tangent vector at a given point are orthogonal."},{"definition":"Of a square matrix: such that its transpose is equal to its inverse."},{"definition":"Of a linear transformation: preserving its angles."},{"definition":"Of grid graphs, board games and polyominoes: vertical or horizontal but not diagonal."},{"definition":"Of a pair of elements in an ortholattice: each less than or equal to the orthocomplement of the other."},{"definition":"Statistically independent, with reference to variates."},{"definition":"Of two or more aspects of a problem, able to be treated separately.","example":"The content of the message should be orthogonal to the means of its delivery."},{"definition":"Of two or more problems or subjects, independent of or irrelevant to each other."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"orthogonal-us","text":"/ɔɹˈθɑɡənəl/"}]},{"word":"OHMS","idx":22412,"count":1314152,"meanings":[{"definitions":[{"definition":"In the International System of Units, the derived unit of electrical resistance; the electrical resistance of a device across which a potential difference of one volt causes a current of one ampere. Symbol: Ω"}],"partOfSpeech":"n"}]},{"word":"BOOSTS","idx":22413,"count":1314011,"meanings":[{"definitions":[{"definition":"A push from behind, as to one who is endeavoring to climb."},{"definition":"Something that helps, or adds power or effectiveness; assistance.","example":"The controversy gave a boost to the author's sales."},{"definition":"(automotive engineering) A positive intake manifold pressure in cars with turbochargers or superchargers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lift or push from behind (one who is endeavoring to climb); to push up."},{"definition":"(by extension) To help or encourage (something) to increase or improve; to assist in overcoming obstacles.","example":"This campaign will boost your chances of winning the election."},{"definition":"To steal."},{"definition":"To jump-start a vehicle by using cables to connect the battery in a running vehicle to the battery in a vehicle that won't start."},{"definition":"To give a booster shot to."},{"definition":"To amplify; to signal boost."}],"partOfSpeech":"ve"}]},{"word":"STABILIZED","idx":22414,"count":1313848,"meanings":[{"definitions":[{"definition":"To make stable.","example":"Jody stabilized the table by putting a book under the short leg."},{"definition":"To become stable.","example":"The country will stabilize after the next election ends."}],"partOfSpeech":"ve"}]},{"word":"VENEER","idx":22415,"count":1313843,"meanings":[{"definitions":[{"definition":"A thin decorative covering of fine material (usually wood) applied to coarser wood or other material."},{"definition":"An attractive appearance that covers or disguises true nature or feelings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply veneer to.","example":"to veneer a piece of furniture with mahogany"},{"definition":"To disguise with apparent goodness."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"veneer-us","text":"[vɨˈniə̆ɹ]"}]},{"word":"ANONYMOUSLY","idx":22416,"count":1313723,"meanings":[{"definitions":[{"definition":"In an anonymous manner; without a name."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/əˈnɒnəməsli/"}]},{"word":"MANAGEABLE","idx":22417,"count":1313633,"meanings":[{"definitions":[{"definition":"Capable of being managed or controlled."},{"definition":"Capable of being done or fulfilled; achievable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"manageable-us","text":"/ˈmænəd͡ʒəb(ə)l/"}]},{"word":"MSGS","idx":22419,"count":1313348,"meanings":[{"definitions":[{"definition":"A communication, or what is communicated; any concept or information conveyed.","example":"We've just received an urgent message from the President."},{"definition":"An underlying theme or conclusion to be drawn from something.","example":"The main message of the novel is that time heals all wounds."},{"definition":"(chiefly in the plural) An errand."},{"definition":"See messages."}],"partOfSpeech":"n"}]},{"word":"SLANT","idx":22420,"count":1313083,"meanings":[{"definitions":[{"definition":"A slope; an incline, inclination.","example":"The house was built on a bit of a slant and was never quite level."},{"definition":"A sloped surface or line."},{"definition":"A run: a heading driven diagonally between the dip and strike of a coal seam."},{"definition":"An oblique movement or course."},{"definition":"A sloping surface in a culture medium."},{"definition":"A pan with a sloped bottom used for holding paintbrushes."},{"definition":"A container or surface bearing shallow sloping areas to hold watercolors."},{"definition":"A sarcastic remark; shade, an indirect mocking insult."},{"definition":"An opportunity, particularly to go somewhere."},{"definition":"A crime committed for the purpose of being apprehended and transported to a major settlement."},{"definition":"(originally United States) A point of view, an angle; a bias.","example":"It was a well written article, but it had a bit of a leftist slant."},{"definition":"A look, a glance."},{"definition":"A person with slanting eyes, particularly an East Asian."},{"definition":"A slashing action or motion, particularly:"},{"definition":"A mark made by a slashing motion, particularly:"},{"definition":"Something resembling such a mark, particularly:"},{"definition":"The loose woody debris remaining from a slash, (particularly forestry) the trimmings left while preparing felled trees for removal.","example":"Slash generated during logging may constitute a fire hazard."},{"definition":"Slash fiction."},{"definition":"A drink of something; a draft."},{"definition":"A piss: an act of urination."},{"definition":"A swampy area; a swamp."},{"definition":"A large quantity of watery food such as broth."},{"definition":"The period of a transitory breeze."},{"definition":"An interval of good weather."},{"definition":"The loose part of a rope; slack."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lean, tilt or incline.","example":"If you slant the track a little more, the marble will roll down it faster."},{"definition":"To bias or skew.","example":"The group tends to slant its policies in favor of the big businesses it serves."},{"definition":"To lie or exaggerate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sloping; oblique; slanted."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"slant-us","text":"/ˈslænt/"},{"audio":"slant-au","text":"/ˈslænt/"}]},{"word":"DISCIPLINED","idx":22422,"count":1313063,"meanings":[{"definitions":[{"definition":"To train someone by instruction and practice."},{"definition":"To teach someone to obey authority."},{"definition":"To punish someone in order to (re)gain control."},{"definition":"To impose order on someone."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Possessing mental discipline."},{"definition":"Punished for disobedience."},{"definition":"Under control."},{"definition":"(in combination) Relating to a specified kind or number of disciplines."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɪsɪplɪnd/"}]},{"word":"SELENIUM","idx":22423,"count":1312892,"meanings":[{"definitions":[{"definition":"A nonmetallic chemical element (symbol Se) with an atomic number of 34, used mainly in glassmaking and pigments and as a semiconductor."},{"definition":"A single atom of this element."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/səˈliː.ni.əm/"}]},{"word":"GRINDERS","idx":22424,"count":1312851,"meanings":[{"definitions":[{"definition":"One who grinds something, such as the teeth."},{"definition":"(anatomical) A molar."},{"definition":"A power tool with a spinning abrasive disc, used for grinding, smoothing, and shaping materials, usually metal."},{"definition":"A sandwich made on a long, cylindrical roll.","example":"I am going to the deli to get a grinder for lunch."},{"definition":"A kitchen gadget for processing coffee, herbs etc. into small or powdered pieces"},{"definition":"The restless flycatcher (Myiagra inquieta) of Australia, which makes a noise like a scissors grinder."},{"definition":"A fan or performer of grindcore music."},{"definition":"A biohacker who uses cybernetic implants or biochemicals to enhance or change their own body."},{"definition":"A student who studies hard; a swot."},{"definition":"A person who coaches students for an upcoming examination."},{"definition":"(ice hockey slang) A hard-working, physical player with limited offensive ability."},{"definition":"A low-ranking attorney with no clients who works very hard."},{"definition":"An outdoor space for drills and parades."}],"partOfSpeech":"n"}]},{"word":"POLLARD","idx":22426,"count":1312749,"meanings":[{"definitions":[{"definition":"A pruned tree; the wood of such trees."},{"definition":"A buck deer that has shed its antlers."},{"definition":"A hornless variety of domestic animal, as cattle or goats."},{"definition":"A European chub (Squalius cephalus, syn. Leuciscus cephalus), a kind of fish."},{"definition":"A fine grade of bran including some flour."},{"definition":"A 13th-century European coin minted as a debased counterfeit of the sterling silver penny of Edward I of England, at first legally accepted as a halfpenny and then outlawed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prune a tree heavily, cutting branches back to the trunk, so that it produces dense new growth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pollard-us","text":"/ˈpɑ.lɚd/"}]},{"word":"CHOPS","idx":22428,"count":1312600,"meanings":[{"definitions":[{"definition":"A cut of meat, often containing a section of a rib.","example":"I only like lamb chops with mint jelly."},{"definition":"A blow with an axe, cleaver, or similar utensil.","example":"It should take just one good chop to fell the sapling."},{"definition":"A blow delivered with the hand rigid and outstretched.","example":"A karate chop."},{"definition":"Ocean waves, generally caused by wind, distinguished from swell by being smaller and not lasting as long."},{"definition":"A hand where two or more players have an equal-valued hand, resulting in the chips being shared equally between them.","example":"With both players having an ace-high straight, the pot was a chop."},{"definition":"(with \"the\") Termination, especially from employment; the sack."},{"definition":"A woodchopping competition."},{"definition":"A crack or cleft; a chap."},{"definition":"A turn of fortune; change; a vicissitude."},{"definition":"(chiefly in the plural) A jaw of an animal."},{"definition":"A movable jaw or cheek, as of a vice."},{"definition":"The land at each side of the mouth of a river, harbour, or channel.","example":"East Chop; West Chop"},{"definition":"An official stamp or seal, as in China and India."},{"definition":"A mark indicating nature, quality, or brand.","example":"silk of the first chop"},{"definition":"A license or passport that has been sealed."},{"definition":"A complete shipment.","example":"a chop of tea"},{"definition":"An IRC channel operator."},{"definition":"Jaws, mouth."},{"definition":"One's skill at musical interpretation and delivery (originally of jazz); musical performance ability.","example":"Although the bass player had no experience playing in New Orleans, the crowd's enthusiastic response showed that he had the chops to make it in the very particular Crescent City jazz scene."},{"definition":"One's skill at any endeavor; ability, talent; competency.","example":"Although he did not know all of the ins and outs of the newsroom, he had the writing chops to become a regular contributor."},{"definition":"The area where two tides meet and cause an irregular (choppy) sea."},{"definition":"A pattern that involves carrying the object with the hand over the next object before throwing it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut into pieces with short, vigorous cutting motions.","example":"chop wood; chop an onion"},{"definition":"To sever with an axe or similar implement.","example":"Chop off his head."},{"definition":"To give a downward cutting blow or movement, typically with the side of the hand."},{"definition":"To hit the ball downward so that it takes a high bounce."},{"definition":"To divide the pot (or tournament prize) between two or more players."},{"definition":"To make a quick, heavy stroke or a series of strokes, with or as with an ax."},{"definition":"To do something suddenly with an unexpected motion; to catch or attempt to seize."},{"definition":"To interrupt; with in or out."},{"definition":"(Perl) To remove the final character from (a text string)."},{"definition":"To exchange, to barter; to swap."},{"definition":"To chap or crack."},{"definition":"To vary or shift suddenly.","example":"The wind chops about."},{"definition":"To twist words."},{"definition":"To converse, discuss, or speak with another."},{"definition":"To talk, chat; also, to talk back, to be cheeky."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/t͡ʃɑps/"},{"text":"/t͡ʃɒps/"},{"audio":"chops-au"}]},{"word":"BROOM","idx":22430,"count":1312361,"meanings":[{"definitions":[{"definition":"A domestic utensil with fibers bound together at the end of a long handle, used for sweeping."},{"definition":"An implement with which players sweep the ice to make a stone travel further and curl less; a sweeper."},{"definition":"Any of several yellow-flowered shrubs of the family Fabaceae, in the tribe Genisteae, including genera Cytisus, Genista, and Spartium, with long, thin branches and small or few leaves."},{"definition":"A gun, because it is more or less long, held similarly to a besom and “cleans” what is in front."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sweep with a broom."},{"definition":"(roofing) To improve the embedding of a membrane by using a broom or squeegee to smooth it out and ensure contact with the adhesive under the membrane."},{"definition":"To clean (e.g. a ship's bottom of clinging shells, seaweed, etc.) by the application of fire and scraping."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"broom-us","text":"/bɹuːm/"}]},{"word":"PLAINLY","idx":22431,"count":1312242,"meanings":[{"definitions":[{"definition":"In a plain manner; simply; basically.","example":"She decorated the room plainly but neatly."},{"definition":"Obviously; clearly.","example":"You will see that ours is plainly the better method."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"plainly-us","text":"/ˈpleɪnli/"}]},{"word":"PUNCHES","idx":22434,"count":1312203,"meanings":[{"definitions":[{"definition":"A hit or strike with one's fist."},{"definition":"Power, strength, energy."},{"definition":"Impact."},{"definition":"A device, generally slender and round, used for creating holes in thin material, for driving an object through a hole in a containing object, or to stamp or emboss a mark or design on a surface."},{"definition":"A hole or opening created with a punch."},{"definition":"(piledriving) An extension piece applied to the top of a pile; a dolly."},{"definition":"A prop, as for the roof of a mine."},{"definition":"A beverage, generally containing a mixture of fruit juice and some other beverage, often alcoholic."},{"definition":"Any of various riodinid butterflies of the genus Dodona of Asia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike with one's fist.","example":"If she punches me, I'm gonna break her nose."},{"definition":"(of cattle) To herd."},{"definition":"To operate (a device or system) by depressing a button, key, bar, or pedal, or by similar means."},{"definition":"To enter (information) on a device or system."},{"definition":"To hit (a ball or similar object) with less than full force.","example":"He punched a hit into shallow left field."},{"definition":"To make holes in something (rail ticket, leather belt, etc)"},{"definition":"To thrust against; to poke.","example":"to punch one with the end of a stick or the elbow"},{"definition":"To employ a punch to create a hole in or stamp or emboss a mark on something."},{"definition":"To mark a ticket."}],"partOfSpeech":"ve"}]},{"word":"SNARE","idx":22435,"count":1311615,"meanings":[{"definitions":[{"definition":"A trap (especially one made from a loop of wire, string, or leather)."},{"definition":"A mental or psychological trap."},{"definition":"A loop of cord used in obstetric cases, to hold or to pull a fetus from the mother animal."},{"definition":"A similar looped instrument formerly used to remove tumours etc."},{"definition":"A set of stiff wires held under tension against the lower skin of a drum to create a rattling sound."},{"definition":"A snare drum."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To catch or hold, especially with a loop."},{"definition":"To ensnare."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"snare-us","text":"/snɛəɹ/"}]},{"word":"MASTURBATE","idx":22436,"count":1311597,"meanings":[{"definitions":[{"definition":"To stimulate oneself sexually, especially by use of one’s hand or a sex toy made for this purpose, often to the point of ejaculation.","example":"I find this difficult to masturbate to."},{"definition":"To stimulate someone else sexually without penetration of the penis."},{"definition":"To stimulate or please oneself by means of anything, not necessarily sexual, that does not get them anywhere; something that wastes their time; something that does not help others or achieve any important goal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"masturbate-us","text":"/ˈmæstɚbeɪt/"}]},{"word":"SHANK","idx":22437,"count":1311484,"meanings":[{"definitions":[{"definition":"The part of the leg between the knee and the ankle."},{"definition":"Meat from that part of an animal."},{"definition":"A redshank or greenshank, various species of Old World wading birds in the genus Tringa having distinctly colored legs."},{"definition":"A straight, narrow part of an object, such as a key or an anchor; shaft; stem."},{"definition":"The handle of a pair of shears, connecting the ride to the neck."},{"definition":"The center part of a fishhook between the eye and the hook, the 'hook' being the curved part that bends toward the point."},{"definition":"A protruding part of an object, by which it is or can be attached."},{"definition":"The metal part on a curb bit that falls below the mouthpiece, which length controls the severity of the leverage action of the bit, and to which the reins of the bridle are attached."},{"definition":"A poorly played golf shot in which the ball is struck by the part of the club head that connects to the shaft."},{"definition":"An improvised stabbing weapon; a shiv."},{"definition":"A loop forming an eye to a button."},{"definition":"The space between two channels of the Doric triglyph."},{"definition":"A large ladle for molten metal, fitted with long bars for handling it."},{"definition":"The body of a type; between the shoulder and the foot."},{"definition":"(shoemaking) The part of the sole beneath the instep connecting the broader front part with the heel."},{"definition":"Flat-nosed pliers, used by opticians for nipping off the edges of pieces of glass to make them round."},{"definition":"The end or remainder, particularly of a period of time."},{"definition":"The main part or beginning of a period of time.","example":"the shank of the morning"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel on foot."},{"definition":"To stab, especially with an improvised blade."},{"definition":"To remove another's trousers, especially in jest; to depants."},{"definition":"To misstrike the ball with the part of the club head that connects to the shaft."},{"definition":"To hit or kick the ball in an unintended direction."},{"definition":"To fall off, as a leaf, flower, or capsule, on account of disease affecting the supporting footstalk; usually followed by off."},{"definition":"To provide (a button) with a shank (loop forming an eye)."},{"definition":"(shoemaking) To apply the shank to a shoe, during the process of manufacturing it."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Bad."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shank-us","text":"/ʃæŋk/"}]},{"word":"PARACHUTE","idx":22438,"count":1311422,"meanings":[{"definitions":[{"definition":"A device, generally constructed from fabric, that is designed to employ air resistance to control the fall of an object."},{"definition":"A web or fold of skin extending between the legs of gliding mammals, such as the flying squirrel and colugo."},{"definition":"(BDSM) A small collar which fastens around the scrotum and from which weights can be hung."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To jump, fall, descend, etc. using such a device."},{"definition":"To introduce into a place using such a device.","example":"The soldiers were parachuted behind enemy lines."},{"definition":"To place (somebody) in an organisation in a position of authority without their having previous experience there; used with in or into."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"parachute-us","text":"/ˈpæɹəʃuːt/"}]},{"word":"UPHOLD","idx":22439,"count":1311296,"meanings":[{"definitions":[{"definition":"To hold up; to lift on high; to elevate."},{"definition":"To keep erect; to support; to sustain; to keep from falling"},{"definition":"To support by approval or encouragement, to confirm (something which has been questioned)"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˌʌpˈhold/"}]},{"word":"GLIDER","idx":22440,"count":1311196,"meanings":[{"definitions":[{"definition":"The act of gliding."},{"definition":"A transitional sound, especially a semivowel."},{"definition":"An attack or preparatory movement made by sliding down the opponent’s blade, keeping it in constant contact."},{"definition":"A bird, the glede or kite."},{"definition":"A kind of cap affixed to the base of the legs of furniture to prevent it from damaging the floor."},{"definition":"The joining of two sounds without a break."},{"definition":"A smooth and sliding step in dancing the waltz."},{"definition":"One who glides."},{"definition":"Any heavier-than-air aircraft optimised for unpowered flight; a sailplane."},{"definition":"A pilot of glider aircraft."},{"definition":"Any animal with the ability to glide, such as the gliding possum."},{"definition":"A kind of garden swing."},{"definition":"In the Game of Life cellular automaton, a particular configuration of five cells that recurs periodically at fixed offsets and appears to \"walk\" across the grid."},{"definition":"A vehicle, of a usually motorised type, without a powertrain."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡlaɪdɚ/"},{"text":"/ˈɡlaɪdə(ɹ)/"}]},{"word":"REVISING","idx":22441,"count":1311172,"meanings":[{"definitions":[{"definition":"To look at again, to reflect on."},{"definition":"To review, alter and amend, especially of written material.","example":"This statute should be revised."},{"definition":"To look over again (something previously written or learned), especially in preparation for an examination.","example":"2008, Tom Burns, Sandra Sinfield, Chapter 19: How to build your memory and revise effectively, Essential Study Skills: The Complete Guide to Success at University, SAGE Publications, UK, page 273."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"revising"}]},{"word":"INSIGNIA","idx":22443,"count":1310533,"meanings":[{"definitions":[{"definition":"A patch or other object that indicates a person's official or military rank, or membership in a group or organization."},{"definition":"A symbol or token of personal power, status, or office, or of an official body of government or jurisdiction."},{"definition":"A mark or token by which anything is known."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"insignia-us","text":"/ɪnˈsɪɡ.ni.ə/"}]},{"word":"TAOS","idx":22444,"count":1310519,"meanings":[{"definitions":[{"definition":"The act of moving or revolving around, or as in a circle or orbit; a revolution"},{"definition":"The circumference of, or distance around, any space; the measure of a line around an area."},{"definition":"That which encircles anything, as a ring or crown."},{"definition":"The space enclosed within a circle, or within limits."},{"definition":"Enclosed path of an electric current, usually designed for a certain function."},{"definition":"A regular or appointed trip from place to place as part of one's job"},{"definition":"The jurisdiction of certain judges within a state or country, whether itinerant or not."},{"definition":"Various administrative divisions of imperial and early Republican China, including:"},{"definition":"Methodism: The basic grouping of local Methodist churches."},{"definition":"By analogy to the proceeding three, a set of theaters among which the same acts circulate; especially common in the heyday of vaudeville."},{"definition":"A track on which a race in held; a racetrack"},{"definition":"Circumlocution"},{"definition":"A thought that unconsciously goes round and round in a person's mind and controls that person."},{"definition":"A closed path, without repeated vertices allowed"},{"definition":"A court that sits at more than one location in the district that it serves."},{"definition":"(by extension) The art or skill of doing something in harmony with the essential nature of the thing.","example":"the tao of archery"}],"partOfSpeech":"n"}]},{"word":"NURTURE","idx":22445,"count":1310338,"meanings":[{"definitions":[{"definition":"The act of nourishing or nursing; tender care"},{"definition":"That which nourishes; food; diet."},{"definition":"The environmental influences that contribute to the development of an individual (as opposed to \"nature\")."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To nourish or nurse."},{"definition":"(by extension) To encourage, especially the growth or development of something."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"nurture-uk","text":"/ˈnɜːɹ.tʃəɹ/"}]},{"word":"TONG","idx":22446,"count":1310252,"meanings":[{"definitions":[{"definition":"An instrument or tool used for manipulating things in a fire without touching them with the hands."},{"definition":"A Chinese secret society or gang."},{"definition":"The flexible muscular organ in the mouth that is used to move food around, for tasting and that is moved into various positions to modify the flow of air from the lungs in order to produce different sounds in speech."},{"definition":"This organ, as taken from animals used for food (especially cows).−","example":"cold tongue with mustard"},{"definition":"(metonym) A language.","example":"He was speaking in his native tongue."},{"definition":"Speakers of a language, collectively."},{"definition":"Voice (the distinctive sound of a person's speech); accent (distinctive manner of pronouncing a language)."},{"definition":"Manner of speaking, often habitually."},{"definition":"(metonym) A person speaking in a specified manner (most often plural)."},{"definition":"The power of articulate utterance; speech generally."},{"definition":"Discourse; fluency of speech or expression."},{"definition":"Discourse; fluency of speech or expression."},{"definition":"Honourable discourse; eulogy."},{"definition":"(often in the plural) Glossolalia."},{"definition":"In a shoe, the flap of material that goes between the laces and the foot (so called because it resembles a tongue in the mouth)."},{"definition":"Any large or long physical protrusion on an automotive or machine part or any other part that fits into a long groove on another part."},{"definition":"A projection, or slender appendage or fixture."},{"definition":"A long, narrow strip of land, projecting from the mainland into a sea or lake."},{"definition":"The pole of a vehicle; especially, the pole of an ox cart, to the end of which the oxen are yoked."},{"definition":"The clapper of a bell."},{"definition":"An individual point of flame from a fire."},{"definition":"A small sole (type of fish)."},{"definition":"A short piece of rope spliced into the upper part of standing backstays, etc.; also, the upper main piece of a mast composed of several pieces."},{"definition":"A reed."},{"definition":"A division of formation; A layer or member of a formation that pinches out in one direction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use tongs."},{"definition":"To grab, manipulate or transport something using tongs."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tong-uk","text":"/tɒŋ/"}]},{"word":"LOTIONS","idx":22447,"count":1310250,"meanings":[{"definitions":[{"definition":"A low- to medium-viscosity topical preparation intended for application to unbroken skin."},{"definition":"A washing, especially of the skin for the purpose of beautification."}],"partOfSpeech":"n"}]},{"word":"LEASH","idx":22448,"count":1310125,"meanings":[{"definitions":[{"definition":"A strap, cord or rope with which to restrain an animal, often a dog."},{"definition":"A brace and a half; a tierce."},{"definition":"A set of three; three creatures of any kind, especially greyhounds, foxes, bucks, and hares; hence, the number three in general."},{"definition":"A string with a loop at the end for lifting warp threads, in a loom."},{"definition":"A leg rope."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten or secure with a leash."},{"definition":"To curb, restrain"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"leash-us","text":"/liːʃ/"}]},{"word":"HUNTS","idx":22449,"count":1310081,"meanings":[{"definitions":[{"definition":"The act of hunting."},{"definition":"A hunting expedition."},{"definition":"An organization devoted to hunting, or the people belonging to it."},{"definition":"A pack of hunting dogs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To find or search for an animal in the wild with the intention of killing the animal for its meat or for sport.","example":"Her uncle will go out and hunt for deer, now that it is open season."},{"definition":"To try to find something; search (for).","example":"The little girl was hunting for shells on the beach."},{"definition":"To drive; to chase; with down, from, away, etc.","example":"He was hunted from the parish."},{"definition":"To use or manage (dogs, horses, etc.) in hunting.","example":"Did you hunt that pony last week?"},{"definition":"To use or traverse in pursuit of game.","example":"He hunts the woods, or the country."},{"definition":"(bell-ringing) To move or shift the order of (a bell) in a regular course of changes."},{"definition":"(bell-ringing) To shift up and down in order regularly."},{"definition":"To be in a state of instability of movement or forced oscillation, as a governor which has a large movement of the balls for small change of load, an arc-lamp clutch mechanism which moves rapidly up and down with variations of current, etc.; also, to seesaw, as a pair of alternators working in parallel."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hʌnts/"}]},{"word":"ADRENAL","idx":22451,"count":1309847,"meanings":[{"definitions":[{"definition":"An adrenal gland."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to the adrenal glands or their secretions."},{"definition":"Near the kidneys."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/æˈdɹiːnəl/"}]},{"word":"PLANTATIONS","idx":22452,"count":1309778,"meanings":[{"definitions":[{"definition":"A large farm; estate or area of land designated for agricultural growth. Often includes housing for the owner and workers."},{"definition":"An area where trees are planted for commercial purposes."},{"definition":"The importation of large numbers of workers and soldiers to displace the local population, such as in medieval Ireland and in the Americas; colonization."},{"definition":"A colony established thus."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"plantations-us"}]},{"word":"SIXTIES","idx":22453,"count":1309750,"meanings":[{"definitions":[{"definition":"The decade of the 1860s, 1960s, etc. (but especially the 1960s)"},{"definition":"A period in American history centered around the counterculture movement of the late 1960s."},{"definition":"The decade of one's life from age 60 through age 69."},{"definition":"(temperature, rates) The range between 60 and 69.","example":"Highs in the mid sixties."}],"partOfSpeech":"n"},{"definitions":[{"definition":"From or evoking the 61st through 70th years of a century (chiefly the 1960s)."}],"partOfSpeech":"j"}]},{"word":"FACTIONS","idx":22454,"count":1309625,"meanings":[{"definitions":[{"definition":"A group of people, especially within a political organization, which expresses a shared belief or opinion different from people who are not part of the group."},{"definition":"Strife; discord."}],"partOfSpeech":"n"}]},{"word":"HUMILITY","idx":22456,"count":1309175,"meanings":[{"definitions":[{"definition":"The characteristic of being humble; humbleness in character and behavior."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/hjuːˈmɪlɪti/"}]},{"word":"COMMENTATORS","idx":22457,"count":1309132,"meanings":[{"definitions":[{"definition":"A person who comments; especially someone who is paid to give his/her opinions in the media about current affairs, sports, etc."}],"partOfSpeech":"n"}]},{"word":"IMPEACHMENT","idx":22458,"count":1309121,"meanings":[{"definitions":[{"definition":"The act of calling into question or challenging the accuracy or propriety of something."},{"definition":"The state of being impeached."},{"definition":"Hindrance; impediment; obstruction."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/imˈpitʃmənt/"},{"text":"/ɪmˈpiːtʃmənt/"},{"audio":"impeachment-au"}]},{"word":"BOOTING","idx":22460,"count":1308810,"meanings":[{"definitions":[{"definition":"To kick.","example":"I booted the ball toward my teammate."},{"definition":"To put boots on, especially for riding."},{"definition":"To apply corporal punishment (compare slippering)."},{"definition":"To forcibly eject.","example":"We need to boot those troublemakers as soon as possible"},{"definition":"To disconnect forcibly; to eject from an online service, conversation, etc."},{"definition":"To vomit.","example":"Sorry, I didn’t mean to boot all over your couch."},{"definition":"(criminal slang) To shoot, to kill by gunfire."},{"definition":"To avail, benefit, profit."},{"definition":"To benefit, to enrich; to give in addition."},{"definition":"To bootstrap; to start a system, e.g. a computer, by invoking its boot process or bootstrap.","example":"When arriving at the office, first thing I do is booting my machine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A kicking, as with a booted foot."},{"definition":"The act by which a computer is booted."},{"definition":"Advantage; gain; gain by plunder; booty."},{"definition":"(criminal slang) Homicide by gunfire."}],"partOfSpeech":"n"}]},{"word":"ENGAGES","idx":22461,"count":1308799,"meanings":[{"definitions":[{"definition":"(heading) To interact socially."},{"definition":"(heading) To interact antagonistically."},{"definition":"(heading) To interact contractually."},{"definition":"(heading) To interact mechanically."},{"definition":"To enter into (an activity), to participate (construed with in)."},{"definition":"To entangle."}],"partOfSpeech":"ve"}]},{"word":"CARBIDE","idx":22462,"count":1308718,"meanings":[{"definitions":[{"definition":"Any binary compound of carbon and a more electropositive element"},{"definition":"The polyatomic ion C22−, or any of its salts."},{"definition":"The monatomic ion C4−, or any of its salts."},{"definition":"A carbon-containing alloy or doping of a metal or semiconductor, such as steel."},{"definition":"Tungsten carbide."},{"definition":"Trivial name for calcium carbide (CaC2), used to produce acetylene in bicycle lamps in the early 1900s."}],"partOfSpeech":"n"}]},{"word":"CUNTS","idx":22463,"count":1308527,"meanings":[{"definitions":[{"definition":"The female genitalia, especially the vulva."},{"definition":"An extremely unpleasant or objectionable person (in US, especially a woman; in UK, Ireland, Australia, New Zealand more usually a man)."},{"definition":"An objectionable object or item.","example":"Fix the car? I’ll sort the cunt out at the weekend."},{"definition":"An unpleasant or difficult experience or incident."},{"definition":"A woman, women, or bottom (i.e. submissive partner, not the top) as a source of sex.","example":"I’m going to hit the clubs and see if I can get me some cunt."},{"definition":"(positive) (with words funny, good) A person (mostly between male friends); compare bastard.","example":"Tom's a good cunt: he fixed my car and didn't even charge me for it!"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kʌnts/"}]},{"word":"CHARACTERISED","idx":22467,"count":1308115,"meanings":[{"definitions":[{"definition":"To depict someone or something a particular way (often negative)."},{"definition":"To be typical of."},{"definition":"To determine the characteristics of."}],"partOfSpeech":"ve"}]},{"word":"KINDER","idx":22469,"count":1307814,"meanings":[{"definitions":[{"definition":"Having a benevolent, courteous, friendly, generous, gentle, liberal, sympathetic, or warm-hearted nature or disposition, marked by consideration for – and service to – others."},{"definition":"Affectionate.","example":"a kind man; a kind heart"},{"definition":"Favorable."},{"definition":"Mild, gentle, forgiving","example":"The years have been kind to Richard Gere; he ages well."},{"definition":"Gentle; tractable; easily governed.","example":"a horse kind in harness"},{"definition":"Characteristic of the species; belonging to one's nature; natural; native."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Kind of; somewhat","example":"I kinda hafta do this right now."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Children."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"kinder-1-us","text":"/ˈkaɪndɚ/"}]},{"word":"DEEMS","idx":22470,"count":1307732,"meanings":[{"definitions":[{"definition":"An opinion, a judgment, a surmise."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To judge, to pass judgment on; to doom, to sentence."},{"definition":"To adjudge, to decree."},{"definition":"To dispense (justice); to administer (law)."},{"definition":"(ditransitive) To hold in belief or estimation; to adjudge as a conclusion; to regard as being; to evaluate according to one's beliefs; to account.","example":"She deemed his efforts insufficient."},{"definition":"To think, judge, or have or hold as an opinion; to decide or believe on consideration; to suppose."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/diːmz/"}]},{"word":"OUTSIDERS","idx":22471,"count":1307640,"meanings":[{"definitions":[{"definition":"One who is not part of a community or organization.","example":"While the initiated easily understand the symbols, they are wholly inaccessible to outsiders."},{"definition":"A newcomer with little or no experience in an organization or community.","example":"Seeing the mess professional politicians have made of things is it any wonder the electorate is beginning to prefer outsiders."},{"definition":"A competitor or contestant who has little chance of winning; a long shot","example":"Johnny was an outsider at this years karate tournament, but he still managed to win second place out of sheer determination."},{"definition":"A pair of nippers for turning a key in a keyhole from the outside."}],"partOfSpeech":"n"}]},{"word":"VALUATIONS","idx":22473,"count":1307541,"meanings":[{"definitions":[{"definition":"An estimation of something's worth."},{"definition":"The process of estimating the value of a financial asset or liability."},{"definition":"(propositional logic, model theory) An assignment of truth values to propositional variables, with a corresponding assignment of truth values to all propositional formulas with those variables (obtained through the recursive application of truth-valued functions corresponding to the logical connectives making up those formulas)."},{"definition":"(first-order logic, model theory) A structure, and the corresponding assignment of a truth value to each sentence in the language for that structure."},{"definition":"A measure of size or multiplicity."},{"definition":"(measure theory, domain theory) A map from the class of open sets of a topological space to the set of positive real numbers including infinity."}],"partOfSpeech":"n"}]},{"word":"DISSOLVE","idx":22475,"count":1307386,"meanings":[{"definitions":[{"definition":"A form of film punctuation in which there is a gradual transition from one scene to the next"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To terminate a union of multiple members actively, as by disbanding.","example":"The ruling party or coalition sometimes dissolves parliament early when the polls are favorable, hoping to reconvene with a larger majority."},{"definition":"To destroy, make disappear."},{"definition":"To liquify, melt into a fluid."},{"definition":"To be melted, changed into a fluid."},{"definition":"To disintegrate chemically into a solution by immersion into a liquid or gas."},{"definition":"To be disintegrated by such immersion."},{"definition":"To disperse, drive apart a group of persons."},{"definition":"To break the continuity of; to disconnect; to loosen; to undo; to separate."},{"definition":"To annul; to rescind; to discharge or release.","example":"to dissolve an injunction"},{"definition":"To shift from one shot to another by having the former fade out as the latter fades in."},{"definition":"To resolve itself as by dissolution."},{"definition":"To solve; to clear up; to resolve."},{"definition":"To relax by pleasure; to make powerless."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dissolve-uk","text":"/dɪˈzɒlv/"}]},{"word":"DEDUCT","idx":22479,"count":1306644,"meanings":[{"definitions":[{"definition":"To take one thing from another; remove from; make smaller by some amount.","example":"I will deduct the cost of the can of peas from the money I owe you."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪˈdʊkt/"}]},{"word":"CRAWLING","idx":22480,"count":1306643,"meanings":[{"definitions":[{"definition":"To creep; to move slowly on hands and knees, or by dragging the body along the ground.","example":"Clutching my wounded side, I crawled back to the trench."},{"definition":"To move forward slowly, with frequent stops.","example":"The rush-hour traffic crawled around the bypass."},{"definition":"To act in a servile manner.","example":"Don't come crawling to me with your useless apologies!"},{"definition":"(with \"with\") See crawl with."},{"definition":"To feel a swarming sensation.","example":"The horrible sight made my skin crawl."},{"definition":"To swim using the crawl stroke.","example":"I think I'll crawl the next hundred metres."},{"definition":"To move over an area on hands and knees.","example":"The baby crawled the entire second floor."},{"definition":"To visit while becoming inebriated.","example":"They crawled the downtown bars."},{"definition":"To visit files or web sites in order to index them for searching.","example":"Yahoo Search has updated its Slurp Crawler to crawl web sites faster and more efficiently."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The motion of something that crawls."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹɔːlɪŋ/"}]},{"word":"POSTOPERATIVE","idx":22481,"count":1306536,"meanings":[{"definitions":[{"definition":"A transgender person who has undergone gender reassignment surgery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or occurring in the period after a surgical operation.","example":"The postoperative procedure is as follows."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/poʊstˈɑpəɹətɪv/"},{"text":"/pəʊstˈɒpəɹətɪv/"}]},{"word":"MODIFIER","idx":22482,"count":1306506,"meanings":[{"definitions":[{"definition":"One who, or that which, modifies."},{"definition":"(grammar) A word, phrase, or clause that limits or qualifies the sense of another word or phrase."},{"definition":"A keyword that qualifies the meaning of other code."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɑdɪfaɪɚ/"},{"text":"/ˈmɒdɪfaɪə/"}]},{"word":"CYTOLOGY","idx":22483,"count":1306449,"meanings":[{"definitions":[{"definition":"The study of cells."},{"definition":"Cytopathology."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/saɪˈtɑləd͡ʒi/"},{"text":"/saɪˈtɒləd͡ʒi/"}]},{"word":"NYE","idx":22484,"count":1306440,"meanings":[{"definitions":[{"definition":"A brood or flock of pheasants."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/naɪ/"}]},{"word":"BIENNIAL","idx":22485,"count":1306238,"meanings":[{"definitions":[{"definition":"A plant that requires two years to complete its life-cycle, germinating and growing in its first year, then producing its flowers and fruit in its second year, after which it usually dies"},{"definition":"An event that happens every two years"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Happening every two years."},{"definition":"Lasting for two years."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"biennial-us","text":"/baɪˈɛnɪəl/"}]},{"word":"CIRCUITRY","idx":22488,"count":1305986,"meanings":[{"definitions":[{"definition":"A specific system of electrical circuits in a particular device; the design of such a system."},{"definition":"Electrical (or, by extension, other) circuits considered as a group."},{"definition":"The brain's neural network."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"circuitry-uk","text":"/ˈsɜːkɪtɹi/"}]},{"word":"MUCK","idx":22491,"count":1305552,"meanings":[{"definitions":[{"definition":"(slimy) mud, sludge.","example":"I need to clean the muck off my shirt."},{"definition":"Soft (or slimy) manure."},{"definition":"Anything filthy or vile. Dirt; something that makes another thing dirty.","example":"What's that green muck on the floor?"},{"definition":"Grub, slop, swill"},{"definition":"Money"},{"definition":"The pile of discarded cards."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shovel muck.","example":"We need to muck the stable before it gets too thick."},{"definition":"To manure with muck."},{"definition":"To do a dirty job."},{"definition":"To pass, to fold without showing one's cards, often done when a better hand has already been revealed."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"muck-us","text":"/mʌk/"}]},{"word":"TWEAKS","idx":22493,"count":1305012,"meanings":[{"definitions":[{"definition":"A sharp pinch or jerk; a twist or twitch.","example":"a tweak of the nose"},{"definition":"A slight adjustment or modification.","example":"He is running so many tweaks it is hard to remember how it looked originally."},{"definition":"Trouble; distress; tweag."},{"definition":"A prostitute."},{"definition":"An additional input to a block cipher, used in conjunction with the key to select the permutation computed by the cipher."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pinch and pull with a sudden jerk and twist; to twitch.","example":"to tweak the nose."},{"definition":"To adjust slightly; to fine-tune.","example":"If we tweak the colors towards blue, it will look more natural."},{"definition":"To twit or tease."},{"definition":"To abuse methamphetamines, especially crystal meth."},{"definition":"To exhibit symptoms of methamphetamine abuse, such as extreme nervousness, compulsiveness, erratic motion, excitability; possibly a blend of twitch and freak."},{"definition":"To exhibit extreme nervousness, evasiveness when confronted by law enforcement or other authority (e.g., customs agents, border patrol, teacher, etc.), mimicking methamphetamine abuse symptoms."}],"partOfSpeech":"ve"}]}]