[{"word":"REPUTED","idx":35946,"count":587127,"meanings":[{"definitions":[{"definition":"To attribute or credit something to something; to impute."},{"definition":"To consider, think, esteem, reckon (a person or thing) to be, or as being, something"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Accorded a reputation."},{"definition":"Supposed or assumed to be true."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈpju.tɪd/"}]},{"word":"WALKWAYS","idx":35951,"count":586893,"meanings":[{"definitions":[{"definition":"A clearly defined path for pedestrians."}],"partOfSpeech":"n"}]},{"word":"SEDUCE","idx":35952,"count":586830,"meanings":[{"definitions":[{"definition":"To beguile or lure (someone) away from duty, accepted principles, or proper conduct; to lead astray."},{"definition":"To entice or induce (someone) to engage in a sexual relationship."},{"definition":"(by extension) To have sexual intercourse with.","example":"He had repeatedly seduced the girl in his car, hotels and his home."},{"definition":"To win over or attract.","example":"He was seduced by the bright lights and glamour of the city."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"seduce-us","text":"/sɪˈd(j)uːs/"},{"audio":"seduce-uk","text":"/sɪˈdjuːs/"}]},{"word":"BEARERS","idx":35955,"count":586762,"meanings":[{"definitions":[{"definition":"One who, or that which, bears, sustains, or carries."},{"definition":"Someone who helps carry the coffin or a dead body during a funeral procession."},{"definition":"One who possesses a cheque, bond, or other notes promising payment.","example":"I promise to pay the bearer on demand."},{"definition":"A domestic servant or palanquin carrier."},{"definition":"A tree or plant yielding fruit.","example":"a good bearer"},{"definition":"Someone who delivers a letter or message on behalf of another (especially as referred to in the letter or message)."},{"definition":"A strip of reglet or other furniture to bear off the impression from a blank page."},{"definition":"A type or type-high piece of metal interspersed in blank parts to support the plate when it is shaved."}],"partOfSpeech":"n"}]},{"word":"KIMONO","idx":35956,"count":586714,"meanings":[{"definitions":[{"definition":"A traditional Japanese robe-like garment which wraps around the body and is now generally worn only on formal occasions."},{"definition":"A yukata."},{"definition":"A long robe-like garment in Western fashion, which may be open at the front, loosely inspired by the Japanese garment."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"kimono-us","text":"/kəˈmoʊnoʊ/"}]},{"word":"GUESSES","idx":35957,"count":586707,"meanings":[{"definitions":[{"definition":"To reach a partly (or totally) unqualified conclusion."},{"definition":"To solve by a correct conjecture; to conjecture rightly.","example":"He who guesses the riddle shall have the ring."},{"definition":"To suppose (introducing a proposition of uncertain plausibility).","example":"That album is quite hard to find, but I guess you could try ordering it online."},{"definition":"To think, conclude, or decide (without a connotation of uncertainty). Usually in first person: \"I guess\".","example":"\"I guess I'll go to bed.\""},{"definition":"To hit upon or reproduce by memory."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A prediction about the outcome of something, typically made without factual evidence or support.","example":"If you don't know the answer, take a guess."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɛsɪz/"}]},{"word":"OXIDIZED","idx":35958,"count":586703,"meanings":[{"definitions":[{"definition":"To combine with oxygen or otherwise make an oxide."},{"definition":"To increase the valence (or the positive charge) of an element by removing electrons."},{"definition":"To coat something with an oxide."},{"definition":"To become oxidized."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has reacted with oxygen, or been modified by oxidation"}],"partOfSpeech":"j"}]},{"word":"BUGFIX","idx":35959,"count":586700,"meanings":[{"definitions":[{"definition":"A patch or change that fixes unwanted behaviour due to a bug."}],"partOfSpeech":"n"}]},{"word":"SHARIF","idx":35960,"count":586651,"meanings":[{"definitions":[{"definition":"A traditional Arab tribal title given to those who serve as the protector of the tribe and all tribal assets."}],"partOfSpeech":"n"}]},{"word":"BLOODSTREAM","idx":35962,"count":586625,"meanings":[{"definitions":[{"definition":"The flow of blood through the circulatory system of an animal"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bloodstream-us"},{"text":"/ˈblʌd.stɹɪim/"}]},{"word":"UNDERPINNING","idx":35964,"count":586589,"meanings":[{"definitions":[{"definition":"To support from below with props or masonry.","example":"You should underpin the mine roof to prevent further collapse."},{"definition":"To give support to; to corroborate.","example":"Public confidence in politicians must underpin our democracy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A support or foundation, especially as a structure of masonry that supports a wall.","example":"This house's underpinning is not up to standard."},{"definition":"A basis for something.","example":"I would like to know more about the underpinning of this political theory."},{"definition":"The lower body or legs."}],"partOfSpeech":"n"}]},{"word":"RESISTIVITY","idx":35965,"count":586588,"meanings":[{"definitions":[{"definition":"The resistance offered at a particular temperature by an electrical conductor of any given material in a cube of unit length, expressed in ohm-metres (Ωm) in the metric system of measurement."},{"definition":"The reciprocal of thermal conductivity, having SI unit: m K W-1"}],"partOfSpeech":"n"}]},{"word":"IMPOSSIBILITY","idx":35966,"count":586554,"meanings":[{"definitions":[{"definition":"Something that is impossible.","example":"Meeting the deadline is an impossibility; there is no way we can be ready in time."},{"definition":"The quality of being impossible."},{"definition":"The state of being unable to do something."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪmˌpɑsɪˈbɪliti/"},{"text":"/ɪmˌpɒsɪˈbɪliti/"}]},{"word":"CONFORMAL","idx":35969,"count":586464,"meanings":[{"definitions":[{"definition":"That conforms, especially to the shape of something."},{"definition":"(of a transformation) That preserves angles between intersecting curves."},{"definition":"(of a map projection) That preserves relative angles over small scales, at all but a limited number of distinct points.","example":"On conformal map projections, the scale depends on location only and not direction."}],"partOfSpeech":"j"}]},{"word":"RACQUETS","idx":35970,"count":586445,"meanings":[{"definitions":[{"definition":"An implement with a handle connected to a round frame strung with wire, sinew, or plastic cords, and used to hit a ball, such as in tennis, or a shuttlecock in badminton."},{"definition":"A game for two or four players, played in an enclosed court with a small hard fast-moving ball"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit with a racquet."},{"definition":"To play a game that involves using a racquet."},{"definition":"To dart about in a manner reminiscent of a ball hit by a racquet."},{"definition":"To exchange back and forth, similar to the way a tennis ball volleys back and forth."}],"partOfSpeech":"ve"}]},{"word":"COURANT","idx":35971,"count":586440,"meanings":[{"definitions":[{"definition":"A piece of music in triple time."},{"definition":"A lively dance; a coranto."},{"definition":"A circulating gazette of news; a newspaper."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Represented as running.","example":"a classical lion courant"}],"partOfSpeech":"j"}]},{"word":"INVASIONS","idx":35974,"count":586379,"meanings":[{"definitions":[{"definition":"A military action consisting of armed forces of one geopolitical entity entering territory controlled by another such entity, generally with the objective of conquering territory or altering the established government."},{"definition":"The entry without consent of an individual or group into an area where they are not wanted.","example":"an invasion of bees"},{"definition":"The spread of cancer cells, bacteries and such to the organism."},{"definition":"The breaching of the skin barrier."}],"partOfSpeech":"n"}]},{"word":"EMINENCE","idx":35975,"count":586334,"meanings":[{"definitions":[{"definition":"Someone of high rank, reputation or social status."},{"definition":"The quality or state of being eminent."},{"definition":"Prominence in a particular order or accumulation; esteem."},{"definition":"An elevated land area or a hill."},{"definition":"A protuberance."},{"definition":"A dark purple color."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛmɪnəns/"}]},{"word":"MOA","idx":35977,"count":586245,"meanings":[{"definitions":[{"definition":"Any of several species of large, extinct, flightless birds of the family Dinornithidae that were native to New Zealand; until its extinction, one species was the largest bird in the world."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈməʊə/"},{"text":"/ˈmoə/"}]},{"word":"CANNA","idx":35979,"count":586192,"meanings":[{"definitions":[{"definition":"Any member of the genus Canna of tropical plants with large leaves and often showy flowers."},{"definition":"A measure of length in Italy, varying from six to seven feet."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkænə/"}]},{"word":"POTTERS","idx":35980,"count":586134,"meanings":[{"definitions":[{"definition":"One who makes pots and other ceramic wares."},{"definition":"One who places flowers or other plants inside their pots."},{"definition":"One who pots meats or other eatables."},{"definition":"One who hawks crockery or earthenware."},{"definition":"The red-bellied terrapin, Pseudemys rubriventris (species of turtle)."},{"definition":"The chicken turtle, Deirochelys reticularia."}],"partOfSpeech":"n"}]},{"word":"DETERGENTS","idx":35981,"count":586127,"meanings":[{"definitions":[{"definition":"Any non-soap cleaning agent, especially a synthetic surfactant."}],"partOfSpeech":"n"}]},{"word":"LIBERATE","idx":35983,"count":586056,"meanings":[{"definitions":[{"definition":"To set free, to make or allow to be free, particularly"},{"definition":"To acquire from an enemy during wartime, used especially of cities, regions, and other population centers."},{"definition":"To acquire from another by theft or force: to steal, to rob.","example":"We didn't need IDs. We just liberated these beers from the back of the shop."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈlɪbəɹeɪt/"}]},{"word":"BOMBARDIER","idx":35985,"count":586022,"meanings":[{"definitions":[{"definition":"A bomber crew member who sights and releases bombs."},{"definition":"A non-commissioned officer rank in artillery, equivalent to corporal. Abbreviated Bdr.","example":"Wikipedia: Bombardier (Bdr) and Lance Bombardier (LBdr or L/Bdr) are British Army ranks used in the Royal Artillery and Royal Horse Artillery instead of (respectively) Corporal and Lance Corporal. In the Canadian Forces, the Artillery Branch uses the ranks of Master Bombardier and Bombardier instead of Master Corporal and Corporal."},{"definition":"An artilleryman; a gunner."},{"definition":"A bombardier beetle."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bombardier-uk","text":"/ˌbɒm.bəˈdɪə/"}]},{"word":"CYTOTOXIC","idx":35987,"count":586015,"meanings":[{"definitions":[{"definition":"Any cytotoxic substance; a cytotoxin."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or being a cytotoxin."},{"definition":"Of or relating to cytotoxicity."}],"partOfSpeech":"j"}]},{"word":"FRAG","idx":35988,"count":586002,"meanings":[{"definitions":[{"definition":"A fragmentation grenade."},{"definition":"A successful kill in a deathmatch game.","example":"I'd been fighting him for ages, and then you stole my frag!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deliberately kill (one's superior officer) with a fragmentation grenade."},{"definition":"To hit with the explosion of a fragmentation grenade."},{"definition":"To kill.","example":"I fragged him but he fell off the ledge afterwards."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"frag-au","text":"/fɹæɡ/"}]},{"word":"COLOPHON","idx":35991,"count":585944,"meanings":[{"definitions":[{"definition":"In manuscripts (typically before the invention of printing), the note, usually at the end, left by the scribe who copied it, giving information on his exemplar, where and when the copy was made, and sometimes, his own name."},{"definition":"A printer's or publisher's identifying inscription or logo appearing at the front or end of a book, or the same appearing on the spine or dust-jacket. It generally contains factual information about the book, especially about its production, and includes details about typographic style, the fonts used, the paper used, and perhaps the binding method of the book. Also used in a similar fashion for newspapers, magazines, and academic journals."},{"definition":"A page on a website identifying the details of its creation, such as the author's name and the technologies used."},{"definition":"A finishing stroke or crowning touch."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɒləfən/"}]},{"word":"HANGED","idx":35992,"count":585915,"meanings":[{"definitions":[{"definition":"To be or remain suspended.","example":"The lights hung from the ceiling."},{"definition":"To float, as if suspended.","example":"The smoke hung in the room."},{"definition":"(of a ball in cricket, tennis, etc.) To rebound unexpectedly or unusually slowly, due to backward spin on the ball or imperfections of the ground."},{"definition":"To hold or bear in a suspended or inclined manner or position instead of erect.","example":"He hung his head in shame."},{"definition":"To cause (something) to be suspended, as from a hook, hanger, hinges or the like.","example":"Hang those lights from the ceiling."},{"definition":"To execute (someone) by suspension from the neck.","example":"The culprits were hanged from the nearest tree."},{"definition":"To be executed by suspension by one's neck from a gallows, a tree, or other raised bar, attached by a rope tied into a noose.","example":"You will hang for this, my friend."},{"definition":"(used in maledictions) To damn."},{"definition":"To loiter, hang around, to spend time idly.","example":"Are you busy, or can you hang with me?  I didn't see anything, officer. I was just hanging."},{"definition":"To exhibit (an object) by hanging."},{"definition":"To apply (wallpaper or drywall to a wall).","example":"Let's hang this cute animal design in the nursery."},{"definition":"To decorate (something) with hanging objects.","example":"Let's hang the nursery with some new wallpaper."},{"definition":"To remain persistently in one's thoughts."},{"definition":"To prevent from reaching a decision, especially by refusing to join in a verdict that must be unanimous.","example":"One obstinate juror can hang a jury."},{"definition":"To stop responding to manual input devices such as keyboard and mouse.","example":"The computer has hung again. Not even pressing ++ works.  When I push this button the program hangs."},{"definition":"To cause (a program or computer) to stop responding.","example":"The program has a bug that can hang the system."},{"definition":"To cause (a piece) to become vulnerable to capture.","example":"If you move there, you'll hang your rook."},{"definition":"To be vulnerable to capture.","example":"In this standard opening position White has to be careful because the pawn on e4 hangs."},{"definition":"Of a pitcher, to throw a hittable off-speed pitch."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hanged-us"},{"text":"/ˈhæŋd/"}]},{"word":"FLATTER","idx":35994,"count":585847,"meanings":[{"definitions":[{"definition":"Having no variations in height.","example":"The land around here is flat."},{"definition":"(voice) Without variations in pitch."},{"definition":"Having small or invisible breasts and/or buttocks.","example":"That girl is completely flat on both sides."},{"definition":"(note) Lowered by one semitone."},{"definition":"Of a note or voice, lower in pitch than it should be.","example":"Your A string is too flat."},{"definition":"(of a tire or other inflated object) Deflated, especially because of a puncture."},{"definition":"Uninteresting.","example":"The party was a bit flat."},{"definition":"(of a carbonated drink) With all or most of its carbon dioxide having come out of solution so that the drink no longer fizzes or contains any bubbles."},{"definition":"Lacking acidity without being sweet."},{"definition":"(of a battery) Unable to emit power; dead."},{"definition":"(of a throw) Without spin; spinless."},{"definition":"Lacking liveliness or action; depressed; dull and boring.","example":"The dialogue in your screenplay is flat -- you need to make it more exciting."},{"definition":"Absolute; downright; peremptory.","example":"His claim was in flat contradiction to experimental results."},{"definition":"(of a consonant) sonant; vocal, as distinguished from a sharp (non-sonant) consonant"},{"definition":"(grammar) Not having an inflectional ending or sign, such as a noun used as an adjective, or an adjective as an adverb, without the addition of a formative suffix; or an infinitive without the sign \"to\".","example":"Many flat adverbs, as in 'run fast', 'buy cheap', etc. are from Old English."},{"definition":"(of a golf club) Having a head at a very obtuse angle to the shaft."},{"definition":"(of certain fruits) Flattening at the ends."},{"definition":"(authorship, especially of a character) Lacking in depth, substance, or believability; underdeveloped; one-dimensional.","example":"The author added a chapter to flesh out the books' flatter characters."},{"definition":"Fixed; unvarying.","example":"a flat fare on public transport"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To compliment someone, often insincerely and sometimes to win favour."},{"definition":"To enhance someone's vanity by praising them."},{"definition":"To portray someone to advantage.","example":"Her portrait flatters her."},{"definition":"To encourage or cheer someone with (usually false) hope."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A type of set tool used by blacksmiths."},{"definition":"A flat-faced fulling hammer."},{"definition":"A drawplate with a narrow, rectangular orifice, for drawing flat strips such as watch springs."},{"definition":"Someone who flattens, purposely or accidently. Also flattener."},{"definition":"Someone who lives in a rented flat."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"flatter-us","text":"/ˈflætɚ/"}]}]