[{"word":"EATER","idx":19320,"count":1702828,"meanings":[{"definitions":[{"definition":"One who eats."},{"definition":"An eating apple."},{"definition":"One who performs fellatio or cunnilingus."},{"definition":"A configuration of cells that appears to consume another configuration by gradually causing it to disappear."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈiːtɚ/"},{"text":"/ˈiːtə/"}]},{"word":"TUNERS","idx":19322,"count":1702332,"meanings":[{"definitions":[{"definition":"A person who tunes a piano or organ."},{"definition":"A device, electronic or mechanical, that helps a person tune a musical instrument by showing the deviation of the played pitch from the desired pitch."},{"definition":"On a musical instrument, a peg or mechanical device that changes the tension, and hence pitch, of a string."},{"definition":"The component of an audio system that receives radio broadcasts."},{"definition":"One who sings or makes music."},{"definition":"(entertainment industry) A musical."}],"partOfSpeech":"n"}]},{"word":"UTOPIA","idx":19323,"count":1702159,"meanings":[{"definitions":[{"definition":"A world in which everything and everyone works in perfect harmony."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/juˈtoʊ.pi.ə/"},{"text":"/juːˈtəʊ.pi.ə/"}]},{"word":"SLIDER","idx":19324,"count":1702058,"meanings":[{"definitions":[{"definition":"An item of play equipment that children can climb up and then slide down again.","example":"The long, red slide was great fun for the kids."},{"definition":"A surface of ice, snow, butter, etc. on which someone can slide for amusement or as a practical joke."},{"definition":"The falling of large amounts of rubble, earth and stones down the slope of a hill or mountain; avalanche.","example":"The slide closed the highway."},{"definition":"An inclined plane on which heavy bodies slide by the force of gravity, especially one constructed on a mountainside for conveying logs by sliding them down."},{"definition":"A mechanism consisting of a part which slides on or against a guide."},{"definition":"The act of sliding; smooth, even passage or progress.","example":"a slide on the ice"},{"definition":"A lever that can be moved in two directions."},{"definition":"A valve that works by sliding, such as in a trombone."},{"definition":"A transparent plate bearing an image to be projected to a screen."},{"definition":"(by extension) A page of a computer presentation package such as PowerPoint.","example":"I still need to prepare some slides for my presentation tomorrow."},{"definition":"A flat, usually rectangular piece of glass or similar material on which a prepared sample may be viewed through a microscope Generally referred to as a microscope slide."},{"definition":"The act of dropping down and skidding into a base"},{"definition":"(guitar) A hand-held device made of smooth, hard material, used in the practice of slide guitar."},{"definition":"A lively dance from County Kerry, in 12/8 time."},{"definition":"A small dislocation in beds of rock along a line of fissure."},{"definition":"A grace consisting of two or more small notes moving by conjoint degrees, and leading to a principal note either above or below."},{"definition":"A sound which, by a gradual change in the position of the vocal organs, passes imperceptibly into another sound."},{"definition":"A clasp or brooch for a belt, etc."},{"definition":"(footwear) A shoe that is backless and open-toed."},{"definition":"(speech therapy) A voluntary stutter used as a technique to control stuttering in one's speech."},{"definition":"Agent noun of slide: one who slides."},{"definition":"A sliding door."},{"definition":"A pitch thrown with added pressure by middle and ring fingers yielding a combination of backspin and sidespin, resulting in a motion to the left when thrown by a right handed pitcher."},{"definition":"A similar delivery in which the wrist and ring finger work to impart backspin to the ball."},{"definition":"A small hamburger.","example":"We ordered five sliders."},{"definition":"A piece of Teflon or similar material attached to a curling shoe that allows the player to slide along the ice."},{"definition":"The movable part of a zip fastener that opens or closes the row of teeth."},{"definition":"A widget allowing the user to select a value or position on a sliding scale."},{"definition":"A slideshow on a web page."},{"definition":"The red-bellied terrapin (Pseudemys rubriventris, syn. Pseudemys rugosa)."},{"definition":"(skydiving) A rectangle of fabric that helps produce an orderly parachute deployment."},{"definition":"An open-toed and backless sandal"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈslaɪdɚ/"},{"audio":"slider-au"}]},{"word":"INSISTS","idx":19325,"count":1702056,"meanings":[{"definitions":[{"definition":"(with on or upon or (that + ordinary verb form)) To hold up a claim emphatically.","example":"I insist that my secretary dresses nicely."},{"definition":"(sometimes with on or upon or (that + subjunctive)) To demand continually that something happen or be done.","example":"I insist that my secretary dress nicely."},{"definition":"To stand (on); to rest (upon); to lean (upon)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪnˈsɪsts/"}]},{"word":"LETTERING","idx":19330,"count":1701761,"meanings":[{"definitions":[{"definition":"To print, inscribe, or paint letters on something."},{"definition":"(scholastic) To earn a varsity letter (award)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Written, especially printed, text."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lettering-us"}]},{"word":"DADS","idx":19331,"count":1701718,"meanings":[{"definitions":[{"definition":"A father, a male parent.","example":"His dad was always there for him."},{"definition":"(familiar) Used to address one's father","example":"Happy Father's Day, Dad!"},{"definition":"Used to address an older adult male"},{"definition":"A lump or piece."},{"definition":"A blow; act of striking something."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dads-us","text":"/dædz/"}]},{"word":"POURING","idx":19335,"count":1701428,"meanings":[{"definitions":[{"definition":"To cause (liquid, or liquid-like substance) to flow in a stream, either out of a container or into it.","example":"pour water from a jug"},{"definition":"To send out as in a stream or a flood; to cause (an emotion) to come out; to cause to escape."},{"definition":"To send forth from, as in a stream; to discharge uninterruptedly."},{"definition":"To flow, pass or issue in a stream; to fall continuously and abundantly.","example":"the rain poured down."},{"definition":"To rain hard.","example":"It's pouring outside."},{"definition":"Of a beverage, to be on tap or otherwise available for serving to customers."},{"definition":"To move in a throng, as a crowd.","example":"The people poured out of the theater."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is poured."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pouring-us","text":"/ˈpɔːɹɪŋ/"}]},{"word":"HAYS","idx":19336,"count":1700861,"meanings":[{"definitions":[{"definition":"Grass cut and dried for use as animal fodder."},{"definition":"Any mix of green leafy plants used for fodder."},{"definition":"Cannabis; marijuana."},{"definition":"A net set around the haunt of an animal, especially a rabbit."},{"definition":"A hedge."},{"definition":"A net placed around the lair or burrow of an animal."},{"definition":"An enclosure, haw."},{"definition":"A circular country dance."},{"definition":"The letter for the h sound in Pitman shorthand."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut grasses or herb plants for use as animal fodder."},{"definition":"To lay snares for rabbits."}],"partOfSpeech":"ve"}]},{"word":"CONCENTRATING","idx":19338,"count":1700803,"meanings":[{"definitions":[{"definition":"To bring to, or direct toward, a common center; to unite more closely; to gather into one body, mass, or force.","example":"to concentrate rays of light into a focus"},{"definition":"To increase the strength and diminish the bulk of, as of a liquid or an ore; to intensify, by getting rid of useless material; to condense.","example":"to concentrate acid by evaporation"},{"definition":"To approach or meet in a common center; to consolidate.","example":"Population tends to concentrate in cities."},{"definition":"To focus one's thought or attention (on).","example":"Let me concentrate!"}],"partOfSpeech":"ve"}]},{"word":"SOAK","idx":19339,"count":1700767,"meanings":[{"definitions":[{"definition":"An immersion in water etc.","example":"After the strenuous climb, I had a nice long soak in a bath."},{"definition":"A drunkard."},{"definition":"A carouse; a drinking session."},{"definition":"A low-lying depression that fills with water after rain."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be saturated with liquid by being immersed in it.","example":"I'm going to soak in the bath for a couple of hours."},{"definition":"To immerse in liquid to the point of saturation or thorough permeation.","example":"Soak the beans overnight before cooking."},{"definition":"To penetrate or permeate by saturation.","example":"The water soaked into my shoes and gave me wet feet."},{"definition":"To allow (especially a liquid) to be absorbed; to take in, receive. (usually + up)","example":"A sponge soaks up water; the skin soaks in moisture."},{"definition":"To take money from."},{"definition":"To drink intemperately or gluttonously."},{"definition":"To heat (a metal) before shaping it."},{"definition":"To hold a kiln at a particular temperature for a given period of time.","example":"We should soak the kiln at cone 9 for half an hour."},{"definition":"To absorb; to drain."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/soʊk/"},{"text":"/səʊk/"},{"audio":"soak-au"}]},{"word":"COURTROOM","idx":19341,"count":1700697,"meanings":[{"definitions":[{"definition":"The room where a judge presides over hearings and trials, sometimes with a jury."}],"partOfSpeech":"n"}]},{"word":"HIDES","idx":19342,"count":1700672,"meanings":[{"definitions":[{"definition":"To put (something) in a place where it will be harder to discover or out of sight.","example":"He hides his magazines under the bed."},{"definition":"To put oneself in a place where one will be harder to find or out of sight."},{"definition":"To beat with a whip made from hide."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The skin of an animal."},{"definition":"The human skin."},{"definition":"(usually United States) One's own life or personal safety, especially when in peril."},{"definition":"(mainly British) A covered structure from which hunters, birdwatchers, etc can observe animals without scaring them."},{"definition":"A secret room for hiding oneself or valuables; a hideaway."},{"definition":"A covered structure to which a pet animal can retreat, as is recommended for snakes."},{"definition":"A unit of land and tax assessment of varying size, originally as intended to support one household with dependents."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/haɪdz/"}]},{"word":"MANURE","idx":19344,"count":1700070,"meanings":[{"definitions":[{"definition":"Animal excrement, especially that of common domestic farm animals and when used as fertilizer. Generally speaking, from cows, horses, sheep, pigs and chickens."},{"definition":"Any fertilizing substance, whether of animal origin or not; fertiliser."},{"definition":"Rubbish; nonsense; bullshit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cultivate by manual labor; to till; hence, to develop by culture."},{"definition":"To apply manure (as fertilizer or soil improver).","example":"The farmer manured his fallow field."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"manure-us","text":"/məˈn(j)ʊɹ/"}]},{"word":"SAVIOR","idx":19345,"count":1699881,"meanings":[{"definitions":[{"definition":"A person who saves someone, rescues another from harm."},{"definition":"A child who is born to provide an organ or cell transplant to a sibling who has an otherwise fatal disease (used in combination, with \"sibling\", \"baby\", \"child\", \"brother\", \"sister\", etc.)"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈseɪvjɚ/"},{"text":"/ˈseɪvjə/"}]},{"word":"SECRECY","idx":19347,"count":1699243,"meanings":[{"definitions":[{"definition":"Concealment; the condition of being secret or hidden."},{"definition":"The habit of keeping secrets."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"secrecy-us","text":"/ˈsiːkɹəsi/"}]},{"word":"BAHT","idx":19349,"count":1698791,"meanings":[{"definitions":[{"definition":"The official currency of Thailand, equal to 100 satang."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Without (Yorkshire dialect, famously part of the song title On Ilkla Moor Baht 'at)"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/bɑːt/"}]},{"word":"DUPLICATED","idx":19350,"count":1698585,"meanings":[{"definitions":[{"definition":"To make a copy of.","example":"Can you duplicate this kind of key?"},{"definition":"To do repeatedly; to do again.","example":"You don't need to duplicate my efforts."},{"definition":"To produce something equal to.","example":"He found it hard to duplicate the skills of his wife."}],"partOfSpeech":"ve"}]},{"word":"DREAMED","idx":19351,"count":1698003,"meanings":[{"definitions":[{"definition":"To see imaginary events in one's mind while sleeping."},{"definition":"To hope, to wish."},{"definition":"To daydream.","example":"Stop dreaming and get back to work."},{"definition":"To envision as an imaginary experience (usually when asleep).","example":"I dreamed a vivid dream last night."},{"definition":"To consider the possibility (of).","example":"I wouldn't dream of snubbing you in public."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dreamed-us","text":"/ˈdɹiːmd/"}]},{"word":"RELOCATING","idx":19352,"count":1697908,"meanings":[{"definitions":[{"definition":"To move (something) from one place to another.","example":"We had to relocate the magazine rack because we bruised our shins on it too frequently when it was near the door."},{"definition":"To change one's domicile or place of business.","example":"Alfred relocated to Colorado Springs to take advantage of the boom in the defense industry."}],"partOfSpeech":"ve"}]},{"word":"FERTILE","idx":19353,"count":1697599,"meanings":[{"definitions":[{"definition":"(of land etc) capable of growing abundant crops; productive"},{"definition":"Capable of reproducing; fecund, fruitful"},{"definition":"Capable of developing past the egg stage"},{"definition":"(of an imagination etc) productive or prolific"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fertile-us","text":"/ˈfɝːtaɪl/"}]},{"word":"HINGES","idx":19354,"count":1697406,"meanings":[{"definitions":[{"definition":"A jointed or flexible device that allows the pivoting of a door etc."},{"definition":"A naturally occurring joint resembling such hardware in form or action, as in the shell of a bivalve."},{"definition":"A stamp hinge, a folded and gummed paper rectangle for affixing postage stamps in an album."},{"definition":"A principle, or a point in time, on which subsequent reasonings or events depend.","example":"This argument was the hinge on which the question turned."},{"definition":"The median of the upper or lower half of a batch, sample, or probability distribution."},{"definition":"One of the four cardinal points, east, west, north, or south."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attach by, or equip with a hinge."},{"definition":"(with on or upon) To depend on something."},{"definition":"The breaking off of the distal end of a knapped stone flake whose presumed course across the face of the stone core was truncated prematurely, leaving not a feathered distal end but instead the scar of a nearly perpendicular break.","example":"The flake hinged at an inclusion in the core."},{"definition":"To bend."}],"partOfSpeech":"ve"}]},{"word":"PLAUSIBLE","idx":19355,"count":1697354,"meanings":[{"definitions":[{"definition":"Seemingly or apparently valid, likely, or acceptable; conceivably true or likely","example":"a plausible excuse"},{"definition":"Obtaining approbation; specifically pleasing; apparently right; specious.","example":"a plausible pretext; plausible manners; a plausible delusion"},{"definition":"Worthy of being applauded; praiseworthy; commendable; ready."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"plausible-us"},{"text":"/ˈplɔːz.ə.bəl/"}]},{"word":"CREEPY","idx":19356,"count":1697316,"meanings":[{"definitions":[{"definition":"Moving by creeping along."},{"definition":"Producing an uneasy fearful sensation, as of things crawling over one's skin."},{"definition":"Feeling an uneasy fearful sensation; creeped out."},{"definition":"Strangely repulsive.","example":"That creepy old man keeps leering at me!"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹipi/"},{"text":"/ˈkɹiːpi/"}]},{"word":"SYNTH","idx":19357,"count":1697095,"meanings":[{"definitions":[{"definition":"A musical synthesizer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play on a musical synthesizer."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"synth-au","text":"/sɪnθ/"}]},{"word":"FILTHY","idx":19358,"count":1697059,"meanings":[{"definitions":[{"definition":"To make very dirty; to cover in filth."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Covered with filth; very dirty."},{"definition":"Obscene or offensive."},{"definition":"Very unpleasant or disagreeable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"filthy-us","text":"/ˈfɪlθi/"}]},{"word":"NARRATOR","idx":19361,"count":1696653,"meanings":[{"definitions":[{"definition":"One who narrates or tells stories."},{"definition":"The person or the \"voice\" whose viewpoint is used in telling a story."},{"definition":"The person providing the voice-over in a documentary."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"narrator-us","text":"/ˈnæɹeɪtəɹ/"}]},{"word":"OPTIMIZATIONS","idx":19362,"count":1696643,"meanings":[{"definitions":[{"definition":"The design and operation of a system or process to make it as good as possible in some defined sense."}],"partOfSpeech":"n"}]},{"word":"HILLSIDE","idx":19370,"count":1695300,"meanings":[{"definitions":[{"definition":"The side of a hill."}],"partOfSpeech":"n"}]},{"word":"STANDPOINT","idx":19371,"count":1695193,"meanings":[{"definitions":[{"definition":"Point of view; perspective","example":"Bathing once a month may save time, but from a cleanliness standpoint, it's not effective."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"standpoint-us","text":"/ˈstændpɔɪnt/"}]},{"word":"LAYUP","idx":19372,"count":1695143,"meanings":[{"definitions":[{"definition":"A close-range shot in which the shooter banks the ball off the backboard from a few feet away."},{"definition":"A relatively easy task.","example":"Meeting the numbers will be a layup, if not a slam dunk."},{"definition":"The state of being laid up.","example":"The ship endured an interminable layup in the harbor lasting nearly a month."},{"definition":"A track used to store train cars.","example":"The caboose, long decrepit, rested on a forgotten layup just north of the dry riverbed."},{"definition":"A train car sitting in storage (laid up), often overnight.","example":"Though I knew we shouldn't be there, she pulled me out of the tunnel and into the dark layup, its floors still grubby from the morning commute many hours ago."},{"definition":"The process of applying alternate layers of a material and a binding agent to form a composite material.","example":"Forgetting to clear the sawdust around his workshop, Payton ended up contaminating the resin-ply matrix with wood particles during his hand layup."}],"partOfSpeech":"n"}]},{"word":"LAUNDERING","idx":19373,"count":1695135,"meanings":[{"definitions":[{"definition":"To wash; to wash, and to smooth with a flatiron or mangle; to wash and iron."},{"definition":"To lave; to wet."},{"definition":"(money) To disguise the source of (ill-gotten wealth) by various means."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act, or occupation, of one who launders; washing and ironing."}],"partOfSpeech":"n"}]},{"word":"NATIONALIST","idx":19374,"count":1694902,"meanings":[{"definitions":[{"definition":"An advocate of nationalism.","example":"You are either a globalist or a nationalist; one cannot be both."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to nationalism."}],"partOfSpeech":"j"}]},{"word":"PIAZZA","idx":19375,"count":1694892,"meanings":[{"definitions":[{"definition":"A public square, especially in Italian cities."},{"definition":"A veranda; a porch."},{"definition":"A roofed gallery or arcade (for example around a public square or in front of a building)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/piˈæt.sə/"}]},{"word":"DENOTED","idx":19377,"count":1694637,"meanings":[{"definitions":[{"definition":"To indicate; to mark.","example":"The yellow blazes denote the trail."},{"definition":"To make overt."},{"definition":"To refer to literally; to convey as meaning."}],"partOfSpeech":"ve"}]},{"word":"NAZIS","idx":19378,"count":1694605,"meanings":[{"definitions":[{"definition":"A member of the National Socialist German Workers Party (Nationalsozialistische Deutsche Arbeiterpartei, commonly called the NSDAP or Nazi Party)."},{"definition":"One who subscribes to or advocates (neo-)Nazism or a similarly fascist, racist (especially anti-Semitic), xenophobic, ethnic supremacist, or ultranationalist ideology; a neo-Nazi."},{"definition":"(usually derogatory, sometimes offensive, see usage notes below) One who imposes one’s views on others; one who is considered unfairly oppressive or needlessly strict. (also frequently uncapitalised: nazi)","example":"She’s a total grammar Nazi."},{"definition":"A German, a person of German descent, or a person perceived to be of German descent."}],"partOfSpeech":"n"}]},{"word":"ONESELF","idx":19380,"count":1694392,"meanings":[{"definitions":[{"definition":"A person's self: general form of himself, herself, themself or yourself.","example":"Teaching oneself to swim can be dangerous."}],"partOfSpeech":"p"}],"phonetics":[{"audio":"oneself-us","text":"/wʌnˈsɛlf/"}]},{"word":"ROYALTIES","idx":19381,"count":1694261,"meanings":[{"definitions":[{"definition":"The rank, status, power or authority of a monarch."},{"definition":"People of royal rank, plus their families, treated as a group."},{"definition":"A royal right or prerogative, such as the exploitation of a natural resource; the granting of such a right; payment received for such a right."},{"definition":"The payment received by an owner of real property for exploitation of mineral rights in the property."},{"definition":"(by extension) Payment made to a writer, composer, inventor etc for the sale or use of intellectual property, invention etc."},{"definition":"Someone in a privileged position."},{"definition":"A king and a queen as a starting hand in Texas hold 'em."},{"definition":"The bounds of a royal burgh."}],"partOfSpeech":"n"}]},{"word":"NEWBIES","idx":19382,"count":1694214,"meanings":[{"definitions":[{"definition":"A newcomer, someone new to something."},{"definition":"A new user or participant; someone who is extremely new and inexperienced (to a game or activity). A beginner."},{"definition":"Anything recently introduced into a setting, especially something that replaces an older version."}],"partOfSpeech":"n"}]},{"word":"PILES","idx":19384,"count":1694029,"meanings":[{"definitions":[{"definition":"A mass of things heaped together; a heap."},{"definition":"A group or list of related items up for consideration, especially in some kind of selection process.","example":"When we were looking for a new housemate, we put the nice woman on the \"maybe\" pile, and the annoying guy on the \"no\" pile"},{"definition":"A mass formed in layers.","example":"a pile of shot"},{"definition":"A funeral pile; a pyre."},{"definition":"A large amount of money.","example":"He made a pile from that invention of his."},{"definition":"A large building, or mass of buildings."},{"definition":"A bundle of pieces of wrought iron to be worked over into bars or other shapes by rolling or hammering at a welding heat; a fagot."},{"definition":"A vertical series of alternate disks of two dissimilar metals (especially copper and zinc), laid up with disks of cloth or paper moistened with acid water between them, for producing a current of electricity; a voltaic pile, or galvanic pile."},{"definition":"An atomic pile; an early form of nuclear reactor."},{"definition":"The reverse (or tails) of a coin."},{"definition":"A list or league"},{"definition":"A dart; an arrow."},{"definition":"The head of an arrow or spear."},{"definition":"A large stake, or piece of pointed timber, steel etc., driven into the earth or sea-bed for the support of a building, a pier, or other superstructure, or to form a cofferdam, etc."},{"definition":"One of the ordinaries or subordinaries having the form of a wedge, usually placed palewise, with the broadest end uppermost."},{"definition":"(usually in the plural) A hemorrhoid."},{"definition":"Hair, especially when very fine or short; the fine underfur of certain animals. (Formerly countable, now treated as a collective singular.)"},{"definition":"The raised hairs, loops or strands of a fabric; the nap of a cloth."},{"definition":"(piles of) A large amount of.","example":"He must earn piles of money."},{"definition":"Haemorrhoids.","example":"Many women get piles when pregnant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(often used with the preposition \"up\") To lay or throw into a pile or heap; to heap up; to collect into a mass; to accumulate","example":"They were piling up wood on the wheelbarrow."},{"definition":"To cover with heaps; or in great abundance; to fill or overfill; to load.","example":"We piled the camel with our loads."},{"definition":"To add something to a great number."},{"definition":"(of vehicles) To create a hold-up."},{"definition":"To place (guns, muskets, etc.) together in threes so that they can stand upright, supporting each other."},{"definition":"To drive piles into; to fill with piles; to strengthen with piles."},{"definition":"To give a pile to; to make shaggy."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/paɪlz/"}]},{"word":"ABBREVIATION","idx":19385,"count":1693819,"meanings":[{"definitions":[{"definition":"The result of shortening or reducing; abridgment."},{"definition":"A shortened or contracted form of a word or phrase, used to represent the whole, utilizing omission of letters, and sometimes substitution of letters, or duplication of initial letters to signify plurality, including signs such as +, =, @."},{"definition":"The process of abbreviating."},{"definition":"A notation used in music score to denote a direction, as pp or mf."},{"definition":"One or more dashes through the stem of a note, dividing it respectively into quavers, semiquavers, demisemiquavers, or hemidemisemiquavers."},{"definition":"Any convenient short form used as a substitution for an understood or inferred whole."},{"definition":"Loss during evolution of the final stages of the ancestral ontogenetic pattern."},{"definition":"Reduction to lower terms, as a fraction."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"abbreviation-uk","text":"/əˌbɹiː.viˈeɪ.ʃən/"}]},{"word":"VAGINAS","idx":19386,"count":1693739,"meanings":[{"definitions":[{"definition":"The passage leading from the opening of the vulva to the cervix of the uterus for copulation and childbirth in female mammals."},{"definition":"A similar part in some invertebrates."},{"definition":"A sheath-like structure, such as the leaf of a grass that surrounds a stem."},{"definition":"The vulva."}],"partOfSpeech":"n"}]},{"word":"BLANCO","idx":19387,"count":1693499,"meanings":[{"definitions":[{"definition":"To polish using Blanco."}],"partOfSpeech":"ve"}]},{"word":"CRITIQUES","idx":19388,"count":1693193,"meanings":[{"definitions":[{"definition":"The art of criticism."},{"definition":"An essay in which another piece of work is criticised, reviewed, etc."},{"definition":"A point made to criticize something.","example":"Bob liked most of my presentation, but offered three minor critiques."},{"definition":"A critic; one who criticises."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To review something.","example":"I want you to critique this new idea of mine."}],"partOfSpeech":"ve"}]},{"word":"STROLL","idx":19389,"count":1693118,"meanings":[{"definitions":[{"definition":"A wandering on foot; an idle and leisurely walk; a ramble."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wander on foot; to ramble idly or leisurely; to rove."},{"definition":"To go somewhere with ease."},{"definition":"To walk the streets as a prostitute."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stroll-us","text":"/stɹoʊl/"}]},{"word":"ANOMALY","idx":19390,"count":1693007,"meanings":[{"definitions":[{"definition":"A deviation from a rule or from what is regarded as normal; an outlier."},{"definition":"Something or someone that is strange or unusual.","example":"He is an anomaly among his friends in that he's the only one who's unmarried."},{"definition":"Any event or measurement that is out of the ordinary regardless of whether it is exceptional or not.","example":"She disregarded some of the anamolies in the experiment, putting them down to miscalculation."},{"definition":"Any of various angular distances."},{"definition":"A defect or malformation."},{"definition":"A failure of a classical symmetry due to quantum corrections."},{"definition":"An irregularity or disproportion."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"anomaly-us","text":"/əˈnɑməli/"}]},{"word":"THIGHS","idx":19391,"count":1692954,"meanings":[{"definitions":[{"definition":"The upper leg of a human, between the hip and the knee."},{"definition":"That part of the leg of vertebrates (or sometimes other animals) which corresponds to the human thigh in position or function; the tibia of a horse, the tarsus of a bird; the third leg-section of an insect."}],"partOfSpeech":"n"}]},{"word":"BOA","idx":19392,"count":1692885,"meanings":[{"definitions":[{"definition":"Any of a group of large American snakes, of the genus Boa, subfamily Boinae, or family Boidae, including the boa constrictor, the emperor boa of Mexico, and the chevalier boa of Peru."},{"definition":"(plural \"boas\") A type of scarf typically made from feathers."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈboʊ.ə/"},{"text":"/ˈbəʊ.ə/"}]},{"word":"EXPRESSIVE","idx":19393,"count":1692880,"meanings":[{"definitions":[{"definition":"Any word or phrase that expresses (that the speaker, writer, or signer has) a certain attitude toward or information about the referent."},{"definition":"(more narrowly) A word or phrase, belonging to a distinct word class or having distinct morphosyntactic properties, with semantic symbolism (for example, an onomatopoeia), variously considered either a synonym, a hypernym or a hyponym of ideophone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Effectively conveying thought or feeling."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"expressive-us","text":"/ɪkˈspɹɛsɪv/"}]},{"word":"INFECT","idx":19394,"count":1692791,"meanings":[{"definitions":[{"definition":"To bring into contact with a substance that causes illness (a pathogen).","example":"Not everyone will be infected when an epidemic strikes."},{"definition":"To make somebody enthusiastic about one's own passion.","example":"Her passion for dancing has infected me."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Infected."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈfɛkt/"}]},{"word":"BEZEL","idx":19395,"count":1692595,"meanings":[{"definitions":[{"definition":"The sloping edge or face on a cutting tool."},{"definition":"The oblique side or face of a cut gem; especially the upper faceted portion of a brilliant (diamond), which projects from its setting."},{"definition":"The rim and flange which encompasses and fastens a jewel or other object, such as the crystal of a watch, in the cavity in which it is set; the collet."},{"definition":"The panel that covers the front of a computer case, or the panel covering each drive bay that can be removed to install a removable drive that requires external access, such as a CD/DVD-ROM drive, which usually has its own preinstalled bezel."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bezel-us","text":"/ˈbɛz.əl/"}]},{"word":"AVATARS","idx":19396,"count":1692560,"meanings":[{"definitions":[{"definition":"The incarnation of a deity, particularly Vishnu."},{"definition":"The physical embodiment of an idea or concept; a personification."},{"definition":"A digital representation of a person or being; often, it can take on any of various forms, as a participant chooses. e.g. 3D, animated, photo, sketch of a person or a person's alter ego, sometimes used in a virtual world or virtual chat room."}],"partOfSpeech":"n"}]},{"word":"DOTTED","idx":19399,"count":1692315,"meanings":[{"definitions":[{"definition":"To cover with small spots (of some liquid).","example":"His jacket was dotted with splashes of paint."},{"definition":"To add a dot (the symbol) or dots to.","example":"Dot your is and cross your ts."},{"definition":"To mark by means of dots or small spots.","example":"to dot a line"},{"definition":"To mark or diversify with small detached objects.","example":"to dot a landscape with cottages"},{"definition":"To punch (a person)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a line) Made up of a series of dots.","example":"Please print your name and address clearly on the dotted line."},{"definition":"(usually computing) That contains dots."},{"definition":"(of notes and rests) With a dot after, increasing the value of the duration by half of the basic note."},{"definition":"Covered with irregularly scattered objects."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dotted-us"}]},{"word":"FRONTAL","idx":19400,"count":1692246,"meanings":[{"definitions":[{"definition":"The bone at the front of the skull, behind the forehead."},{"definition":"The façade of a building."},{"definition":"A drapery covering the front of an altar."},{"definition":"Any of the scales of a reptile that lie in the general region of the forehead, more specifically between the eyes and to the anterior of this area."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, directed toward, or situated at the front.","example":"a frontal attack"},{"definition":"Of or relating to the forehead or frontal bone."},{"definition":"Of or relating to the frontal plane."},{"definition":"Of or relating to a weather front."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɹʌntəl/"}]},{"word":"HAVOC","idx":19401,"count":1692191,"meanings":[{"definitions":[{"definition":"Widespread devastation, destruction"},{"definition":"Mayhem"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pillage."},{"definition":"To cause havoc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A cry in war as the signal for indiscriminate slaughter."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"havoc-us","text":"/ˈhæv.ək/"}]},{"word":"UBIQUITOUS","idx":19402,"count":1692121,"meanings":[{"definitions":[{"definition":"Being everywhere at once: omnipresent.","example":"To Hindus, Jews, Christians, and Muslims, God is ubiquitous."},{"definition":"Appearing to be everywhere at once; being or seeming to be in more than one location at the same time."},{"definition":"Widespread; very prevalent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ubiquitous-us","text":"/juˈbɪk.wɪ.təs/"},{"audio":"ubiquitous-uk","text":"/juːˈbɪk.wə.təs/"}]},{"word":"ARSENIC","idx":19403,"count":1691840,"meanings":[{"definitions":[{"definition":"A nonmetallic chemical element (symbol As) with an atomic number of 33."},{"definition":"A single atom of this element."},{"definition":"Arsenic trioxide."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or containing arsenic with a valence of 5."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"arsenic-us","text":"/ˈɑɹsənɪk/"}]},{"word":"SYNONYM","idx":19404,"count":1691819,"meanings":[{"definitions":[{"definition":"(strictly) A word whose meaning is the same as that of another word."},{"definition":"A word or phrase with a meaning that is the same as, or very similar to, another word or phrase.","example":"“Happy” is a synonym of “glad”."},{"definition":"Any of the formal names for a taxon, including the valid name (i.e. the senior synonym)."},{"definition":"Any name for a taxon, usually a validly published, formally accepted one, but often also an unpublished name."},{"definition":"An alternative (often shorter) name defined for an object in a database."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"synonym-us","text":"/ˈsɪnənɪm/"}]},{"word":"FACILITATION","idx":19405,"count":1691730,"meanings":[{"definitions":[{"definition":"The act of facilitating or making easy."},{"definition":"The process of synapses becoming more capable of transmitting the same type of signal each time certain types of sensory signals pass through sequences of these synapses."}],"partOfSpeech":"n"}]},{"word":"YER","idx":19409,"count":1690747,"meanings":[{"definitions":[{"definition":"Pronunciation spelling of yeah, yes."}],"partOfSpeech":"v"},{"definitions":[{"definition":"(object pronoun) The people spoken, or written to, as an object.","example":"Both of you should get ready now."},{"definition":"(reflexive pronoun) (To) yourselves, (to) yourself."},{"definition":"(object pronoun) The person spoken to or written to, as an object. (Replacing thee; originally as a mark of respect.)"},{"definition":"(subject pronoun) The people spoken to or written to, as a subject. (Replacing ye.)","example":"You are all supposed to do as I tell you."},{"definition":"(subject pronoun) The person spoken to or written to, as a subject. (Originally as a mark of respect.)"},{"definition":"(indefinite personal pronoun) Anyone, one; an unspecified individual or group of individuals (as subject or object)."}],"partOfSpeech":"p"},{"definitions":[{"definition":"Either of the letters ъ and ь in Cyrillic alphabets, which originally represented phonemically the ultra-short vowels in Slavic languages."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"yer-1-us","text":"/jə(ɹ)/"}]},{"word":"DOOMED","idx":19411,"count":1690352,"meanings":[{"definitions":[{"definition":"To pronounce sentence or judgment on; to condemn.","example":"a criminal doomed to death"},{"definition":"To destine; to fix irrevocably the ill fate of."},{"definition":"To judge; to estimate or determine as a judge."},{"definition":"To ordain as a penalty; hence, to mulct or fine."},{"definition":"To assess a tax upon, by estimate or at discretion."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Assured to suffer death, failure, or a similarly negative outcome."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"doomed-us","text":"/duːmd/"}]},{"word":"APPLETS","idx":19412,"count":1689646,"meanings":[{"definitions":[{"definition":"A small program module that runs under the control of a larger application, typically a web browser"}],"partOfSpeech":"n"}]},{"word":"FRANCS","idx":19413,"count":1689190,"meanings":[{"definitions":[{"definition":"A former unit of currency of France, Belgium and Luxembourg, replaced by the euro."},{"definition":"Any of several units of currency, some of which are multi-national (West African CFA Franc (XOF), Central African CFA Franc (XAF), the Swiss franc (CHF)) while others are national currencies."}],"partOfSpeech":"n"}]},{"word":"BALLAD","idx":19414,"count":1689145,"meanings":[{"definitions":[{"definition":"A kind of narrative poem, adapted for recitation or singing; especially, a sentimental or romantic poem in short stanzas.","example":"The poet composed a ballad praising the heroic exploits of the fallen commander."},{"definition":"A slow romantic song.","example":"On Friday nights, the roller rink had a time-block called \"Lovers' Lap\" when they played nothing but ballads on the overhead speakers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make mention of in ballads."},{"definition":"To compose or sing ballads."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ballad-us","text":"/ˈbæləd/"}]},{"word":"PDFS","idx":19415,"count":1688778,"meanings":[{"definitions":[{"definition":"Portable Document Format"},{"definition":"Any function whose integral over a set gives the probability that a random variable has a value in that set"}],"partOfSpeech":"n"}]},{"word":"SLING","idx":19416,"count":1688770,"meanings":[{"definitions":[{"definition":"An instrument for throwing stones or other missiles, consisting of a short strap with two strings fastened to its ends, or with a string fastened to one end and a light stick to the other."},{"definition":"A kind of hanging bandage put around the neck, in which a wounded arm or hand is supported."},{"definition":"A loop of cloth, worn around the neck, for supporting a baby or other such load."},{"definition":"A loop of rope, or a rope or chain with hooks, for suspending a barrel, bale, or other heavy object, in hoisting or lowering."},{"definition":"A strap attached to a firearm, for suspending it from the shoulder."},{"definition":"(chiefly in the plural) A band of rope or iron for securing a yard to a mast."},{"definition":"The act or motion of hurling as with a sling; a throw; figuratively, a stroke."},{"definition":"A loop of rope or fabric tape used for various purposes: e.g. as part of a runner, or providing extra protection when abseiling or belaying."},{"definition":"A drink composed of a spirit (usually gin) and water sweetened.","example":"a Singapore sling"},{"definition":"A young or infant spider, such as one raised in captivity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw with a circular or arcing motion."},{"definition":"To throw with a sling."},{"definition":"To pass a rope around (a cask, gun, etc.) preparatory to attaching a hoisting or lowering tackle."},{"definition":"To sell, peddle, or distribute illicitly (e.g. drugs, sex, etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sling-1-au","text":"/ˈslɪŋ/"}]},{"word":"CONTRACTION","idx":19417,"count":1688692,"meanings":[{"definitions":[{"definition":"A reversible reduction in size."},{"definition":"A period of economic decline or negative growth.","example":"The country's economic contraction was caused by high oil prices."},{"definition":"A shortening of a muscle when it is used."},{"definition":"A strong and often painful shortening of the uterine muscles prior to or during childbirth."},{"definition":"A process whereby one or more sounds of a free morpheme (a word) are lost or reduced, such that it becomes a bound morpheme (a clitic) that attaches phonologically to an adjacent word.","example":"In English didn't, that's, and wanna, the endings -n't, -'s, and -a arose by contraction."},{"definition":"(English orthography) A word with omitted letters replaced by an apostrophe, usually resulting from the above process.","example":"\"Don't\" is a contraction of \"do not.\""},{"definition":"A shorthand symbol indicating an omission for the purpose of brevity."},{"definition":"The process of contracting a disease.","example":"the contraction of malaria"},{"definition":"Syncope, the loss of sounds from within a word."},{"definition":"The acquisition of something, generally negative.","example":"Our contraction of debt in this quarter has reduced our ability to attract investors."},{"definition":"A distinct stage of wound healing, wherein the wound edges are gradually pulled together."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"contraction-uk","text":"/kɒnˈtɹæk.ʃən/"}]},{"word":"DEVISED","idx":19419,"count":1688301,"meanings":[{"definitions":[{"definition":"To use one's intellect to plan or design (something).","example":"to devise an argument; to devise a machine, or a new system of writing"},{"definition":"To leave (property) in a will."},{"definition":"To form a scheme; to lay a plan; to contrive; to consider."},{"definition":"To plan or scheme for; to plot to obtain."},{"definition":"To imagine; to guess."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪˈvaɪzd/"}]},{"word":"EXPLORERS","idx":19421,"count":1687938,"meanings":[{"definitions":[{"definition":"One who explores something"},{"definition":"A person who by means of travel (notably an expedition) searches out new information."},{"definition":"Any of various hand tools, with sharp points, used in dentistry."},{"definition":"A visual representation of a file system etc. through which the user can navigate."}],"partOfSpeech":"n"}]},{"word":"UNDERCOVER","idx":19423,"count":1687786,"meanings":[{"definitions":[{"definition":"A person who works undercover."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide too little coverage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Performed or happening in secret."},{"definition":"Employed or engaged in spying or secret investigation."}],"partOfSpeech":"j"}]},{"word":"SUBSTRATES","idx":19424,"count":1687769,"meanings":[{"definitions":[{"definition":"What an enzyme acts upon."},{"definition":"A surface on which an organism grows, or to which an organism or an item is attached.","example":"The rock surface of a rockpool is the substrate for a sessile organism such as a limpet."},{"definition":"An underlying layer; a substratum."},{"definition":"A language that is replaced in a population by another language and that influences the language imposed on its speakers."},{"definition":"(plating) A metal which is plated with another metal which has different physical properties."},{"definition":"A surface to which a substance adheres."},{"definition":"The substance lining the bottom edge of an enclosure.","example":"Stream substrate affects fish longevity."}],"partOfSpeech":"n"}]},{"word":"JOYSTICK","idx":19426,"count":1687753,"meanings":[{"definitions":[{"definition":"A mechanical device consisting of a handgrip mounted on a base or pedestal and typically having one or more buttons, used to control an aircraft, computer or other equipment."},{"definition":"A penis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To manoeuvre by means of a joystick."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"joystick-us"}]},{"word":"KNOWLEDGEBASE","idx":19427,"count":1687497,"meanings":[{"definitions":[{"definition":"A database designed to meet the complex storage and retrieval requirements of computerized knowledge management, especially in support of artificial intelligence or expert systems."}],"partOfSpeech":"n"}]},{"word":"RAVENS","idx":19429,"count":1686982,"meanings":[{"definitions":[{"definition":"Any of several, generally large and lustrous black species of birds in the genus Corvus, especially the common raven, Corvus corax."},{"definition":"A jet-black colour."},{"definition":"Rapine; rapacity."},{"definition":"Prey; plunder; food obtained by violence."}],"partOfSpeech":"n"}]},{"word":"UNDERLINE","idx":19432,"count":1686466,"meanings":[{"definitions":[{"definition":"A line placed underneath a piece of text in order to provide emphasis or to indicate that it should be viewed in italics or (in electronic documents) that it acts as a hyperlink."},{"definition":"The character _."},{"definition":"An announcement of a theatrical performance to follow, placed in an advertisement for the current one."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To draw a line underneath something, especially to add emphasis; to underscore","example":"underline the important words in the text"},{"definition":"To emphasise or stress something"},{"definition":"To influence secretly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Passing under a railway line."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"underline-us","text":"/ˈʌndɚˌlaɪn/"}]},{"word":"OBSCENE","idx":19433,"count":1686451,"meanings":[{"definitions":[{"definition":"Offensive to current standards of decency or morality."},{"definition":"Lewd or lustful."},{"definition":"Disgusting or repulsive."},{"definition":"(by extension) Beyond all reason; excessive."},{"definition":"Liable to corrupt or deprave."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"obscene-us","text":"/əbˈsin/"}]},{"word":"UPTIME","idx":19434,"count":1686290,"meanings":[{"definitions":[{"definition":"The period of time a computer has functioned since last requiring a reboot."}],"partOfSpeech":"n"}]},{"word":"SPAMMERS","idx":19436,"count":1686038,"meanings":[{"definitions":[{"definition":"Someone who sends spam."},{"definition":"A spring-loaded mechanical hammer specially adapted to be used in microgravity."}],"partOfSpeech":"n"}]},{"word":"HYMN","idx":19438,"count":1685394,"meanings":[{"definitions":[{"definition":"A song of praise or worship."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sing a hymn."},{"definition":"To praise or extol in hymns."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hymn-us","text":"/hɪm/"}]},{"word":"CONTINUAL","idx":19439,"count":1685246,"meanings":[{"definitions":[{"definition":"Recurring in steady, rapid succession."},{"definition":"Seemingly continuous; appearing to have no end or interruption."},{"definition":"Forming a continuous series."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"continual-us","text":"/kənˈtɪnjuəl/"}]},{"word":"NUCLEI","idx":19440,"count":1685159,"meanings":[{"definitions":[{"definition":"The core, central part of something, around which other elements are assembled."},{"definition":"An initial part or version that will receive additions.","example":"This collection will form the nucleus of a new library."},{"definition":"The massive, positively charged central part of an atom, made up of protons and neutrons."},{"definition":"A large membrane-enclosed organelle found in eukaryotic cells which contains genetic material."},{"definition":"A ganglion, cluster of many neuronal bodies where synapsing occurs."},{"definition":"The central part of a syllable, most commonly a vowel."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnuːkli.aɪ/"},{"text":"/ˈnjuː.kli.aɪ/"}]},{"word":"TUMMY","idx":19442,"count":1685130,"meanings":[{"definitions":[{"definition":"(often childish) Stomach or belly."},{"definition":"Protruding belly, paunch."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tummy-au","text":"/ˈtʌm.i/"}]},{"word":"AXIAL","idx":19443,"count":1685087,"meanings":[{"definitions":[{"definition":"A flight feather that appears between the primaries and secondaries on some birds."},{"definition":"A plane parallel to the surface of a tooth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to, resembling, or situated on an axis"},{"definition":"Belonging to the axis of the body, or to the axis of any appendage or organ","example":"the axial bones"},{"definition":"In the same direction as the axis, parallel to the axis.","example":"The secondary xylem usually consists of axial and radial elements."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈæksi.əl/"}]},{"word":"SLOWED","idx":19444,"count":1684926,"meanings":[{"definitions":[{"definition":"To make (something) run, move, etc. less quickly; to reduce the speed of."},{"definition":"To keep from going quickly; to hinder the progress of."},{"definition":"To become slow; to slacken in speed; to decelerate."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sləʊd/"}]},{"word":"TOLERATED","idx":19446,"count":1684559,"meanings":[{"definitions":[{"definition":"To accept hardship without objection.","example":"I can tolerate working on Saturdays, but not on Sundays."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Endured"},{"definition":"Permitted"}],"partOfSpeech":"j"}]},{"word":"QUAY","idx":19447,"count":1684371,"meanings":[{"definitions":[{"definition":"A stone or concrete structure on navigable water used for loading and unloading vessels; a wharf."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To land or tie up at a quay or similar structure, especially used in the phrase \"quay up\"."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"quay-uk","text":"/kiː/"}]},{"word":"OUTING","idx":19449,"count":1684303,"meanings":[{"definitions":[{"definition":"To eject; to expel."},{"definition":"To reveal (a person) as LGBT+ (gay, trans, etc)."},{"definition":"To reveal (a person or organization) as having a certain secret, such as a being a secret agent or undercover detective."},{"definition":"To reveal (a secret).","example":"A Brazilian company outed the new mobile phone design."},{"definition":"To come or go out; to get out or away; to become public or apparent."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A pleasure trip or excursion."},{"definition":"An appearance to perform in public, for example in a drama, film, on a musical album, as a sports contestant etc."},{"definition":"The practice of publicly revealing that a person is homosexual or transgender without that person's consent."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"outing-uk","text":"/ˈaʊtɪŋ/"}]},{"word":"INSTRUCT","idx":19450,"count":1684125,"meanings":[{"definitions":[{"definition":"Instruction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To teach by giving instructions.","example":"Listen carefully when someone instructs you how to assemble the furniture."},{"definition":"To tell (someone) what they must or should do.","example":"The doctor instructed me to keep my arm immobilised and begin physiotherapy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Arranged; furnished; provided."},{"definition":"Instructed; taught; enlightened."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"instruct-us","text":"/ˌɪnˈstɹʌkt/"}]},{"word":"TOPOGRAPHIC","idx":19452,"count":1683986,"meanings":[{"definitions":[{"definition":"Of or relating to topography."}],"partOfSpeech":"j"}]},{"word":"OVERHAUL","idx":19454,"count":1683953,"meanings":[{"definitions":[{"definition":"A major repair, remake, renovation, or revision.","example":"The engine required a complete overhaul to run properly."},{"definition":"The process after the fire appears extinguished in which the firefighters search the structure for signs of hot spots that may cause the structure to reignite. Often this includes the process of salvage under the blanket term, salvage and overhaul."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To modernize, repair, renovate, or revise completely."},{"definition":"To pass, overtake, or travel past."},{"definition":"To keep (running rigging) clear, and see that no hitch occurs."},{"definition":"To search (a ship) for contraband goods."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"overhaul-us","text":"/ˈoʊvɚˌhɔl/"},{"audio":"overhaul-uk","text":"/ˈəʊvəˌhɔːl/"}]},{"word":"MAJORDOMO","idx":19455,"count":1683560,"meanings":[{"definitions":[{"definition":"The head servant or official in a royal Spanish or Italian household; later, any head servant in a wealthy household in a foreign country; a leading servant or butler."},{"definition":"(Southwest) A manager of a hacienda, ranch or estate."},{"definition":"Any overseer, organizer, person in command."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"majordomo-uk","text":"/ˌmeɪ.dʒəˈdəʊ.məʊ/"}]},{"word":"INDEMNITY","idx":19457,"count":1683423,"meanings":[{"definitions":[{"definition":"Security from damage, loss, or penalty."},{"definition":"An obligation or duty upon an individual to incur the losses of another."},{"definition":"Repayment; compensation for loss or injury."},{"definition":"The right of an injured party to shift the loss onto the party responsible for the loss."},{"definition":"A principle of insurance which provides that when a loss occurs, the insured should be restored to the approximate financial condition occupied before the loss occurred, no better, no worse."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"indemnity-us","text":"/ɪnˈdɛmnɪti/"}]},{"word":"LEV","idx":19458,"count":1683199,"meanings":[{"definitions":[{"definition":"The currency of Bulgaria, divided into 100 stotinki"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/lɛv/"}]},{"word":"IMAGINATIVE","idx":19459,"count":1682880,"meanings":[{"definitions":[{"definition":"Having a lively or creative imagination."},{"definition":"Tending to be fanciful or inventive."},{"definition":"False or imagined."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/-ənətɪv/"}]},{"word":"WEIR","idx":19460,"count":1682833,"meanings":[{"definitions":[{"definition":"An adjustable dam placed across a river to regulate the flow of water downstream."},{"definition":"A fence placed across a river to catch fish."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/wɪɹ/"},{"text":"/wɪə/"},{"audio":"weir-au"}]},{"word":"BURGERS","idx":19462,"count":1682693,"meanings":[{"definitions":[{"definition":"A hamburger."},{"definition":"(chiefly as a combining form) A similar sandwich or patty."},{"definition":"A citizen of a borough or town, especially one belonging to the middle class."},{"definition":"A prosperous member of the community; a middle class citizen (may connote complacency)."}],"partOfSpeech":"n"}]},{"word":"RAI","idx":19463,"count":1682546,"meanings":[{"definitions":[{"definition":"Stone money"},{"definition":"A form of music, originating in Oran, Algeria from Bedouin shepherds."}],"partOfSpeech":"n"}]},{"word":"REMARKED","idx":19464,"count":1682432,"meanings":[{"definitions":[{"definition":"To mark again."},{"definition":"To make a remark or remarks; to comment."},{"definition":"To express in words or writing; to state; to make a comment","example":"He remarked that it was getting late."},{"definition":"To pay heed to; notice; to take notice of"},{"definition":"To mark in a notable manner; to distinguish clearly; to make noticeable or conspicuous; to point out."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Conspicuous; marked"},{"definition":"Bearing a remark, as an etching"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"remarked-us","text":"/ɹɪˈmɑɹkt/"}]},{"word":"PORTRAYED","idx":19465,"count":1682197,"meanings":[{"definitions":[{"definition":"To paint or draw the likeness of.","example":"I will portray a king on horseback."},{"definition":"To describe in words; to convey."},{"definition":"To play a role; to depict a character, person, situation, or event.","example":"For my next movie, I will be portraying Shakespeare."},{"definition":"To adorn."}],"partOfSpeech":"ve"}]},{"word":"WATCHLIST","idx":19466,"count":1682120,"meanings":[{"definitions":[{"definition":"A list of people or things that are to receive special attention."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add to a watchlist."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"watchlist-us"},{"text":"/ˈwɒtʃˌlɪst/"}]},{"word":"CAMPERS","idx":19468,"count":1681690,"meanings":[{"definitions":[{"definition":"A person who camps, especially in a tent etc.","example":"There were thousands of campers at the music festival."},{"definition":"A motor vehicle with a rear compartment for living and sleeping in."},{"definition":"A person who stays in one spot during a first-person shooting game, to guard an item etc."}],"partOfSpeech":"n"}]},{"word":"PHENOTYPE","idx":19469,"count":1681518,"meanings":[{"definitions":[{"definition":"The appearance of an organism based on a multifactorial combination of genetic traits and environmental factors, especially used in pedigrees."},{"definition":"Any observable characteristic of an organism, such as its morphological, developmental, biochemical or physiological properties, or its behavior."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To evaluate or classify based on phenotype"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfiːnə(ʊ)ˌtaɪp/"}]},{"word":"COUNTRYWIDE","idx":19470,"count":1681124,"meanings":[{"definitions":[{"definition":"Throughout a country; nationwide."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Throughout a country; nationwide."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˌkʌn.tɹiˈwaɪd/"}]},{"word":"AFFIRM","idx":19473,"count":1680655,"meanings":[{"definitions":[{"definition":"To agree, verify or concur; to answer positively.","example":"She affirmed that she would go when I asked her."},{"definition":"To assert positively; to tell with confidence; to aver; to maintain as true."},{"definition":"To support or encourage.","example":"They did everything they could to affirm the children's self-confidence."},{"definition":"To make firm; to confirm, or ratify; especially to assert or confirm, as a judgment, decree, or order, brought before an appellate court for review."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"affirm-us","text":"/əˈfɝm/"}]},{"word":"SPELLED","idx":19475,"count":1680303,"meanings":[{"definitions":[{"definition":"To put under the influence of a spell; to affect by a spell; to bewitch; to fascinate; to charm."},{"definition":"To read (something) as though letter by letter; to peruse slowly or with effort."},{"definition":"(sometimes with “out”) To write or say the letters that form a word or part of a word."},{"definition":"To be able to write or say the letters that form words.","example":"I find it difficult to spell because I'm dyslexic."},{"definition":"Of letters: to compose (a word).","example":"The letters “a”, “n” and “d” spell “and”."},{"definition":"(with “out”) To clarify; to explain in detail.","example":"Please spell it out for me."},{"definition":"To indicate that (some event) will occur.","example":"This spells trouble."},{"definition":"To constitute; to measure."},{"definition":"To speak, to declaim."},{"definition":"To tell; to relate; to teach."},{"definition":"To work in place of (someone).","example":"to spell the helmsman"},{"definition":"To rest (someone or something), to give someone or something a rest or break.","example":"They spelled the horses and rested in the shade of some trees near a brook."},{"definition":"To rest from work for a time."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spelled-uk","text":"/ˈspɛld/"}]},{"word":"EPOCH","idx":19476,"count":1680235,"meanings":[{"definitions":[{"definition":"A particular period of history, especially one considered noteworthy or remarkable."},{"definition":"A notable event which marks the beginning of such a period."},{"definition":"A precise instant of time that is used as a point of reference."},{"definition":"Uses in computing."},{"definition":"A unit of geologic time subdividing a period into smaller parts."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide (data) into segments by time period."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"epoch-us","text":"/ˈeɪˌpɑk/"}]},{"word":"MOURNING","idx":19477,"count":1679985,"meanings":[{"definitions":[{"definition":"To express sadness or sorrow for; to grieve over (especially a death)."},{"definition":"To utter in a sorrowful manner."},{"definition":"To wear mourning."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of expressing or feeling sorrow or regret; lamentation."},{"definition":"Feeling or expressing sorrow over someone's death."},{"definition":"The traditional clothes worn by those who mourn (in Western societies, typically coloured black)."},{"definition":"Drapes or coverings associated with mourning."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mourning-us","text":"/ˈmɔɹnɪŋ/"}]},{"word":"RESISTOR","idx":19478,"count":1679980,"meanings":[{"definitions":[{"definition":"One who resists, especially a person who fights against an occupying army."},{"definition":"An electric component that transmits current in direct proportion to the voltage across it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪˈzɪstɚ/"},{"text":"/ɹɪˈzɪstə/"}]},{"word":"AFT","idx":19480,"count":1679356,"meanings":[{"definitions":[{"definition":"The stern portion of a vessel."},{"definition":"The part of the day from noon or lunchtime until sunset, evening, or suppertime or 6pm."},{"definition":"The later part of anything, often with implications of decline."},{"definition":"A party or social event held in the afternoon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Located at the back of a boat, ship, or airplane"}],"partOfSpeech":"j"},{"definitions":[{"definition":"At, near, or towards the stern of a vessel (with the frame of reference within the vessel)."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"aft-us","text":"/æft/"}]},{"word":"PLAID","idx":19482,"count":1679093,"meanings":[{"definitions":[{"definition":"A type of twilled woollen cloth, often with a tartan or chequered pattern."},{"definition":"A length of such material used as a piece of clothing, formerly worn in the Scottish Highlands and other parts of northern Britain and remaining as an item of ceremonial dress worn by members of Scottish pipe bands."},{"definition":"The typical chequered pattern of a plaid; tartan."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a pattern or colors which resemble a Scottish tartan; checkered or marked with bars or stripes at right angles to one another."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To act in a manner such that one has fun; to engage in activities expressly for the purpose of recreation or entertainment.","example":"They played long and hard."},{"definition":"To perform in (a sport); to participate in (a game).","example":"He plays on three teams"},{"definition":"To take part in amorous activity; to make love."},{"definition":"To act as the indicated role, especially in a performance.","example":"He plays the King, and she's the Queen."},{"definition":"(heading) To produce music or theatre."},{"definition":"(heading) To behave in a particular way."},{"definition":"To move in any manner; especially, to move regularly with alternate or reciprocating motion; to operate.","example":"He played the torch beam around the room."},{"definition":"To move to and fro."},{"definition":"To put in action or motion.","example":"to play a trump in a card game"},{"definition":"To keep in play, as a hooked fish in order to land it."},{"definition":"To manipulate, deceive, or swindle someone.","example":"You played me!"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plaid-1-us","text":"/plæd/"}]},{"word":"FABLE","idx":19484,"count":1678751,"meanings":[{"definitions":[{"definition":"A fictitious narrative intended to enforce some useful truth or precept, usually with animals, etc. as characters; an apologue. Prototypically, Aesop's Fables."},{"definition":"Any story told to excite wonder; common talk; the theme of talk."},{"definition":"Fiction; untruth; falsehood."},{"definition":"The plot, story, or connected series of events forming the subject of an epic or dramatic poem."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To compose fables; hence, to write or speak fiction; to write or utter what is not true."},{"definition":"To make up; to devise, and speak of, as true or real; to tell of falsely; to recount in the form of a fable."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fable-us","text":"/ˈfeɪbəl/"}]},{"word":"RESCUED","idx":19485,"count":1678575,"meanings":[{"definitions":[{"definition":"To save from any violence, danger or evil.","example":"The well-trained team rescued everyone after the avalanche."},{"definition":"To free or liberate from confinement or other physical restraint.","example":"to rescue a prisoner from the enemy."},{"definition":"To recover forcibly."},{"definition":"To deliver by arms, notably from a siege."},{"definition":"To remove or withdraw from a state of exposure to evil and sin.","example":"Traditionally missionaries aim to rescue many ignorant heathen souls."},{"definition":"To achieve something positive under difficult conditions."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rescued-us","text":"/ˈɹɛs.kjuːd/"},{"audio":"rescued-uk","text":"/ˈɹɛs.kjuːd/"}]},{"word":"SNOWMOBILE","idx":19487,"count":1678313,"meanings":[{"definitions":[{"definition":"A vehicle with skis at the front and a caterpillar track at the rear, used for travelling over snow, sometimes as sport"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride or race in a snowmobile."}],"partOfSpeech":"ve"}]},{"word":"EXPLODED","idx":19488,"count":1678214,"meanings":[{"definitions":[{"definition":"To destroy with an explosion.","example":"The assassin exploded the car by means of a car bomb."},{"definition":"To destroy violently or abruptly.","example":"They sought to explode the myth."},{"definition":"To create an exploded view of.","example":"Explode the assembly drawing so that all the fasteners are visible."},{"definition":"To disprove or debunk."},{"definition":"To blast, to blow up, to burst, to detonate, to go off.","example":"The bomb explodes."},{"definition":"To make a violent or emotional outburst.","example":"She exploded when I criticised her hat."},{"definition":"To increase suddenly."},{"definition":"(PHP) To break (a delimited string of text) into several smaller strings by removing the separators."},{"definition":"To decompress (data) that was previously imploded."},{"definition":"To open all doors and hatches on an automobile."}],"partOfSpeech":"ve"}]},{"word":"PADRES","idx":19491,"count":1677708,"meanings":[{"definitions":[{"definition":"A military clergyman"},{"definition":"A Roman Catholic or Anglican priest"}],"partOfSpeech":"n"}]},{"word":"SCARS","idx":19492,"count":1677547,"meanings":[{"definitions":[{"definition":"A permanent mark on the skin, sometimes caused by the healing of a wound."},{"definition":"(by extension) A permanent negative effect on someone's mind, caused by a traumatic experience."},{"definition":"Any permanent mark resulting from damage."},{"definition":"A cliff or rock outcrop."},{"definition":"A rock in the sea breaking out from the surface of the water."},{"definition":"A bare rocky place on the side of a hill or mountain."},{"definition":"A marine food fish, the scarus or parrotfish (family Scaridae)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark the skin permanently."},{"definition":"To form a scar."},{"definition":"To affect deeply in a traumatic manner.","example":"Seeing his parents die in a car crash scarred him for life."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/skɑɹz/"},{"audio":"scars-uk"}]},{"word":"WHISKY","idx":19493,"count":1677493,"meanings":[{"definitions":[{"definition":"An alcoholic liquor distilled from fermented grain and usually aged in oak barrels."},{"definition":"A drink of this liquor."},{"definition":"A light gig or carriage."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"whisky-us","text":"/ˈwɪski/"}]},{"word":"UPTOWN","idx":19495,"count":1677197,"meanings":[{"definitions":[{"definition":"The residential part of a city, away from the commercial center"}],"partOfSpeech":"n"},{"definitions":[{"definition":"In the upper part of a town."},{"definition":"(by extension) Of or relating to an affluent area or population."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To or in the upper part of a town.","example":"Let's go uptown and try out that new restaurant."}],"partOfSpeech":"v"}]},{"word":"BATTER","idx":19498,"count":1676822,"meanings":[{"definitions":[{"definition":"To hit or strike violently and repeatedly.","example":"The firemen battered down the door."},{"definition":"To coat with batter (the food ingredient).","example":"I prefer it when they batter the cod with breadcrumbs."},{"definition":"To defeat soundly; to thrash.","example":"Leeds United battered Charlton 7-0."},{"definition":"(usually in the passive) To intoxicate.","example":"I was battered last night on our pub crawl."},{"definition":"To flatten (metal) by hammering, so as to compress it inwardly and spread it outwardly."},{"definition":"To slope (of walls, buildings etc.)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A beaten mixture of flour and liquid (usually egg and milk), used for baking (e.g. pancakes, cake, or Yorkshire pudding) or to coat food (e.g. fish) prior to frying","example":"To the dismay of his mother, the boy put his finger into the cake batter."},{"definition":"A binge, a heavy drinking session.","example":"When he went on a batter, he became very violent."},{"definition":"A paste of clay or loam."},{"definition":"A bruise on the face of a plate or of type in the form."},{"definition":"An incline on the outer face of a built wall."},{"definition":"The player attempting to hit the ball with a bat.","example":"The first batter hit the ball into the corner for a double."},{"definition":"The player attempting to hit the ball with a bat; a batsman."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"batter-us","text":"/ˈbætəɹ/"}]},{"word":"WEIGHTING","idx":19499,"count":1676674,"meanings":[{"definitions":[{"definition":"To add weight to something; to make something heavier."},{"definition":"To load, burden or oppress someone."},{"definition":"To assign weights to individual statistics."},{"definition":"To bias something; to slant."},{"definition":"To handicap a horse with a specified weight."},{"definition":"To give a certain amount of force to a throw, kick, hit, etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The weight or significance given to something, sometimes by means of a statistical multiplier.","example":"Higher weightings were assigned to data from double-blind studies."}],"partOfSpeech":"n"}]},{"word":"RECTAL","idx":19501,"count":1676607,"meanings":[{"definitions":[{"definition":"A rectal examination."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, via or related to the rectum.","example":"The customs inspector subjected him to a rectal exam."}],"partOfSpeech":"j"}]},{"word":"NUGGETS","idx":19503,"count":1676486,"meanings":[{"definitions":[{"definition":"A small, compact chunk or clump.","example":"a gold nugget"},{"definition":"A chicken nugget."},{"definition":"A tidbit of something valuable.","example":"a nugget of wisdom"},{"definition":"A small piece of tasty food, a tidbit."},{"definition":"A type of boot polish."},{"definition":"A bud from the Cannabis sativa plant, especially one that is potent."},{"definition":"An inexperienced, newly trained fighter pilot."},{"definition":"A partial description gleaned from data mining."}],"partOfSpeech":"n"}]},{"word":"SILENTLY","idx":19504,"count":1676469,"meanings":[{"definitions":[{"definition":"In a silent manner; making no noise."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"silently-us","text":"/ˈsaɪləntli/"}]},{"word":"PESOS","idx":19505,"count":1676404,"meanings":[{"definitions":[{"definition":"A former unit of currency in Spain and Spain's colonies, worth 8 reales; the Spanish dollar."},{"definition":"The currency of various countries, including but not limited to Argentina, Chile, Mexico and the Philippines."}],"partOfSpeech":"n"}]},{"word":"SHAKES","idx":19506,"count":1676341,"meanings":[{"definitions":[{"definition":"The act of shaking or being shaken; tremulous or back-and-forth motion.","example":"She replied in the negative, with a shake of her head."},{"definition":"A milkshake."},{"definition":"A beverage made by adding ice cream to a (usually carbonated) drink; a float."},{"definition":"Shake cannabis, small, leafy fragments of cannabis that gather at the bottom of a bag of marijuana."},{"definition":"(building material) A thin shingle."},{"definition":"A crack or split between the growth rings in wood."},{"definition":"A fissure in rock or earth."},{"definition":"A basic wooden shingle made from split logs, traditionally used for roofing etc."},{"definition":"Instant, second. (Especially in two shakes.)"},{"definition":"One of the staves of a hogshead or barrel taken apart."},{"definition":"A rapid alternation of a principal tone with another represented on the next degree of the staff above or below it; a trill."},{"definition":"A shook of staves and headings."},{"definition":"The redshank, so called from the nodding of its head while on the ground."},{"definition":"A pattern of behavior including twitches, tics and spasms typical of withdrawal from addiction; usually following the.","example":"When researchers either stopped the diet or administered an opioid blocker, the rats showed signs common to drug withdrawal, such as teeth-chattering and the shakes.  http//apu.sfn.org/index.cfm?pagename=brainBriefings_sugarAddiction"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause (something) to move rapidly in opposite directions alternatingly.","example":"He shook the can of soda for thirty seconds before delivering it to me, so that, when I popped it open, soda went everywhere."},{"definition":"To move (one's head) from side to side, especially to indicate refusal, reluctance or disapproval.","example":"Shaking his head, he kept repeating \"No, no, no\"."},{"definition":"To move or remove by agitating; to throw off by a jolting or vibrating motion.","example":"to shake fruit down from a tree"},{"definition":"To disturb emotionally; to shock.","example":"He was shaken by what had happened."},{"definition":"To lose, evade, or get rid of (something).","example":"I can't shake the feeling that I forgot something."},{"definition":"To move from side to side.","example":"She shook with grief."},{"definition":"(usually as \"shake on\") To shake hands.","example":"OK, let's shake on it."},{"definition":"To dance.","example":"She was shaking it on the dance floor."},{"definition":"To give a tremulous tone to; to trill.","example":"to shake a note in music"},{"definition":"To threaten to overthrow.","example":"The experience shook my religious belief."},{"definition":"To be agitated; to lose firmness."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ʃeɪks/"}]},{"word":"DRAM","idx":19507,"count":1676257,"meanings":[{"definitions":[{"definition":"The currency of Greece in ancient times and again from 1832 until 2001, with the symbol ₯, since replaced by the euro."},{"definition":"A coin worth one drachma."},{"definition":"An Ancient Greek weight of about 66.5 grains, or 4.3 grams."},{"definition":"A later Greek weight equal to a gram."},{"definition":"A small unit of weight, variously:"},{"definition":"Any similarly minute quantity, a small amount of strong alcohol or poison.","example":"a dram of brandy"},{"definition":"A cart formerly used to haul coal in coal mines."},{"definition":"The currency of Armenia, divided into 100 luma."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drink drams."},{"definition":"To ply with drams of drink."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dram-1-uk","text":"/dɹæm/"}]},{"word":"IMPARTIAL","idx":19509,"count":1676218,"meanings":[{"definitions":[{"definition":"Treating all parties, rivals, or disputants equally; not partial; not biased"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪmˈpɑɹ.ʃəl/"}]},{"word":"EMBRYOS","idx":19511,"count":1675714,"meanings":[{"definitions":[{"definition":"In the reproductive cycle, the stage after the fertilization of the egg that precedes the development into a fetus."},{"definition":"An organism in the earlier stages of development before it emerges from the egg, or before metamorphosis."},{"definition":"In viviparous animals, the young animal's earliest stages in the mother's body"},{"definition":"In humans, usually the cell growth up to the end of the seventh week in the mother's body"},{"definition":"A rudimentary plant contained in the seed."},{"definition":"The beginning; the first stage of anything."}],"partOfSpeech":"n"}]},{"word":"PUNCTUATION","idx":19512,"count":1675694,"meanings":[{"definitions":[{"definition":"A set of symbols and marks which are used to clarify meaning in text by separating strings of words into clauses, phrases and sentences."},{"definition":"An act of punctuating."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"punctuation-uk","text":"/pʌŋk.tʃuˈeɪ.ʃən/"}]},{"word":"INITIALS","idx":19513,"count":1675671,"meanings":[{"definitions":[{"definition":"The first letter of a word or a name."},{"definition":"In plural, the first letter of each word of a person's full name considered as a unit.","example":"You can get your initials printed at the top."},{"definition":"A distinguished initial letter of a chapter or section of a document."},{"definition":"Onset, part of a syllable that precedes the syllable nucleus in phonetics and phonology."},{"definition":"An abbreviation of a person's name, constructed by taking the initial letters of first, last, and sometimes middle name(s). See monogram","example":"You may leave out where you live and use either initials or an alias, since gods, buddhas and other divinities look only at our hearts."}],"partOfSpeech":"n"}]},{"word":"SPANS","idx":19514,"count":1675632,"meanings":[{"definitions":[{"definition":"The space from the thumb to the end of the little finger when extended; nine inches; an eighth of a fathom."},{"definition":"(by extension) A small space or a brief portion of time.","example":"He has a short attention span and gets bored within minutes."},{"definition":"A portion of something by length; a subsequence."},{"definition":"The spread or extent of an arch or between its abutments, or of a beam, girder, truss, roof, bridge, or the like, between supports."},{"definition":"The length of a cable, wire, rope, chain between two consecutive supports."},{"definition":"A rope having its ends made fast so that a purchase can be hooked to the bight; also, a rope made fast in the center so that both ends can be used."},{"definition":"A pair of horses or other animals driven together; usually, such a pair of horses when similar in color, form, and action."},{"definition":"The space of all linear combinations of something."},{"definition":"The time required to execute a parallel algorithm on an infinite number of processors, i.e. the shortest distance across a directed acyclic graph representing the computation steps."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extend through the distance between or across.","example":"The suspension bridge spanned the canyon."},{"definition":"To extend through (a time period).","example":"The novel spans three centuries."},{"definition":"To measure by the span of the hand with the fingers extended, or with the fingers encompassing the object.","example":"to span a space or distance; to span a cylinder"},{"definition":"To generate an entire space by means of linear combinations."},{"definition":"To be matched, as horses."},{"definition":"To fetter, as a horse; to hobble."}],"partOfSpeech":"ve"}]},{"word":"PALLET","idx":19515,"count":1675416,"meanings":[{"definitions":[{"definition":"A portable platform, usually designed to be easily moved by a forklift, on which goods can be stacked, for transport or storage."},{"definition":"A flat base for combining stores or carrying a single item to form a unit load for handling, transportation, and storage by materials handling equipment."},{"definition":"(DOD only) 463L pallet – An 88” x 108” aluminum flat base used to facilitate the upload and download of aircraft."},{"definition":"A straw bed."},{"definition":"(by extension) A makeshift bed."},{"definition":"Paleness; pallor."},{"definition":"A wooden stake; a picket."},{"definition":"Fence made from wooden stake; palisade."},{"definition":"(by extension) Limits, bounds (especially before of)."},{"definition":"The bounds of morality, good behaviour or judgment in civilized company, in the phrase beyond the pale."},{"definition":"A vertical band down the middle of a shield."},{"definition":"A territory or defensive area within a specific boundary or under a given jurisdiction."},{"definition":"The jurisdiction (territorial or otherwise) of an authority."},{"definition":"A cheese scoop."},{"definition":"A shore for bracing a timber before it is fastened."},{"definition":"A thin board on which a painter lays and mixes colours."},{"definition":"The range of colors in a given work or item or body of work."},{"definition":"A visual selection of colours, tools, commands, etc."},{"definition":"A plate of armour covering the points of junction at the bend of the shoulders and elbows."},{"definition":"A plate against which a person presses their breast to give force to a hand-operated drill."},{"definition":"A wooden implement, often oval or round, used by potters, crucible makers, etc., for forming, beating, and rounding their works."},{"definition":"A potter's wheel."},{"definition":"(gilding) An instrument used to take up gold leaf from the pillow, and to apply it."},{"definition":"(gilding) A tool for gilding the backs of books over the bands."},{"definition":"(brickmaking) A board on which a newly moulded brick is conveyed to the hack."},{"definition":"A click or pawl for driving a ratchet wheel."},{"definition":"One of the series of disks or pistons in the chain pump."},{"definition":"One of the pieces or levers connected with the pendulum of a clock, or the balance of a watch, which receive the immediate impulse of the scape-wheel, or balance wheel."},{"definition":"In the organ, a valve between the wind chest and the mouth of a pipe or row of pipes."},{"definition":"One of a pair of shelly plates that protect the siphon tubes of certain bivalves, such as the Teredo."},{"definition":"A cup containing three ounces, formerly used by surgeons."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To load or stack (goods) onto pallets."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpælɪt/"},{"text":"/ˈpælət/"}]},{"word":"PISTOLS","idx":19516,"count":1675315,"meanings":[{"definitions":[{"definition":"A handgun, typically with a chamber integrated in the barrel, a semi-automatic action and a box magazine."},{"definition":"The mechanical component of a fuse in a bomb or torpedo responsible for firing the detonator."},{"definition":"A creative and unpredictable jokester, a constant source of entertainment and surprises."},{"definition":"A small boy who is bright, alert and very active."},{"definition":"An offensive formation in which the quarterback receives the snap at a distance behind the center, but closer than in a shotgun formation, with a running back lined up behind him."}],"partOfSpeech":"n"}]},{"word":"MARA","idx":19517,"count":1674798,"meanings":[{"definitions":[{"definition":"A nightmare; a spectre or wraith-like creature in Germanic and particularly Scandinavian folklore; a female demon who torments people in sleep by crouching on their chests or stomachs, or by causing terrifying visions."},{"definition":"A type of god that prevents accomplishment or success."},{"definition":"Any malicious or evil spirit."},{"definition":"Any caviid rodent of genus Dolichotis, common in the Patagonian steppes of Argentina."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mara-uk","text":"/ˈmɑːɹə/"}]},{"word":"GARAGES","idx":19518,"count":1674739,"meanings":[{"definitions":[{"definition":"A building (or section of a building) used to store a car or cars, tools and other miscellaneous items."},{"definition":"(20th century) A place where cars are serviced and repaired."},{"definition":"A petrol filling station."},{"definition":"A shed for housing an airship or aeroplane or a launchable missile; a hangar."},{"definition":"A side way or space in a canal to enable vessels to pass each other; a siding."},{"definition":"A type of guitar rock music, personified by amateur bands playing in the basement or garage; garage rock."},{"definition":"A type of electronic dance music related to house music, with warped and time-stretched sounds; UK garage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To store in a garage.","example":"We garaged the convertible during the monsoon months."}],"partOfSpeech":"ve"}]},{"word":"TANNER","idx":19520,"count":1674597,"meanings":[{"definitions":[{"definition":"A person whose occupation is to tan hides, or convert them into leather by the use of tan."},{"definition":"A former British coin, worth six old pence"},{"definition":"A type of commercially-fished crab, Chionoecetes bairdi or Chionoecetes opilio."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a yellowish-brown.","example":"Mine is the white car parked next to the tan pickup truck."},{"definition":"Having dark skin as a result of exposure to the sun.","example":"You’re looking very tan this week."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtænɚ/"},{"audio":"tanner-uk"}]},{"word":"AVENUES","idx":19521,"count":1674437,"meanings":[{"definitions":[{"definition":"A broad street, especially one bordered by trees."},{"definition":"A way or opening for entrance into a place; a passage by which a place may be reached; a way of approach or of exit."},{"definition":"The principal walk or approach to a house which is withdrawn from the road, especially, such approach bordered on each side by trees; any broad passageway thus bordered."},{"definition":"A method or means by which something may be accomplished.","example":"There are several avenues by which we can approach this problem."},{"definition":"(urban toponymy) A street, especially, in cities laid out in a grid pattern, one that is in a particular side of the city or that runs in a particular direction."}],"partOfSpeech":"n"}]},{"word":"UROLOGY","idx":19522,"count":1674293,"meanings":[{"definitions":[{"definition":"The surgical specialty of medicine that treats disorders of the urinary tract and the urogenital system."}],"partOfSpeech":"n"}]},{"word":"DUN","idx":19523,"count":1673771,"meanings":[{"definitions":[{"definition":"A brownish grey colour."},{"definition":"A collector of debts."},{"definition":"An urgent request or demand of payment."},{"definition":"A newly hatched, immature mayfly; a mayfly subimago."},{"definition":"A fly made to resemble the mayfly subimago."},{"definition":"An ancient or medieval fortification; especially a hill-fort in Scotland or Ireland."},{"definition":"A structure in the Orkney or Shetland islands or in Scotland consisting of a roundhouse surrounded by a circular wall; a broch."},{"definition":"A mound or small hill."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a brownish grey colour."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To ask or beset a debtor for payment."},{"definition":"To harass by continually repeating e.g. a request."},{"definition":"(auxiliary) A syntactic marker."},{"definition":"To perform; to execute.","example":"All you ever do is surf the Internet. What will you do this afternoon?"},{"definition":"To cause, make (someone) (do something)."},{"definition":"To suffice.","example":"it’s not the best broom, but it will have to do;  this will do me, thanks."},{"definition":"To be reasonable or acceptable.","example":"It simply will not do to have dozens of children running around such a quiet event."},{"definition":"(ditransitive) To have (as an effect).","example":"The fresh air did him some good."},{"definition":"To fare, perform (well or poorly).","example":"Our relationship isn't doing very well;  how do you do?"},{"definition":"(chiefly in questions) To have as one's job.","example":"What does Bob do? — He's a plumber."},{"definition":"To perform the tasks or actions associated with (something).","example":"\"Don't forget to do your report\" means something quite different depending on whether you're a student or a programmer."},{"definition":"To cook.","example":"I'll just do some eggs."},{"definition":"To travel in, to tour, to make a circuit of.","example":"Let’s do New York also."},{"definition":"To treat in a certain way."},{"definition":"To work for or on, by way of caring for, looking after, preparing, cleaning, keeping in order, etc."},{"definition":"To act or behave in a certain manner; to conduct oneself."},{"definition":"To spend (time) in jail. (See also do time)","example":"I did five years for armed robbery."},{"definition":"To impersonate or depict.","example":"They really laughed when he did Clinton, with a perfect accent and a leer."},{"definition":"(with 'a' and the name of a person, place, event, etc.) To copy or emulate the actions or behaviour that is associated with the person or thing mentioned.","example":"He did a Henry VIII and got married six times."},{"definition":"To kill."},{"definition":"To deal with for good and all; to finish up; to undo; to ruin; to do for."},{"definition":"To punish for a misdemeanor.","example":"He got done for speeding."},{"definition":"To have sex with. (See also do it)"},{"definition":"To cheat or swindle.","example":"That guy just did me out of two hundred bucks!"},{"definition":"To convert into a certain form; especially, to translate.","example":"the novel has just been done into English;  I'm going to do this play into a movie"},{"definition":"To finish."},{"definition":"To work as a domestic servant (with for)."},{"definition":"(auxiliary) Used to form the present progressive of verbs."},{"definition":"To cash or to advance money for, as a bill or note."},{"definition":"(ditransitive) To make or provide.","example":"Could you do me a burger with mayonnaise instead of ketchup?"},{"definition":"To injure (one's own body part)."},{"definition":"To take drugs.","example":"I do cocaine."},{"definition":"(in the form be doing [somewhere]) To exist with a purpose or for a reason.","example":"What's that car doing in our swimming pool?"},{"definition":"To cure, as codfish, by laying them, after salting, in a pile in a dark place, covered with saltgrass or a similar substance."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Imitating suspenseful music."}],"partOfSpeech":"i"}],"phonetics":[{"text":"/dʌn/"}]},{"word":"AFOREMENTIONED","idx":19524,"count":1673653,"meanings":[{"definitions":[{"definition":"The one or ones mentioned previously.","example":"The judge read a list of prisoners' names. She then indicated that the aforementioned were to be set free."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Previously mentioned.","example":"The PA system broadcast a long list of names in the morning, but it wasn't until later that they requested the aforementioned students report to the health clinic."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈfɔɹˌmɛn.ʃənd/"},{"text":"/əˈfɔːˌmɛn.ʃənd/"}]},{"word":"TACKLING","idx":19526,"count":1673414,"meanings":[{"definitions":[{"definition":"To force a person to the ground with the weight of one's own body, usually by jumping on top or slamming one's weight into him or her."},{"definition":"To face or deal with, attempting to overcome or fight down.","example":"The government's measures to tackle crime were insufficient."},{"definition":"To attempt to take away a ball."},{"definition":"To bring a ball carrier to the ground."},{"definition":"To \"hit on\" or pursue a person that one is interested in."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is tackled or dealt with."},{"definition":"The tackle of a vessel."},{"definition":"The harness for drawing a carriage."}],"partOfSpeech":"n"}]},{"word":"OBESE","idx":19527,"count":1673406,"meanings":[{"definitions":[{"definition":"Extremely overweight, especially: weighing more than 20% (for men) or 25% (for women) over their ideal weight determined by height and build; or, having a body mass index over 30 kg/m2."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/oʊˈbis/"},{"text":"/əʊˈbiːs/"}]},{"word":"COMPRESS","idx":19528,"count":1673026,"meanings":[{"definitions":[{"definition":"To make smaller; to press or squeeze together, or to make something occupy a smaller space or volume.","example":"The force required to compress a spring varies linearly with the displacement."},{"definition":"To be pressed together or folded by compression into a more economic, easier format.","example":"Our new model compresses easily, ideal for storage and travel"},{"definition":"To condense into a more economic, easier format.","example":"This chart compresses the entire audit report into a few lines on a single diagram."},{"definition":"To abridge.","example":"If you try to compress the entire book into a three-sentence summary, you will lose a lot of information."},{"definition":"To make digital information smaller by encoding it using fewer bits."},{"definition":"To embrace sexually."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A multiply folded piece of cloth, a pouch of ice etc., used to apply to a patient's skin, cover the dressing of wounds, and placed with the aid of a bandage to apply pressure on an injury.","example":"He held a cold compress over the sprain."},{"definition":"A machine for compressing"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"compress-1","text":"/kəmˈpɹɛs/"}]},{"word":"APOSTLES","idx":19529,"count":1673003,"meanings":[{"definitions":[{"definition":"A missionary, or leader of a religious mission, especially one in the early Christian Church (but see Apostle)."},{"definition":"A pioneer or early advocate of a particular cause, prophet of a belief."},{"definition":"A top-ranking ecclesiastical official in the twelve seat administrative council of The Church of Jesus Christ of Latter-day Saints."},{"definition":"A person who is plucked, that is, refused an academic degree."},{"definition":"A letter dismissory."},{"definition":"A note sent to an appeals court presenting the appeal in summary."},{"definition":"The trial court record sent to an appeal court concerning an appeal."}],"partOfSpeech":"n"}]},{"word":"SOBER","idx":19531,"count":1672710,"meanings":[{"definitions":[{"definition":"(often with up) To make or become sober."},{"definition":"(often with up) To overcome or lose a state of intoxication.","example":"It took him hours to sober up."},{"definition":"To moderate one's feelings"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not drunk; not intoxicated"},{"definition":"Not given to excessive drinking of alcohol","example":"1890, John Charles, The Godly, Righteous, And Sober Life"},{"definition":"Moderate; realistic; serious; not playful; not passionate; cool; self-controlled"},{"definition":"Dull; not bright or colorful"},{"definition":"Subdued; solemn; grave"},{"definition":"Poor; feeble"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sober-us","text":"/ˈsəʊ.bə(ɹ)/"}]},{"word":"COLLABORATIONS","idx":19532,"count":1672642,"meanings":[{"definitions":[{"definition":"The act of collaborating.","example":"Collaboration can be a useful part of the creative process."},{"definition":"A production or creation made by collaborating.","example":"The husband-and-wife artists will release their new collaboration in June this year."},{"definition":"Treasonous cooperation.","example":"He has been charged with collaboration."}],"partOfSpeech":"n"}]},{"word":"TREAD","idx":19533,"count":1672572,"meanings":[{"definitions":[{"definition":"To step or walk (on or over something); to trample.","example":"Don't tread on the lawn."},{"definition":"To step or walk upon.","example":"Actors tread the boards."},{"definition":"To beat or press with the feet.","example":"to tread a path; to tread land when too light; a well-trodden path"},{"definition":"To go through or accomplish by walking, dancing, etc."},{"definition":"To crush under the foot; to trample in contempt or hatred; to subdue."},{"definition":"To copulate; said of (especially male) birds."},{"definition":"(of a male bird) To copulate with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A step taken with the foot."},{"definition":"A manner of stepping."},{"definition":"The sound made when someone or something is walking."},{"definition":"A way; a track or path."},{"definition":"The horizontal part of a step in a flight of stairs."},{"definition":"The grooves carved into the face of a tire, used to give the tire traction."},{"definition":"The grooves on the bottom of a shoe or other footwear, used to give grip or traction."},{"definition":"The chalaza of a bird's egg; the treadle."},{"definition":"The act of avian copulation in which the male bird mounts the female by standing on her back."},{"definition":"(fortification) The top of the banquette, on which soldiers stand to fire over the parapet."},{"definition":"A bruise or abrasion produced on the foot or ankle of a horse that interferes, or strikes its feet together."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tread-us","text":"/tɹɛd/"}]},{"word":"LEGITIMACY","idx":19534,"count":1672389,"meanings":[{"definitions":[{"definition":"The quality of being legitimate or valid; validity."},{"definition":"Lawfulness of birth or origin; directness of descent as affecting the royal succession."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ləˈdʒɪtɪməsi/"}]},{"word":"ZOOLOGY","idx":19535,"count":1672374,"meanings":[{"definitions":[{"definition":"The part of biology relating to the animal kingdom, including the structure, embryology, evolution, classification, habits, and distribution of all animals, both living and extinct."},{"definition":"A treatise on this science."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/zoʊˈɑlədʒi/"},{"text":"/zuːˈɒlədʒi/"}]},{"word":"STEALS","idx":19536,"count":1671902,"meanings":[{"definitions":[{"definition":"To take illegally, or without the owner's permission, something owned by someone else.","example":"Three irreplaceable paintings were stolen from the gallery."},{"definition":"(of ideas, words, music, a look, credit, etc.) To appropriate without giving credit or acknowledgement.","example":"They stole my idea for a biodegradable, disposable garbage de-odorizer."},{"definition":"To get or effect surreptitiously or artfully.","example":"He stole glances at the pretty woman across the street."},{"definition":"To acquire at a low price.","example":"He stole the car for two thousand less than its book value."},{"definition":"To draw attention unexpectedly in (an entertainment), especially by being the outstanding performer. Usually used in the phrase steal the show."},{"definition":"To move silently or secretly.","example":"He stole across the room, trying not to wake her."},{"definition":"To convey (something) clandestinely."},{"definition":"To withdraw or convey (oneself) clandestinely."},{"definition":"To advance safely to (another base) during the delivery of a pitch, without the aid of a hit, walk, passed ball, wild pitch, or defensive indifference."},{"definition":"To dispossess"},{"definition":"To borrow for a short moment.","example":"Can I steal your pen?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The number of stolen bases by a baserunner.","example":"He has 25 steals this year."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/stiːlz/"}]},{"word":"UNWILLING","idx":19537,"count":1671798,"meanings":[{"definitions":[{"definition":"Not willing; reluctant","example":"We are unwilling to restore his previous privileges after his betrayal of our trust."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unwilling-us","text":"/ʌnˈwɪlɪŋ/"}]},{"word":"LIS","idx":19538,"count":1671786,"meanings":[{"definitions":[{"definition":"Fleur-de-lis"},{"definition":"The Chinese mile, a traditional unit of distance equal to 1500 chis or 150 zhangs, now standardized as a half-kilometer (500 meters)."},{"definition":"The Korean mile, a traditional unit of distance equivalent to about 393 m."}],"partOfSpeech":"n"}]},{"word":"ISOLATES","idx":19539,"count":1671719,"meanings":[{"definitions":[{"definition":"Something that has been isolated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To set apart or cut off from others."},{"definition":"To place in quarantine or isolation."},{"definition":"To separate a substance in pure form from a mixture."},{"definition":"To insulate, or make free of external influence."},{"definition":"To separate a pure strain of bacteria etc. from a mixed culture."},{"definition":"To insulate an electrical component from a source of electricity."}],"partOfSpeech":"ve"}]},{"word":"VELCRO","idx":19540,"count":1670690,"meanings":[{"definitions":[{"definition":"To fasten with Velcro."}],"partOfSpeech":"ve"}]},{"word":"WORKSHEETS","idx":19541,"count":1670687,"meanings":[{"definitions":[{"definition":"A sheet of paper or computerized document on which problems are worked out or solved and answers recorded."}],"partOfSpeech":"n"}]},{"word":"ABBA","idx":19546,"count":1670093,"meanings":[{"definitions":[{"definition":"Father; religious superior; in the Syriac, Coptic, and Ethiopic churches, a title given to the bishops, and by the bishops to the patriarch; a title given to Jewish scholars in the Talmudic period."},{"definition":"A coarse, often striped, felted fabric from the Middle East, woven from goat or camel hair."},{"definition":"A loose-fitting sleeveless garment, made from aba or silk, worn by Arabs."},{"definition":"An outer garment made of the above, very simple in form, worn by the Arabs of the desert. The illustration shows such an aba, made of two breadths of stuff sewed together to make an oblong about four by nine feet."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æˈbɑ/"}]},{"word":"PADDY","idx":19549,"count":1668962,"meanings":[{"definitions":[{"definition":"Rough or unhusked rice, either before it is milled or as a crop to be harvested."},{"definition":"A paddy field, a rice paddy; an irrigated or flooded field where rice is grown."},{"definition":"A fit of temper; a tantrum","example":"throw a paddy etc."},{"definition":"A white person."},{"definition":"A labourer's assistant or workmate."},{"definition":"A drill used in boring wells, with cutters that expand on pressure."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Low; mean; boorish; vagabond."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"paddy-us","text":"/ˈpædi/"},{"audio":"paddy-au","text":"/ˈpædi/"}]},{"word":"HUSKIES","idx":19550,"count":1668798,"meanings":[{"definitions":[{"definition":"Any of several breeds of dogs used as sled dogs."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhʌskiz/"}]},{"word":"PLUNGE","idx":19554,"count":1668493,"meanings":[{"definitions":[{"definition":"The act of plunging or submerging"},{"definition":"A dive, leap, rush, or pitch into (into water)","example":"A plunge into the sea"},{"definition":"A swimming pool"},{"definition":"The act of pitching or throwing oneself headlong or violently forward, like an unruly horse"},{"definition":"Heavy and reckless betting in horse racing; hazardous speculation"},{"definition":"An immersion in difficulty, embarrassment, or distress; the condition of being surrounded or overwhelmed; a strait; difficulty"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To thrust into liquid, or into any penetrable substance; to immerse.","example":"to plunge the body into water"},{"definition":"To cast, stab or throw into some thing, state, condition or action.","example":"to plunge a dagger into the breast;   to plunge a nation into war"},{"definition":"To baptize by immersion."},{"definition":"To dive, leap or rush (into water or some liquid); to submerge oneself.","example":"he plunged into the river"},{"definition":"To fall or rush headlong into some thing, action, state or condition.","example":"to plunge into debt;   to plunge into controversy"},{"definition":"To pitch or throw oneself headlong or violently forward, as a horse does."},{"definition":"To bet heavily and recklessly; to risk large sums in gambling."},{"definition":"To entangle or embarrass (mostly used in past participle)."},{"definition":"To overwhelm, overpower."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plunge-us","text":"/plʌndʒ/"}]},{"word":"SINISTER","idx":19558,"count":1667276,"meanings":[{"definitions":[{"definition":"Inauspicious, ominous, unlucky, illegitimate (as in bar sinister)."},{"definition":"Evil or seemingly evil; indicating lurking danger or harm.","example":"sinister influences"},{"definition":"Of the left side."},{"definition":"On the left side of a shield from the wearer's standpoint, and the right side to the viewer."},{"definition":"Wrong, as springing from indirection or obliquity; perverse; dishonest."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sinister-us","text":"/ˈsɪnɪstɚ/"}]},{"word":"BURR","idx":19560,"count":1666923,"meanings":[{"definitions":[{"definition":"A sharp, pointy object, such as a sliver or splinter."},{"definition":"A bur; a seed pod with sharp features that stick in fur or clothing."},{"definition":"A small piece of material left on an edge after a cutting operation."},{"definition":"A thin flat piece of metal, formed from a sheet by punching; a small washer put on the end of a rivet before it is swaged down."},{"definition":"A broad iron ring on a tilting lance just below the grip, to prevent the hand from slipping."},{"definition":"The ear lobe."},{"definition":"The knot at the bottom of an antler."},{"definition":"A rough humming sound."},{"definition":"A uvular \"r\"."},{"definition":"A metal ring at the top of the hand-rest on a spear."},{"definition":"A tree growth in which the grain has grown in a deformed manner."},{"definition":"Wood of a mottled veneer, usually cut from such a growth."},{"definition":"A knot or lump in thread or cloth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pronounce with a uvular \"r\"."},{"definition":"To make a rough humming sound."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bɝ/"}]},{"word":"ARTERIES","idx":19561,"count":1666760,"meanings":[{"definitions":[{"definition":"An efferent blood vessel from the heart, conveying blood away from the heart regardless of oxygenation status; see pulmonary artery."},{"definition":"A major transit corridor."}],"partOfSpeech":"n"}]},{"word":"STRAPON","idx":19562,"count":1666627,"meanings":[{"definitions":[{"definition":"An artificial phallus attached with a strap, usually a dildo."}],"partOfSpeech":"n"}]},{"word":"CHASER","idx":19563,"count":1666136,"meanings":[{"definitions":[{"definition":"A person or thing (ship, plane, car, etc.) that chases."},{"definition":"A hunter."},{"definition":"A person who does the chasing on metalwork."},{"definition":"A horse: a horse used for hunting; a horse trained for steeplechasing, a steeplechaser."},{"definition":"A drink drunk after another of a different kind"},{"definition":"(logging) Someone that follows logs out of the forest in order to signal a yarder engineer to stop them if they become fouled (also called a frogger)."},{"definition":"(logging) One who unhooks chokers from the logs at the landing."},{"definition":"A piece of music, etc. played after a performance while the audience leaves."},{"definition":"One of a series of adjacent light bulbs that cycle on and off to give the illusion of movement."},{"definition":"A person who seeks out sexual partners with a particular quality:"},{"definition":"A prison guard; particularly one who guards military prisoners on fatigue duty"},{"definition":"Someone who chases (decorates) metal; a person who decorates metal by engraving or embossing."},{"definition":"A tool used for cleaning out screw threads, either as an integral part of a tap or die to remove waste material produced by the cutting tool, or as a separate tool to repair damaged threads."},{"definition":"A chase gun.","example":"bow chaser; stern chaser"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʃeɪsɚ/"},{"text":"/ˈtʃeɪsə/"},{"audio":"chaser-au"}]},{"word":"FORMATIONS","idx":19564,"count":1665874,"meanings":[{"definitions":[{"definition":"Something possessing structure or form."},{"definition":"The act of assembling a group or structure."},{"definition":"The process during which something comes into being and gains its characteristics."},{"definition":"A rock or face of a mountain."},{"definition":"A grouping of military units or smaller formations under a command, such as a brigade, division, wing, etc."},{"definition":"An arrangement of moving troops, ships, or aircraft, such as a wedge, line abreast, or echelon. Often \"in formation\"."},{"definition":"An arrangement of players designed to facilitate certain plays."},{"definition":"The process of influencing or guiding a person to a deeper understanding of a particular vocation."},{"definition":"A structure made of two categories, two functors from the first to the second category, and a transformation from one of the functors to the other."}],"partOfSpeech":"n"}]},{"word":"VANTAGE","idx":19565,"count":1665533,"meanings":[{"definitions":[{"definition":"Any condition, circumstance, opportunity or means, particularly favorable to success, or to any desired end.","example":"The enemy had the advantage of a more elevated position."},{"definition":"Superiority; mastery; — used with of to specify its nature or with over to specify the other party."},{"definition":"Superiority of state, or that which gives it; benefit; gain; profit","example":"Having the faster car is of little advantage."},{"definition":"The score where one player wins a point after deuce but needs the next to carry the game."},{"definition":"The continuation of the game after a foul against the attacking team, because the attacking team are in an advantageous position."},{"definition":"Interest of money; increase; overplus (as the thirteenth in the baker's dozen)."},{"definition":"An advantage."},{"definition":"A place or position affording a good view; a vantage point."},{"definition":"A superior or more favorable situation or opportunity; gain; profit; advantage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To profit; to aid."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vantage-uk","text":"/ˈvɑːntɪd͡ʒ/"}]},{"word":"DIFFUSE","idx":19567,"count":1665383,"meanings":[{"definitions":[{"definition":"To spread over or through as in air, water, or other matter, especially by fluid motion or passive means."},{"definition":"To be spread over or through as in air, water, or other matter, especially by fluid motion or passive means.","example":"Food coloring diffuses in water."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Everywhere or throughout everything; not focused or concentrated.","example":"Such a diffuse effort is unlikely to produce good results."},{"definition":"Wordy; verbose."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"diffuse-1-us","text":"/dɪˈfjuz/"}]},{"word":"BOREDOM","idx":19568,"count":1665375,"meanings":[{"definitions":[{"definition":"The state of being bored."},{"definition":"An instance or period of being bored; A bored state."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɔɹ.dəm/"},{"text":"/ˈbɔː.dəm/"}]},{"word":"CROSSE","idx":19572,"count":1665028,"meanings":[{"definitions":[{"definition":"A lacrosse stick."}],"partOfSpeech":"n"}]},{"word":"OVERDRIVE","idx":19573,"count":1664969,"meanings":[{"definitions":[{"definition":"To drive too hard, or far, or beyond strength."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A gear, on an automobile, higher than the normal top gear."},{"definition":"A state of heightened activity."}],"partOfSpeech":"n"}]},{"word":"MONDO","idx":19574,"count":1664921,"meanings":[{"definitions":[{"definition":"A dialogue between master and student designed to obtain an intuitive truth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Big, large; major, significant."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Very, extremely, really."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"mondo-au"}]},{"word":"HELPLESS","idx":19577,"count":1664525,"meanings":[{"definitions":[{"definition":"Unable to defend oneself."},{"definition":"Lacking help; powerless."},{"definition":"Unable to act without help; needing help; feeble."},{"definition":"Uncontrollable.","example":"a helpless urge"},{"definition":"From which there is no possibility of being saved."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"helpless-us","text":"/ˈhɛlplɪs/"}]},{"word":"DEPLETION","idx":19579,"count":1664362,"meanings":[{"definitions":[{"definition":"The act of depleting, or the state of being depleted; exhaustion."},{"definition":"The consumption of a resource faster than it can be replenished."},{"definition":"The act of relieving congestion or plethora, by purging, blood-letting, or reduction of the system by abstinence."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈpliːʃən/"}]},{"word":"NEONATAL","idx":19580,"count":1664249,"meanings":[{"definitions":[{"definition":"Of or pertaining to the period of time immediately following birth, or to the newborn.","example":"The baby was placed in the neonatal intensive care unit."}],"partOfSpeech":"j"}]},{"word":"QR","idx":19581,"count":1663773,"meanings":[{"definitions":[{"definition":"Abbreviation of quarter (of the year)."}],"partOfSpeech":"n"}]},{"word":"FLATBED","idx":19586,"count":1663079,"meanings":[{"definitions":[{"definition":"An open freight vehicle with no sides, designed to carry heavy or outsized loads."},{"definition":"A railway freight car with no sides; a flatcar."},{"definition":"A document scanner with a flat bed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transport by flatbed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a flat bed.","example":"I can't scan the whole document quickly because I only have a flatbed scanner."}],"partOfSpeech":"j"}]},{"word":"SPADES","idx":19587,"count":1663068,"meanings":[{"definitions":[{"definition":"A garden tool with a handle and a flat blade for digging. Not to be confused with a shovel which is used for moving earth or other materials."},{"definition":"A playing card marked with the symbol ♠.","example":"I've got only one spade in my hand."},{"definition":"A black person."},{"definition":"A cutting instrument used in flensing a whale."},{"definition":"A hart or stag three years old."},{"definition":"A castrated man or animal."},{"definition":"One of the four suits of playing cards, marked with the symbol ♠."},{"definition":"A card game in which the spade suit cards are trumps."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To turn over soil with a spade to loosen the ground for planting."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spades-us","text":"/speɪdz/"}]},{"word":"SLUG","idx":19588,"count":1662960,"meanings":[{"definitions":[{"definition":"Any of many terrestrial pulmonate gastropod mollusks, having no (or only a rudimentary) shell."},{"definition":"A slow, lazy person; a sluggard."},{"definition":"A bullet or other projectile fired from a firearm; in modern usage, generally refers to a shotgun slug."},{"definition":"A solid block or piece of roughly shaped metal."},{"definition":"A counterfeit coin, especially one used to steal from vending machines."},{"definition":"A shot of a drink, usually alcoholic."},{"definition":"A title, name or header, a catchline, a short phrase or title to indicate the content of a newspaper or magazine story for editing use."},{"definition":"(rarely used) the Imperial (English) unit of mass that accelerates by 1 foot per second squared (1 ft/s²) when a force of one pound-force (lbf) is exerted on it."},{"definition":"A discrete mass of a material that moves as a unit, usually through another material."},{"definition":"A motile pseudoplasmodium formed by amoebae working together."},{"definition":"An accessory to a diesel-electric locomotive, used to increase adhesive weight and allow full power to be applied at a lower speed. It has trucks with traction motors but lacks a prime mover."},{"definition":"(television editing) A black screen."},{"definition":"A piece of type metal imprinted by a linotype machine; also a black mark placed in the margin to indicate an error; also said in application to typewriters; type slug."},{"definition":"A stranger picked up as a passenger to enable legal use of high occupancy vehicle lanes."},{"definition":"(District of Columbia) A hitchhiking commuter."},{"definition":"The last part of a clean URL, the displayed resource name, similar to a filename."},{"definition":"A hindrance, an obstruction."},{"definition":"A ship that sails slowly."},{"definition":"A hard blow, usually with the fist."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drink quickly; to gulp; to down."},{"definition":"To take part in casual carpooling; to form ad hoc, informal carpools for commuting, essentially a variation of ride-share commuting and hitchhiking."},{"definition":"(of a bullet) To become reduced in diameter, or changed in shape, by passing from a larger to a smaller part of the bore of the barrel."},{"definition":"To move slowly or sluggishly; to lie idle."},{"definition":"To load with a slug or slugs.","example":"to slug a gun"},{"definition":"To make sluggish."},{"definition":"To hit very hard, usually with the fist.","example":"He insulted my mother, so I slugged him."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slug-us","text":"/slʌɡ/"},{"audio":"slug-au","text":"/slʌɡ/"}]},{"word":"VISIONARY","idx":19589,"count":1662608,"meanings":[{"definitions":[{"definition":"Someone who has visions; a seer"},{"definition":"An impractical dreamer"},{"definition":"Someone who has positive ideas about the future"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having vision or foresight"},{"definition":"Imaginary or illusory"},{"definition":"Prophetic or revelatory"},{"definition":"Idealistic or utopian","example":"a visionary scheme or project"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈvɪʒəˌnɛɹi/"},{"text":"/ˈvɪʒn̩(ə)ɹi/"}]},{"word":"COFFIN","idx":19590,"count":1662468,"meanings":[{"definitions":[{"definition":"A rectangular closed box in which the body of a dead person is placed for burial."},{"definition":"The eighth Lenormand card."},{"definition":"A basket."},{"definition":"A casing or crust, or a mold, of pastry, as for a pie."},{"definition":"A conical paper bag, used by grocers."},{"definition":"The hollow crust or hoof of a horse's foot, below the coronet, in which is the coffin bone."},{"definition":"A storage container for nuclear waste."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place in a coffin."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"coffin-us","text":"/ˈkɔfɪn/"}]},{"word":"OTTER","idx":19591,"count":1662335,"meanings":[{"definitions":[{"definition":"An aquatic or marine carnivorous mammal in the subfamily Lutrinae of the family Mustelidae, which also includes weasels, polecats, badgers, and others."},{"definition":"A hairy man with a slender physique, in contrast with a bear, who is more thickset."},{"definition":"Annatto (dye)"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɑtɚ/"},{"text":"/ˈɒt.ə/"}]},{"word":"GOLFERS","idx":19592,"count":1662265,"meanings":[{"definitions":[{"definition":"Someone who plays golf."}],"partOfSpeech":"n"}]},{"word":"LIRA","idx":19593,"count":1662242,"meanings":[{"definitions":[{"definition":"The former currency of Israel, superseded by the sheqel."},{"definition":"The basic unit of currency in Turkey."},{"definition":"The currency of Lebanon (also pound), Syria (also pound), Jordan (also dinar)"},{"definition":"The former currency of Italy, Malta, San Marino, Cyprus and the Vatican City, superseded by the euro"},{"definition":"A Ukrainian folk musical instrument similar to the hurdy-gurdy."},{"definition":"Any of a set of fine ridges on the shells of some molluscs"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɪəɹə/"}]},{"word":"EARNS","idx":19595,"count":1661937,"meanings":[{"definitions":[{"definition":"To gain (success, reward, recognition) through applied effort or work.","example":"You can have the s'mores: you earned them, clearing the walkway of snow so well."},{"definition":"To receive payment for work.","example":"He earns seven million dollars a year as CEO.  My bank account is only earning one percent interest."},{"definition":"To receive payment for work.","example":"Now that you are earning, you can start paying me rent."},{"definition":"To cause (someone) to receive payment or reward.","example":"My CD earns me six percent!"},{"definition":"To achieve by being worthy of.","example":"to earn a spot in the top 20"},{"definition":"To curdle, as milk."},{"definition":"To long; to yearn."},{"definition":"To grieve."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"earns-us","text":"/ɝnz/"},{"audio":"earns-uk","text":"/ɜːnz/"}]},{"word":"AMPLIFIED","idx":19596,"count":1661309,"meanings":[{"definitions":[{"definition":"Having been made the subject of amplification; more potent or stronger, louder"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To render larger, more extended, or more intense.","example":"amplify a microscopes"},{"definition":"To enlarge by addition or commenting; to treat copiously by adding particulars, illustrations, etc.; to expand."},{"definition":"To increase the amplitude of something, especially of an electric current.","example":"amplify a signal"},{"definition":"To add content that is not present in the source text to the target text, usually to improve the fluency of the translation."}],"partOfSpeech":"ve"}]},{"word":"RECESS","idx":19597,"count":1661246,"meanings":[{"definitions":[{"definition":"A break, pause or vacation.","example":"Spring recess offers a good chance to travel."},{"definition":"An inset, hole, space or opening.","example":"Put a generous recess behind the handle for finger space."},{"definition":"A time of play during the school day, usually on a playground; break, playtime.","example":"Students who do not listen in class will not play outside during recess."},{"definition":"A decree of the imperial diet of the old German empire."},{"definition":"A withdrawing or retiring; a moving back; retreat.","example":"the recess of the tides"},{"definition":"The state of being withdrawn; seclusion; privacy."},{"definition":"A place of retirement, retreat, secrecy, or seclusion."},{"definition":"A secret or abstruse part.","example":"the difficulties and recesses of science"},{"definition":"A sinus."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To inset into something, or to recede.","example":"Recess the screw so it does not stick out."},{"definition":"To take or declare a break.","example":"Class will recess for 20 minutes."},{"definition":"To appoint, with a recess appointment."},{"definition":"To make a recess in.","example":"to recess a wall"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Remote, distant (in time or place)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"recess-us","text":"/ɹɪ.ˈsɛs/"}]},{"word":"DISPERSED","idx":19598,"count":1661192,"meanings":[{"definitions":[{"definition":"To scatter in different directions","example":"The Jews are dispersed among all nations."},{"definition":"To break up and disappear; to dissipate"},{"definition":"To disseminate"},{"definition":"To separate rays of light etc. according to wavelength; to refract"},{"definition":"To distribute throughout"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dispersed-us","text":"/dɪˈspɜ˞st/"}]},{"word":"TECHNICS","idx":19599,"count":1661003,"meanings":[{"definitions":[{"definition":"The method of performance in any art; technique."},{"definition":"(in the plural) Technical terms or objects; things pertaining to the practice of an art or science."},{"definition":"(in the plural) The doctrine of arts in general; those branches of learning that relate to the arts."}],"partOfSpeech":"n"}]},{"word":"SHOUTED","idx":19600,"count":1660857,"meanings":[{"definitions":[{"definition":"To utter a sudden and loud cry, as in joy, triumph, exultation or anger, or to attract attention, to animate others, etc."},{"definition":"To utter with a shout; to cry; to shout out","example":"They shouted his name to get his attention."},{"definition":"To pay for food, drink or entertainment for others.","example":"He′s shouting us all to the opening night of the play."},{"definition":"To post a text message (for example, email) in upper case, regarded as the electronic messaging equivalent of oral shouting.","example":"Please don't shout in the chat room."},{"definition":"To treat with shouts or clamor."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shouted-us","text":"/ˈʃaʊtɪd/"}]},{"word":"CLIPPERS","idx":19602,"count":1660416,"meanings":[{"definitions":[{"definition":"Anything that clips."},{"definition":"(chiefly in the plural) A tool used for clipping something, such as hair, coins, or fingernails."},{"definition":"Something that moves swiftly; especially:"},{"definition":"The Asian butterfly Parthenos sylvia, family Nymphalidae."},{"definition":"A circuit which prevents the amplitude of a wave from exceeding a set value."},{"definition":"A person who mutilates coins by fraudulently paring the edges."},{"definition":"Confidence trickster; conman."},{"definition":"A tool for clipping something."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈklɪpɹ̩z/"}]},{"word":"SHILLING","idx":19603,"count":1660040,"meanings":[{"definitions":[{"definition":"A coin formerly used in the United Kingdom, Ireland, Malta, Australia, New Zealand and many other Commonwealth countries.","example":"The shilling was worth twelve old pence, or one twentieth of a pound sterling."},{"definition":"The currency of Kenya, Somalia, Tanzania and Uganda."},{"definition":"A currency in the United States, differing in value between states."},{"definition":"(New York and some other states) The Spanish real, formerly having the value of one eighth of a dollar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To promote or endorse in return for payment, especially dishonestly."},{"definition":"To put under cover; to sheal."},{"definition":"To shell."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shilling-us","text":"/ˈʃɪlɪŋ/"}]},{"word":"RESEMBLE","idx":19604,"count":1659654,"meanings":[{"definitions":[{"definition":"To be like or similar to (something); to represent as similar.","example":"The twins resemble each other."},{"definition":"To compare; to regard as similar, to liken."},{"definition":"To counterfeit; to imitate."},{"definition":"To cause to imitate or be like; to make similar."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"resemble-uk","text":"/ɹɪˈzɛmb(ə)l/"}]},{"word":"SPIRITED","idx":19605,"count":1659614,"meanings":[{"definitions":[{"definition":"To carry off, especially in haste, secrecy, or mystery."},{"definition":"To animate with vigor; to excite; to encourage; to inspirit; sometimes followed by up.","example":"Civil dissensions often spirit the ambition of private men."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lively, vigorous, animated or courageous."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈspɪɹɪtɪd/"}]},{"word":"CARBONATE","idx":19607,"count":1659355,"meanings":[{"definitions":[{"definition":"Any salt or ester of carbonic acid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To charge (often a beverage) with carbon dioxide."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"carbonate-uk","text":"/ˈkɑː(ɹ).bə.nət/"}]},{"word":"DISCRIMINATE","idx":19610,"count":1659114,"meanings":[{"definitions":[{"definition":"To make distinctions."},{"definition":"(construed with against) To make decisions based on prejudice.","example":"The law prohibits discriminating against people based on their skin color."},{"definition":"To set apart as being different; to mark as different; to separate from another by discerning differences; to distinguish."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having the difference marked; distinguished by certain tokens."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪsˈkɹɪmɪneɪt/"}]},{"word":"STARED","idx":19611,"count":1658945,"meanings":[{"definitions":[{"definition":"(construed with at) To look fixedly (at something)."},{"definition":"To influence in some way by looking fixedly.","example":"to stare a timid person into submission"},{"definition":"To be very conspicuous on account of size, prominence, colour, or brilliancy.","example":"staring windows or colours"},{"definition":"To stand out; to project; to bristle."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/stɛɹd/"},{"text":"/stɛəd/"}]},{"word":"RECHARGE","idx":19612,"count":1658759,"meanings":[{"definitions":[{"definition":"Water that has percolated from the ground surface to an aquifer."},{"definition":"The process of charging (an electrical device) again.","example":"My phone has needed five recharges in the last month."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To charge an electric battery after its power has been consumed."},{"definition":"To invigorate and revitalize one's energy level by removing stressful agents for a period of time."},{"definition":"To reload a gun with ammunition."},{"definition":"To add or restore water to an aquifer."},{"definition":"To request payment again from."},{"definition":"To charge or accuse in return."},{"definition":"To attack again or anew."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːˈtʃɑː(ɹ)dʒ/"},{"text":"/ˈɹiːtʃɑː(ɹ)dʒ/"}]},{"word":"CROCODILE","idx":19613,"count":1658300,"meanings":[{"definitions":[{"definition":"Any of the predatory amphibious reptiles of the family Crocodylidae; a crocodilian, any species of the order Crocodilia, which also includes the alligators, caimans and gavials."},{"definition":"A long line or procession of people (especially children) walking together."},{"definition":"A fallacious dilemma, mythically supposed to have been first used by a crocodile."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To speak one's native language at an Esperanto-language gathering, rather than Esperanto."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crocodile-uk","text":"/ˈkɹɒkədaɪl/"}]},{"word":"SASSY","idx":19615,"count":1657970,"meanings":[{"definitions":[{"definition":"Bold and spirited, cheeky, impudent, saucy."},{"definition":"Somewhat sexy and provocative."},{"definition":"Lively, vigorous."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsæsi/"},{"text":"/ˈsasi/"},{"audio":"sassy-au"}]},{"word":"RATIFICATION","idx":19617,"count":1657571,"meanings":[{"definitions":[{"definition":"The act or process of ratifying, or the state of being ratified."},{"definition":"A formal declaration of agreement to a treaty etc."}],"partOfSpeech":"n"}]},{"word":"VASES","idx":19620,"count":1657182,"meanings":[{"definitions":[{"definition":"An upright open container used mainly for displaying fresh, dried, or artificial flowers."},{"definition":"The body of the Corinthian capital."}],"partOfSpeech":"n"}]},{"word":"FILMMAKERS","idx":19621,"count":1657073,"meanings":[{"definitions":[{"definition":"A producer or director of films/movies."}],"partOfSpeech":"n"}]},{"word":"TRANSNATIONAL","idx":19622,"count":1656943,"meanings":[{"definitions":[{"definition":"Someone operating in several countries."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Between or beyond national boundaries."},{"definition":"Involving several nations or nationalities."}],"partOfSpeech":"j"}]},{"word":"ADVISES","idx":19623,"count":1656922,"meanings":[{"definitions":[{"definition":"To give advice to; to offer an opinion to, as worthy or expedient to be followed.","example":"The dentist advised me to brush three times a day."},{"definition":"To recommend; to offer as advice.","example":"The dentist advised brushing three times a day."},{"definition":"To give information or notice to; to inform or counsel; — with of before the thing communicated.","example":"The lawyer advised me to drop the case, since there was no chance of winning."},{"definition":"To consider, to deliberate."},{"definition":"To look at, watch; to see."},{"definition":"To consult (with)."}],"partOfSpeech":"ve"}]},{"word":"COWARD","idx":19625,"count":1656677,"meanings":[{"definitions":[{"definition":"A person who lacks courage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To intimidate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Cowardly."},{"definition":"(of a lion) Borne in the escutcheon with his tail doubled between his legs."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"coward-uk","text":"/ˈkaʊəd/"}]},{"word":"PARALEGAL","idx":19626,"count":1656554,"meanings":[{"definitions":[{"definition":"One who assists a lawyer in routine legal work, but who is without qualified status as a solicitor or barrister (England and Wales), attorney (U.S.), or advocate; known more commonly in the U.S. as a legal assistant."}],"partOfSpeech":"n"}]},{"word":"SPOKESPERSON","idx":19627,"count":1656553,"meanings":[{"definitions":[{"definition":"A person who acts as the voice of a group of people."}],"partOfSpeech":"n"}]},{"word":"TEAMED","idx":19629,"count":1656266,"meanings":[{"definitions":[{"definition":"To form a group, as for sports or work.","example":"They teamed to complete the project."},{"definition":"(by extension) To go together well; to harmonize."},{"definition":"To convey or haul with a team.","example":"to team lumber"},{"definition":"To form together into a team.","example":"to team oxen"},{"definition":"To give work to a gang under a subcontractor."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Associated with others in a team"}],"partOfSpeech":"j"}]},{"word":"PRESET","idx":19630,"count":1656205,"meanings":[{"definitions":[{"definition":"Something that is set in advance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To set something in advance."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Set in advance, or as a default."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpriːsɛt/"},{"text":"/priːˈsɛt/"}]},{"word":"INEQUALITIES","idx":19631,"count":1656200,"meanings":[{"definitions":[{"definition":"An unfair, not equal, state."},{"definition":"A statement that of two quantities one is specifically less than (or greater than) another. Symbol: < or \\leq or > or \\geq or \\ne, as appropriate."}],"partOfSpeech":"n"}]},{"word":"NOX","idx":19635,"count":1655793,"meanings":[{"definitions":[{"definition":"Millilux (unit of illuminance)"}],"partOfSpeech":"n"}]},{"word":"JAMS","idx":19636,"count":1655641,"meanings":[{"definitions":[{"definition":"A sweet mixture of fruit boiled with sugar and allowed to congeal. Often spread on bread or toast or used in jam tarts."},{"definition":"A difficult situation."},{"definition":"Blockage, congestion.","example":"A traffic jam caused us to miss the game's first period."},{"definition":"An informal, impromptu performance or rehearsal."},{"definition":"(by extension) A song; a track."},{"definition":"(by extension) An informal event where people brainstorm and collaborate on projects."},{"definition":"A kind of frock for children."},{"definition":"(interior decorating) Either of the vertical components that form the side of an opening in a wall, such as that of a door frame, window frame, or fireplace."},{"definition":"Any thick mass of rock that prevents miners from following the lode or vein."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To get something stuck in a confined space.","example":"Her poor little baby toe got jammed in the door."},{"definition":"To brusquely force something into a space; cram, squeeze.","example":"The rush-hour train was jammed with commuters."},{"definition":"To cause congestion or blockage. Often used with \"up\"","example":"A single accident can jam the roads for hours."},{"definition":"To block or confuse a broadcast signal."},{"definition":"To throw a pitch at or near the batter's hands.","example":"Jones was jammed by the pitch."},{"definition":"To play music (especially improvisation as a group, or an informal unrehearsed session)."},{"definition":"To injure a finger or toe by sudden compression of the digit's tip.","example":"When he tripped on the step he jammed his toe."},{"definition":"To attempt to score points.","example":"Toughie jammed four times in the second period."},{"definition":"To bring (a vessel) so close to the wind that half her upper sails are laid aback."},{"definition":"To give up on a date or some joint endeavour; stand up, chicken out, jam out."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/d͡ʒæmz/"}]},{"word":"PANCREATIC","idx":19637,"count":1655615,"meanings":[{"definitions":[{"definition":"Of or pertaining to the pancreas"}],"partOfSpeech":"j"}]},{"word":"MANICURES","idx":19639,"count":1655210,"meanings":[{"definitions":[{"definition":"A cosmetic treatment for the fingernails."},{"definition":"A manicurist."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To trim the fingernails"}],"partOfSpeech":"ve"}]},{"word":"DYES","idx":19640,"count":1654912,"meanings":[{"definitions":[{"definition":"A colourant, especially one that has an affinity to the substrate to which it is applied."},{"definition":"Any hue, color, or blee."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To colour with dye, or as if with dye."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/daɪz/"}]},{"word":"VIZ","idx":19645,"count":1654193,"meanings":[{"definitions":[{"definition":"Videlicet: namely, to wit, that is to say, specifically, as an illustration."}],"partOfSpeech":"v"}]},{"word":"TURBULENCE","idx":19646,"count":1654172,"meanings":[{"definitions":[{"definition":"The state or fact of being turbulent or agitated; tempestuousness, disturbance."},{"definition":"Disturbance in a gas or fluid, characterized by evidence of internal motion or unrest."},{"definition":"Specifically, a state of agitation or disturbance in the air which is disruptive to an aircraft."},{"definition":"An instance or type of such state or disturbance."}],"partOfSpeech":"n"}]},{"word":"YELL","idx":19648,"count":1654034,"meanings":[{"definitions":[{"definition":"A shout."},{"definition":"A phrase to be shouted."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Shout; holler; make a loud sound with the voice."},{"definition":"To convey by shouting","example":"He yelled directions to the party from the car."},{"definition":"To tell someone off (in a loud and angry manner)","example":"If I come home late again, my dad is gonna yell at me."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Dry (of cow)"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"yell-us","text":"/jɛl/"}]},{"word":"FINS","idx":19649,"count":1653999,"meanings":[{"definitions":[{"definition":"One of the appendages of a fish, used to propel itself and to manoeuvre/maneuver.","example":"The fish's fins minimize water flow."},{"definition":"A similar appendage of a cetacean or other marine animal.","example":"a dolphin's fin"},{"definition":"A thin, rigid component of an aircraft, extending from the fuselage and used to stabilise and steer the aircraft.","example":"The fin stabilises the plane in flight."},{"definition":"A similar structure on the tail of a bomb, used to help keep it on course."},{"definition":"A hairstyle, resembling the fin of a fish, in which the hair is combed and set into a vertical ridge along the top of the head from about the crown to the forehead."},{"definition":"A device worn by divers and swimmers on their feet.","example":"The divers wore fins to swim faster."},{"definition":"An extending part on a surface of a radiator, engine, heatsink, etc., used to facilitate cooling."},{"definition":"A sharp raised edge (generally in concrete) capable of damaging a roof membrane or vapor retarder."},{"definition":"(formerly Australia) a five-pound (£5) note; the sum of five pounds."},{"definition":"A five-dollar bill; the sum of five dollars."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut the fins from a fish, shark, etc."},{"definition":"(Of a fish) to swim with the dorsal fin above the surface of the water."},{"definition":"To swim in the manner of a fish.","example":"A neutrally buoyant diver does not need to fin to maintain depth."},{"definition":"To provide (a motor vehicle etc) with fins."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɪnz/"}]},{"word":"PLZ","idx":19650,"count":1653411,"meanings":[{"definitions":[{"definition":"Used to make a polite request.","example":"Could you tell me the time, please?"},{"definition":"Used as an affirmative to an offer.","example":"—May I help you? —Please."},{"definition":"An expression of annoyance or impatience.","example":"Oh, please, do we have to hear that again?"},{"definition":"(Cincinnati) Said as a request to repeat information."}],"partOfSpeech":"v"}]},{"word":"UNDERWRITING","idx":19653,"count":1652694,"meanings":[{"definitions":[{"definition":"To write below or under; subscribe."},{"definition":"To subscribe (a document, policy etc.) with one's name."},{"definition":"To sign; to put one's name to."},{"definition":"To agree to pay by signing one's name; subscribe."},{"definition":"Specifically, to assume financial responsibility for something, and guarantee it against failure."},{"definition":"To act as an underwriter."},{"definition":"To support, lend support to, guarantee the basis of."},{"definition":"To submit to; put up with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of something being underwritten financially."}],"partOfSpeech":"n"}]},{"word":"DRESSER","idx":19654,"count":1652504,"meanings":[{"definitions":[{"definition":"An item of kitchen furniture, like a cabinet with shelves, for storing crockery or utensils."},{"definition":"An item of bedroom furniture, like a low chest of drawers, often with a mirror."},{"definition":"One who dresses in a particular way.","example":"He's a very snappy dresser."},{"definition":"A wardrobe assistant (who helps actors put on their costume)."},{"definition":"A servant to royalty etc. who helps them with tasks such as dressing."},{"definition":"A surgeon's assistant who helps to dress wounds etc."},{"definition":"A football hooligan who wears designer clothing; a casual."},{"definition":"A mechanical device used in grain mills for bolting."},{"definition":"A table or bench on which meat and other things are dressed, or prepared for use."},{"definition":"A kind of pick for shaping large coal."},{"definition":"One who dresses or prepares stone."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dresser-uk","text":"/ˈdɹɛsə/"}]},{"word":"RAKE","idx":19656,"count":1652408,"meanings":[{"definitions":[{"definition":"A garden tool with a row of pointed teeth fixed to a long handle, used for collecting debris, grass, etc., for flattening the ground, or for loosening soil; also, a similar wheel-mounted tool drawn by a horse or a tractor."},{"definition":"(by extension) A similarly shaped tool used for other purposes."},{"definition":"The act of raking."},{"definition":"Something that is raked."},{"definition":"A walk, or a journey taken (especially on foot); the act of taking a walk or journey."},{"definition":"The movement of animals while grazing."},{"definition":"The pastureland over which animals graze; a range, a stray."},{"definition":"A journey to transport something between two places; a run; also, the quantity of items so transported."},{"definition":"A garden tool with a row of pointed teeth fixed to a long handle, used for collecting debris, grass, etc., for flattening the ground, or for loosening soil; also, a similar wheel-mounted tool drawn by a horse or a tractor."},{"definition":"(by extension) A similarly shaped tool used for other purposes."},{"definition":"The act of raking."},{"definition":"Something that is raked."},{"definition":"A course, a path, especially a narrow and steep path or route up a hillside."},{"definition":"A fissure or mineral vein of ore traversing the strata vertically, or nearly so."},{"definition":"(originally Northern England) A series, a succession; specifically a set of coupled rail vehicles, normally coaches or wagons.","example":"The train was formed of a locomotive and a rake of six coaches."},{"definition":"(systems theory) In cellular automata: a puffer that emits a stream of spaceships rather than a trail of debris."},{"definition":"Rate of progress; pace, speed."},{"definition":"A divergence from the horizontal or perpendicular; a slant, a slope."},{"definition":"(specifically) In full, angle of rake or rake angle: the angle between the edge or face of a tool (especially a cutting tool) and a plane (usually one perpendicular to the object that the tool is being applied to)."},{"definition":"The direction of slip during the movement of a fault, measured within the fault plane."},{"definition":"Senses relating to watercraft."},{"definition":"(roofing) The sloped edge of a roof at or adjacent to the first or last rafter."},{"definition":"A person (usually a man) who is stylish but habituated to hedonistic and immoral conduct."},{"definition":"Rate of progress; pace, speed."},{"definition":"A divergence from the horizontal or perpendicular; a slant, a slope."},{"definition":"(specifically) In full, angle of rake or rake angle: the angle between the edge or face of a tool (especially a cutting tool) and a plane (usually one perpendicular to the object that the tool is being applied to)."},{"definition":"The direction of slip during the movement of a fault, measured within the fault plane."},{"definition":"Senses relating to watercraft."},{"definition":"(roofing) The sloped edge of a roof at or adjacent to the first or last rafter."},{"definition":"A person (usually a man) who is stylish but habituated to hedonistic and immoral conduct."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act upon with a rake, or as if with a rake.","example":"She is raking the gravel path to keep it even."},{"definition":"To walk; to roam, to wander."},{"definition":"Of animals (especially sheep): to graze."},{"definition":"To roam or wander through (somewhere)."},{"definition":"To move swiftly; to proceed rapidly."},{"definition":"Of a bird of prey: to fly after a quarry; also, to fly away from the falconer, to go wide of the quarry being pursued."},{"definition":"To incline (something) from a perpendicular direction.","example":"A mast rakes aft."},{"definition":"Senses relating to watercraft."},{"definition":"To behave as a rake; to lead a hedonistic and immoral life."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rake-us","text":"/ɹeɪk/"}]},{"word":"ORNAMENTAL","idx":19658,"count":1651866,"meanings":[{"definitions":[{"definition":"An ornamental plant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Serving as an ornament; having no purpose other than to make more beautiful.","example":"Some think it most ornamental to wear their bracelets on their wrists; others, about their ankles."},{"definition":"(of a plant, fish, etc.) Bred for aesthetic or decorative purposes."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɔɹnəˈmɛntl/"},{"text":"/ˌɔːnəˈmɛntl/"}]},{"word":"RICHES","idx":19659,"count":1651697,"meanings":[{"definitions":[{"definition":"Money, goods, wealth, treasure."},{"definition":"An abundance of anything desirable."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪt͡ʃɪz/"}]},{"word":"RESIGN","idx":19660,"count":1651672,"meanings":[{"definitions":[{"definition":"To give up; to relinquish ownership of."},{"definition":"To hand over (something to someone), place into the care or control of another."},{"definition":"To quit (a job or position).","example":"He resigned the crown to follow his heart."},{"definition":"To submit passively; to give up as hopeless or inevitable.","example":"After fighting for so long, she finally resigned to her death."},{"definition":"To sign again; to provide one's signature again."},{"definition":"(by extension) To sign a contract renewing or restarting a professional relationship, such as that of a professional athlete with a sports team."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"resign-1-uk","text":"/ɹɪˈzaɪn/"}]},{"word":"COLLECTABLE","idx":19663,"count":1651566,"meanings":[{"definitions":[{"definition":"Anything that someone might want to collect."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Suitable for collecting."}],"partOfSpeech":"j"}]},{"word":"RAMPS","idx":19666,"count":1651245,"meanings":[{"definitions":[{"definition":"An inclined surface that connects two levels; an incline."},{"definition":"A road that connects a freeway to a surface street or another freeway."},{"definition":"A mobile staircase that is attached to the doors of an aircraft at an airport"},{"definition":"A large parking area in an airport for aircraft, for loading and unloading or for storage (see also apron)"},{"definition":"A construction used to do skating tricks, usually in the form of part of a pipe."},{"definition":"A speed bump."},{"definition":"A leap or bound."},{"definition":"A concave bend at the top or cap of a railing, wall, or coping; a romp."},{"definition":"An American plant, Allium tricoccum, related to the onion; a wild leek."},{"definition":"A promiscuous man or woman; a general insult for a worthless person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To behave violently; to rage."},{"definition":"To spring; to leap; to bound, rear, or prance; to move swiftly or violently."},{"definition":"To climb, like a plant; to creep up."},{"definition":"To stand in a rampant position."},{"definition":"To (cause to) change value, often at a steady rate."},{"definition":"To adapt a piece of iron to the woodwork of a gate."}],"partOfSpeech":"ve"}]},{"word":"TACKLES","idx":19667,"count":1651206,"meanings":[{"definitions":[{"definition":"A device for grasping an object and an attached means of moving it, as a rope and hook."},{"definition":"A block and tackle."},{"definition":"Equipment (rod, reel, line, lure, etc.) used when angling."},{"definition":"(by extension) equipment, gear, gadgetry."},{"definition":"A play where a player attempts to take control over the ball from an opponent, as in rugby or football."},{"definition":"A play where a defender brings the ball carrier to the ground."},{"definition":"Any instance in which one person intercepts another and forces them to the ground."},{"definition":"An offensive line position between a guard and an end: offensive tackle; a person playing that position."},{"definition":"A defensive position between two defensive ends: defensive tackle; a person playing that position."},{"definition":"A man's genitalia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To force a person to the ground with the weight of one's own body, usually by jumping on top or slamming one's weight into him or her."},{"definition":"To face or deal with, attempting to overcome or fight down.","example":"The government's measures to tackle crime were insufficient."},{"definition":"To attempt to take away a ball."},{"definition":"To bring a ball carrier to the ground."},{"definition":"To \"hit on\" or pursue a person that one is interested in."}],"partOfSpeech":"ve"}]},{"word":"INJUNCTION","idx":19668,"count":1651173,"meanings":[{"definitions":[{"definition":"The act of enjoining; the act of directing, commanding, or prohibiting."},{"definition":"That which is enjoined; such as an order, mandate, decree, command, precept"},{"definition":"A writ or process, granted by a court of equity, and, in some cases, under statutes, by a court of law, whereby a party is required to do or to refrain from doing certain acts, according to the exigency of the writ."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈdʒʌnk.ʃən/"}]},{"word":"INTERVENE","idx":19669,"count":1650973,"meanings":[{"definitions":[{"definition":"To become involved in a situation, so as to alter or prevent an action.","example":"The police had to be called to intervene in the fight."},{"definition":"To occur, fall, or come between, points of time, or events.","example":"An instant intervened between the flash and the report."},{"definition":"To occur or act as an obstacle or delay.","example":"Nothing intervened to prevent the undertaking."},{"definition":"To say (something) in the middle of a conversation or discussion between other people, or to respond to a situation involving other people."},{"definition":"To come between, or to be between, persons or things.","example":"The Mediterranean intervenes between Europe and Africa."},{"definition":"In a suit to which one has not been made a party, to put forward a defense of one's interest in the subject matter.","example":"an application for leave (i.e. permission) to intervene"}],"partOfSpeech":"ve"}]},{"word":"POISED","idx":19670,"count":1650755,"meanings":[{"definitions":[{"definition":"To hang in equilibrium; to be balanced or suspended; hence, to be in suspense or doubt."},{"definition":"To counterpoise; to counterbalance."},{"definition":"To be of a given weight; to weigh."},{"definition":"To add weight to, to weigh down."},{"definition":"To hold (something) with or against something else in equilibrium; to balance, counterpose."},{"definition":"To hold (something) in equilibrium, to hold balanced and ready; to carry (something) ready to be used.","example":"I poised the crowbar in my hand, and waited."},{"definition":"To keep (something) in equilibrium; to hold suspended or balanced.","example":"The rock was poised precariously on the edge of the cliff."},{"definition":"To ascertain, as if by balancing; to weigh."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Possessing poise, having self-confidence."},{"definition":"Ready, prepared.","example":"He stood there, poised to act, and then suddenly he drew his gun in a smooth arc."},{"definition":"Balanced, in position, equilibrium"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɔɪzd/"}]},{"word":"BARKING","idx":19672,"count":1650384,"meanings":[{"definitions":[{"definition":"To make a short, loud, explosive noise with the vocal organs (said of animals, especially dogs).","example":"The neighbour's dog is always barking."},{"definition":"To make a clamor; to make importunate outcries."},{"definition":"To speak sharply.","example":"The sergeant barked an order."},{"definition":"To strip the bark from; to peel."},{"definition":"To abrade or rub off any outer covering from.","example":"to bark one’s heel"},{"definition":"To girdle."},{"definition":"To cover or inclose with bark, or as with bark.","example":"bark the roof of a hut"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Who or that barks or bark.","example":"a barking dog"},{"definition":"Completely insane."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The action of the verb to bark."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"barking-us","text":"/ˈbɑɹkɪŋ/"}]},{"word":"DREAD","idx":19675,"count":1649823,"meanings":[{"definitions":[{"definition":"Great fear in view of impending evil; fearful apprehension of danger; anticipatory terror.","example":"my visit to the doctor is filling me with dread"},{"definition":"Reverential or respectful fear; awe."},{"definition":"Somebody or something dreaded."},{"definition":"A person highly revered."},{"definition":"Fury; dreadfulness."},{"definition":"A Rastafarian."},{"definition":"(chiefly in the plural) dreadlock"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fear greatly."},{"definition":"To anticipate with fear.","example":"I'm dreading getting the results of the test, as it could decide my whole life."},{"definition":"To be in dread, or great fear."},{"definition":"To style (the hair) into dreadlocks."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Terrible; greatly feared."},{"definition":"Awe-inspiring; held in fearful awe."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dread-us","text":"/dɹɛd/"}]},{"word":"DAG","idx":19676,"count":1649705,"meanings":[{"definitions":[{"definition":"A hanging end or shred, in particular a long pointed strip of cloth at the edge of a piece of clothing, or one of a row of decorative strips of cloth that may ornament a tent, booth or fairground."},{"definition":"A dangling lock of sheep’s wool matted with dung."},{"definition":"A skewer."},{"definition":"A spit, a sharpened rod used for roasting food over a fire."},{"definition":"A dagger; a poniard."},{"definition":"A kind of large pistol."},{"definition":"The unbranched antler of a young deer."},{"definition":"One who dresses unfashionably or without apparent care about appearance."},{"definition":"A directed acyclic graph; an ordered pair (V, E) such that E is a subset of some partial ordering relation on V."},{"definition":"A misty shower; dew."},{"definition":"A mammal, Canis familiaris or Canis lupus familiaris, that has been domesticated for thousands of years, of highly variable appearance due to human breeding.","example":"The dog barked all night long."},{"definition":"Any member of the Family Canidae, including domestic dogs, wolves, coyotes, jackals, foxes, and their relatives (extant and extinct); canid."},{"definition":"A male dog, wolf or fox, as opposed to a bitch or vixen."},{"definition":"A dull, unattractive girl or woman.","example":"She’s a real dog."},{"definition":"A man (derived from definition 2).","example":"He's a silly dog."},{"definition":"A coward.","example":"Come back and fight, you dogs!"},{"definition":"Someone who is morally reprehensible.","example":"You dirty dog."},{"definition":"A sexually aggressive man (cf. horny)."},{"definition":"Any of various mechanical devices for holding, gripping, or fastening something, particularly with a tooth-like projection."},{"definition":"A click or pallet adapted to engage the teeth of a ratchet-wheel, to restrain the back action; a click or pawl. (See also: ratchet, windlass)"},{"definition":"A metal support for logs in a fireplace.","example":"The dogs were too hot to touch."},{"definition":"The eighteenth Lenormand card."},{"definition":"A hot dog."},{"definition":"Underdog."},{"definition":"(almost always in the plural) Foot."},{"definition":"(from \"dog and bone\") Phone or mobile phone.","example":"My dog is dead."},{"definition":"One of the cones used to divide up a racetrack when training horses."},{"definition":"A flop; a film that performs poorly at the box office."},{"definition":"Meat from a dog eaten as food.","example":"We visited South Korea this time around, where we ate dog meat for the first time."},{"definition":"Meat prepared to be given to a dog as food."},{"definition":"An insult intended to assert hyperbolically that another person has value only as a corpse to be fed to a dog.","example":"Did you just step on my blue suede shoes? You're dog meat now!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shear the hindquarters of a sheep in order to remove dags or prevent their formation."},{"definition":"To daggle or bemire."},{"definition":"To skewer food, for roasting over a fire"},{"definition":"To cut or slash the edge of a garment into dags"},{"definition":"To be misty; to drizzle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Expressing shock, awe or surprise; used as a general intensifier."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"dag-au","text":"/dæɡ/"}]},{"word":"CATCHMENT","idx":19677,"count":1649610,"meanings":[{"definitions":[{"definition":"Any structure or land feature which catches and holds water; the collection of such water."},{"definition":"A catchment area, or the people it serves."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide into catchment areas.","example":"the catchmenting of mental health services"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkætʃmənt/"},{"text":"/ˈkatʃmənt/"},{"audio":"catchment-au"}]},{"word":"TACTIC","idx":19679,"count":1649523,"meanings":[{"definitions":[{"definition":"A maneuver, or action calculated to achieve some end."},{"definition":"A maneuver used against an enemy."},{"definition":"A sequence of moves that limits the opponent's options and results in an immediate and tangible advantage, typically in the form of material."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Tactical; of or relating to the art of military and naval tactics."},{"definition":"Describing a polymer whose repeat units are identical."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tactic-us","text":"/ˈtæktɪk/"}]},{"word":"ESS","idx":19680,"count":1649372,"meanings":[{"definitions":[{"definition":"The name of the Latin-script letter S."},{"definition":"Something shaped like the letter S."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move in a changing direction, forming the shape of a letter S."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɛs/"}]},{"word":"PARTITIONING","idx":19681,"count":1649370,"meanings":[{"definitions":[{"definition":"To divide something into parts, sections or shares"},{"definition":"To divide a region or country into two or more territories with separate political status"},{"definition":"To separate or divide a room by a partition (ex. a wall), often use with off"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or result of dividing into partitions; an arrangement of partitions."}],"partOfSpeech":"n"}]},{"word":"VOICEMAIL","idx":19682,"count":1649324,"meanings":[{"definitions":[{"definition":"A computerized interactive system for storing, processing and reproducing verbal messages left through a conventional telephone network."},{"definition":"(by extension) An individual message on such a system."}],"partOfSpeech":"n"}]},{"word":"HANDWRITING","idx":19684,"count":1649048,"meanings":[{"definitions":[{"definition":"To write something manually, normally used to emphasise that it is not being typed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process of writing done with the hand, rather than typed or word-processed."},{"definition":"Text that was written by hand."},{"definition":"The characteristic writing of a particular person."},{"definition":"(by extension) A characteristic trait or hallmark by which somebody may be recognised."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhændɹaɪtɪŋ/"}]},{"word":"SERPENT","idx":19686,"count":1648778,"meanings":[{"definitions":[{"definition":"A snake."},{"definition":"An obsolete wind instrument in the brass family, whose shape is suggestive of a snake (Wikipedia article)."},{"definition":"A subtle, treacherous, malicious person."},{"definition":"A kind of firework with a serpentine motion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wind or meander"},{"definition":"To encircle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"serpent-us","text":"/ˈsɝpənt/"}]},{"word":"TAPPED","idx":19688,"count":1648690,"meanings":[{"definitions":[{"definition":"To furnish with taps.","example":"If we tap the maple trees, we can get maple syrup!"},{"definition":"To draw off liquid from a vessel.","example":"He tapped a new barrel of beer."},{"definition":"To deplete, especially of a liquid via a tap; to tap out."},{"definition":"To exploit.","example":"Businesses are trying to tap the youth market."},{"definition":"To place a listening or recording device on a telephone or wired connection.","example":"They can't tap the phone without a warrant."},{"definition":"To intercept a communication without authority.","example":"He was known to tap cable television."},{"definition":"To cut an internal screw thread.","example":"Tap an M3 thread all the way through the hole."},{"definition":"To turn or flip a card or playing piece to remind players that it has already been used that turn (by analogy to \"tapping,\" in the sense of drawing on to the point of temporary exhaustion, the resources or abilities represented by the card)."},{"definition":"To cadge, borrow or beg.","example":"I tried to tap a cigarette off him, but he wouldn't give me one."},{"definition":"To drain off fluid by paracentesis."},{"definition":"To advance someone for a post or job, or for membership of a club.","example":"Trump interviewed Mueller for FBI job day before he was tapped for special counsel."},{"definition":"To strike lightly.","example":"She tapped him on the shoulder to get his attention."},{"definition":"To touch one's finger, foot, or other body parts on a surface (usually) repeatedly.","example":"He was so nervous he began to tap his fingers on the table."},{"definition":"To make a sharp noise.","example":"The tree, swaying in the breeze, began to tap on the window pane."},{"definition":"To operate an electronic device (e.g. a mobile phone) by tapping a specific place on its (capacitive or other) touch screen."},{"definition":"To designate for some duty or for membership, as in 'a tap on the shoulder'."},{"definition":"To have sexual intercourse with.","example":"I would tap that hot girl over there."},{"definition":"To submit to an opponent by tapping one's hand repeatedly."},{"definition":"To force (an opponent) to submit."},{"definition":"To put a new sole or heel on.","example":"to tap shoes"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Furnished with active taps (e.g. a keg or a maple tree)"},{"definition":"Of a card or playing piece, used up for the current turn"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/tæpt/"}]},{"word":"ARTICULATED","idx":19689,"count":1648485,"meanings":[{"definitions":[{"definition":"To make clear or effective."},{"definition":"To speak clearly; to enunciate.","example":"I wish he’d articulate his words more clearly."},{"definition":"To explain; to put into words; to make something specific.","example":"I like this painting, but I can’t articulate why."},{"definition":"To bend or hinge something at intervals, or to allow or build something so that it can bend.","example":"an articulated bus"},{"definition":"To attack a note, as by tonguing, slurring, bowing, etc.","example":"Articulate that passage heavily."},{"definition":"To form a joint or connect by joints","example":"The lower jaw articulates with the skull at the temporomandibular joint."},{"definition":"To treat or make terms."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An articulated vehicle, such as a locomotive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Constructed with one or more pivoted joints which allow bending of an otherwise rigid structure."},{"definition":"Of a vehicle, composed of component parts each with its own wheels and chassis, e.g. an articulated lorry, articulated bus, or certain kinds of streetcars and trains."}],"partOfSpeech":"j"}]},{"word":"PITCHED","idx":19690,"count":1648460,"meanings":[{"definitions":[{"definition":"To cover or smear with pitch."},{"definition":"To darken; to blacken; to obscure."},{"definition":"To throw.","example":"He pitched the horseshoe."},{"definition":"To throw (the ball) toward a batter at home plate."},{"definition":"To play baseball in the position of pitcher.","example":"Bob pitches today."},{"definition":"To throw away; discard.","example":"He pitched the candy wrapper."},{"definition":"To promote, advertise, or attempt to sell.","example":"He pitched the idea for months with no takers."},{"definition":"To deliver in a certain tone or style, or with a certain audience in mind.","example":"At which level should I pitch my presentation?"},{"definition":"To assemble or erect (a tent).","example":"Pitch the tent over there."},{"definition":"To fix or place a tent or temporary habitation; to encamp."},{"definition":"To move so that the front of an aircraft or boat goes alternatively up and down."},{"definition":"To play a short, high, lofty shot that lands with backspin.","example":"The only way to get on the green from here is to pitch the ball over the bunker."},{"definition":"To bounce on the playing surface.","example":"The ball pitched well short of the batsman."},{"definition":"(of snow) To settle and build up, without melting."},{"definition":"To alight; to settle; to come to rest from flight."},{"definition":"(with on or upon) To fix one's choice."},{"definition":"To plunge or fall; especially, to fall forward; to decline or slope.","example":"The field pitches toward the east."},{"definition":"(of an embankment, roadway) To set, face, or pave with rubble or undressed stones."},{"definition":"(of a price, value) To set or fix."},{"definition":"(of a card) To discard for some gain."},{"definition":"To produce a note of a given pitch."},{"definition":"To fix or set the tone of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a slope.","example":"a pitched roof"},{"definition":"Having a specified tonal range.","example":"a high-pitched scream."},{"definition":"Fought from predetermined positions at a specified time and place.","example":"a pitched battle"},{"definition":"Covered in pitch."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pitched-us","text":"/pɪtʃt/"}]},{"word":"PARENTHESES","idx":19691,"count":1648298,"meanings":[{"definitions":[{"definition":"A clause, phrase or word which is inserted (usually for explanation or amplification) into a passage which is already grammatically complete, and usually marked off with brackets, commas or dashes."},{"definition":"Either of a pair of brackets, especially round brackets, ( and ) (used to enclose parenthetical material in a text)."},{"definition":"A digression; the use of such digressions."},{"definition":"Such brackets as used to clarify expressions by grouping those terms affected by a common operator, or to enclose the components of a vector or the elements of a matrix."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"parentheses-us","text":"/pəˈɹɛnθəsiːz/"}]},{"word":"CONTEXTUAL","idx":19692,"count":1648180,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or depending on the context of information; relating to the situation or location in which the information was found."}],"partOfSpeech":"j"}]},{"word":"WISELY","idx":19696,"count":1647283,"meanings":[{"definitions":[{"definition":"In a wise manner; using good judgement.","example":"She wisely decided to re-check her homework before submitting it."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈwaɪzli/"}]},{"word":"ACCUSTOMED","idx":19697,"count":1647188,"meanings":[{"definitions":[{"definition":"(of a person) Familiar with something through repeated experience; adapted to existing conditions.","example":"accustomed to cold"},{"definition":"(of a thing, condition, activity, etc.) Familiar through use; usual; customary."},{"definition":"Frequented by customers."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"accustomed-ca","text":"/ə.ˈkʌs.təmd/"}]},{"word":"STEAKS","idx":19699,"count":1646745,"meanings":[{"definitions":[{"definition":"Beefsteak, a slice of beef, broiled or cut for broiling."},{"definition":"(by extension) A relatively large, thick slice or slab cut from another animal, a vegetable, etc."},{"definition":"(seafood) A slice of meat cut across the grain (perpendicular to the spine) from a fish."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/steɪks/"}]},{"word":"PLAYHOUSE","idx":19701,"count":1646694,"meanings":[{"definitions":[{"definition":"A child's toy domestic dwelling, either for dolls or large enough for the child to enter."},{"definition":"A venue for performing plays."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpleɪhaʊs/"}]},{"word":"SUPERFICIAL","idx":19702,"count":1646666,"meanings":[{"definitions":[{"definition":"(chiefly in plural) A surface detail.","example":"He always concentrates on the superficials and fails to see the real issue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the surface."},{"definition":"Being near the surface."},{"definition":"Shallow, lacking substance."},{"definition":"At face value."},{"definition":"Two-dimensional; drawn on a flat surface."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"superficial-us","text":"/ˌsupɚˈfɪʃəl/"}]},{"word":"TOXINS","idx":19703,"count":1646568,"meanings":[{"definitions":[{"definition":"A toxic or poisonous substance produced by the biological processes of biological organisms."}],"partOfSpeech":"n"}]},{"word":"SUNS","idx":19705,"count":1646060,"meanings":[{"definitions":[{"definition":"A star, especially when seen as the centre of any single solar system."},{"definition":"The light and warmth which is received from the sun."},{"definition":"Something like the sun in brightness or splendor."},{"definition":"Sunrise or sunset."},{"definition":"The nineteenth trump/major arcana card of the Tarot."},{"definition":"The thirty-first Lenormand card."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To expose to the warmth and radiation of the sun.","example":"Beautiful bodies lying on the beach, sunning their bronzed limbs."},{"definition":"To warm or dry in the sunshine."},{"definition":"To be exposed to the sun."},{"definition":"To expose the eyes to the sun as part of the Bates method."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"suns-us","text":"/sʌnz/"}]},{"word":"CASTS","idx":19707,"count":1645690,"meanings":[{"definitions":[{"definition":"An act of throwing."},{"definition":"An instance of throwing out a fishing line."},{"definition":"Something which has been thrown, dispersed etc."},{"definition":"A small mass of earth \"thrown off\" or excreted by a worm.","example":"The area near the stream was covered with little bubbly worm casts."},{"definition":"The collective group of actors performing a play or production together. Contrasted with crew.","example":"He’s in the cast of Oliver."},{"definition":"The casting procedure.","example":"The men got into position for the cast, two at the ladle, two with long rods, all with heavy clothing."},{"definition":"An object made in a mould.","example":"The cast would need a great deal of machining to become a recognizable finished part."},{"definition":"A supportive and immobilising device used to help mend broken bones.","example":"The doctor put a cast on the boy’s broken arm."},{"definition":"The mould used to make cast objects.","example":"A plaster cast was made from his face."},{"definition":"(hawking) The number of hawks (or occasionally other birds) cast off at one time; a pair."},{"definition":"A squint."},{"definition":"Visual appearance.","example":"Her features had a delicate cast to them."},{"definition":"The form of one's thoughts, mind etc.","example":"a cast of mind, a mental tendency."},{"definition":"An animal, especially a horse, that is unable to rise without assistance."},{"definition":"Animal and insect remains which have been regurgitated by a bird."},{"definition":"A group of crabs."},{"definition":"A broadcast."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(physical) To move, or be moved, away."},{"definition":"To direct (one's eyes, gaze etc.)."},{"definition":"To add up (a column of figures, accounts etc.); cross-cast refers to adding up a row of figures."},{"definition":"(social) To predict, to decide, to plan."},{"definition":"To perform, bring forth (a magical spell or enchantment)."},{"definition":"To throw (light etc.) on or upon something, or in a given direction."},{"definition":"To give birth to (a child) prematurely; to miscarry."},{"definition":"To shape (molten metal etc.) by pouring into a mould; to make (an object) in such a way."},{"definition":"To twist or warp (of fabric, timber etc.)."},{"definition":"To bring the bows of a sailing ship on to the required tack just as the anchor is weighed by use of the headsail; to bring (a ship) round."},{"definition":"To deposit (a ballot or voting paper); to formally register (one's vote)."},{"definition":"To change a variable type from, for example, integer to real, or integer to text.","example":"Casting is generally an indication of bad design."},{"definition":"Of dogs, hunters: to spread out and search for a scent."},{"definition":"To set (a bone etc.) in a cast."},{"definition":"To open a circle in order to begin a spell or meeting of witches."},{"definition":"To broadcast.","example":"The streamer was the first to cast footage of the new game."}],"partOfSpeech":"ve"}]},{"word":"BUNK","idx":19708,"count":1645649,"meanings":[{"definitions":[{"definition":"One of a series of berths or beds placed in tiers."},{"definition":"A built-in bed on board ship, often erected in tiers one above the other."},{"definition":"A cot."},{"definition":"A wooden case or box, which serves for a seat in the daytime and for a bed at night."},{"definition":"A piece of wood placed on a lumberman's sled to sustain the end of heavy timbers."},{"definition":"Bunkum; senseless talk, nonsense."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To occupy a bunk."},{"definition":"To provide a bunk."},{"definition":"To fail to attend school or work without permission; to play truant (usually as in 'to bunk off')."},{"definition":"To expel from a school."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Defective, broken, not functioning properly"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bunk-au","text":"/bʌŋk/"}]},{"word":"CRYPTOGRAPHY","idx":19709,"count":1645630,"meanings":[{"definitions":[{"definition":"The discipline concerned with communication security (eg, confidentiality of messages, integrity of messages, sender authentication, non-repudiation of messages, and many other related issues), regardless of the used medium such as pencil and paper or computers."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɹɪpˈtɒɡ.ɹə.fi/"}]},{"word":"STAB","idx":19710,"count":1645553,"meanings":[{"definitions":[{"definition":"An act of stabbing or thrusting with an object."},{"definition":"A wound made by stabbing."},{"definition":"Pain inflicted on a person's feelings."},{"definition":"An attempt."},{"definition":"Criticism."},{"definition":"A single staccato chord that adds dramatic impact to a composition.","example":"a horn stab"},{"definition":"A bacterial culture made by inoculating a solid medium, such as gelatin, with the puncture of a needle or wire."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pierce or to wound (somebody) with a pointed tool or weapon, especially a knife or dagger.","example":"If you stab him in the heart he won't live long enough to retaliate."},{"definition":"To thrust in a stabbing motion.","example":"to stab a dagger into a person"},{"definition":"To recklessly hit with the tip of a pointed object, such as a weapon or finger (often used with at).","example":"He stabbed at my face with the twig but luckily kept missing my eyes."},{"definition":"To cause a sharp, painful sensation (often used with at).","example":"The snow from the blizzard was stabbing at my face as I skied down the mountain."},{"definition":"To injure secretly or by malicious falsehood or slander.","example":"to stab a person's reputation"},{"definition":"To roughen a brick wall with a pick so as to hold plaster."},{"definition":"To pierce folded sheets, near their back edges, for the passage of thread or wire."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stab-us","text":"/stæb/"}]},{"word":"SANCTION","idx":19711,"count":1645521,"meanings":[{"definitions":[{"definition":"An approval, by an authority, generally one that makes something valid.","example":"The whalers had been operating in the contested waters off the island with sanction from the Japanese government."},{"definition":"A penalty, punishment, or some coercive measure, intended to ensure compliance; especially one adopted by several nations, or by an international body.","example":"The United States enacted a new round of sanctions against the apartheid regime of South Africa."},{"definition":"A law, treaty, or contract, or a clause within a law, treaty, or contract, specifying any of the above."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ratify; to make valid."},{"definition":"To give official authorization or approval to; to countenance."},{"definition":"To penalize (a State etc.) with sanctions."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sanction-us"},{"text":"/ˈsæŋkʃən/"}]},{"word":"DYER","idx":19712,"count":1645507,"meanings":[{"definitions":[{"definition":"One who dyes, especially one who dyes cloth etc. as an occupation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdaɪɚ/"},{"text":"/ˈdaɪə/"}]},{"word":"EFFECTED","idx":19713,"count":1645475,"meanings":[{"definitions":[{"definition":"To make or bring about; to implement.","example":"The best way to effect change is to work with existing stakeholders."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Modified by effects."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"effected-us","text":"/ɪˈfɛktɪd/"}]},{"word":"SIGNALLING","idx":19714,"count":1645433,"meanings":[{"definitions":[{"definition":"To indicate; to convey or communicate by a signal."},{"definition":"To communicate with (a person or system) by a signal.","example":"Seeing the flames, he ran to the control room and signalled headquarters."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The use of signals in communications, especially the sending of signals in telecommunications"},{"definition":"The signals and associated equipment required for their operation."}],"partOfSpeech":"n"}]},{"word":"DAYCARE","idx":19715,"count":1645407,"meanings":[{"definitions":[{"definition":"Daytime supervision, usually of children."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdeɪkeə(ɹ)/"}]},{"word":"TUBULAR","idx":19717,"count":1645135,"meanings":[{"definitions":[{"definition":"Shaped like a tube.","example":"tubular bell"},{"definition":"Relating to, or composed of tubes or tubules"},{"definition":"Cool, awesome."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tubular-au","text":"/ˈtjubjəlɚ/"}]},{"word":"MOI","idx":19719,"count":1644951,"meanings":[{"definitions":[{"definition":"(often used questioningly to express mock surprise) Me.","example":"Don't you be so cheeky. — Cheeky? Moi?"}],"partOfSpeech":"p"}],"phonetics":[{"audio":"moi-us","text":"/mwɑː/"}]},{"word":"ODE","idx":19720,"count":1644895,"meanings":[{"definitions":[{"definition":"A short poetical composition proper to be set to music or sung; a lyric poem; especially, now, a poem characterized by sustained noble sentiment and appropriate dignity of style."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ode-uk","text":"/əʊd/"}]},{"word":"AVOIDS","idx":19723,"count":1644683,"meanings":[{"definitions":[{"definition":"To try not to meet or communicate with (a person); to shun"},{"definition":"To keep away from; to keep clear of; to stay away from","example":"I try to avoid the company of gamblers."},{"definition":"To try not to do something or to have something happen"},{"definition":"To make empty; to clear."},{"definition":"To make void, to annul; to refute (especially a contract)."},{"definition":"To defeat or evade; to invalidate."},{"definition":"To emit or throw out; to void."},{"definition":"To leave, evacuate; to leave as empty, to withdraw or come away from."},{"definition":"To get rid of."},{"definition":"To retire; to withdraw, depart, go away."},{"definition":"To become void or vacant."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈvɔɪdz/"}]},{"word":"ULTRASONIC","idx":19726,"count":1643762,"meanings":[{"definitions":[{"definition":"(acoustics) Beyond (higher in frequency than) the range of sound perceptible to the human ear; with a frequency of 20 kilohertz or higher."}],"partOfSpeech":"j"}]},{"word":"EVIDENCED","idx":19727,"count":1643586,"meanings":[{"definitions":[{"definition":"To provide evidence for, or suggest the truth of.","example":"She was furious, as evidenced by her slamming the door."}],"partOfSpeech":"ve"}]},{"word":"DIT","idx":19730,"count":1643411,"meanings":[{"definitions":[{"definition":"To stop up; block (an opening); close (compare Scots dit)."},{"definition":"To close up."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A ditty, a little melody."},{"definition":"A word; a decree."},{"definition":"The spoken representation of a dot in radio and telegraph Morse code."},{"definition":"Decimal digit"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Indicator of a declared surname originating from Canadian French."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪt/"}]},{"word":"LARVAE","idx":19731,"count":1643319,"meanings":[{"definitions":[{"definition":"An early stage of growth for some insects and amphibians, in which after hatching from their egg, insects are wingless and resemble a caterpillar or grub, and amphibians lack limbs and resemble fish."},{"definition":"An animal in the aforementioned stage."},{"definition":"A form of a recently born or hatched animal that is quite different from its adult stage."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɑɹ.vi/"},{"text":"/ˈlɑː.viː/"},{"text":"/ˈlɑɹ.veɪ/"}]},{"word":"DYKE","idx":19732,"count":1643250,"meanings":[{"definitions":[{"definition":"(usually derogatory) A lesbian, particularly one with masculine or butch traits or behavior."}],"partOfSpeech":"n"}]},{"word":"INTERGOVERNMENTAL","idx":19734,"count":1643136,"meanings":[{"definitions":[{"definition":"Of, relating to, or involving two or more governments."}],"partOfSpeech":"j"}]},{"word":"PARANOID","idx":19736,"count":1642722,"meanings":[{"definitions":[{"definition":"Someone suffering from paranoia"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, related to, or suffering from paranoia"},{"definition":"Exhibiting extreme and irrational fear or distrust of others","example":"Maybe I'm paranoid, but that doesn't mean that they are not out to get me."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"paranoid-uk","text":"/ˈpæɹ.ə.ˌnɔɪd/"}]},{"word":"KERNELS","idx":19737,"count":1642563,"meanings":[{"definitions":[{"definition":"The core, center, or essence of an object or system.","example":"the kernel of an argument"},{"definition":"The central (usually edible) part of a nut, especially once the hard shell has been removed."},{"definition":"A single seed or grain, especially of corn or wheat."},{"definition":"The stone of certain fruits, such as peaches or plums."},{"definition":"A small mass around which other matter is concreted; a nucleus; a concretion or hard lump in the flesh."},{"definition":"The central part of many computer operating systems which manages the system's resources and the communication between hardware and software components.","example":"The Linux kernel is open-source."},{"definition":"The core engine of any complex software system."},{"definition":"A function used to define an integral transform.","example":"The Dirichlet kernel convolved with a function yields its Fourier series approximation."},{"definition":"A set of pairs of a mapping's domain which are mapped to the same value."},{"definition":"For a given function (especially a linear map between vector spaces), the set of elements in the domain which are mapped to zero; (formally) given f : X → Y, the set {x ∈ X : f(x) = 0}.","example":"If a function is continuous then its kernel is a closed set."},{"definition":"For a category with zero morphisms: the equalizer of a given morphism and the zero morphism which is parallel to that given morphism."},{"definition":"(fuzzy set theory) The set of members of a fuzzy set that are fully included (i.e., whose grade of membership is 1)."},{"definition":"The human clitoris."},{"definition":"The nucleus and electrons of an atom excluding its valence electrons."}],"partOfSpeech":"n"}]},{"word":"MOBILIZATION","idx":19738,"count":1642231,"meanings":[{"definitions":[{"definition":"The act of mobilizing"},{"definition":"The marshalling of troops and national resources in preparation for war."},{"definition":"The process by which the armed forces of a nation are brought to a state of readiness for a conflict."},{"definition":"The softening of rock such that geochemical migration can take place"},{"definition":"The transport of a copy of a gene from one chromosome, or one organism to another"}],"partOfSpeech":"n"}]},{"word":"DINO","idx":19739,"count":1642153,"meanings":[{"definitions":[{"definition":"Dinosaur."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdaɪnoʊ/"}]},{"word":"AMT","idx":19742,"count":1642018,"meanings":[{"definitions":[{"definition":"The total, aggregate or sum of material (not applicable to discrete numbers or units or items in standard English).","example":"The amount of atmospheric pollution threatens a health crisis."},{"definition":"A quantity or volume.","example":"Pour a small amount of water into the dish."},{"definition":"(sometimes proscribed) The number (the sum) of elements in a set."},{"definition":"A county in Denmark."}],"partOfSpeech":"n"}]},{"word":"SNORKELING","idx":19746,"count":1641053,"meanings":[{"definitions":[{"definition":"To use a snorkel."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of swimming using a snorkel."}],"partOfSpeech":"n"}]},{"word":"QUALIFIER","idx":19751,"count":1640552,"meanings":[{"definitions":[{"definition":"One who qualifies for something, especially a contestant who qualifies for a stage in a competition."},{"definition":"A preliminary stage of a competition."},{"definition":"(grammar) A word or phrase, such as an adjective or adverb, that describes or characterizes another word or phrase, such as a noun or verb; a modifier; that adds or subtracts attributes to another."},{"definition":"A marker that qualifies or modifies another code element."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkwɑl.ɪ.faɪ.ɚ/"},{"text":"/ˈkwɒl.ɪ.faɪ.ə/"}]},{"word":"MANIPULATED","idx":19752,"count":1640498,"meanings":[{"definitions":[{"definition":"To move, arrange or operate something using the hands"},{"definition":"To influence, manage, direct, control or tamper with something"},{"definition":"To handle and move a body part, either as an examination or for a therapeutic purpose"},{"definition":"To influence or control someone in order to achieve a specific purpose, especially one that is unknown to the one being manipulated and beneficial to the manipulator; to use"},{"definition":"To use the hands, especially in scientific experiments."}],"partOfSpeech":"ve"}]},{"word":"ALLEVIATE","idx":19754,"count":1640342,"meanings":[{"definitions":[{"definition":"To make less severe, as a pain or difficulty.","example":"Alcohol is often a cheap tool to alleviate the stress of a hard day."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"alleviate-us","text":"/əˈli.vi.eɪt/"}]},{"word":"FUNGAL","idx":19755,"count":1640076,"meanings":[{"definitions":[{"definition":"Of or pertaining to a fungus or fungi.","example":"Doctors determined that the cause of the itchy rash was fungal rather than bacterial."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfʌŋɡəl/"}]},{"word":"LIGAND","idx":19756,"count":1640021,"meanings":[{"definitions":[{"definition":"An ion, molecule, or functional group that binds to another chemical entity to form a larger complex."},{"definition":"A letter that orthography requires to be ligated with one or more other letters."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlaɪɡənd/"},{"text":"/ˈlɪɡənd/"}]},{"word":"SEAM","idx":19757,"count":1639943,"meanings":[{"definitions":[{"definition":"A folded-back and stitched piece of fabric; especially, the stitching that joins two or more pieces of fabric."},{"definition":"A suture."},{"definition":"A thin stratum, especially of an economically viable material such as coal or mineral."},{"definition":"The stitched equatorial seam of a cricket ball; the sideways movement of a ball when it bounces on the seam."},{"definition":"A joint formed by mating two separate sections of materials.","example":"Seams can be made or sealed in a variety of ways, including adhesive bonding, hot-air welding, solvent welding, using adhesive tapes, sealant, etc."},{"definition":"A line or depression left by a cut or wound; a scar; a cicatrix."},{"definition":"A line of junction; a joint."},{"definition":"An old English measure of grain, containing eight bushels."},{"definition":"An old English measure of glass, containing twenty-four weys of five pounds, or 120 pounds."},{"definition":"Grease; tallow; lard"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put together with a seam."},{"definition":"To make the appearance of a seam in, as in knitting a stocking; hence, to knit with a certain stitch, like that in such knitting."},{"definition":"To mark with a seam or line; to scar."},{"definition":"To crack open along a seam."},{"definition":"Of the ball, to move sideways after bouncing on the seam."},{"definition":"Of a bowler, to make the ball move thus."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"seam-us","text":"/siːm/"},{"audio":"seam-au","text":"/siːm/"}]},{"word":"RIDDLE","idx":19761,"count":1639366,"meanings":[{"definitions":[{"definition":"A verbal puzzle, mystery, or other problem of an intellectual nature.","example":"Here's a riddle: It's black, and white, and red all over. What is it?"},{"definition":"An ancient verbal, poetic, or literary form, in which, rather than a rhyme scheme, there are parallel opposing expressions with a hidden meaning."},{"definition":"A sieve with coarse meshes, usually of wire, for separating coarser materials from finer, as chaff from grain, cinders from ashes, or gravel from sand."},{"definition":"A board with a row of pins, set zigzag, between which wire is drawn to straighten it."},{"definition":"A curtain; bed-curtain"},{"definition":"One of the pair of curtains enclosing an altar on the north and south"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To speak ambiguously or enigmatically."},{"definition":"To solve, answer, or explicate a riddle or question.","example":"Riddle me this."},{"definition":"To put something through a riddle or sieve, to sieve, to sift.","example":"You have to riddle the gravel before you lay it on the road."},{"definition":"To fill with holes like a riddle.","example":"The shots from his gun began to riddle the targets."},{"definition":"To fill or spread throughout; to pervade.","example":"Your argument is riddled with errors."},{"definition":"To plait"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"riddle-uk","text":"/ˈɹɪdəl/"}]},{"word":"COASTLINE","idx":19762,"count":1639278,"meanings":[{"definitions":[{"definition":"The shape, outline, or boundary of a coast."}],"partOfSpeech":"n"}]},{"word":"COMEDIES","idx":19763,"count":1638987,"meanings":[{"definitions":[{"definition":"A choric song of celebration or revel, especially in Ancient Greece."},{"definition":"A light, amusing play with a happy ending."},{"definition":"(Medieval Europe) A narrative poem with an agreeable ending (e.g., The Divine Comedy)."},{"definition":"A dramatic work that is light and humorous or satirical in tone."},{"definition":"The genre of such works."},{"definition":"Entertainment composed of jokes, satire, or humorous performance.","example":"Why would you be watching comedy when there are kids starving right now?"},{"definition":"The art of composing comedy."},{"definition":"A humorous event."}],"partOfSpeech":"n"}]},{"word":"FAINTER","idx":19764,"count":1638739,"meanings":[{"definitions":[{"definition":"(of a being) Lacking strength; weak; languid; inclined to lose consciousness","example":"I felt faint after my fifth gin and tonic."},{"definition":"Lacking courage, spirit, or energy; cowardly; dejected"},{"definition":"Barely perceptible; not bright, or loud, or sharp","example":"There was a faint red light in the distance."},{"definition":"Performed, done, or acted, weakly; not exhibiting vigor, strength, or energy","example":"faint efforts"},{"definition":"Slight; minimal."}],"partOfSpeech":"j"},{"definitions":[{"definition":"One who faints."}],"partOfSpeech":"n"}]},{"word":"OMIT","idx":19765,"count":1638380,"meanings":[{"definitions":[{"definition":"To leave out or exclude."},{"definition":"To fail to perform."},{"definition":"To neglect or take no notice of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"omit-us","text":"/oʊˈmɪt/"}]},{"word":"RESPECTFUL","idx":19766,"count":1638205,"meanings":[{"definitions":[{"definition":"Marked or characterized by respect","example":"It is of great importance that you act in a respectful manner towards the duke and duchess."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"respectful-us","text":"/ɹɪˈspɛktfəl/"}]},{"word":"FLAMINGO","idx":19767,"count":1638181,"meanings":[{"definitions":[{"definition":"A wading bird of the family Phoenicopteridae."},{"definition":"A deep pink color tinged with orange, like that of a flamingo."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a deep pink color tinged with orange, like that of a flamingo."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/fləˈmɪŋɡoʊ/"}]},{"word":"CABARET","idx":19768,"count":1638162,"meanings":[{"definitions":[{"definition":"Live entertainment held in a restaurant or nightclub; the genre of music associated with this form of entertainment, especially in early 20th century Europe."},{"definition":"The nightclub or restaurant where such entertainment is held."},{"definition":"A strip club."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kæbəˈreɪ/"}]},{"word":"DEFORMATION","idx":19769,"count":1637818,"meanings":[{"definitions":[{"definition":"The act of deforming, or state of being deformed."},{"definition":"A transformation; change of shape."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdɛfəˈmeɪʃən/"}]}]