[{"word":"FAVORING","idx":35929,"count":587753,"meanings":[{"definitions":[{"definition":"To look upon fondly; to prefer."},{"definition":"To encourage, conduce to"},{"definition":"To do a favor [noun sense 1] for; to show beneficence toward.","example":"Would you favor us with a poetry reading?"},{"definition":"To treat with care.","example":"Favoring your sore leg will only injure the other one."},{"definition":"(including) To resemble, to look like (another person)."}],"partOfSpeech":"ve"}]},{"word":"CONVERGING","idx":35930,"count":587721,"meanings":[{"definitions":[{"definition":"Of two or more entities, to approach each other; to get closer and closer."},{"definition":"Of a sequence, to have a limit."},{"definition":"Of an iterative process, to reach a stable end point."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Convergence"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Approaching each other at a point; convergent."}],"partOfSpeech":"j"}]},{"word":"MUFFLERS","idx":35940,"count":587357,"meanings":[{"definitions":[{"definition":"Part of the exhaust pipe of a car that dampens the noise the engine produces."},{"definition":"A silencer or suppressor fitted to a gun."},{"definition":"A type of scarf."}],"partOfSpeech":"n"}]},{"word":"QUARKS","idx":35941,"count":587246,"meanings":[{"definitions":[{"definition":"In the Standard Model, an elementary subatomic particle that forms matter. They combine to form hadrons, such as protons and neutrons."},{"definition":"(X Window System) An integer that uniquely identifies a text string."},{"definition":"(Falkland Islands) The black-crowned night heron, Nycticorax nycticorax."}],"partOfSpeech":"n"}]},{"word":"INQUISITION","idx":35943,"count":587218,"meanings":[{"definitions":[{"definition":"An investigation or inquiry into the truth of some matter"},{"definition":"An inquest"},{"definition":"A questioning"},{"definition":"The finding of a jury, especially such a finding under a writ of inquiry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make inquisition concerning; to inquire into."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"inquisition-us","text":"/ˌɪŋkwɪˈzɪʃən/"}]},{"word":"REFACTORING","idx":35944,"count":587214,"meanings":[{"definitions":[{"definition":"To rewrite existing source code in order to improve its readability, reusability or structure without affecting its meaning or behaviour.","example":"The code works, but I must refactor it before it is production quality."},{"definition":"(writing) To rewrite existing text in order to improve its readability, reusability or structure without intentionally affecting its meaning. Similar to, but sometimes involving more extensive restructuring than, copy editing.","example":"Two significant activities which to contribute to community projects, such as Wikipedia, are to refactor complicated articles into simpler ones, and to refactor duplicated content into reusable templates."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act or process in which code is refactored."}],"partOfSpeech":"n"}]}]