[{"word":"FLOOD","idx":4816,"count":13979267,"meanings":[{"definitions":[{"definition":"A (usually disastrous) overflow of water from a lake or other body of water due to excessive rainfall or other input of water."},{"definition":"A large number or quantity of anything appearing more rapidly than can easily be dealt with.","example":"a flood of complaints"},{"definition":"The flowing in of the tide, opposed to the ebb."},{"definition":"A floodlight."},{"definition":"Menstrual discharge; menses."},{"definition":"Water as opposed to land."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To overflow, as by water from excessive rainfall."},{"definition":"To cover or partly fill as if by a flood.","example":"The floor was flooded with beer."},{"definition":"To provide (someone or something) with a larger number or quantity of something than can easily be dealt with.","example":"The station's switchboard was flooded with listeners making complaints."},{"definition":"To paste numerous lines of text to (a chat system) in order to disrupt the conversation."},{"definition":"To bleed profusely, as after childbirth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/flood-us.mp3","text":"/flʌd/"}]},{"word":"EASE","idx":4818,"count":13974702,"meanings":[{"definitions":[{"definition":"Ability, the means to do something, particularly:"},{"definition":"Comfort, a state or quality lacking unpleasantness, particularly:"},{"definition":"Relief, an end to discomfort, particularly:"},{"definition":"A convenience; a luxury."},{"definition":"A relief; an easement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To free (something) from pain, worry, agitation, etc.","example":"He eased his conscience by confessing."},{"definition":"To alleviate, assuage or lessen (pain).","example":"He loosened his shoe to ease the pain."},{"definition":"To give respite to (someone).","example":"The provision of extra staff eased their workload."},{"definition":"To loosen or slacken the tension on a line.","example":"We eased the boom vang, then lowered the sail."},{"definition":"To reduce the difficulty of (something).","example":"We had to ease the entry requirements."},{"definition":"To move (something) slowly and carefully.","example":"He eased the cork from the bottle."},{"definition":"To lessen in severity.","example":"The pain eased overnight."},{"definition":"To proceed with little effort.","example":"The car eased onto the motorway."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/ease-us.mp3","text":"/iz/"}]},{"word":"ARGUMENTS","idx":4819,"count":13971547,"meanings":[{"definitions":[{"definition":"A fact or statement used to support a proposition; a reason."},{"definition":"A verbal dispute; a quarrel."},{"definition":"A process of reasoning."},{"definition":"A series of propositions organized so that the final proposition is a conclusion which is intended to follow logically from the preceding propositions, which function as premises."},{"definition":"The independent variable of a function."},{"definition":"The phase of a complex number."},{"definition":"A value, or reference to a value, passed to a function.","example":"Parameters are like labeled fillable blanks used to define a function whereas arguments are passed to a function when calling it, filling in those blanks."},{"definition":"A parameter at a function call; an actual parameter, as opposed to a formal parameter."},{"definition":"Any of the phrases that bears a syntactic connection to the verb of a clause."},{"definition":"The quantity on which another quantity in a table depends.","example":"The altitude is the argument of the refraction."},{"definition":"The subject matter of a discourse, writing, or artistic representation; theme or topic; also, an abstract or summary, as of the contents of a book, chapter, poem."},{"definition":"Matter for question; business in hand."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(NNES) To put forward as an argument; to argue."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/arguments-us.mp3","text":"/ˈɑɹɡjəmənts/"}]},{"word":"ORGY","idx":4821,"count":13967728,"meanings":[{"definitions":[{"definition":"Originally, secret rites or ceremonies, typically involving riotous and dissolute behaviour, including dancing, drunkenness and indiscriminate sexual activity, undertaken in honour of various pagan gods or goddesses (such as Attis, Bacchus, Ceres, Dionysus, Osiris, etc)."},{"definition":"A gathering of people to engage in group sex."},{"definition":"Excessive indulgence in a specified activity."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɔː.dʒi/"}]},{"word":"ARENA","idx":4822,"count":13966572,"meanings":[{"definitions":[{"definition":"An enclosed area, often outdoor, for the presentation of sporting events (sports arena) or other spectacular events; earthen area, often oval, specifically for rodeos (North America) or circular area for bullfights (especially Hispanic America).","example":"A large crowd filled the seats of the arena."},{"definition":"The building housing such an area; specifically, a very large, often round building, often topped with a dome, designated for indoor sporting or other major events, such as concerts.","example":"The arena is grey with white beams."},{"definition":"The sand-covered centre of an amphitheatre where contests were held in Ancient Rome.","example":"The gladiators entered the arena."},{"definition":"A realm in which events take place; an area of interest, study, behaviour, etc.","example":"The company was a player in the maritime insurance arena."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈɹiːnə/"}]},{"word":"ADVENTURES","idx":4823,"count":13966085,"meanings":[{"definitions":[{"definition":"The encountering of risks; a bold undertaking, in which dangers are likely to be encountered, and the issue is staked upon unforeseen events; a daring feat."},{"definition":"A remarkable occurrence; a striking event.","example":"A life full of adventures."},{"definition":"A mercantile or speculative enterprise of hazard; a venture; a shipment by a merchant on his own account."},{"definition":"A feeling of desire for new and exciting things.","example":"his sense of adventure"},{"definition":"A text adventure or an adventure game."},{"definition":"That which happens by chance; hazard; hap."},{"definition":"Chance of danger or loss."},{"definition":"Risk; danger; peril."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To risk or hazard; jeopard; venture."},{"definition":"To venture upon; to run the risk of; to dare."},{"definition":"To try the chance; to take the risk."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/adventures-us.mp3","text":"/ædˈvɛnt͡ʃɚz/"}]},{"word":"PUPILS","idx":4824,"count":13951572,"meanings":[{"definitions":[{"definition":"A learner under the supervision of a teacher or professor."},{"definition":"An orphan who is a minor and under the protection of the state."},{"definition":"The hole in the middle of the iris of the eye, through which light passes to be focused on the retina."},{"definition":"The central dark part of an ocellated spot."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pupils-us.mp3","text":"/pjuːpəlz/"}]},{"word":"ANNOUNCEMENT","idx":4826,"count":13951272,"meanings":[{"definitions":[{"definition":"An act of announcing, or giving notice.","example":"He raised his hand to make his announcement and said \"Excuse me everyone, I have an announcement to make."},{"definition":"That which conveys what is announced.","example":"This announcement was made during the first training session."},{"definition":"The content which is announced.","example":"The announcement implied that somebody needed a spare Toshiba charger."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈnaʊns.mɛnt/"}]},{"word":"TABS","idx":4827,"count":13950657,"meanings":[{"definitions":[{"definition":"A small flap or strip of material attached to something, for holding, manipulation, identification, opening etc."},{"definition":"An ear."},{"definition":"(by extension) A navigational widget, resembling a physical tab, for switching between documents or sets of controls."},{"definition":"The page or form associated with such a navigational widget.","example":"How many tabs are open in your Web browser?"},{"definition":"(British army) A fast march or run with full kit."},{"definition":"A restaurant bill."},{"definition":"Credit account, e.g., in a shop or bar; slate","example":"Put this round on my tab, will you, barman."},{"definition":"A space character that extends to the next aligned column, traditionally used for tabulation."},{"definition":"A cigarette.","example":"Giv'is a tab man!"},{"definition":"A form of musical notation indicating fingering rather than the pitch of notes, commonly used for stringed instruments."},{"definition":"(British slang) A student of Cambridge University."},{"definition":"A tabloid newspaper."},{"definition":"A tablet, especially one containing illicit drugs."},{"definition":"A tableau curtain."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To affix with tabs; to label."},{"definition":"To use the Tab key on a computer to advance the cursor or move the input focus, or on a typewriter to advance the carriage."}],"partOfSpeech":"ve"}]},{"word":"OUTCOME","idx":4828,"count":13941550,"meanings":[{"definitions":[{"definition":"That which is produced or occurs as a result of an event or process.","example":"A quality automobile is the outcome of the work of skilled engineers and thousands of workers."},{"definition":"The result of a random trial. An element of a sample space.","example":"Three is a possible outcome of tossing a six-sided die."},{"definition":"The anticipated or desired results or evidence of a learning experience (often used in the phrase learning outcomes).","example":"The outcomes of this course are outlined in your syllabus."},{"definition":"The scoreline; the result."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈaʊtkʌm/"}]},{"word":"APPRECIATE","idx":4830,"count":13938792,"meanings":[{"definitions":[{"definition":"To be grateful or thankful for.","example":"I appreciate your efforts"},{"definition":"To view as valuable.","example":"You must learn to appreciate time"},{"definition":"To be fully conscious of; understand; be aware of; detect.","example":"I appreciate that what I'm asking you to do is very difficult."},{"definition":"To increase in value.","example":"The value of his portfolio appreciated by 80% over eight years."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/appreciate-us.mp3","text":"/əˈpɹiː.si.eɪt/"}]},{"word":"EXPANDED","idx":4831,"count":13932764,"meanings":[{"definitions":[{"definition":"To change (something) from a smaller form and/or size to a larger one; to spread out or lay open.","example":"You can expand this compact umbrella to cover a large table."},{"definition":"To increase the extent, number, volume or scope of (something).","example":"A flower expands its leaves."},{"definition":"To express (something) at length and/or in detail."},{"definition":"To rewrite (an expression) as a longer, yet equivalent sum of terms.","example":"Use the binomial theorem to expand {(x+1)}^4."},{"definition":"(of an expression) To become, by rewriting, a longer, yet equivalent sum of terms.","example":"The expression {(x+1)}^4 expands to x^4 + 4x^3 + 6x^2 + 4x + 1."},{"definition":"To multiply both the numerator and the denominator of a fraction by the same natural number yielding a fraction of equal value"},{"definition":"To change from a smaller form/size to a larger one.","example":"Many materials expand when heated."},{"definition":"To increase in extent, number, volume or scope."},{"definition":"To speak or write at length or in detail.","example":"He expanded on his plans for the business."},{"definition":"To feel generous or optimistic."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/expanded-us.mp3","text":"/ɛkˈspændɪd/"}]},{"word":"CASUAL","idx":4832,"count":13932521,"meanings":[{"definitions":[{"definition":"A worker who is only working for a company occasionally, not as its permanent employee."},{"definition":"A soldier temporarily at a place of duty, usually en route to another place of duty."},{"definition":"A member of a group of football hooligans who wear expensive designer clothing to avoid police attention; see casual (subculture)."},{"definition":"One who receives relief for a night in a parish to which he does not belong; a vagrant."},{"definition":"A player of casual games.","example":"The devs dumbed the game down so the casuals could enjoy it."},{"definition":"A person whose engagement with media is relaxed or superficial."},{"definition":"A tramp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Happening by chance.","example":"They only had casual meetings."},{"definition":"Coming without regularity; occasional or incidental.","example":"The purchase of donuts was just a casual expense."},{"definition":"Employed irregularly.","example":"He was just a casual worker."},{"definition":"Careless."},{"definition":"Happening or coming to pass without design."},{"definition":"Informal, relaxed."},{"definition":"Designed for informal or everyday use."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkæʒuəl/"},{"text":"/ˈkazjuəl/"},{"text":"/ˈkɛʒɘl/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/casual-au.mp3"}]},{"word":"GROWN","idx":4833,"count":13931521,"meanings":[{"definitions":[{"definition":"To become larger, to increase in magnitude.","example":"Children grow quickly."},{"definition":"To appear or sprout.","example":"A long tail began to grow from his backside."},{"definition":"To develop, to mature.","example":"As I grew throughout adolescence, I came to appreciate many things about human nature."},{"definition":"To cause or allow something to become bigger, especially to cultivate plants.","example":"Have you ever grown your hair before?"},{"definition":"To assume a condition or quality over time.","example":"The boy grew wise as he matured."},{"definition":"To become attached or fixed; to adhere."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Covered by growth; overgrown.","example":"What once was a farm was grown with trees."},{"definition":"Of a person: adult."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/grown-us.mp3","text":"/ɡɹoʊn/"}]},{"word":"POLISH","idx":4834,"count":13927858,"meanings":[{"definitions":[{"definition":"A substance used to polish.","example":"A good silver polish will remove tarnish easily."},{"definition":"Cleanliness; smoothness, shininess.","example":"The floor was waxed to a high polish."},{"definition":"Refinement; cleanliness in performance or presentation.","example":"The lecturer showed a lot of polish at his last talk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shine; to make a surface very smooth or shiny by rubbing, cleaning, or grinding.","example":"He polished up the chrome until it gleamed."},{"definition":"To refine; remove imperfections from.","example":"The band has polished its performance since the last concert."},{"definition":"To apply shoe polish to shoes."},{"definition":"To become smooth, as from friction; to receive a gloss; to take a smooth and glossy surface.","example":"Steel polishes well."},{"definition":"To refine; to wear off the rudeness, coarseness, or rusticity of; to make elegant and polite."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/polish-us.mp3","text":"/ˈpɑlɪʃ/"}]},{"word":"LOVELY","idx":4835,"count":13923904,"meanings":[{"definitions":[{"definition":"An attractive, lovely person, especially a (professional) beauty.","example":"a calendar depicting young lovelies in bikinis"},{"definition":"Term of fond address.","example":"Goodbye, my lovely."},{"definition":"A lovely object."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Beautiful; charming; very pleasing in form, looks, tone, or manner.","example":"It's a lovely day and the sun is shining."},{"definition":"Very nice, wonderful.","example":"It would be lovely to have a little more money to spend."},{"definition":"Inspiring love or friendship; amiable."},{"definition":"Loving, filled with love."},{"definition":"Worthy of praise."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a lovely fashion or manner; beautifully."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/lovely-us.mp3","text":"/ˈlʌvli/"}]},{"word":"EXTRAS","idx":4836,"count":13923870,"meanings":[{"definitions":[{"definition":"Something additional, such as an item above and beyond the ordinary school curriculum, or added to the usual charge on a bill."},{"definition":"An extra edition of a newspaper, which is printed outside of the normal printing cycle.","example":"Extra, extra! Read all about it!"},{"definition":"A run scored without the ball having hit the striker's bat - a wide, bye, leg bye or no ball."},{"definition":"A supernumerary or walk-on in a film or play."},{"definition":"Something of an extra quality or grade."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛkstɹəz/"}]},{"word":"GM","idx":4837,"count":13918451,"meanings":[{"definitions":[{"definition":"A manager with overall responsibility for an organisation or a distinct unit of an organisation."},{"definition":"Initialism of group message."}],"partOfSpeech":"n"}]},{"word":"CENTRES","idx":4838,"count":13910645,"meanings":[{"definitions":[{"definition":"The point in the interior of a circle that is equidistant from all points on the circumference."},{"definition":"The point in the interior of a sphere that is equidistant from all points on the circumference."},{"definition":"The middle portion of something; the part well away from the edges."},{"definition":"The point on a line that is midway between the ends."},{"definition":"The point in the interior of any figure of any number of dimensions that has as its coordinates the arithmetic mean of the coordinates of all points on the perimeter of the figure (or of all points in the interior for a center of volume)."},{"definition":"The subgroup (respectively, subring), denoted Z(G), of those elements of a given group (respectively, ring) G that commute with every element of G."},{"definition":"A place where the greater part of some function or activity occurs.","example":"shopping center, convention center, civic center, garment center, Lincoln Center for the Performing Arts, Rockefeller Center"},{"definition":"A topic that is particularly important in a given context.","example":"the center of attention"},{"definition":"A player in the middle of the playing area"},{"definition":"A player who can go all over the court, except the shooting circles."},{"definition":"A pass played into the centre of the pitch."},{"definition":"One of the backs operating in a central area of the pitch, either the inside centre or outside centre."},{"definition":"A temporary structure upon which the materials of a vault or arch are supported in position until the work becomes self-supporting."},{"definition":"One of the two conical steel pins in a lathe, etc., upon which the work is held, and about which it revolves."},{"definition":"A conical recess or indentation in the end of a shaft or other work, to receive the point of a center, on which the work can turn, as in a lathe."},{"definition":"The ensemble of moderate or centrist political parties."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause (an object) to occupy the center of an area.","example":"He centered the heading of the document."},{"definition":"To cause (some attribute, such as a mood or voltage) to be adjusted to a value which is midway between the extremes."},{"definition":"To give (something) a central basis."},{"definition":"To concentrate on (something), to pay close attention to (something).","example":"The discussion centered around the recent issues."},{"definition":"To form a recess or indentation for the reception of a center."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsɛn.tɚs/"},{"text":"/ˈsen.tə(ɹ)s/"}]},{"word":"JERRY","idx":4839,"count":13908229,"meanings":[{"definitions":[{"definition":"A chamber pot."},{"definition":"A German, particularly a male German."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Jerry-built."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdʒɛɹi/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/jerry-au.mp3"}]},{"word":"CLAUSE","idx":4840,"count":13906621,"meanings":[{"definitions":[{"definition":"(grammar) A verb, its necessary grammatical arguments, and any adjuncts affecting them."},{"definition":"(grammar) A verb along with its subject and their modifiers. If a clause provides a complete thought on its own, then it is an independent (superordinate) clause; otherwise, it is (subordinate) dependent."},{"definition":"A separate part of a contract, a will or another legal document."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(shipping) To amend (a bill of lading or similar document)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/clause-us.mp3","text":"/klɔːz/"}]},{"word":"SMILE","idx":4841,"count":13893537,"meanings":[{"definitions":[{"definition":"A facial expression comprised by flexing the muscles of both ends of one's mouth, often showing the front teeth, without vocalisation, and in humans is a common involuntary or voluntary expression of happiness, pleasure, amusement or anxiety.","example":"He always puts a smile on my face."},{"definition":"Favour; propitious regard.","example":"the smile of the gods"},{"definition":"A drink bought by one person for another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have (a smile) on one's face.","example":"I don't know what he's smiling about."},{"definition":"To express by smiling.","example":"to smile consent, or a welcome"},{"definition":"To express amusement, pleasure, or love and kindness."},{"definition":"To look cheerful and joyous; to have an appearance suited to excite joy.","example":"The sun smiled down from a clear summer sky."},{"definition":"To be propitious or favourable; to countenance.","example":"The gods smiled on his labours."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/smile-us.mp3","text":"/ˈsmaɪ.əl/"}]},{"word":"LANDS","idx":4842,"count":13891179,"meanings":[{"definitions":[{"definition":"The part of Earth which is not covered by oceans or other bodies of water.","example":"Most insects live on land."},{"definition":"Real estate or landed property; a partitioned and measurable area which is owned and on which buildings can be erected.","example":"There are 50 acres of land in this estate."},{"definition":"A country or region."},{"definition":"A person's country of origin and/or homeplace; homeland."},{"definition":"The soil, in respect to its nature or quality for farming.","example":"wet land; good or bad land for growing potatoes"},{"definition":"(often in combination) realm, domain.","example":"I'm going to Disneyland."},{"definition":"The ground left unploughed between furrows; any of several portions into which a field is divided for ploughing."},{"definition":"A shock or fright.","example":"He got an awful land when the police arrived."},{"definition":"A conducting area on a board or chip which can be used for connecting wires."},{"definition":"In a compact disc or similar recording medium, an area of the medium which does not have pits."},{"definition":"(travel) The non-airline portion of an itinerary. Hotel, tours, cruises, etc.","example":"Our city offices sell a lot more land than our suburban offices."},{"definition":"The ground or floor."},{"definition":"The lap of the strakes in a clinker-built boat; the lap of plates in an iron vessel; called also landing."},{"definition":"In any surface prepared with indentations, perforations, or grooves, that part of the surface which is not so treated, such as the level part of a millstone between the furrows."},{"definition":"A group of dwellings or tenements under one roof and having a common entry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To descend to a surface, especially from the air.","example":"The plane is about to land."},{"definition":"To alight, to descend from a vehicle."},{"definition":"To come into rest."},{"definition":"To arrive at land, especially a shore, or a dock, from a body of water."},{"definition":"To bring to land.","example":"It can be tricky to land a helicopter."},{"definition":"To acquire; to secure."},{"definition":"To deliver."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/lands-us.mp3","text":"/lændz/"}]},{"word":"RI","idx":4843,"count":13890693,"meanings":[{"definitions":[{"definition":"The Chinese mile, a traditional unit of distance equal to 1500 chis or 150 zhangs, now standardized as a half-kilometer (500 meters)."},{"definition":"The Korean mile, a traditional unit of distance equivalent to about 393 m."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹiː/"}]},{"word":"TROOPS","idx":4844,"count":13879349,"meanings":[{"definitions":[{"definition":"(collective) A collection of people; a number; a multitude (in general)."},{"definition":"A small unit of cavalry or armour commanded by a captain, corresponding to a platoon or company of infantry."},{"definition":"A detachment of soldiers or police, especially horse artillery, armour, or state troopers."},{"definition":"Soldiers, military forces (usually \"troops\")."},{"definition":"A company of stageplayers; a troupe."},{"definition":"A basic unit of girl or boy scouts, consisting of 6 to 10 youngsters."},{"definition":"(collective) A group of baboons."},{"definition":"A particular roll of the drum; a quick march."},{"definition":"Mushrooms that are in a close group but not close enough to be called a cluster."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move in numbers; to come or gather in crowds or troops."},{"definition":"To march on; to go forward in haste."},{"definition":"To move or march as if in a crowd.","example":"The children trooped into the room."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/troops-us.mp3","text":"/tɹuːps/"}]},{"word":"INDOOR","idx":4845,"count":13871917,"meanings":[{"definitions":[{"definition":"Situated in, or designed to be used in, or carried on within, the interior of a building.","example":"These fireworks are not for indoor use!"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɪndɔɹ/"},{"text":"/ˈɪndɔː/"}]},{"word":"ARMED","idx":4847,"count":13866785,"meanings":[{"definitions":[{"definition":"To take by the arm; to take up in one's arms."},{"definition":"To supply with armour or (later especially) weapons.","example":"The king armed his knights with swords and shields."},{"definition":"To prepare a tool or a weapon for action; to activate.","example":"Remember to arm the alarm system before leaving for work."},{"definition":"To cover or furnish with a plate, or with whatever will add strength, force, security, or efficiency.","example":"to arm the hit of a sword; to arm a hook in angling"},{"definition":"To furnish with means of defence; to prepare for resistance; to fortify, in a moral sense."},{"definition":"To take up weapons; to arm oneself."},{"definition":"To fit (a magnet) with an armature."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(sometimes in combination) Equipped, especially with a weapon.","example":"nuclear-armed"},{"definition":"(of a weapon) Prepared for use; loaded."},{"definition":"Furnished with whatever serves to add strength, force, or efficiency."},{"definition":"Having prickles or thorns."},{"definition":"(chiefly in combination) Having an arm or arms, often of a specified number or type."},{"definition":"(of a creature) Possessing arms of a specified number or type.","example":"the four-armed creature."},{"definition":"(heraldry, of animals) Having horns, claws, teeth, a beak, etc. in a particular tincture, as contrasted with that of the animal as a whole."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/armed-us.mp3","text":"/ɑɹmd/"}]},{"word":"BROKER","idx":4848,"count":13865583,"meanings":[{"definitions":[{"definition":"Financially ruined, bankrupt."},{"definition":"Without any money, penniless.","example":"dead broke; flat broke"},{"definition":"Broken.","example":"If it ain't broke, don't fix it."},{"definition":"Demoted, deprived of a commission.","example":"He was broke and rendered unfit to serve His Majesty at sea."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A mediator between a buyer and seller."},{"definition":"A stockbroker."},{"definition":"A mediator in general, one who liaises between two or more parties to attempt to achieve an outcome of some kind."},{"definition":"An agent involved in the exchange of messages or transactions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a broker; to mediate in a sale or transaction."},{"definition":"To act as a broker in; to arrange or negotiate."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɹoʊkɚ/"},{"text":"/ˈbɹəʊkə/"}]},{"word":"CHARGER","idx":4849,"count":13862324,"meanings":[{"definitions":[{"definition":"A device that charges or recharges","example":"Put the batteries in the charger overnight so we can use them tomorrow."},{"definition":"A large horse trained for battle and used by the cavalry (of a lighter build than a destrier)","example":"The knight rode a white charger."},{"definition":"A large platter"},{"definition":"A large decorative plate, sometimes used under dinner plates or other savoury-dish vessels in a multi-course meal; also service plate or underplate","example":"The fancy restaurant used a white porcelain charger when serving."},{"definition":"One who charges"},{"definition":"A speedloader that holds several cartridges together in a single unit for easier loading of a firearm's magazine"},{"definition":"A rectal concealment container for prohibited material such as money, drugs and tools"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʃɑɹdʒɚ/"},{"text":"/ˈtʃɑːdʒə/"}]},{"word":"REGULARLY","idx":4850,"count":13860363,"meanings":[{"definitions":[{"definition":"With constant frequency or pattern."},{"definition":"Normally; ordinarily."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/regularly-us.mp3","text":"/ˈɹɛɡjəlɚli/"}]},{"word":"BELIEVED","idx":4851,"count":13851733,"meanings":[{"definitions":[{"definition":"To accept as true, particularly without absolute certainty (i.e., as opposed to knowing)","example":"I believe there are faeries."},{"definition":"To accept that someone is telling the truth.","example":"Why did I ever believe you?"},{"definition":"To have religious faith; to believe in a greater truth.","example":"After that night in the church, I believed."},{"definition":"To opine, think, reckon"}],"partOfSpeech":"ve"}]},{"word":"PINE","idx":4852,"count":13842664,"meanings":[{"definitions":[{"definition":"Any coniferous tree of the genus Pinus.","example":"The northern slopes were covered mainly in pine."},{"definition":"Any tree (usually coniferous) which resembles a member of this genus in some respect."},{"definition":"The wood of this tree."},{"definition":"(obsolete except South Africa) A pineapple."},{"definition":"A painful longing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To languish; to lose flesh or wear away through distress."},{"definition":"To long, to yearn so much that it causes suffering.","example":"Laura was pining for Bill all the time he was gone."},{"definition":"To grieve or mourn for."},{"definition":"To inflict pain upon; to torment."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/paɪn/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pine-au.mp3"}]},{"word":"COOLING","idx":4853,"count":13842002,"meanings":[{"definitions":[{"definition":"To lose heat, to get colder.","example":"I like to let my tea cool before drinking it so I don't burn my tongue."},{"definition":"To make cooler, less warm."},{"definition":"To become less intense, e.g. less amicable or passionate.","example":"Relations cooled between the USA and the USSR after 1980."},{"definition":"To make less intense, e.g. less amicable or passionate."},{"definition":"To kill."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A decrease in temperature."},{"definition":"Refrigeration."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That cools."},{"definition":"(Asian English). Of food or medicine, according to traditional Chinese medicine: serving to cool or calm the body."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkuːlɪŋ/"}]},{"word":"TEND","idx":4854,"count":13840765,"meanings":[{"definitions":[{"definition":"(Old English law) To make a tender of; to offer or tender."},{"definition":"(followed by a to-infinitive) To be likely, or probable to do something, or to have a certain habit or leaning.","example":"It tends to snow here in winter."},{"definition":"To contribute to or toward some outcome."},{"definition":"(with to) To look after (e.g. an ill person.)","example":"We need to tend to the garden, which has become a mess."},{"definition":"To accompany as an assistant or protector; to care for the wants of; to look after; to watch; to guard.","example":"Shepherds tend their flocks."},{"definition":"To wait (upon), as attendants or servants; to serve; to attend."},{"definition":"To await; to expect."},{"definition":"To be attentive to; to note carefully; to attend to."},{"definition":"To manage (an anchored vessel) when the tide turns, to prevent it from entangling the cable when swinging."},{"definition":"To kindle; ignite; set on fire; light; inflame; burn."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tend-us.mp3","text":"/tɛnd/"}]},{"word":"GULF","idx":4855,"count":13830000,"meanings":[{"definitions":[{"definition":"A hollow place in the earth; an abyss; a deep chasm or basin."},{"definition":"That which swallows; the gullet."},{"definition":"That which swallows irretrievably; a whirlpool; a sucking eddy."},{"definition":"A portion of an ocean or sea extending into the land; a partially landlocked sea","example":"the Gulf of Mexico    the Persian Gulf"},{"definition":"A large deposit of ore in a lode."},{"definition":"A difference, especially a large difference, between groups."},{"definition":"(Oxbridge slang) The bottom part of a list of those awarded a degree, for those who have only just passed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(Oxbridge slang) To award a degree to somebody who has only just passed sufficiently."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/gulf-us.mp3","text":"/ɡʌlf/"}]},{"word":"RT","idx":4856,"count":13828683,"meanings":[{"definitions":[{"definition":"A message reposted or forwarded in this way."},{"definition":"A course or way which is traveled or passed.","example":"The route was used so much that it formed a rut."},{"definition":"A regular itinerary of stops, or the path followed between these stops, such as for delivery or passenger transportation.","example":"Here is a map of our delivery routes."},{"definition":"A road or path; often specifically a highway.","example":"Follow Route 49 out of town."},{"definition":"One of multiple methods or approaches to doing something."},{"definition":"One of the major provinces of imperial China from the Later Jin to the Song, corresponding to the Tang and early Yuan circuits."},{"definition":"A specific entry in a router that tells the router how to transmit the data it receives."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Straight, not bent.","example":"a right line"},{"definition":"Of an angle, having a size of 90 degrees, or one quarter of a complete rotation; the angle between two perpendicular lines.","example":"The kitchen counter formed a right angle with the back wall."},{"definition":"Of a geometric figure, incorporating a right angle between edges, faces, axes, etc.","example":"a right triangle, a right prism, a right cone"},{"definition":"Complying with justice, correctness or reason; correct, just, true.","example":"I thought you'd made a mistake, but it seems you were right all along."},{"definition":"Appropriate, perfectly suitable; fit for purpose.","example":"Is this the right software for my computer?"},{"definition":"Healthy, sane, competent.","example":"I'm afraid my father is no longer in his right mind."},{"definition":"Real; veritable (used emphatically).","example":"You've made a right mess of the kitchen!"},{"definition":"All right; not requiring assistance."},{"definition":"Most favourable or convenient; fortunate."},{"definition":"Designating the side of the body which is positioned to the east if one is facing north. This arrow points to the reader's right: →","example":"After the accident, her right leg was slightly shorter than her left."},{"definition":"Designed to be placed or worn outward.","example":"the right side of a piece of cloth"},{"definition":"Pertaining to the political right; conservative."}],"partOfSpeech":"j"}]},{"word":"RICK","idx":4857,"count":13822320,"meanings":[{"definitions":[{"definition":"Straw, hay etc. stored in a stack for winter fodder, commonly protected with thatch."},{"definition":"A stack of wood, especially cut to a regular length; also used as a measure of wood, typically four by eight feet."},{"definition":"A brand new (naive) boot camp inductee.","example":"No turning back now rick, you are the property of the US government now."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To heap up (hay, etc.) in ricks."},{"definition":"To slightly sprain or strain the neck, back, ankle etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/rick-uk.mp3","text":"/ɹɪk/"}]},{"word":"TRUCKS","idx":4858,"count":13809070,"meanings":[{"definitions":[{"definition":"A small wheel or roller, specifically the wheel of a gun carriage."},{"definition":"The ball on top of a flagpole."},{"definition":"On a wooden mast, a circular disc (or sometimes a rectangle) of wood near or at the top of the mast, usually with holes or sheaves to reeve signal halyards; also a temporary or emergency place for a lookout. \"Main\" refers to the mainmast, whereas a truck on another mast may be called (on the mizzenmast, for example) \"mizzen-truck\"."},{"definition":"A semi-tractor (\"semi\") trailer; a lorry.","example":"Mexican open-bed trucks haul most of the fresh produce that comes into the United States from Mexico."},{"definition":"Any motor vehicle designed for carrying cargo, including delivery vans, pickups, and other motorized vehicles (including passenger autos) fitted with a bed designed to carry goods."},{"definition":"A garden cart, a two-wheeled wheelbarrow."},{"definition":"A small wagon or cart, of various designs, pushed or pulled by hand or pulled by an animal, as with those in hotels for moving luggage, or in libraries for transporting books."},{"definition":"A pantechnicon (removal van)."},{"definition":"A flatbed railway car; a flatcar."},{"definition":"A pivoting frame, one attached to the bottom of the bed of a railway car at each end, that rests on the axle and which swivels to allow the axle (at each end of which is a solid wheel) to turn with curves in the track; a bogie."},{"definition":"The part of a skateboard or roller skate that joins the wheels to the deck, consisting of a hanger, baseplate, kingpin, and bushings, and sometimes mounted with a riser in between."},{"definition":"A platform with wheels or casters."},{"definition":"Dirt or other messiness."},{"definition":"(often in the plural) Small, humble items; things, often for sale or barter."},{"definition":"The practice of paying workers in kind, or with tokens only exchangeable at a shop owned by the employer [forbidden in the 19th century by the Truck Acts]."},{"definition":"Garden produce, groceries (see truck garden)."},{"definition":"(usually with negative) Social intercourse; dealings, relationships."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drive a truck: Generally a truck driver's slang."},{"definition":"To convey by truck.","example":"Last week, Cletus trucked 100 pounds of lumber up to Dubuque."},{"definition":"To travel or live contentedly.","example":"Keep on trucking!"},{"definition":"To persist, to endure.","example":"Keep on trucking!"},{"definition":"(film production) To move a camera parallel to the movement of the subject."},{"definition":"To fight or otherwise physically engage with."},{"definition":"To run over or through a tackler in American football."},{"definition":"To fail; run out; run short; be unavailable; diminish; abate."},{"definition":"To give in; give way; knuckle under; truckle."},{"definition":"To deceive; cheat; defraud."},{"definition":"To tread (down); stamp on; trample (down)."},{"definition":"To trade, exchange; barter."},{"definition":"To engage in commerce; to barter or deal."},{"definition":"To have dealings or social relationships with; to engage with."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɹʌks/"}]},{"word":"CP","idx":4859,"count":13806456,"meanings":[{"definitions":[{"definition":"A mapping to a particular character set, where there are several possible sets that share the same code points. Abbreviation: cp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To assess the similarities and differences between two or more things [\"to compare X with Y\"]. Having made the comparison of X with Y, one might have found it similar to Y or different from Y.","example":"Compare the tiger's coloration with that of the zebra."},{"definition":"To declare two things to be similar in some respect [\"to compare X to Y\"].","example":"Astronomers have compared comets to dirty snowballs."},{"definition":"(grammar) To form the three degrees of comparison of (an adjective).","example":"We compare \"good\" as \"good\", \"better\", \"best\"."},{"definition":"To be similar (often used in the negative).","example":"A sapling and a fully-grown oak tree do not compare."},{"definition":"To get; to obtain."}],"partOfSpeech":"ve"}]},{"word":"MECHANISMS","idx":4860,"count":13805561,"meanings":[{"definitions":[{"definition":"(within a machine or machinery) Any mechanical means for the conversion or control of motion, or the transmission or control of power."},{"definition":"Any combination of cams, gears, links, belts, chains and logical mechanical elements."},{"definition":"A group of entities, such as objects, that interact together.","example":"political machine"},{"definition":"A mental, physical or chemical process."},{"definition":"Any process of, or system designed to manage useful energy conversion."},{"definition":"The theory that all natural phenomena can be explained by physical causes."}],"partOfSpeech":"n"}]},{"word":"DIVORCE","idx":4861,"count":13803408,"meanings":[{"definitions":[{"definition":"The legal dissolution of a marriage.","example":"Richard obtained a divorce from his wife some years ago, but hasn't returned to the dating scene."},{"definition":"A separation of connected things.","example":"The Civil War split between Virginia and West Virginia was a divorce based along cultural and economic as well as geographic lines."},{"definition":"That which separates."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To legally dissolve a marriage between two people.","example":"A ship captain can marry couples, but cannot divorce them."},{"definition":"To end one's own marriage to (a person) in this way.","example":"Lucy divorced Steve when she discovered that he had been unfaithful."},{"definition":"To obtain a legal divorce.","example":"Edna and Simon divorced last year; he got the house, and she retained the business."},{"definition":"To separate something that was connected.","example":"The radical group voted to divorce itself from the main faction and start an independent movement."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪˈvɔɹs/"},{"text":"/dɪˈvɔːs/"}]},{"word":"SHOPPER","idx":4863,"count":13798030,"meanings":[{"definitions":[{"definition":"A person who shops."},{"definition":"A free local newspaper containing advertisements for local shops etc; sometimes includes discount coupons."},{"definition":"A kind of bicycle suited to riding short distances."},{"definition":"A plastic shopping bag."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/shopper-us.mp3","text":"/ˈʃɑ.pɚ/"}]},{"word":"PARTLY","idx":4865,"count":13790568,"meanings":[{"definitions":[{"definition":"In part, or to some degree, but not completely.","example":"they partly finished the house so they could move in before winter;  the car was partly visible in the garage"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/partly-us.mp3","text":"/ˈpɑɹtli/"}]},{"word":"CUSTOMIZE","idx":4867,"count":13783519,"meanings":[{"definitions":[{"definition":"To build or alter according to personal preferences or specifications."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkʌst.ə.maɪ̯z/"}]},{"word":"TRADITION","idx":4868,"count":13773517,"meanings":[{"definitions":[{"definition":"A part of culture that is passed from person to person or generation to generation, possibly differing in detail from family to family, such as the way to celebrate holidays."},{"definition":"A commonly held system."},{"definition":"The act of delivering into the hands of another; delivery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transmit by way of tradition; to hand down."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tradition-us.mp3","text":"/tɹəˈdɪʃn̩/"}]},{"word":"CANDY","idx":4869,"count":13772033,"meanings":[{"definitions":[{"definition":"Edible, sweet-tasting confectionery containing sugar, or sometimes artificial sweeteners, and often flavored with fruit, chocolate, nuts, herbs and spices, or artificial flavors."},{"definition":"A piece of confectionery of this kind."},{"definition":"(slang, chiefly US) crack cocaine."},{"definition":"A unit of mass used in southern India, equal to twenty maunds, roughly equal to 500 pounds avoirdupois but varying locally."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook in, or coat with, sugar syrup."},{"definition":"To have sugar crystals form in or on.","example":"Fruits preserved in sugar candy after a time."},{"definition":"To be formed into candy; to solidify in a candylike form or mass."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/candy-us.mp3","text":"/ˈkændi/"}]},{"word":"PILLS","idx":4870,"count":13767091,"meanings":[{"definitions":[{"definition":"A small, usually round or cylindrical object designed for easy swallowing, usually containing some sort of medication."},{"definition":"(definite, i.e. used with \"the\") Contraceptive medication, usually in the form of a pill to be taken by a woman; an oral contraceptive pill.","example":"Jane went on the pill when she left for college."},{"definition":"A comical or entertaining person."},{"definition":"A contemptible, annoying, or unpleasant person."},{"definition":"A small piece of any substance, for example a ball of fibres formed on the surface of a textile by rubbing."},{"definition":"A baseball."},{"definition":"A bullet (projectile)."},{"definition":"A rounded rectangle indicating the tag or category that an item belongs to."},{"definition":"The peel or skin."},{"definition":"An inlet on the coast; a small tidal pool or bay."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a woven fabric surface, to form small matted balls of fiber."},{"definition":"To form into the shape of a pill.","example":"Pilling is a skill rarely used by modern pharmacists."},{"definition":"To medicate with pills.","example":"She pills herself with all sorts of herbal medicines."},{"definition":"To persuade or convince someone of something."},{"definition":"To peel; to remove the outer layer of hair, skin, or bark."},{"definition":"To peel; to make by removing the skin."},{"definition":"To be peeled; to peel off in flakes."},{"definition":"To pillage; to despoil or impoverish."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɪlz/"}]},{"word":"TIGER","idx":4871,"count":13763074,"meanings":[{"definitions":[{"definition":"Panthera tigris, a large predatory mammal of the cat family, indigenous to Asia."},{"definition":"A representation of a large mythological cat, used on a coat of arms."},{"definition":"A servant in livery, who rides with his master or mistress."},{"definition":"A leopard."},{"definition":"A person who is very athletic during sexual intercourse."},{"definition":"A ferocious, bloodthirsty and audacious person."},{"definition":"A kind of growl or screech, after cheering.","example":"three cheers and a tiger"},{"definition":"A pneumatic box or pan used in refining sugar."},{"definition":"A tiger moth in the family Arctiidae."},{"definition":"A tiger beetle."},{"definition":"A tiger butterfly in tribe Danaini, especially subtribe Danaina"},{"definition":"A relatively small country or group of countries with a fast-growing economy."},{"definition":"A final shouted phrase, accompanied by a jump or outstretched arms, at the end of a cheer."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tiger-1-us.mp3","text":"/ˈtaɪɡɚ/"}]},{"word":"FOLKS","idx":4873,"count":13760930,"meanings":[{"definitions":[{"definition":"A grouping of smaller peoples or tribes as a nation."},{"definition":"The inhabitants of a region, especially the native inhabitants."},{"definition":"(plural: folks) One’s relatives, especially one’s parents."},{"definition":"Folk music."},{"definition":"People in general.","example":"Young folk, old folk, everybody come, / To our little Sunday School and have a lot of fun."},{"definition":"A particular group of people."},{"definition":"The members of one's immediate family, especially one's parents","example":"My folks visit us at Christmas."},{"definition":"People in general; everybody or anybody.","example":"Lots of folks like to travel during the holidays."},{"definition":"The police."},{"definition":"(California) Late 19th and early 20th century migrants to California from Iowa and other parts of the Midwestern United States."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/folks-us.mp3","text":"/foʊks/"}]},{"word":"SENSOR","idx":4874,"count":13759334,"meanings":[{"definitions":[{"definition":"A device or organ that detects certain external stimuli and responds in a distinctive manner."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/sensor-us.mp3","text":"/ˈsɛn.sɚ/"}]},{"word":"EXPOSED","idx":4875,"count":13756477,"meanings":[{"definitions":[{"definition":"To reveal, uncover, make visible, bring to light, introduce to."},{"definition":"To subject photographic film to light thereby recording an image."},{"definition":"To abandon, especially an unwanted baby in the wilderness."},{"definition":"To submit to an active (mostly dangerous) substance like an allergen, ozone, nicotine, solvent, or to any other stress, in order to test the reaction, resistance, etc."},{"definition":"To make available to other parts of a program, or to other programs."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(usually followed by to) Vulnerable, susceptible.","example":"The bike chain is open and exposed to tough environmental conditions such as temperature changes, humidity, rain, dirt and road salt."}],"partOfSpeech":"j"}]},{"word":"TELECOM","idx":4876,"count":13755270,"meanings":[{"definitions":[{"definition":"Telecommunication or telecommunications."},{"definition":"A telco (phone company) or telecom company."}],"partOfSpeech":"n"}]},{"word":"HUNT","idx":4877,"count":13752874,"meanings":[{"definitions":[{"definition":"The act of hunting."},{"definition":"A hunting expedition."},{"definition":"An organization devoted to hunting, or the people belonging to it."},{"definition":"A pack of hunting dogs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To find or search for an animal in the wild with the intention of killing the animal for its meat or for sport.","example":"Her uncle will go out and hunt for deer, now that it is open season."},{"definition":"To try to find something; search (for).","example":"The little girl was hunting for shells on the beach."},{"definition":"To drive; to chase; with down, from, away, etc.","example":"He was hunted from the parish."},{"definition":"To use or manage (dogs, horses, etc.) in hunting.","example":"Did you hunt that pony last week?"},{"definition":"To use or traverse in pursuit of game.","example":"He hunts the woods, or the country."},{"definition":"(bell-ringing) To move or shift the order of (a bell) in a regular course of changes."},{"definition":"(bell-ringing) To shift up and down in order regularly."},{"definition":"To be in a state of instability of movement or forced oscillation, as a governor which has a large movement of the balls for small change of load, an arc-lamp clutch mechanism which moves rapidly up and down with variations of current, etc.; also, to seesaw, as a pair of alternators working in parallel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/hunt-us.mp3","text":"/hʌnt/"}]},{"word":"ANGELS","idx":4878,"count":13747515,"meanings":[{"definitions":[{"definition":"An incorporeal and sometimes divine messenger from a deity, or other divine entity, often depicted in art as a youthful winged figure in flowing robes."},{"definition":"(Abrahamic tradition) One of the lowest order of such beings, below virtues."},{"definition":"A person having the qualities attributed to angels, such as purity or selflessness.","example":"Thanks for making me breakfast in bed, you little angel."},{"definition":"Attendant spirit; genius; demon."},{"definition":"(possibly obsolete) An official (a bishop, or sometimes a minister) who heads a Christian church, especially a Catholic Apostolic church."},{"definition":"An English gold coin, bearing the figure of the archangel Michael, circulated between the 15th and 17th centuries, and varying in value from six shillings and eightpence to ten shillings."},{"definition":"(originally Royal Air Force) An altitude, measured in thousands of feet.","example":"Climb to angels sixty. (“ascend to 60,000 feet”)"},{"definition":"An unidentified flying object detected by air traffic control radar."},{"definition":"An affluent individual who provides capital for a startup, usually in exchange for convertible debt or ownership equity; an angel investor."},{"definition":"The person who funds a show."},{"definition":"A person who has Angelman syndrome."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To support by donating money."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/angels-us.mp3","text":"/ˈeɪn.dʒəlz/"}]},{"word":"DEPUTY","idx":4879,"count":13747486,"meanings":[{"definitions":[{"definition":"One appointed as the substitute of another, and empowered to act for them, in their name or their behalf; a substitute in office","example":"As the deputy store manager, he is able to fire staff."},{"definition":"A person employed to install and remove props, brattices, etc. and to clear gas, for the safety of the miners."},{"definition":"(France): A member of the Chamber of Deputies, formerly called Corps Législatif"},{"definition":"(Ireland): a member of Dáil Éireann, or the title of a member of Dáil Éireann. (Normally capitalised in both cases)","example":"At today's meeting, Deputy Ryan will speak on local issues."},{"definition":"(United States): a law enforcement officer who works for the county sheriff's office; a deputy sheriff or sheriff's deputy; the entry level rank in such an agency","example":"The sheriff's deputies took the suspect into custody."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deputise"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/deputy-us.mp3","text":"/ˈdɛpjəti/"}]},{"word":"INDICATORS","idx":4880,"count":13737979,"meanings":[{"definitions":[{"definition":"A pointer or index that indicates something."},{"definition":"A meter or gauge."},{"definition":"The needle or dial on such a meter."},{"definition":"Any of many substances, such as litmus, used to indicate the concentration of a substance, or the degree of a reaction."},{"definition":"A plant or animal whose presence is indicative of some specific environment."},{"definition":"A measure, such as unemployment rate, which can be used to predict economic trends."},{"definition":"A turn signal; each of the flashing lights on each side of a vehicle which indicate a turn is being made to left or right, or a lane change etc."},{"definition":"A bird, the honeyguide."}],"partOfSpeech":"n"}]},{"word":"SEALED","idx":4881,"count":13733878,"meanings":[{"definitions":[{"definition":"To hunt seals.","example":"They're organizing a protest against sealing."},{"definition":"To place a seal on (a document)."},{"definition":"To mark with a stamp, as an evidence of standard exactness, legal size, or merchantable quality.","example":"to seal silverware"},{"definition":"To fasten (something) so that it cannot be opened without visible damage.","example":"The cover is sealed. If anyone tries to open it, we'll know about it."},{"definition":"To prevent people or vehicles from crossing (something).","example":"The border has been sealed until the fugitives are found."},{"definition":"To close securely to prevent leakage.","example":"I've sealed the bottle to keep the contents fresh."},{"definition":"To place in a sealed container.","example":"I've sealed the documents in this envelope."},{"definition":"To place a notation of one's next move in a sealed envelope to be opened after an adjournment.","example":"After thinking for half an hour, the champion sealed his move."},{"definition":"To guarantee.","example":"The last-minute goal sealed United’s win."},{"definition":"To fix, as a piece of iron in a wall, with cement or plaster, etc."},{"definition":"To close by means of a seal.","example":"to seal a drainpipe with water"},{"definition":"To confirm or set apart as a second or additional wife."},{"definition":"To tie up animals (especially cattle) in their stalls."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Closed by a seal."},{"definition":"Preventing entrance."},{"definition":"Of a road that has an asphalt or macadamised surface."},{"definition":"Not subclassable; from which one cannot inherit."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/siːld/"}]},{"word":"EMISSIONS","idx":4883,"count":13718311,"meanings":[{"definitions":[{"definition":"Something which is emitted or sent out; issue.","example":"the emission was mostly blood"},{"definition":"The act of emitting; the act of sending forth or putting into circulation.","example":"the emission of heat from a fire"}],"partOfSpeech":"n"}]},{"word":"PHYSICIANS","idx":4884,"count":13717814,"meanings":[{"definitions":[{"definition":"A practitioner of physic, i.e. a specialist in internal medicine, especially as opposed to a surgeon; a practitioner who treats with medication rather than with surgery."},{"definition":"A medical doctor trained in human medicine."}],"partOfSpeech":"n"}]},{"word":"LOADED","idx":4885,"count":13714028,"meanings":[{"definitions":[{"definition":"To put a load on or in (a means of conveyance or a place of storage).","example":"The dock workers refused to load the ship."},{"definition":"To place in or on a conveyance or a place of storage.","example":"He loaded his stuff into his storage locker."},{"definition":"To put a load on something.","example":"The truck was supposed to leave at dawn, but in fact we spent all morning loading."},{"definition":"To receive a load.","example":"The truck is designed to load easily."},{"definition":"To be placed into storage or conveyance.","example":"The containers load quickly and easily."},{"definition":"To fill (a firearm or artillery) with munition.","example":"I pulled the trigger, but nothing happened. I had forgotten to load the gun."},{"definition":"To insert (an item or items) into an apparatus so as to ready it for operation, such as a reel of film into a camera, sheets of paper into a printer etc.","example":"Now that you've loaded the camera [with film], you're ready to start shooting."},{"definition":"To fill (an apparatus) with raw material.","example":"The workers loaded the blast furnace with coke and ore."},{"definition":"To be put into use in an apparatus.","example":"The cartridge was designed to load easily."},{"definition":"To read (data or a program) from a storage medium into computer memory.","example":"Click OK to load the selected data."},{"definition":"To transfer from a storage medium into computer memory.","example":"This program takes an age to load."},{"definition":"To put runners on first, second and third bases","example":"He walks to load the bases."},{"definition":"To tamper with so as to produce a biased outcome.","example":"The wording of the ballot paper loaded the vote in favour of the Conservative candidate."},{"definition":"To ask or adapt a question so that it will be more likely to be answered in a certain way."},{"definition":"To encumber with something negative, to place as an encumbrance.","example":"The new owners had loaded the company with debt."},{"definition":"To provide in abundance.","example":"He loaded carbs into his system before the marathon."},{"definition":"To weight (a cane, whip, etc.) with lead or similar."},{"definition":"To adulterate or drug.","example":"to load wine"},{"definition":"To magnetize."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Burdened by some heavy load; packed.","example":"Let's leave the TV; the car is loaded already."},{"definition":"(of a projectile weapon) Having a live round of ammunition in the chamber.","example":"No funny business; this heater's loaded!"},{"definition":"Possessing great wealth.","example":"He sold his business a couple of years ago and is just loaded."},{"definition":"Drunk.","example":"By the end of the evening, the guests in the club were really loaded."},{"definition":"Pertaining to a situation where there is a runner at each of the three bases.","example":"It's bottom of the ninth, the bases are loaded and there are two outs."},{"definition":"(also used figuratively) a die or dice being weighted asymmetrically, and so biased to produce predictable throws.","example":"He was playing with loaded dice and won a fortune."},{"definition":"(of a question) Designed to produce a predictable answer, or to lay a trap.","example":"That interviewer is tricky; he asks loaded questions."},{"definition":"(of a word or phrase) Having strong connotations that colour the literal meaning and are likely to provoke an emotional response. Sometimes used loosely to describe a word that simply has many different meanings.","example":"\"Ignorant\" is a loaded word, often implying lack of intelligence rather than just lack of knowledge."},{"definition":"(of an item offered for sale, especially an automobile) Equipped with numerous options.","example":"She went all out; her new car is loaded."},{"definition":"Covered with a topping or toppings.","example":"loaded fries"},{"definition":"Weighted with lead or similar.","example":"a loaded cane or whip"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/loaded-us.mp3","text":"/ˈloʊdɪd/"}]},{"word":"COMPLAINT","idx":4887,"count":13703047,"meanings":[{"definitions":[{"definition":"The act of complaining."},{"definition":"A grievance, problem, difficulty, or concern.","example":"I have no complaints about the quality of his work, but I don't enjoy his company."},{"definition":"In a civil action, the first pleading of the plaintiff setting out the facts on which the claim is based; The purpose is to give notice to the adversary of the nature and basis of the claim asserted."},{"definition":"In criminal law, the preliminary charge or accusation made by one person against another to the appropriate court or officer, usually a magistrate. However, court proceedings, such as a trial, cannot be instituted until an indictment or information has been handed down against the defendant."},{"definition":"A bodily disorder or disease; the symptom of such a disorder.","example":"Don't come too close; I've got this nasty complaint."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/complaint-us.mp3","text":"/kəmˈpleɪnt/"}]},{"word":"SCENES","idx":4888,"count":13691578,"meanings":[{"definitions":[{"definition":"The location of an event that attracts attention.","example":"the scene of the crime"},{"definition":"The stage.","example":"They stood in the centre of the scene."},{"definition":"The decorations; furnishings and backgrounds of a stage, representing the place in which the action of a play is set","example":"behind the scenes"},{"definition":"A part of a dramatic work that is set in the same place or time. In the theatre, generally a number of scenes constitute an act.","example":"The most moving scene is the final one, where he realizes he has wasted his whole life."},{"definition":"The location, time, circumstances, etc., in which something occurs, or in which the action of a story, play, or the like, is set up"},{"definition":"A combination of objects or events in view or happening at a given moment at a particular place.","example":"He assessed the scene to check for any danger, and agreed it was safe."},{"definition":"A landscape, or part of a landscape; scenery."},{"definition":"An exhibition of passionate or strong feeling before others, creating embarrassment or disruption; often, an artificial or affected action, or course of action, done for effect; a theatrical display","example":"The crazy lady made a scene in the grocery store."},{"definition":"An element of fiction writing."},{"definition":"A social environment consisting of an informal, vague group of people with a uniting interest; their sphere of activity; a subculture.","example":"She got into the emo scene at an early age."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/scenes-us.mp3","text":"/siːnz/"}]},{"word":"EXPERIMENTS","idx":4889,"count":13690535,"meanings":[{"definitions":[{"definition":"A test under controlled conditions made to either demonstrate a known truth, examine the validity of a hypothesis, or determine the efficacy of something previously untried."},{"definition":"Experience, practical familiarity with something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To conduct an experiment."},{"definition":"To experience; to feel; to perceive; to detect."},{"definition":"To test or ascertain by experiment; to try out; to make an experiment on."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/experiments-us.mp3","text":"/ɪkˈspɛɹ.ɪ.mənts/"}]},{"word":"BALLS","idx":4890,"count":13683840,"meanings":[{"definitions":[{"definition":"A solid or hollow sphere, or roughly spherical mass.","example":"a ball of spittle; a fecal ball"},{"definition":"A round or ellipsoidal object."},{"definition":"(mildly, usually in the plural) A testicle."},{"definition":"A leather-covered cushion, fastened to a handle called a ballstock; formerly used by printers for inking the form, then superseded by the roller."},{"definition":"A large pill, a form in which medicine was given to horses; a bolus."},{"definition":"A formal dance."},{"definition":"A very enjoyable time.","example":"I had a ball at that concert."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form or wind into a ball.","example":"to ball cotton"},{"definition":"To heat in a furnace and form into balls for rolling."},{"definition":"To have sexual intercourse with."},{"definition":"To gather balls which cling to the feet, as of damp snow or clay; to gather into balls.","example":"The horse balls; the snow balls."},{"definition":"(usually in present participle) To be hip or cool."},{"definition":"To play basketball."},{"definition":"To punish by affixing a ball and chain"},{"definition":"Speaking or acting with bravado to achieve (something)"},{"definition":"To engage in sexual intercourse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Very. Intensifier.","example":"It is balls cold out there."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/balls-us.mp3","text":"/bɔːlz/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/balls-uk.mp3","text":"/bɔːlz/"}]},{"word":"DD","idx":4892,"count":13675652,"meanings":[{"definitions":[{"definition":"Day, in two-digit, numeric format, as in dd/mm/yyyy"}],"partOfSpeech":"n"}]},{"word":"BOOST","idx":4893,"count":13675076,"meanings":[{"definitions":[{"definition":"A push from behind, as to one who is endeavoring to climb."},{"definition":"Something that helps, or adds power or effectiveness; assistance.","example":"The controversy gave a boost to the author's sales."},{"definition":"(automotive engineering) A positive intake manifold pressure in cars with turbochargers or superchargers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lift or push from behind (one who is endeavoring to climb); to push up."},{"definition":"(by extension) To help or encourage (something) to increase or improve; to assist in overcoming obstacles.","example":"This campaign will boost your chances of winning the election."},{"definition":"To steal."},{"definition":"To jump-start a vehicle by using cables to connect the battery in a running vehicle to the battery in a vehicle that won't start."},{"definition":"To give a booster shot to."},{"definition":"To amplify; to signal boost."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/boost-au.mp3","text":"/buːst/"}]},{"word":"SPANKING","idx":4894,"count":13673436,"meanings":[{"definitions":[{"definition":"To beat, smack or slap a person's buttocks, with the bare hand or other object, as punishment, gesture, or form of sexual interaction."},{"definition":"To soundly defeat, to trounce."},{"definition":"To hit very hard"},{"definition":"To move rapidly.","example":"The ship was really spanking along."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A form of physical punishment in which a beating is applied to the buttocks.","example":"Domestic spanking is often endured over the knee (or lap), formal spanking rather applied over a contraption such as a tresle or A-frame, with or without constraints"},{"definition":"An incident of such punishment, or such physical act in a non-punitive context, such as a birthday spanking."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Fast and energetic.","example":"a spanking pace"},{"definition":"Brisk and fresh.","example":"a spanking breeze"}],"partOfSpeech":"j"},{"definitions":[{"definition":"(now usually with “new”) An intensifier.","example":"a spanking good time"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/spanking-us.mp3"},{"text":"/ˈspæŋkɪŋ/"}]},{"word":"SCHOLARSHIP","idx":4895,"count":13667978,"meanings":[{"definitions":[{"definition":"A grant-in-aid to a student."},{"definition":"The character or qualities of a scholar."},{"definition":"The activity, methods or attainments of a scholar."},{"definition":"The sum of knowledge accrued by scholars; the realm of refined learning."},{"definition":"The first year of high school, often accompanied by exams that needed to be passed before advancement to the higher grades."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attend an institution on a scholarship."},{"definition":"To grant a scholarship to."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈskɑːləɹʃɪp/"},{"text":"/ˈskɒləʃɪp/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/scholarship-au.mp3"}]},{"word":"GOVERNANCE","idx":4896,"count":13664006,"meanings":[{"definitions":[{"definition":"The process, or the power, of governing; government or administration."},{"definition":"The specific system by which a political system is ruled."},{"definition":"The group of people who make up an administrative body."},{"definition":"The state of being governed."},{"definition":"Accountability for consistent, cohesive policies, processes and decision rights."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡʌvəɹnəns/"},{"text":"/ˈɡʌvənəns/"}]},{"word":"MILL","idx":4897,"count":13658453,"meanings":[{"definitions":[{"definition":"A grinding apparatus for substances such as grains, seeds, etc.","example":"Pepper has a stronger flavor when it is ground straight from a mill."},{"definition":"The building housing such a grinding apparatus.","example":"My grandfather worked in a mill."},{"definition":"A machine used for expelling the juice, sap, etc., from vegetable tissues by pressure, or by pressure in combination with a grinding, or cutting process.","example":"a cider mill; a cane mill"},{"definition":"A machine for grinding and polishing.","example":"a lapidary mill"},{"definition":"The raised or ridged edge or surface made in milling anything, such as a coin or screw."},{"definition":"A manufacturing plant for paper, steel, textiles, etc.","example":"a steel mill"},{"definition":"A building housing such a plant."},{"definition":"An establishment that handles a certain type of situation or procedure routinely, or produces large quantities of an item without much regard to quality, such as a divorce mill, a puppy mill, etc."},{"definition":"An institution awarding educational certificates not officially recognised"},{"definition":"An engine."},{"definition":"A boxing match, fistfight."},{"definition":"(die sinking) A hardened steel roller with a design in relief, used for imprinting a reversed copy of the design in a softer metal, such as copper."},{"definition":"An excavation in rock, transverse to the workings, from which material for filling is obtained."},{"definition":"A passage underground through which ore is shot."},{"definition":"A milling cutter."},{"definition":"A treadmill."},{"definition":"A typewriter used to transcribe messages received."},{"definition":"An obsolete coin worth one thousandth of a US dollar, or one tenth of a cent."},{"definition":"One thousandth part, particularly in millage rates of property tax."},{"definition":"An angular mil, a unit of angular measurement equal to 1⁄6400 of a complete circle. At 1000 metres one mil subtends about one metre (0.98 m). Also 1⁄6000 and 1⁄6300 are used in other countries."},{"definition":"A unit of measurement equal to 1⁄1000 of an inch, usually used for thin objects, such as sheets of plastic."},{"definition":"A former subdivision (1/1000) of the Maltese lira"},{"definition":"(plural \"mil\") Abbreviation of million."},{"definition":"A unit of measure of capacity, being one thousandth of a litre. Symbol: ml"},{"definition":"A line of three matching pieces in nine men's morris and related games."},{"definition":"(trading card games) Discarding a card from one's deck."},{"definition":"(trading card games) A strategy centered on depleting the opponent's deck."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grind or otherwise process in a mill or other machine.","example":"to mill flour"},{"definition":"To shape, polish, dress or finish using a machine."},{"definition":"To engrave one or more grooves or a pattern around the edge of (a cylindrical object such as a coin)."},{"definition":"(followed by around, about, etc.) To move about in an aimless fashion.","example":"I didn't have much to do, so I just milled around the town looking at the shops."},{"definition":"To cause to mill, or circle around.","example":"to mill cattle"},{"definition":"(of air-breathing creatures) To swim underwater."},{"definition":"(of a whale) To swim suddenly in a new direction."},{"definition":"To beat; to pound."},{"definition":"To pass through a fulling mill; to full, as cloth."},{"definition":"To roll (steel, etc.) into bars."},{"definition":"To make (drinking chocolate) frothy, as by churning."},{"definition":"To undergo hulling.","example":"This maize mills well."},{"definition":"To take part in a fistfight; to box."},{"definition":"To fill (a winze or interior incline) with broken ore, to be drawn out at the bottom."},{"definition":"(thieves' cant) To commit burglary."},{"definition":"(trading card games) To move (a card) from a deck to the discard pile."},{"definition":"(Hearthstone) To destroy (a card) due to having a full hand."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/mill-us.mp3","text":"/mɪl/"}]},{"word":"FOUNDED","idx":4898,"count":13656662,"meanings":[{"definitions":[{"definition":"To start (an institution or organization)."},{"definition":"To begin building."},{"definition":"To melt, especially of metal in an industrial setting."},{"definition":"To form by melting a metal and pouring it into a mould; to cast."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a basis.","example":"She offered a well-founded hypothesis."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/founded-us.mp3","text":"/ˈfaʊndɪd/"}]},{"word":"SUPPLEMENTS","idx":4899,"count":13656530,"meanings":[{"definitions":[{"definition":"Something added, especially to make up for a deficiency."},{"definition":"An extension to a document or publication that adds information, corrects errors or brings up to date."},{"definition":"An additional section of a newspaper devoted to a specific subject."},{"definition":"An angle that, when added to a given angle, makes 180°; a supplementary angle."},{"definition":"(nutrition) A vitamin, herbal extract or chemical compound ingested to meet dietary deficiencies or enhance muscular development."},{"definition":"An additional charge, especially for food in a restaurant.","example":"There is a £2 supplement if you choose the steak."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide or make a supplement to something."}],"partOfSpeech":"ve"}]},{"word":"CHRONIC","idx":4900,"count":13650397,"meanings":[{"definitions":[{"definition":"Marijuana, typically of high quality."},{"definition":"A condition of extended duration, either continuous or marked by frequent recurrence. Sometimes implies a condition which worsens with each recurrence, though that is not inherent in the term."},{"definition":"A person who is chronic, such as a criminal reoffender or a person with chronic disease."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a problem, that continues over an extended period of time.","example":"chronic unemployment; chronic poverty; chronic anger; chronic life"},{"definition":"Prolonged or slow to heal.","example":"chronic cough; chronic headache; chronic illness"},{"definition":"Of a person, suffering from an affliction that is prolonged or slow to heal.","example":"Chronic patients must learn to live with their condition."},{"definition":"Inveterate or habitual.","example":"He's a chronic smoker."},{"definition":"Very bad, awful.","example":"That concert was chronic."},{"definition":"Extremely serious.","example":"They left him in a chronic condition."},{"definition":"Good, great; \"wicked\".","example":"That was cool, chronic in fact."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/chronic-au.mp3","text":"/ˈkɹɒnɪk/"}]},{"word":"ICONS","idx":4901,"count":13649671,"meanings":[{"definitions":[{"definition":"An image, symbol, picture, or other representation usually as an object of religious devotion."},{"definition":"(especially Eastern Christianity) A type of religious painting portraying a saint or scene from Scripture, often done on wooden panels."},{"definition":"(by extension) A person or thing that is the best example of a certain profession or some doing.","example":"That man is an icon in the business; he personifies loyalty and good business sense."},{"definition":"A small picture that represents something (such as an icon on a computer screen which when clicked performs some function.)"},{"definition":"A word, character, or sign whose form reflects and is determined by the referent; onomatopoeic words are necessarily all icons."}],"partOfSpeech":"n"}]},{"word":"TRANNY","idx":4902,"count":13645638,"meanings":[{"definitions":[{"definition":"A transsexual, transgender or transvestite person, usually a trans woman."},{"definition":"A transistor radio."},{"definition":"A mechanical transmission, a gearbox."},{"definition":"A transformer."},{"definition":"A transition between moves."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɹæ.ni/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tranny-au.mp3"}]},{"word":"MORAL","idx":4903,"count":13643598,"meanings":[{"definitions":[{"definition":"(of a narrative) The ethical significance or practical lesson."},{"definition":"(chiefly in the plural) Moral practices or teachings: modes of conduct.","example":"a candidate with strong morals"},{"definition":"A morality play."},{"definition":"A moral certainty."},{"definition":"An exact counterpart."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To moralize."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to principles of right and wrong in behaviour, especially for teaching right behaviour.","example":"moral judgments;  a moral poem"},{"definition":"Conforming to a standard of right behaviour; sanctioned by or operative on one's conscience or ethical judgment.","example":"a moral obligation"},{"definition":"Capable of right and wrong action.","example":"a moral agent"},{"definition":"Probable but not proved.","example":"a moral certainty"},{"definition":"Positively affecting the mind, confidence, or will.","example":"a moral victory;  moral support"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/moral-us.mp3","text":"/ˈmɑɹəl/"}]},{"word":"DEN","idx":4904,"count":13641144,"meanings":[{"definitions":[{"definition":"A small cavern or hollow place in the side of a hill, or among rocks; especially, a cave used by a wild animal for shelter or concealment.","example":"Daniel was put into the lions’ den."},{"definition":"A squalid or wretched place; a haunt.","example":"a den of vice"},{"definition":"A comfortable room not used for formal entertaining."},{"definition":"A narrow glen; a ravine; a dell."},{"definition":"An old French coin worth one-twelfth of a sou."},{"definition":"A unit of linear density which indicates the fineness of fiber or yarn, equal to one gram per 9000 meters, used especially to measure or indicate the fineness of hosiery. Originally equal to the weight of a denier coin per 9600 aunes."},{"definition":"Person who denies something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ensconce or hide oneself in (or as in) a den."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(temporal location) At that time.","example":"He was happy then."},{"definition":"(temporal location) Soon afterward.","example":"He fixed it, then left."},{"definition":"(sequence) Next in order; in addition.","example":"There are three green ones, then a blue one."},{"definition":"In that case.","example":"If it’s locked, then we’ll need the key."},{"definition":"(sequence) At the same time; on the other hand.","example":"That’s a nice shirt, but then, so is the other one."},{"definition":"(affirmation) Used to contradict an assertion."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/den-1-us.mp3","text":"/dɛn/"}]},{"word":"CATERING","idx":4905,"count":13638302,"meanings":[{"definitions":[{"definition":"To provide, particularly:"},{"definition":"To place, set, move, or cut diagonally or rhomboidally."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The business of providing food and related services; foodservice."},{"definition":"The business of providing such services for special occasions."},{"definition":"The act of one who caters (to something)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkeɪt(ə)ɹɪŋ/"}]},{"word":"FINGER","idx":4907,"count":13628350,"meanings":[{"definitions":[{"definition":"A slender jointed extremity of the human hand, exclusive of the thumb.","example":"Humans have two hands and ten fingers. Each hand has one thumb and four fingers."},{"definition":"Similar or similar-looking extremities in other animals, particularly:"},{"definition":"Something similar in shape to the human finger, particularly:"},{"definition":"Something similarly extending, from a larger body, particularly:","example":"a finger of land; a finger of smoke"},{"definition":"Something similar in function or agency to the human finger, with regard to touching, grasping, or pointing."},{"definition":"Various units of measure based or notionally based on the adult human finger, particularly"},{"definition":"A part of a glove intended to cover a finger."},{"definition":"Skill in the use of the fingers, as in playing upon a musical instrument."},{"definition":"Someone skilled in the use of their fingers, a pickpocket."},{"definition":"A person."},{"definition":"(especially in the phrase 'give someone the finger') An obscene or insulting gesture made by raising one's middle finger towards someone with the palm of one's hand facing inwards."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To identify or point out. Also put the finger on. To report to or identify for the authorities, rat on, rat out, squeal on, tattle on, turn in."},{"definition":"To poke, probe, feel, or fondle with a finger or fingers."},{"definition":"To use the fingers to penetrate and sexually stimulate one's own or another person's vagina or anus; to fingerbang"},{"definition":"To use specified finger positions in producing notes on a musical instrument."},{"definition":"To provide instructions in written music as to which fingers are to be used to produce particular notes or passages."},{"definition":"To query (a user's status) using the Finger protocol."},{"definition":"To steal; to purloin."},{"definition":"To execute, as any delicate work."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/finger-us.mp3","text":"/ˈfɪŋɡɚ/"}]},{"word":"KEEPS","idx":4908,"count":13624468,"meanings":[{"definitions":[{"definition":"The main tower of a castle or fortress, located within the castle walls."},{"definition":"The food or money required to keep someone alive and healthy; one's support, maintenance.","example":"He works as a cobbler's apprentice for his keep."},{"definition":"The act or office of keeping; custody; guard; care; heed; charge; notice."},{"definition":"The state of being kept; hence, the resulting condition; case.","example":"to be in good keep"},{"definition":"That which is kept in charge; a charge."},{"definition":"A cap for holding something, such as a journal box, in place."},{"definition":"Keeping"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To continue in (a course or mode of action); not to intermit or fall from; to uphold or maintain.","example":"to keep silence;  to keep one's word;  to keep possession"},{"definition":"(heading) To hold the status of something."},{"definition":"(heading) To hold or be held in a state."},{"definition":"To wait for, keep watch for."},{"definition":"To act as wicket-keeper.","example":"Godfrey Evans kept for England for many years."},{"definition":"To take care; to be solicitous; to watch."},{"definition":"To be in session; to take place.","example":"School keeps today."},{"definition":"To observe; to adhere to; to fulfill; not to swerve from or violate."},{"definition":"(by extension) To visit (a place) often; to frequent."},{"definition":"To observe or celebrate (a holiday).","example":"The feast of St. Stephen is kept on December 26."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/keeps-us.mp3","text":"/kiːps/"}]},{"word":"POUND","idx":4909,"count":13620117,"meanings":[{"definitions":[{"definition":"A unit of mass equal to 16 avoirdupois ounces (= 453.592 37 g). Today this value is the most common meaning of \"pound\" as a unit of weight."},{"definition":"A unit of mass equal to 12 troy ounces (≈ 373.242 g). Today, this is a common unit of weight when measuring precious metals, and is little used elsewhere."},{"definition":"The symbol # (octothorpe, hash)"},{"definition":"The unit of currency used in the United Kingdom and its dependencies. It is divided into 100 pence."},{"definition":"Any of various units of currency used in Egypt and Lebanon, and formerly in the Republic of Ireland, Cyprus and Israel."},{"definition":"Any of various units of currency formerly used in the United States.","example":"the Rhode Island pound; the New Hampshire pound"},{"definition":"Abbreviation for pound-force, a unit of force/weight. Using this abbreviation to describe pound-force is inaccurate and unscientific."},{"definition":"A place for the detention of stray or wandering animals. An animal shelter."},{"definition":"A place for the detention of automobiles that have been illegally parked, abandoned, etc. Short form of impound."},{"definition":"A section of a canal between two adjacent locks."},{"definition":"A kind of fishing net, having a large enclosure with a narrow entrance into which fish are directed by wings spreading outward."},{"definition":"A hard blow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To confine in, or as in, a pound; to impound."},{"definition":"To strike hard, usually repeatedly."},{"definition":"To crush to pieces; to pulverize."},{"definition":"To eat or drink very quickly.","example":"You really pounded that beer!"},{"definition":"To pitch consistently to a certain location.","example":"The pitcher has been pounding the outside corner all night."},{"definition":"(of a body part, generally heart, blood, or head) To beat strongly or throb.","example":"As I tiptoed past the sleeping dog, my heart was pounding but I remained silent."},{"definition":"To penetrate sexually, with vigour.","example":"I was pounding her all night!"},{"definition":"To advance heavily with measured steps."},{"definition":"To make a jarring noise, as when running.","example":"The engine pounds."},{"definition":"To wager a pound on."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pound-us.mp3","text":"/paʊnd/"}]},{"word":"LOCATE","idx":4910,"count":13616735,"meanings":[{"definitions":[{"definition":"To place; to set in a particular spot or position."},{"definition":"To find out where something is located."},{"definition":"To designate the site or place of; to define the limits of (Note: the designation may be purely descriptive: it need not be prescriptive.)","example":"The council must locate the new hospital"},{"definition":"To place oneself; to take up one's residence; to settle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/locate-us.mp3","text":"/loʊˈkeɪt/"}]},{"word":"CAMCORDER","idx":4911,"count":13609184,"meanings":[{"definitions":[{"definition":"A portable electronic device for recording images and audio on to a storage device, hence functioning as a camera and a recorder in a single unit"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To record using a camcorder."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkæmˌkɔɹdɚ/"}]},{"word":"PL","idx":4912,"count":13608193,"meanings":[{"definitions":[{"definition":"(physical) An area; somewhere within an area."},{"definition":"A location or position in space."},{"definition":"A particular location in a book or document, particularly the current location of a reader."},{"definition":"A passage or extract from a book or document."},{"definition":"A topic."},{"definition":"A frame of mind.","example":"I'm in a strange place at the moment."},{"definition":"A chess position; a square of the chessboard."},{"definition":"(social) A responsibility or position in an organization."},{"definition":"A fortified position: a fortress, citadel, or walled town."},{"definition":"Numerically, the column counting a certain quantity.","example":"three decimal places;  the hundreds place"},{"definition":"Ordinal relation; position in the order of proceeding.","example":"That's what I said in the first place!"},{"definition":"Reception; effect; implying the making room for."},{"definition":"(grammar) The plural number."},{"definition":"(grammar) A word in the form in which it potentially refers to something other than one person or thing; and other than two things if the language has a dual form."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Consisting of or containing more than one of something."},{"definition":"Pluralistic."}],"partOfSpeech":"j"}]},{"word":"TRAINED","idx":4913,"count":13608102,"meanings":[{"definitions":[{"definition":"To practice an ability.","example":"She trained seven hours a day to prepare for the Olympics."},{"definition":"To teach and form (someone) by practice; to educate (someone).","example":"You can't train a pig to write poetry."},{"definition":"To improve one's fitness.","example":"I trained with weights all winter."},{"definition":"To proceed in sequence."},{"definition":"To move (a gun) laterally so that it points in a different direction.","example":"The assassin had trained his gun on the minister."},{"definition":"To encourage (a plant or branch) to grow in a particular direction or shape, usually by pruning and bending.","example":"The vine had been trained over the pergola."},{"definition":"To trace (a lode or any mineral appearance) to its head."},{"definition":"To create a trainer for; to apply cheats to (a game)."},{"definition":"To draw along; to trail; to drag."},{"definition":"To draw by persuasion, artifice, or the like; to attract by stratagem; to entice; to allure."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having undergone a course of training (sometimes in combination).","example":"fully trained troops"},{"definition":"Manipulated in shape or habit.","example":"trained fruit trees"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/trained-us.mp3","text":"/tɹeɪnd/"}]},{"word":"BURN","idx":4914,"count":13602754,"meanings":[{"definitions":[{"definition":"A physical injury caused by heat, cold, electricity, radiation or caustic chemicals.","example":"She had second-degree burns from falling in the bonfire."},{"definition":"A sensation resembling such an injury.","example":"chili burn from eating hot peppers"},{"definition":"The act of burning something with fire.","example":"They're doing a controlled burn of the fields."},{"definition":"An intense non-physical sting, as left by shame or an effective insult."},{"definition":"An effective insult, often in the expression sick burn (excellent or badass insult)."},{"definition":"Physical sensation in the muscles following strenuous exercise, caused by build-up of lactic acid.","example":"One and, two and, keep moving; feel the burn!"},{"definition":"Tobacco."},{"definition":"The writing of data to a permanent storage medium like a compact disc or a ROM chip."},{"definition":"The operation or result of burning or baking, as in brickmaking.","example":"They have a good burn."},{"definition":"A disease in vegetables; brand."},{"definition":"A stream."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to be consumed by fire.","example":"He burned his manuscript in the fireplace."},{"definition":"To be consumed by fire, or in flames.","example":"He watched the house burn."},{"definition":"To overheat so as to make unusable.","example":"He burned the toast. The blacksmith burned the steel."},{"definition":"To become overheated to the point of being unusable.","example":"The grill was too hot and the steak burned."},{"definition":"To make or produce by the application of fire or burning heat.","example":"to burn a hole;  to burn letters into a block"},{"definition":"To injure (a person or animal) with heat or chemicals that produce similar damage.","example":"She burned the child with an iron, and was jailed for ten years."},{"definition":"To cauterize."},{"definition":"To sunburn.","example":"She forgot to put on sunscreen and burned."},{"definition":"To consume, injure, or change the condition of, as if by action of fire or heat; to affect as fire or heat does.","example":"to burn the mouth with pepper"},{"definition":"To be hot, e.g. due to embarrassment.","example":"The child's forehead was burning with fever.  Her cheeks burned with shame."},{"definition":"To cause to combine with oxygen or other active agent, with evolution of heat; to consume; to oxidize.","example":"A human being burns a certain amount of carbon at each respiration.  to burn iron in oxygen"},{"definition":"To combine energetically, with evolution of heat.","example":"Copper burns in chlorine."},{"definition":"To write data to a permanent storage medium like a compact disc or a ROM chip.","example":"We’ll burn this program onto an EEPROM one hour before the demo begins."},{"definition":"To betray.","example":"The informant burned him."},{"definition":"To insult or defeat.","example":"I just burned you again."},{"definition":"To waste (time); to waste money or other resources.","example":"The company has burned more than a million dollars a month this year."},{"definition":"In certain games, to approach near to a concealed object which is sought.","example":"You're cold... warm... hot... you're burning!"},{"definition":"To accidentally touch a moving stone."},{"definition":"In pontoon, to swap a pair of cards for another pair, or to deal a dead card."},{"definition":"To increase the exposure for certain areas of a print in order to make them lighter (compare dodge)."},{"definition":"(of an element) To be converted to another element in a nuclear fusion reaction, especially in a star"},{"definition":"To discard."},{"definition":"To shoot someone with a firearm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/burn-us.mp3","text":"/bɝn/"}]},{"word":"IMPLEMENTING","idx":4915,"count":13588118,"meanings":[{"definitions":[{"definition":"To bring about; to put into practice","example":"It’s a good thought, but it will be a difficult thing to implement."},{"definition":"To carry out; to do"}],"partOfSpeech":"ve"}]},{"word":"ROSES","idx":4916,"count":13584758,"meanings":[{"definitions":[{"definition":"A shrub of the genus Rosa, with red, pink, white or yellow flowers."},{"definition":"A flower of the rose plant."},{"definition":"A plant or species in the rose family. (Rosaceae)"},{"definition":"Something resembling a rose flower."},{"definition":"The rose flower, usually depicted with five petals, five barbs, and a circular seed."},{"definition":"A purplish-red or pink colour, the colour of some rose flowers."},{"definition":"A round nozzle for a sprinkling can or hose."},{"definition":"The base of a light socket."},{"definition":"Any of various large, red-bodied, papilionid butterflies of the genus Pachliopta."},{"definition":"Any of various flower-like polar graphs of sinusoids or their squares."},{"definition":"A graph with only one vertex."},{"definition":"A pale pink wine made by removing the dark grape skins at the required point during fermentation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make rose-coloured; to redden or flush."},{"definition":"To perfume, as with roses."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/roses-us.mp3","text":"/ɹoʊzɨz̥/"}]},{"word":"LABS","idx":4917,"count":13582203,"meanings":[{"definitions":[{"definition":"A laboratory."},{"definition":"(chiefly in the plural) Laboratory experiment, test, investigation or result.","example":"I dropped my mixture while doing my lab, so I had to start over."},{"definition":"A Labrador retriever."},{"definition":"A telltale; a blabber."}],"partOfSpeech":"n"}]},{"word":"OURSELVES","idx":4918,"count":13581863,"meanings":[{"definitions":[{"definition":"(reflexive pronoun) Us; the group including the speaker as the object of a verb or preposition when that group also is the subject.","example":"We should keep this for ourselves."},{"definition":"We; intensifies the subject as the group including the speaker, especially to indicate that no one else satisfies the predicate.","example":"We did it ourselves."}],"partOfSpeech":"p"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/ourselves-us.mp3","text":"/aʊɚˈsɛlvz/"}]},{"word":"BREAD","idx":4919,"count":13575360,"meanings":[{"definitions":[{"definition":"A foodstuff made by baking dough made from cereals."},{"definition":"Any variety of bread."},{"definition":"Money."},{"definition":"Food; sustenance; support of life, in general."},{"definition":"Breadth."},{"definition":"A piece of embroidery; a braid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To coat with breadcrumbs"},{"definition":"To make broad; spread."},{"definition":"To form in meshes; net."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/bread-us.mp3","text":"/bɹɛd/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/bread-uk.mp3","text":"/bɹɛd/"}]},{"word":"TOBACCO","idx":4920,"count":13574147,"meanings":[{"definitions":[{"definition":"Any plant of the genus Nicotiana."},{"definition":"Leaves of Nicotiana tabacum and some other species cultivated and harvested to make cigarettes, cigars, snuff, for smoking in pipes or for chewing."},{"definition":"A variety of tobacco.","example":"Tobaccos from the Connecticut Valley were used for wrapping cigars."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To indulge in tobacco; to smoke."},{"definition":"To treat with tobacco."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tobacco-us.mp3","text":"/təˈbækoʊ/"}]},{"word":"WOODEN","idx":4921,"count":13564576,"meanings":[{"definitions":[{"definition":"Made of wood.","example":"On a recent windy day, hundreds of visitors climbed wooden stairs to take pictures in front of the glacier."},{"definition":"As if made of wood; moving awkwardly, or speaking with dull lack of emotion.","example":"wooden acting"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/wooden-us.mp3","text":"/ˈwʊdən/"}]},{"word":"MOTORS","idx":4922,"count":13563719,"meanings":[{"definitions":[{"definition":"A machine or device that converts other energy forms into mechanical energy, or imparts motion."},{"definition":"A motor car, or automobile.","example":"Nice motor!"},{"definition":"A source of power for something; an inspiration; a driving force."},{"definition":"Any protein capable of converting chemical energy into mechanical work."},{"definition":"The controller or prime mover of the universe; God."},{"definition":"The fermenting mass of fruit that is the basis of pruno, or \"prison wine\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a journey by motor vehicle; to drive.","example":"On Saturday we motored down to Plymouth."},{"definition":"To move at a brisk pace.","example":"Sales were slow at first, but now things are really motoring."},{"definition":"To leave.","example":"I gotta motor."}],"partOfSpeech":"ve"}]},{"word":"TOUGH","idx":4923,"count":13560922,"meanings":[{"definitions":[{"definition":"A person who obtains things by force; a thug or bully.","example":"They were doing fine until they encountered a bunch of toughs from the opposition."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To endure."},{"definition":"To toughen."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Strong and resilient; sturdy.","example":"The tent, made of tough canvas, held up to many abuses."},{"definition":"(of food) Difficult to cut or chew.","example":"To soften a tough cut of meat, the recipe suggested simmering it for hours."},{"definition":"Rugged or physically hardy.","example":"Only a tough species will survive in the desert."},{"definition":"Stubborn.","example":"He had a reputation as a tough negotiator."},{"definition":"(of weather etc) Harsh or severe."},{"definition":"Rowdy or rough.","example":"A bunch of the tough boys from the wrong side of the tracks threatened him."},{"definition":"(of questions, etc.) Difficult or demanding.","example":"This is a tough crowd."},{"definition":"Undergoing plastic deformation before breaking."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Used to indicate lack of sympathy","example":"If you don't like it, tough!"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tough-us.mp3","text":"/tʌf/"}]},{"word":"INCIDENT","idx":4925,"count":13553458,"meanings":[{"definitions":[{"definition":"An event or occurrence.","example":"It was an incident that he hoped to forget."},{"definition":"A (relatively minor) event that is incidental to, or related to others."},{"definition":"An event that causes or may cause an interruption or a crisis, such as a workplace illness or a software error."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Arising as the result of an event, inherent."},{"definition":"(of a stream of particles or radiation) Falling on or striking a surface.","example":"The incident light illuminated the surface."},{"definition":"Coming or happening accidentally; not in the usual course of things; not in connection with the main design; not according to expectation; casual; fortuitous."},{"definition":"Liable to happen; apt to occur; befalling; hence, naturally happening or appertaining."},{"definition":"Dependent upon, or appertaining to, another thing, called the principal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/incident-us.mp3","text":"/ˈɪn.sɪ.dənt/"}]},{"word":"DYNAMICS","idx":4927,"count":13534626,"meanings":[{"definitions":[{"definition":"The branch of mechanics that is concerned with the effects of forces on the motion of objects."},{"definition":"The volume of the sound, such as piano, mezzo piano, mezzo forte, and forte."}],"partOfSpeech":"n"}]},{"word":"LIE","idx":4928,"count":13533542,"meanings":[{"definitions":[{"definition":"The terrain and conditions surrounding the ball before it is struck."},{"definition":"The terrain and conditions surrounding the disc before it is thrown."},{"definition":"The position of a fetus in the womb."},{"definition":"A manner of lying; relative position."},{"definition":"An animal's lair."},{"definition":"An intentionally false statement; an intentional falsehood.","example":"I knew he was telling a lie by his facial expression."},{"definition":"A statement intended to deceive, even if literally true; a half-truth"},{"definition":"Anything that misleads or disappoints."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rest in a horizontal position on a surface.","example":"The book lies on the table;  the snow lies on the roof;  he lies in his coffin"},{"definition":"To be placed or situated."},{"definition":"To abide; to remain for a longer or shorter time; to be in a certain state or condition.","example":"The paper does not lie smooth on the wall."},{"definition":"Used with in: to be or exist; to belong or pertain; to have an abiding place; to consist."},{"definition":"Used with with: to have sexual relations with."},{"definition":"Used with on/upon: to be incumbent (on); to be the responsibility of a person."},{"definition":"To lodge; to sleep."},{"definition":"To be still or quiet, like one lying down to rest."},{"definition":"To be sustainable; to be capable of being maintained."},{"definition":"To give false information intentionally with intent to deceive.","example":"If you are found to have lied in court, you could face a penalty."},{"definition":"To convey a false image or impression.","example":"Photographs often lie."},{"definition":"To be mistaken or unintentionally spread false information.","example":"Sorry, I haven't seen your keys anywhere...wait, I lied! They're right there on the coffee table."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/lie-us.mp3","text":"/laɪ̯/"}]},{"word":"RF","idx":4930,"count":13530421,"meanings":[{"definitions":[{"definition":"That part of the electromagnetic spectrum, between about 3 kHz and 300 MHz, within which radio waves are transmitted."},{"definition":"A frequency in this range."}],"partOfSpeech":"n"}]},{"word":"CONVERSATION","idx":4931,"count":13527150,"meanings":[{"definitions":[{"definition":"Expression and exchange of individual ideas through talking with other people; also, a set instance or occasion of such talking.","example":"I had an interesting conversation with Nicolas yesterday about how much he's getting paid."},{"definition":"The back-and-forth play of the blades in a bout."},{"definition":"The protocol-based interaction between systems processing a transaction."},{"definition":"Interaction; commerce or intercourse with other people; dealing with others."},{"definition":"Behaviour, the way one conducts oneself; a person's way of life."},{"definition":"Sexual intercourse."},{"definition":"Engagement with a specific subject, idea, field of study etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To engage in conversation (with)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/conversation-us.ogg","text":"/ˌkɑn.vəɹˈseɪ.ʃən/"}]},{"word":"DECREASE","idx":4932,"count":13523903,"meanings":[{"definitions":[{"definition":"An amount by which a quantity is decreased.","example":"One research team has recorded Baishui’s decrease at about 27 meters per year over the last 10 years."},{"definition":"A reduction in the number of stitches, usually accomplished by suspending the stitch to be decreased from another existing stitch or by knitting it together with another stitch. See Decrease (knitting)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a quantity, to become smaller."},{"definition":"To make (a quantity) smaller."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/decrease-us.mp3"}]},{"word":"CHEST","idx":4934,"count":13516414,"meanings":[{"definitions":[{"definition":"A box, now usually a large strong box with a secure convex lid.","example":"The clothes are kept in a chest."},{"definition":"A coffin."},{"definition":"The place in which public money is kept; a treasury.","example":"You can take the money from the chest."},{"definition":"A chest of drawers."},{"definition":"The portion of the front of the human body from the base of the neck to the top of the abdomen; the thorax. Also the analogous area in other animals.","example":"She had a sudden pain in her chest."},{"definition":"A hit or blow made with one's chest.","example":"He scored with a chest into the goal."},{"definition":"Debate; quarrel; strife; enmity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit with one's chest (front of one's body)"},{"definition":"To deposit in a chest."},{"definition":"To place in a coffin."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/chest-us.mp3","text":"/t͡ʃɛst/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/chest-uk.mp3","text":"/t͡ʃɛst/"}]},{"word":"PENSION","idx":4935,"count":13515899,"meanings":[{"definitions":[{"definition":"An annuity paid regularly as benefit due to a retired employee, serviceman etc. in consideration of past services, originally and chiefly by a government but also by various private pension schemes.","example":"Many old people depend on their pension to pay the bills."},{"definition":"A boarding house or small hotel, especially in continental Europe, which typically offers lodging and certain meals and services.","example":"A pension had somewhat less to offer than a hotel; it was always smaller, and never elegant; it sometimes offered breakfast, and sometimes not (John Irving)."},{"definition":"A wage or fee."},{"definition":"A charge or expense of some kind; a tax."},{"definition":"A sum paid to a clergyman in place of tithes."},{"definition":"A regular allowance paid to support a royal favourite, or as patronage of an artist or scholar."},{"definition":"A boarding school in France, Belgium, Switzerland, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grant a pension to."},{"definition":"To force (someone) to retire on a pension."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pension-us.mp3","text":"/ˈpɛnʃ(ə)n/"}]},{"word":"BILLY","idx":4936,"count":13515249,"meanings":[{"definitions":[{"definition":"A billy club."},{"definition":"A billy goat."},{"definition":"A good friend."},{"definition":"A tin used by bushmen to boil tea; a billycan; a billypot.","example":"Let's get the billy and cook some beans."},{"definition":"A condom (from the E-Rotic song \"Willy, Use a Billy... Boy\")"},{"definition":"A slubbing or roving machine."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/billy-us.mp3"}]},{"word":"REVENUES","idx":4937,"count":13508713,"meanings":[{"definitions":[{"definition":"The income returned by an investment."},{"definition":"The total income received from a given source."},{"definition":"All income generated for some political entity's treasury by taxation and other means."},{"definition":"The total sales; turnover."},{"definition":"The net income from normal business operations; net sales."},{"definition":"A return; something paid back."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹɛvəˌnuz/"},{"text":"/ˈɹɛvənjuːz/"}]},{"word":"EMERGING","idx":4938,"count":13504049,"meanings":[{"definitions":[{"definition":"To come into view."},{"definition":"To come out of a situation, object or a liquid.","example":"He emerged unscathed from the accident."},{"definition":"To become known.","example":"Gradually the truth emerged."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Emergence"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Becoming prominent; emergent; rising."}],"partOfSpeech":"j"}]},{"word":"WORSHIP","idx":4939,"count":13502651,"meanings":[{"definitions":[{"definition":"The condition of being worthy; honour, distinction."},{"definition":"The devotion accorded to a deity or to a sacred object."},{"definition":"The religious ceremonies that express this devotion."},{"definition":"(by extension) Voluntary, utter submission; voluntary, utter deference."},{"definition":"(also by extension) Ardent love."},{"definition":"An object of worship."},{"definition":"Honour; respect; civil deference."},{"definition":"(chiefly British) Used as a title or term of address for various officials, including magistrates"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reverence (a deity, etc.) with supreme respect and veneration; to perform religious exercises in honour of."},{"definition":"To honour with extravagant love and extreme submission, as a lover; to adore; to idolize."},{"definition":"To participate in religious ceremonies.","example":"We worship at the church down the road."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/worship-us.mp3","text":"/ˈwɝʃɪp/"}]},{"word":"BUKKAKE","idx":4940,"count":13499254,"meanings":[{"definitions":[{"definition":"A Japanese dish made by pouring broth over cold noodles, commonly udon."},{"definition":"A sex act in which multiple people ejaculate on another person."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/buˈkæ.ki/"}]},{"word":"CAPABILITY","idx":4941,"count":13491067,"meanings":[{"definitions":[{"definition":"The power or ability to generate an outcome"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/keɪpəˈbɪləti/"}]},{"word":"HERSELF","idx":4945,"count":13479005,"meanings":[{"definitions":[{"definition":"(reflexive pronoun) Her; the female object of a verb or preposition that also appears as the subject.","example":"She injured herself."},{"definition":"She; an intensive repetition of the female subject, often used to indicate the exclusiveness of that person as the only satisfier of the predicate.","example":"She was injured herself."},{"definition":"The subject or non-reflexive object of a predicate; she (used of upper-class ladies, or sarcastically, of women who imagine themselves to be more important than others)","example":"Have you seen herself yet this morning?"}],"partOfSpeech":"p"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/herself-us.mp3","text":"/hɝˈsɛlf/"}]},{"word":"PRODUCING","idx":4946,"count":13472319,"meanings":[{"definitions":[{"definition":"To yield, make or manufacture; to generate."},{"definition":"To make (a thing) available to a person, an authority, etc.; to provide for inspection."},{"definition":"To sponsor and present (a motion picture, etc) to an audience or to the public."},{"definition":"To extend an area, or lengthen a line.","example":"to produce a side of a triangle"},{"definition":"To draw out; to extend; to lengthen or prolong.","example":"to produce a man's life to threescore"},{"definition":"To alter using technology, as opposed to simply performing.","example":"highly produced sound"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/producing-us.mp3","text":"/pɹəˈdusɪŋ/"}]},{"word":"CHURCHES","idx":4947,"count":13467005,"meanings":[{"definitions":[{"definition":"A Christian house of worship; a building where Christian religious services take place.","example":"There is a lovely little church in the valley."},{"definition":"Christians collectively seen as a single spiritual community; Christianity.","example":"These worshippers make up the Church of Christ."},{"definition":"A local group of people who follow the same Christian religious beliefs, local or general."},{"definition":"A particular denomination of Christianity.","example":"The Church of England separated from the Roman Catholic Church in 1534."},{"definition":"(as bare noun) Christian worship held at a church; service."},{"definition":"Organized religion in general or a specific religion considered as a political institution.","example":"Many constitutions enshrine the separation of church and state."},{"definition":"Any religious group.","example":"She goes to a Wiccan church down the road."},{"definition":"Assembly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To conduct a religious service for (a woman after childbirth, or a newly married couple)."},{"definition":"To educate someone religiously, as in in a church."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/churches-us.mp3","text":"/ˈtʃɝtʃɪz/"}]},{"word":"PRECISION","idx":4948,"count":13465434,"meanings":[{"definitions":[{"definition":"The state of being precise or exact; exactness."},{"definition":"The ability of a measurement to be reproduced consistently."},{"definition":"The number of significant digits to which a value may be measured reliably."},{"definition":"A bidding system that makes use of many artificial bids to describe a hand quite precisely."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Used for exact or precise measurement."},{"definition":"Made, or characterized by accuracy."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹɪˈsɪ.ʒ(ə)n/"}]},{"word":"DAMAGES","idx":4949,"count":13463452,"meanings":[{"definitions":[{"definition":"To impair the soundness, goodness, or value of; to harm or cause destruction.","example":"Be careful not to damage any of the fragile items while unpacking them."},{"definition":"To undergo damage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The money paid or awarded to a claimant (in England), a pursuer (in Scotland) or a plaintiff (in the US) in a civil action as compensation for a loss suffered by the same."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/damages-us.mp3","text":"/ˈdæmɪdʒɪz/"}]},{"word":"RESERVES","idx":4950,"count":13456639,"meanings":[{"definitions":[{"definition":"(behaviour) Restriction."},{"definition":"That which is reserved or kept back, as for future use."},{"definition":"(social) Something initially kept back for later use in a recreation."},{"definition":"In exhibitions, a distinction indicating that the recipient will get a prize in the event of another person being disqualified."},{"definition":"(calico printing) A resist."},{"definition":"A preparation used on an object being electroplated to fix the limits of the deposit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To keep back; to retain.","example":"We reserve the right to make modifications."},{"definition":"To keep in store for future or special use.","example":"This cake is reserved for the guests!"},{"definition":"To book in advance; to make a reservation.","example":"I reserved a table for us at the best restaurant in town."},{"definition":"To make an exception of; to except."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/reserves-us.mp3","text":"/ɹɪˈzɝvz/"}]},{"word":"CONTRIBUTED","idx":4951,"count":13454831,"meanings":[{"definitions":[{"definition":"To give something that is or becomes part of a larger whole.","example":"to contribute articles to a journal"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɒntɹɪˌbjuːtɪd/"}]},{"word":"SOLVE","idx":4952,"count":13452150,"meanings":[{"definitions":[{"definition":"(chiefly law enforcement) A solution; an explanation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To find an answer or solution to a problem or question; to work out."},{"definition":"To find the values of variables that satisfy a system of equations and/or inequalities."},{"definition":"To algebraically manipulate an equation or inequality into a form that isolates a chosen variable on one side, so that the other side consists of an expression that may be used to generate solutions."},{"definition":"To loosen or separate the parts of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/solve-uk.mp3","text":"/sɒlv/"}]},{"word":"SHORTS","idx":4953,"count":13446221,"meanings":[{"definitions":[{"definition":"A short circuit."},{"definition":"A short film."},{"definition":"A short version of a garment in a particular size.","example":"38 short suits fit me right off the rack."},{"definition":"A shortstop.","example":"Jones smashes a grounder between third and short."},{"definition":"A short seller.","example":"The market decline was terrible, but the shorts were buying champagne."},{"definition":"A short sale.","example":"He closed out his short at a modest loss after three months."},{"definition":"A summary account."},{"definition":"A short sound, syllable, or vowel."},{"definition":"An integer variable having a smaller range than normal integers; usually two bytes long."},{"definition":"An automobile; especially in crack shorts, to break into automobiles."},{"definition":"Trousers worn primarily in warm weather that do not go lower than the knees.","example":"Jessica hated covering her legs, so she usually wore shorts."},{"definition":"Underwear bottoms.","example":"After a scare like that, I need to change my shorts."},{"definition":"Remnants, clippings, trimmings of production processes."},{"definition":"The part of milled grain sifted out which is next finer than the bran; pollard."},{"definition":"Short, inferior hemp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause a short circuit in (something)."},{"definition":"Of an electrical circuit, to short circuit."},{"definition":"To shortchange."},{"definition":"To provide with a smaller than agreed or labeled amount.","example":"This is the third time I’ve caught them shorting us."},{"definition":"To sell something, especially securities, that one does not own at the moment for delivery at a later date in hopes of profiting from a decline in the price; to sell short."},{"definition":"To shorten."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ʃɔː(ɹ)ts/"}]},{"word":"REPRODUCTION","idx":4954,"count":13443395,"meanings":[{"definitions":[{"definition":"The act of reproducing new individuals biologically."},{"definition":"The act of making copies.","example":"Unauthorized reproduction of this article is prohibited."},{"definition":"A copy of something, as in a piece of art; a duplicate.","example":"Jim was proud of the Rembrandt reproduction he owned."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/reproduction-us.mp3"}]},{"word":"MINORITY","idx":4955,"count":13436730,"meanings":[{"definitions":[{"definition":"The state of being a minor; youth, the period of a person's life prior to reaching adulthood."},{"definition":"Any subgroup that does not form a numerical majority.","example":"Most people agreed, but a sizable minority were upset by the decision."},{"definition":"(used attributively of a party, government, etc.) Empowered by or representing a minority (usually a plurality) of votes cast, legislative seats, etc., rather than an outright majority thereof."},{"definition":"A member of an ethnic minority.","example":"The company claims it has hired several minorities since the complaint was lodged."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to a minority.","example":"They hold a minority interest in the company."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/minority-us.mp3","text":"/maɪˈnɑɹ.ɪ.ti/"}]},{"word":"TD","idx":4956,"count":13432717,"meanings":[{"definitions":[{"definition":"Abbreviation of table data. (standard cells that contains data, no table headers)"}],"partOfSpeech":"n"}]},{"word":"DIVERSE","idx":4957,"count":13432331,"meanings":[{"definitions":[{"definition":"Consisting of many different elements; various."},{"definition":"Different; dissimilar; distinct; not the same"},{"definition":"Capable of various forms; multiform."},{"definition":"Composed of people with a variety of different demographic characteristics in terms of, for example, ethnicity, gender, sexual orientation, socioeconomic status, etc., and having a sizeable representation of people that are minorities in a given area."},{"definition":"Belonging to a minority group.","example":"Idris Elba was a diverse hire for the franchise"}],"partOfSpeech":"j"},{"definitions":[{"definition":"In different directions; diversely."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/diverse-us.mp3","text":"/daɪ.ˈvɝs/"}]},{"word":"AMP","idx":4958,"count":13421855,"meanings":[{"definitions":[{"definition":"Short for ampere."},{"definition":"Short for amplifier."},{"definition":"Short for ampoule."},{"definition":"Short for amputee."},{"definition":"Short for ampicillin."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(usually with up) To amplify.","example":"He asked the disk jockey to amp it up."},{"definition":"(usually with up) To excite."},{"definition":"(usually with up) To intensify or increase.","example":"2014, Andy Paul, Amp Up Your Sales, AMACOM Books"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/amp-uk.mp3","text":"/æmp/"}]},{"word":"INGREDIENTS","idx":4959,"count":13418042,"meanings":[{"definitions":[{"definition":"One of the substances present in a mixture, especially food."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/ingredients-us.mp3"}]},{"word":"SB","idx":4960,"count":13412944,"meanings":[{"definitions":[{"definition":"Some unspecified person.","example":"Somebody has to clean this mess up."}],"partOfSpeech":"p"}]},{"word":"AH","idx":4961,"count":13406814,"meanings":[{"definitions":[{"definition":"The speaker or writer, referred to as the grammatical subject, of a sentence."},{"definition":"The speaker or writer, referred to as the grammatical object, of a sentence.","example":"Mom drove my sister and I to school."}],"partOfSpeech":"p"},{"definitions":[{"definition":"An instance of the interjection ah.","example":"the crowd's oohs and ahs at the fireworks"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a cry of \"ah\"."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An expression of relief, relaxation, comfort, confusion, understanding, wonder, awe, etc. according to uttered inflection.","example":"Ah! It's good to be back home!"},{"definition":"A syllable used to fill space, particularly in music."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/ah-1-us.mp3","text":"/ɑː/"}]},{"word":"JOHNNY","idx":4962,"count":13404833,"meanings":[{"definitions":[{"definition":"A prostitute's client."},{"definition":"A device or place to urinate and defecate: now usually a toilet or lavatory, but also a chamber pot or outhouse."},{"definition":"A Western man traveling in East Asia."},{"definition":"A male mule."},{"definition":"A condom."},{"definition":"An inexperienced new worker, usually an immigrant."},{"definition":"A hospital gown: a gown with a back opening closed with snaps or ties, worn by hospital patients."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʒɑni/"},{"text":"/ˈdʒɒni/"},{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/johnny-au.mp3"}]},{"word":"SOLE","idx":4963,"count":13401764,"meanings":[{"definitions":[{"definition":"A wooden band or yoke put around the neck of an ox or cow in the stall."},{"definition":"A pond or pool; a dirty pond of standing water."},{"definition":"The bottom or plantar surface of the foot."},{"definition":"(footwear) The bottom of a shoe or boot."},{"definition":"The foot itself."},{"definition":"Solea solea, a flatfish of the family Soleidae."},{"definition":"The bottom or lower part of anything, or that on which anything rests in standing."},{"definition":"The seat or bottom of a mine; applied to horizontal veins or lodes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pull by the ears; to pull about; haul; lug."},{"definition":"To put a sole on (a shoe or boot)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Only"},{"definition":"Unmarried (especially of a woman); widowed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/sole-us.mp3","text":"/soʊl/"}]},{"word":"FRANCHISE","idx":4964,"count":13396527,"meanings":[{"definitions":[{"definition":"The right to vote at a public election or referendum; see: suffrage, suffragette."},{"definition":"A right or privilege officially granted to a person, a group of people, or a company by a government."},{"definition":"An acknowledgment of a corporation's existence and ownership."},{"definition":"The authorization granted by a company to sell or distribute its goods or services in a certain area.","example":"McDonalds has exported its franchise."},{"definition":"A business operating under such authorization, a franchisee."},{"definition":"A legal exemption from jurisdiction."},{"definition":"The membership of a corporation or state; citizenship."},{"definition":"The district or jurisdiction to which a particular privilege extends; the limits of an immunity; hence, an asylum or sanctuary."},{"definition":"The collection of organizations in the history of a sports team; the tradition of a sports team as an entity, extending beyond the contemporary organization.","example":"The Whalers' home city of Hartford was one of many for the franchise."},{"definition":"The positive influence on the buying behavior of customers exerted by the reputation of a company or a brand."},{"definition":"The loose collection of fictional works pertaining to a particular universe, including literary, film or television series from various sources.","example":"the Star Wars franchise"},{"definition":"Exemption from constraint or oppression; freedom; liberty."},{"definition":"Magnanimity; generosity; liberality; frankness; nobility."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To confer certain powers on; grant a franchise to; authorize."},{"definition":"To set free; invest with a franchise or privilege; enfranchise."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfɹænt͡ʃaɪ̯z/"}]},{"word":"RECORDER","idx":4965,"count":13394033,"meanings":[{"definitions":[{"definition":"An apparatus for recording; a device which records."},{"definition":"Agent noun of record; one who records."},{"definition":"A judge in a municipal court."},{"definition":"A musical instrument of the woodwind family; a type of fipple flute, a simple internal duct flute."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/recorder-1-us.mp3"}]},{"word":"COMPLAINTS","idx":4966,"count":13388225,"meanings":[{"definitions":[{"definition":"The act of complaining."},{"definition":"A grievance, problem, difficulty, or concern.","example":"I have no complaints about the quality of his work, but I don't enjoy his company."},{"definition":"In a civil action, the first pleading of the plaintiff setting out the facts on which the claim is based; The purpose is to give notice to the adversary of the nature and basis of the claim asserted."},{"definition":"In criminal law, the preliminary charge or accusation made by one person against another to the appropriate court or officer, usually a magistrate. However, court proceedings, such as a trial, cannot be instituted until an indictment or information has been handed down against the defendant."},{"definition":"A bodily disorder or disease; the symptom of such a disorder.","example":"Don't come too close; I've got this nasty complaint."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/complaints-us.mp3","text":"/kəmˈpleɪnts/"}]},{"word":"FACING","idx":4967,"count":13385115,"meanings":[{"definitions":[{"definition":"(of a person or animal) To position oneself or itself so as to have one's face closest to (something).","example":"Face the sun."},{"definition":"(of an object) To have its front closest to, or in the direction of (something else).","example":"Turn the chair so it faces the table."},{"definition":"To cause (something) to turn or present a face or front, as in a particular direction."},{"definition":"To be presented or confronted with; to have in prospect.","example":"We are facing an uncertain future."},{"definition":"To deal with (a difficult situation or person); to accept (facts, reality, etc.) even when undesirable.","example":"I'm going to have to face this sooner or later."},{"definition":"To have the front in a certain direction.","example":"The seats in the carriage faced backwards."},{"definition":"To have as an opponent.","example":"Puddletown United face Mudchester Rovers in the quarter-finals."},{"definition":"To be the batsman on strike.","example":"Willoughby comes in to bowl, and it's Hobson facing."},{"definition":"To confront impudently; to bully."},{"definition":"To cover in front, for ornament, protection, etc.; to put a facing upon.","example":"a building faced with marble"},{"definition":"To line near the edge, especially with a different material.","example":"to face the front of a coat, or the bottom of a dress"},{"definition":"To cover with better, or better appearing, material than the mass consists of, for purpose of deception, as the surface of a box of tea, a barrel of sugar, etc."},{"definition":"To make the surface of (anything) flat or smooth; to dress the face of (a stone, a casting, etc.); especially, in turning, to shape or smooth the flat surface of, as distinguished from the cylindrical surface."},{"definition":"(retail) To arrange the products in (a store) so that they are tidy and attractive.","example":"In my first job, I learned how to operate a till and to face the store to high standards."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The most external portion of exterior siding."},{"definition":"Fabric applied to a garment edge on the underside."},{"definition":"A powdered substance, such as charcoal or bituminous coal, applied to the face of a mould, or mixed with the sand that forms it, to give a fine smooth surface to the casting."},{"definition":"(in the plural) The collar and cuffs of a military coat, commonly of a different colour from the rest of the coat."},{"definition":"(usually in the plural) The movement of soldiers by turning on their heels to the right, left, or about."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Positioned so as to face (in a particular direction)"},{"definition":"(of points and crossovers) Diverging in the direction of travel."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/facing-us.mp3","text":"/ˈfeɪsɪŋ/"}]},{"word":"NANCY","idx":4969,"count":13381057,"meanings":[{"definitions":[{"definition":"An effeminate man, especially a homosexual."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/nancy-us.mp3","text":"/ˈnænsi/"}]},{"word":"PROMOTIONS","idx":4970,"count":13378320,"meanings":[{"definitions":[{"definition":"An advancement in rank or position.","example":"I'll have to give myself a promotion!"},{"definition":"Dissemination of information in order to increase its popularity.","example":"the promotion of the idea of global warming in schools"},{"definition":"An event intended to increase the reach or image of a product or brand.","example":"The price cut is serving as a promotion of the manufacturer's new beverage varieties."},{"definition":"Forward motion. (Contrast remotion.)"}],"partOfSpeech":"n"}]},{"word":"TONES","idx":4971,"count":13373535,"meanings":[{"definitions":[{"definition":"A specific pitch."},{"definition":"(in the diatonic scale) An interval of a major second."},{"definition":"(in a Gregorian chant) A recitational melody."},{"definition":"The character of a sound, especially the timbre of an instrument or voice."},{"definition":"General character, mood, or trend.","example":"Her rousing speech gave an upbeat tone to the rest of the evening."},{"definition":"The pitch of a word that distinguishes a difference in meaning, for example in Chinese."},{"definition":"A whining style of speaking; a kind of mournful or artificial strain of voice; an affected speaking with a measured rhythm and a regular rise and fall of the voice.","example":"Children often read with a tone."},{"definition":"The manner in which speech or writing is expressed."},{"definition":"State of mind; temper; mood."},{"definition":"The shade or quality of a colour."},{"definition":"The favourable effect of a picture produced by the combination of light and shade, or of colours.","example":"This picture has tone."},{"definition":"The definition and firmness of a muscle or organ; see also: tonus."},{"definition":"The state of a living body or of any of its organs or parts in which the functions are healthy and performed with due vigor."},{"definition":"Normal tension or responsiveness to stimuli."},{"definition":"A gun"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a particular tone to"},{"definition":"To change the colour of"},{"definition":"To make (something) firmer"},{"definition":"To harmonize, especially in colour"},{"definition":"To utter with an affected tone."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/tones-us.mp3","text":"/toʊnz/"}]},{"word":"PASSION","idx":4972,"count":13370569,"meanings":[{"definitions":[{"definition":"Any great, strong, powerful emotion, especially romantic love or extreme hate.","example":"We share a passion for books."},{"definition":"Fervor, determination."},{"definition":"An object of passionate or romantic love or strong romantic interest.","example":"It started as a hobby, but now my motorbike collection has become my passion."},{"definition":"Sexual intercourse, especially when very emotional.","example":"We shared a night of passion."},{"definition":"(usually capitalized) The suffering of Jesus leading up to and during his crucifixion."},{"definition":"A display, musical composition, or play meant to commemorate the suffering of Jesus."},{"definition":"Suffering or enduring of imposed or inflicted pain; any suffering or distress.","example":"a cardiac passion"},{"definition":"The state of being acted upon; subjection to an external agent or influence; a passive condition"},{"definition":"The capacity of being affected by external agents; susceptibility of impressions from external agents."},{"definition":"An innate attribute, property, or quality of a thing.","example":"[...] to obtain the knowledge of some passion of the circle."},{"definition":"Disorder of the mind; madness."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To suffer pain or sorrow; to experience a passion; to be extremely agitated."},{"definition":"To give a passionate character to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/passion-us.mp3","text":"[ˈpʰæʃən]"}]},{"word":"REHABILITATION","idx":4973,"count":13370501,"meanings":[{"definitions":[{"definition":"The process of rehabilitating somebody or something."}],"partOfSpeech":"n"}]},{"word":"MAINTAINING","idx":4974,"count":13362778,"meanings":[{"definitions":[{"definition":"To support (someone), to back up or assist (someone) in an action."},{"definition":"To keep up; to preserve; to uphold (a state, condition etc.)."},{"definition":"To declare or affirm (a clause) to be true; to assert."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of doing maintenance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/maintaining-us.mp3","text":"/meɪnˈteɪnɪŋ/"}]},{"word":"SIGHT","idx":4975,"count":13360499,"meanings":[{"definitions":[{"definition":"(in the singular) The ability to see.","example":"He is losing his sight and now can barely read."},{"definition":"The act of seeing; perception of objects by the eye; view.","example":"to gain sight of land"},{"definition":"Something seen."},{"definition":"Something worth seeing; a spectacle, either good or bad.","example":"We went to London and saw all the sights – Buckingham Palace, Tower Bridge, and so on."},{"definition":"A device used in aiming a projectile, through which the person aiming looks at the intended target."},{"definition":"A small aperture through which objects are to be seen, and by which their direction is settled or ascertained.","example":"the sight of a quadrant"},{"definition":"A great deal, a lot; frequently used to intensify a comparative.","example":"This is a darn sight better than what I'm used to at home!"},{"definition":"In a drawing, picture, etc., that part of the surface, as of paper or canvas, which is within the frame or the border or margin. In a frame, the open space, the opening."},{"definition":"The instrument of seeing; the eye."},{"definition":"Mental view; opinion; judgment.","example":"In their sight it was harmless."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To register visually."},{"definition":"To get sight of (something).","example":"to sight land from a ship"},{"definition":"To apply sights to; to adjust the sights of; also, to give the proper elevation and direction to by means of a sight.","example":"to sight a rifle or a cannon"},{"definition":"To take aim at."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/sight-us.mp3","text":"/saɪt/"}]},{"word":"LAID","idx":4976,"count":13359320,"meanings":[{"definitions":[{"definition":"(of paper) Marked with parallel lines, as if ribbed, from wires in the mould."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To place down in a position of rest, or in a horizontal position.","example":"A shower of rain lays the dust."},{"definition":"To cause to subside or abate."},{"definition":"To prepare (a plan, project etc.); to set out, establish (a law, principle)."},{"definition":"To install certain building materials, laying one thing on top of another.","example":"lay brick;  lay flooring"},{"definition":"To produce and deposit an egg.","example":"Did dinosaurs lay their eggs in a nest?"},{"definition":"To bet (that something is or is not the case).","example":"I'll lay that he doesn't turn up on Monday."},{"definition":"To deposit (a stake) as a wager; to stake; to risk."},{"definition":"To have sex with."},{"definition":"To take a position; to come or go.","example":"to lay forward;  to lay aloft"},{"definition":"To state; to allege.","example":"to lay the venue"},{"definition":"To point; to aim.","example":"to lay a gun"},{"definition":"(ropemaking) To put the strands of (a rope, a cable, etc.) in their proper places and twist or unite them.","example":"to lay a cable or rope"},{"definition":"To place and arrange (pages) for a form upon the imposing stone."},{"definition":"To place (new type) properly in the cases."},{"definition":"To apply; to put."},{"definition":"To impose (a burden, punishment, command, tax, etc.).","example":"to lay a tax on land"},{"definition":"To impute; to charge; to allege."},{"definition":"To present or offer.","example":"to lay an indictment in a particular county;   to lay a scheme before one"},{"definition":"To don or put on (tefillin (phylacteries))."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/laid-us.mp3","text":"/leɪd/"}]},{"word":"CLAY","idx":4977,"count":13357683,"meanings":[{"definitions":[{"definition":"A mineral substance made up of small crystals of silica and alumina, that is ductile when moist; the material of pre-fired ceramics."},{"definition":"An earth material with ductile qualities."},{"definition":"A tennis court surface made of crushed stone, brick, shale, or other unbound mineral aggregate.","example":"The French Open is played on clay."},{"definition":"The material of the human body."},{"definition":"A particle less than 3.9 microns in diameter, following the Wentworth scale."},{"definition":"A clay pipe for smoking tobacco."},{"definition":"A clay pigeon.","example":"We went shooting clays at the weekend."},{"definition":"Land or territory of a country or other political region, especially when subject to territorial claims","example":"Danzig is rightfully German clay."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add clay to, to spread clay onto."},{"definition":"(of sugar) To purify using clay.","example":"1809, Jonathan Williams, On the Process of Claying Sugar, in Transactions of the American Philosophical Society, Volume 6."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/clay-us.mp3","text":"/kleɪ/"}]},{"word":"DEFENCE","idx":4978,"count":13356231,"meanings":[{"definitions":[{"definition":"The action of defending, of protecting from attack, danger or injury."},{"definition":"Something used to oppose attacks."},{"definition":"An argument in support or justification of something."},{"definition":"A strategy and tactics employed to prevent the other team from scoring; contrasted with offence."},{"definition":"The portion of a team dedicated to preventing the other team from scoring; contrasted with offence."},{"definition":"Government policy or (infra)structure related to the military.","example":"Department of Defence"},{"definition":"Prohibition; a prohibitory ordinance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To furnish with defences; to fortify."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/defence-uk.mp3","text":"/dɪˈfɛns/"}]},{"word":"PATCHES","idx":4979,"count":13354086,"meanings":[{"definitions":[{"definition":"A piece of cloth, or other suitable material, sewed or otherwise fixed upon a garment to repair or strengthen it, especially upon an old garment to cover a hole.","example":"His sleeves had patches on the elbows where different fabric had been sewn on to replace material that had worn away."},{"definition":"A small piece of anything used to repair damage or a breach; as, a patch on a kettle, a roof, etc.","example":"I can't afford to replace the roof, which is what it really needs. I'll have the roofer apply a patch."},{"definition":"A piece of any size, used to repair something for a temporary period only, or that it is temporary because it is not meant to last long or will be removed as soon as a proper repair can be made, which will happen in the near future.","example":"\"This patch should hold until you reach the city,\" the mechanic said as he patted the car's hood."},{"definition":"A small, usually contrasting but always somehow different or distinct, part of something else (location, time, size)","example":"Doesn't that patch of clouds looks like a bunny?"},{"definition":"(specifically) A small area, a small plot of land or piece of ground.","example":"Scattered patches of trees or growing corn."},{"definition":"A local region of professional responsibility."},{"definition":"A small piece of black silk stuck on the face or neck to heighten beauty by contrast, worn by ladies in the 17th and 18th centuries; an imitation beauty mark."},{"definition":"A piece of material used to cover a wound."},{"definition":"An adhesive piece of material, impregnated with a drug, which is worn on the skin, the drug being slowly absorbed over a period of time.","example":"Many people use a nicotine patch to wean themselves off of nicotine."},{"definition":"A cover worn over a damaged eye, an eyepatch.","example":"He had scratched his cornea so badly that his doctor told him to wear a patch."},{"definition":"A block on the muzzle of a gun, to do away with the effect of dispart, in sighting."},{"definition":"A patch file, a file that describes changes to be made to a computer file or files, usually changes made to a computer program that fix a programming bug."},{"definition":"A small piece of material that is manually passed through a gun barrel to clean it."},{"definition":"A piece of greased cloth or leather used as wrapping for a rifle ball, to make it fit the bore."},{"definition":"(often patch cable, patch cord etc.; see also patch panel) A cable connecting two pieces of electrical equipment."},{"definition":"A sound setting for a musical synthesizer (originally selected by means of a patch cable)."},{"definition":"An overlay used to obtain a stronger impression."},{"definition":"A paltry fellow; a rogue; a ninny; a fool."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mend by sewing on a piece or pieces of cloth, leather, or the like","example":"My coat needs patching."},{"definition":"To mend with pieces; to repair by fastening pieces on."},{"definition":"To make out of pieces or patches, like a quilt."},{"definition":"To join or unite the pieces of; to patch the skirt."},{"definition":"To employ a temporary, removable electronic connection, as one between two components in a communications system."},{"definition":"(generally with the particle \"up\") To repair or arrange in a hasty or clumsy manner","example":"The truce between the two countries has been patched up."},{"definition":"To make the changes a patch describes; to apply a patch to the files in question. Hence:"},{"definition":"To connect two pieces of electrical equipment using a cable.","example":"I'll need to patch the preamp output to the mixer."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/patches-us.mp3","text":"/ˈpætʃɪz/"}]},{"word":"WEAK","idx":4980,"count":13347842,"meanings":[{"definitions":[{"definition":"Lacking in force (usually strength) or ability.","example":"The child was too weak to move the boulder."},{"definition":"Unable to sustain a great weight, pressure, or strain.","example":"a weak timber; a weak rope"},{"definition":"Unable to withstand temptation, urgency, persuasion, etc.; easily impressed, moved, or overcome; accessible; vulnerable.","example":"weak resolutions; weak virtue"},{"definition":"Dilute, lacking in taste or potency.","example":"We were served stale bread and weak tea."},{"definition":"(grammar) Displaying a particular kind of inflection, including:"},{"definition":"That does not ionize completely into anions and cations in a solution.","example":"a weak acid;  a weak base"},{"definition":"One of the four fundamental forces associated with nuclear decay."},{"definition":"Bad or uncool.","example":"This place is weak."},{"definition":"Having a narrow range of logical consequences; narrowly applicable. (Often contrasted with a strong statement which implies it.)"},{"definition":"Resulting from, or indicating, lack of judgment, discernment, or firmness; unwise; hence, foolish."},{"definition":"Not having power to convince; not supported by force of reason or truth; unsustained.","example":"The prosecution advanced a weak case."},{"definition":"Lacking in vigour or expression.","example":"a weak sentence; a weak style"},{"definition":"Not prevalent or effective, or not felt to be prevalent; not potent; feeble."},{"definition":"Tending towards lower prices.","example":"a weak market; wheat is weak at present"},{"definition":"Lacking contrast.","example":"a weak negative"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/weak-us.mp3","text":"/wiːk/"}]},{"word":"REFUND","idx":4981,"count":13340961,"meanings":[{"definitions":[{"definition":"An amount of money returned.","example":"If the camera is faulty, you can return it to the store where you bought it for a full refund."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To return (money) to (someone); to reimburse.","example":"If you find this computer for sale anywhere at a lower price, we'll refund you the difference."},{"definition":"To supply again with funds.","example":"to refund a railroad loan"},{"definition":"To pour back."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/refund-us.mp3"}]},{"word":"TOWNS","idx":4983,"count":13337599,"meanings":[{"definitions":[{"definition":"A settlement; an area with residential districts, shops and amenities, and its own local government; especially one larger than a village and smaller than a city.","example":"This town is really dangerous because these youngsters have Beretta handguns."},{"definition":"Any more urbanized center than the place of reference.","example":"I'll be in Yonkers, then I'm driving into town to see the Knicks at the Garden tonight."},{"definition":"A rural settlement in which a market was held at least once a week."},{"definition":"The residents (as opposed to gown: the students, faculty, etc.) of a community which is the site of a university."},{"definition":"Used to refer to a town or similar entity under discussion.","example":"Call me when you get to town."},{"definition":"A major city, especially one where the speaker is located."},{"definition":"A municipal organization, such as a corporation, defined by the laws of the entity of which it is a part."},{"definition":"An enclosure which surrounded the mere homestead or dwelling of the lord of the manor."},{"definition":"The whole of the land which constituted the domain."},{"definition":"A collection of houses enclosed by fences or walls."},{"definition":"A farm or farmstead; also, a court or farmyard."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/towns-us.mp3","text":"/taʊnz/"}]},{"word":"ENVIRONMENTS","idx":4984,"count":13331567,"meanings":[{"definitions":[{"definition":"The surroundings of, and influences on, a particular item of interest."},{"definition":"The natural world or ecosystem."},{"definition":"All the elements that affect a system or its inputs and outputs."},{"definition":"A particular political or social setting, arena or condition."},{"definition":"The software and/or hardware existing on any particular computer system.","example":"That program uses the Microsoft Windows environment."},{"definition":"The environment of a function at a point during the execution of a program is the set of identifiers in the function's scope and their bindings at that point."},{"definition":"The set of variables and their values in a namespace that an operating system associates with a process."}],"partOfSpeech":"n"}]},{"word":"DIVIDED","idx":4986,"count":13323175,"meanings":[{"definitions":[{"definition":"To split or separate (something) into two or more parts.","example":"a wall divides two houses; a stream divides the towns"},{"definition":"To share (something) by dividing it.","example":"How shall we divide this pie?"},{"definition":"(with by) To calculate the number (the quotient) by which you must multiply one given number (the divisor) to produce a second given number (the dividend).","example":"If you divide 6 by 3, you get 2."},{"definition":"To be a divisor of.","example":"3 divides 6."},{"definition":"To separate into two or more parts."},{"definition":"Of a cell, to reproduce by dividing."},{"definition":"To disunite in opinion or interest; to make discordant or hostile; to set at variance."},{"definition":"To break friendship; to fall out."},{"definition":"To have a share; to partake."},{"definition":"To vote, as in the British parliament and other legislatures, by the members separating themselves into two parties (as on opposite sides of the hall or in opposite lobbies), that is, the ayes dividing from the noes."},{"definition":"To mark divisions on; to graduate.","example":"to divide a sextant"},{"definition":"To play or sing in a florid style, or with variations."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Separated or split into pieces"},{"definition":"Having conflicting interests or emotions"},{"definition":"Disunited"},{"definition":"(of a road) separated into lanes, that move in opposite directions, by a median"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/divided-us.mp3"}]},{"word":"RECEPTION","idx":4988,"count":13317222,"meanings":[{"definitions":[{"definition":"The act of receiving."},{"definition":"The act or ability to receive radio or similar signals.","example":"The new system provides exceptional quality of the reception signal."},{"definition":"A social engagement, usually to formally welcome someone.","example":"After the wedding we proceeded to the reception."},{"definition":"A reaction; the treatment received on first talking to a person, arriving at a place, etc.","example":"The ambassador's jokes met a cold reception."},{"definition":"The desk of a hotel or office where guests are received."},{"definition":"The school year, or part thereof, between preschool and Year 1, when children are introduced to formal education."},{"definition":"The conscious adoption or transplantation of legal phenomena from a different culture."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/reception-us.mp3","text":"/ɹɪˈsɛp.ʃn̩/"}]},{"word":"WISE","idx":4990,"count":13299902,"meanings":[{"definitions":[{"definition":"To become wise."},{"definition":"Usually with \"up\", to inform or learn.","example":"After Mo had a word with him, he wised up."},{"definition":"To instruct."},{"definition":"To advise; induce."},{"definition":"To show the way, guide."},{"definition":"To direct the course of, pilot."},{"definition":"To cause to turn."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Showing good judgement or the benefit of experience.","example":"\"It is a profitable thing, if one is wise, to seem foolish\" - Aeschylus"},{"definition":"Disrespectful.","example":"Don't get wise with me!"},{"definition":"Aware, informed.","example":"Be careful, the boss is wise."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Way, manner, method."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/wise-us.mp3","text":"/waɪz/"}]},{"word":"EMAILS","idx":4991,"count":13289920,"meanings":[{"definitions":[{"definition":"A system for transferring messages from one computer to another, usually through a network.","example":"He sent me his details via email."},{"definition":"A quantity of messages sent through an email system.","example":"I am searching through my old email."},{"definition":"A message sent through an email system.","example":"He sent me an email last week to remind me about the meeting."},{"definition":"An email address.","example":"Don’t send personal messages to my work email."},{"definition":"Enamel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send an email or emails to.","example":"She emailed me last week, asking about the status of the project."},{"definition":"(may take two objects) To send (something) through email.","example":"He emailed the file out to everyone."},{"definition":"To send, or compose and send, an email or emails.","example":"Most teenagers seem to spend almost the whole day emailing and surfing the Web."}],"partOfSpeech":"ve"}]},{"word":"ODDS","idx":4994,"count":13282573,"meanings":[{"definitions":[{"definition":"(diminutive) An odd number.","example":"So let's see. There are two evens here and three odds."},{"definition":"Something left over, not forming part of a set."},{"definition":"The ratio of the probability of an event happening to that of it not happening.","example":"I'd say the odds are strongly in favor of the sun rising tomorrow morning."},{"definition":"The ratio of winnings to stake in betting situations."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɑdz/"},{"text":"/ɒdz/"}]},{"word":"CORRECTLY","idx":4995,"count":13281872,"meanings":[{"definitions":[{"definition":"In a correct manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/kəˈɹɛktli/"}]},{"word":"INSIDER","idx":4996,"count":13275905,"meanings":[{"definitions":[{"definition":"A person who has special knowledge about the inner workings of a group, organization, or institution."},{"definition":"A person who is within an enclosed space."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈsaɪdɚ/"}]},{"word":"SEMINARS","idx":4997,"count":13272933,"meanings":[{"definitions":[{"definition":"A class held for advanced studies in which students meet regularly to discuss original research, under the guidance of a professor."},{"definition":"A meeting held for the exchange of useful information by members of a common business community."}],"partOfSpeech":"n"}]},{"word":"CONSEQUENCES","idx":4998,"count":13267090,"meanings":[{"definitions":[{"definition":"That which follows something on which it depends; that which is produced by a cause."},{"definition":"A result of actions, especially if such a result is unwanted or unpleasant.","example":"I'm warning you. If you don't get me the report on time, there will be consequences."},{"definition":"A proposition collected from the agreement of other previous propositions; any conclusion which results from reason or argument; inference."},{"definition":"Chain of causes and effects; consecution."},{"definition":"Importance with respect to what comes after."},{"definition":"The power to influence or produce an effect."},{"definition":"(especially when preceded by \"of\") Importance, value, or influence."},{"definition":"An old-fashioned parlour game describing the meeting of a lady and gentleman and the ensuing events, each player in turn writing a part of the story, not knowing what the others have written."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/consequences-us.mp3","text":"/ˈkɑnsɪkwɛnsɪz/"}]},{"word":"MAKERS","idx":4999,"count":13264592,"meanings":[{"definitions":[{"definition":"Someone who makes; a person or thing that makes or produces something."},{"definition":"(usually capitalized and preceded by the) God."},{"definition":"A poet."},{"definition":"Someone who signs a promissory note, thereby becoming responsible for payment."}],"partOfSpeech":"n"}]},{"word":"HEARTS","idx":5000,"count":13262019,"meanings":[{"definitions":[{"definition":"A muscular organ that pumps blood through the body, traditionally thought to be the seat of emotion."},{"definition":"Emotions, kindness, moral effort, or spirit in general.","example":"The team lost, but they showed a lot of heart."},{"definition":"The seat of the affections or sensibilities, collectively or separately, as love, hate, joy, grief, courage, etc.; rarely, the seat of the understanding or will; usually in a good sense; personality.","example":"a good, tender, loving, bad, hard, or selfish heart"},{"definition":"Courage; courageous purpose; spirit."},{"definition":"Vigorous and efficient activity; power of fertile production; condition of the soil, whether good or bad."},{"definition":"A term of affectionate or kindly and familiar address.","example":"Listen, dear heart, we must go now."},{"definition":"Personality, disposition.","example":"a cold heart"},{"definition":"A wight or being."},{"definition":"A conventional shape or symbol used to represent the heart, love, or emotion: ♥ or sometimes <3."},{"definition":"A playing card of the suit hearts featuring one or more heart-shaped symbols."},{"definition":"The twenty-fourth Lenormand card."},{"definition":"The centre, essence, or core.","example":"Buddhists believe that suffering is right at the heart of all life."},{"definition":"One of the four suits of playing cards, in red, marked with the symbol ♥."},{"definition":"A trick-taking card game in which players are penalized for taking hearts and (especially) the queen of spades."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be fond of. Often bracketed or abbreviated with a heart symbol.","example":"2008 July 25, \"The Media Hearts Obama?\", On The Media, National Public Radio"},{"definition":"To give heart to; to hearten; to encourage."},{"definition":"To fill an interior with rubble, as a wall or a breakwater."},{"definition":"To form a dense cluster of leaves, a heart, especially of lettuce or cabbage."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/hearts-us.mp3"},{"text":"/hɑː(ɹ)ts/"}]},{"word":"GEOGRAPHY","idx":5001,"count":13258481,"meanings":[{"definitions":[{"definition":"A description of the earth: a treatise or textbook on geography; an atlas or gazetteer."},{"definition":"The study of the physical properties of the earth, including how humans affect and are affected by them."},{"definition":"Terrain: the physical properties of a region of the earth."},{"definition":"Any subject considered in terms of its physical distribution."},{"definition":"Similar books, studies, or regions concerning other planets."},{"definition":"The physical arrangement of any place, particularly a house."},{"definition":"The lavatory: a room used for urination and defecation."},{"definition":"The relative arrangement of the parts of anything."},{"definition":"A territory: a geographical area as a field of business or market sector."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/geography-us.mp3","text":"/dʒiˈɑɡɹəfi/"}]},{"word":"APPEARING","idx":5002,"count":13254387,"meanings":[{"definitions":[{"definition":"To come or be in sight; to be in view; to become visible."},{"definition":"To come before the public.","example":"A great writer appeared at that time."},{"definition":"To stand in presence of some authority, tribunal, or superior person, to answer a charge, plead a cause, etc.; to present oneself as a party or advocate before a court, or as a person to be tried."},{"definition":"To become visible to the apprehension of the mind; to be known as a subject of observation or comprehension, or as a thing proved; to be obvious or manifest."},{"definition":"To seem; to have a certain semblance; to look.","example":"He appeared quite happy with the result."},{"definition":"To bring into view."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Appearance; act of coming into view"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/appearing-us.mp3","text":"/əˈpɪəɹ.ɪŋ/"}]},{"word":"INTEGRITY","idx":5003,"count":13247038,"meanings":[{"definitions":[{"definition":"Steadfast adherence to a strict moral or ethical code."},{"definition":"The state of being wholesome; unimpaired"},{"definition":"The quality or condition of being complete; pure"},{"definition":"With regards to data encryption, ensuring that information is not altered by unauthorized persons in a way that is not detectable by authorized users."},{"definition":"The ability of a system to provide timely warnings to users when they should not be used for navigation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/integrity-us.mp3"},{"text":"/ɪnˈtɛɡɹəti/"}]},{"word":"WORRY","idx":5004,"count":13243591,"meanings":[{"definitions":[{"definition":"A strong feeling of anxiety.","example":"I'm afflicted by worry throughout the night."},{"definition":"An instance or cause of such a feeling.","example":"My main worry is that I'll miss the train."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be troubled; to give way to mental anxiety or doubt.","example":"Stop worrying about your test, it’ll be fine."},{"definition":"Disturb the peace of mind of; afflict with mental agitation or distress.","example":"Your tone of voice worries me."},{"definition":"To harass; to irritate or distress.","example":"The President was worried into military action by persistent advisors."},{"definition":"To seize or shake by the throat, especially of a dog or wolf.","example":"Your dog’s been worrying sheep again."},{"definition":"To touch repeatedly, to fiddle with."},{"definition":"To strangle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/worry-us.mp3","text":"/ˈwɝɹi/"}]},{"word":"DISCRIMINATION","idx":5006,"count":13237807,"meanings":[{"definitions":[{"definition":"Discernment, the act of discriminating, discerning, distinguishing, noting or perceiving differences between things, with intent to understand rightly and make correct decisions."},{"definition":"The act of recognizing the 'good' and 'bad' in situations and choosing good."},{"definition":"(sometimes discrimination against) Distinct treatment of an individual or group to their disadvantage; treatment or consideration based on class or category rather than individual merit; partiality; prejudice; bigotry.","example":"reverse discrimination"},{"definition":"The quality of being discriminating, acute discernment, specifically in a learning situation; as to show great discrimination in the choice of means."},{"definition":"That which discriminates; mark of distinction, a characteristic."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪskɹɪmɪˈneɪʃən/"}]},{"word":"EVE","idx":5007,"count":13237067,"meanings":[{"definitions":[{"definition":"The day or night before, usually used for holidays, such as Christmas Eve."},{"definition":"Evening, night."},{"definition":"The period of time when something is just about to happen or to be introduced","example":"the eve of a scientific discovery"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/eve-us.mp3","text":"/iːv/"}]},{"word":"LEGACY","idx":5009,"count":13223921,"meanings":[{"definitions":[{"definition":"Money or property bequeathed to someone in a will."},{"definition":"Something inherited from a predecessor or the past.","example":"John Muir left as his legacy an enduring spirit of respect for the environment."},{"definition":"The descendant of an alumnus.","example":"Because she was a legacy, her mother's sorority rushed her."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Left over from the past; no longer current."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/legacy-us.mp3","text":"/ˈleɪɡəsi/"}]},{"word":"MARC","idx":5010,"count":13217593,"meanings":[{"definitions":[{"definition":"The refuse matter that remains after fruit, particularly grapes, has been pressed."},{"definition":"An alcoholic spirit distilled from the marc of grapes."},{"definition":"A weight of various commodities, especially of gold and silver, used in different European countries. In France and Holland it was equal to eight ounces."},{"definition":"A coin formerly current in England and Scotland, equal to thirteen shillings and four pence."},{"definition":"A German coin and money of account; the mark."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mɑɹk/"},{"text":"/mɑːk/"}]},{"word":"PLEASED","idx":5011,"count":13215862,"meanings":[{"definitions":[{"definition":"To make happy or satisfy; to give pleasure to.","example":"Her presentation pleased the executives."},{"definition":"To desire; to will; to be pleased by.","example":"Just do as you please."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Happy, content"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pleased-us.mp3","text":"/pliːzd/"}]},{"word":"DANGER","idx":5012,"count":13206765,"meanings":[{"definitions":[{"definition":"Exposure to likely harm; peril.","example":"There's plenty of danger in the desert."},{"definition":"An instance or cause of likely harm."},{"definition":"Mischief."},{"definition":"(mainly outside US) The stop indication of a signal (usually in the phrase \"at danger\").","example":"The north signal was at danger because of the rockslide."},{"definition":"Ability to harm; someone's dominion or power to harm or penalise. See in one's danger, below."},{"definition":"Liability."},{"definition":"Difficulty; sparingness."},{"definition":"Coyness; disdainful behavior."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To claim liability."},{"definition":"To imperil; to endanger."},{"definition":"To run the risk."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/danger-us.mp3","text":"/ˈdeɪndʒɚ/"}]},{"word":"VITAMIN","idx":5013,"count":13204687,"meanings":[{"definitions":[{"definition":"Any of a specific group of organic compounds essential in small quantities for healthy human growth, metabolism, development, and body function; found in minute amounts in plant and animal foods or sometimes produced synthetically; deficiencies of specific vitamins produce specific disorders."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/vitamin-us.mp3","text":"/ˈvaɪ.tə.mɪn/"}]},{"word":"WIDELY","idx":5014,"count":13197312,"meanings":[{"definitions":[{"definition":"In a wide manner; across a wide area."},{"definition":"Commonly; generally; to a great degree."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/widely-us.mp3","text":"/ˈwaɪdli/"}]},{"word":"PROCESSED","idx":5015,"count":13192681,"meanings":[{"definitions":[{"definition":"To perform a particular process on a thing."},{"definition":"To retrieve, store, classify, manipulate, transmit etc. (data, signals, etc.), especially using computer techniques.","example":"We have processed the data using our proven techniques, and have come to the following conclusions."},{"definition":"To think about a piece of information, or a concept, in order to assimilate it, and perhaps accept it in a modified state.","example":"I didn't know she had a criminal record. That will take me a while to process."},{"definition":"To develop photographic film."},{"definition":"To take legal proceedings against."},{"definition":"To walk in a procession"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has completed a required process.","example":"The bank returned her processed application by mail."},{"definition":"Modified through manufacture such as refinement or food processing.","example":"Processed foods are of dubious nutritional value."}],"partOfSpeech":"j"}]},{"word":"PHRASE","idx":5016,"count":13191958,"meanings":[{"definitions":[{"definition":"A short written or spoken expression."},{"definition":"(grammar) A word or group of words that functions as a single unit in the syntax of a sentence, usually consisting of a head, or central word, and elaborating words."},{"definition":"A small section of music in a larger piece."},{"definition":"A mode or form of speech; diction; expression."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To express (an action, thought or idea) by means of particular words.","example":"I wasn't sure how to phrase my condolences without sounding patronising."},{"definition":"To perform a passage with the correct phrasing."},{"definition":"To divide into melodic phrases."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/phrase-us.mp3","text":"/fɹeɪz/"}]},{"word":"GENUINE","idx":5017,"count":13191602,"meanings":[{"definitions":[{"definition":"Belonging to, or proceeding from the original stock; native"},{"definition":"Not counterfeit, spurious, false, or adulterated","example":"a genuine text;  a genuine production;  genuine materials; genuine friendship"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/genuine-us.mp3","text":"/ˈdʒɛnjuːˌaɪn/"}]},{"word":"RAISING","idx":5018,"count":13190308,"meanings":[{"definitions":[{"definition":"(physical) To cause to rise; to lift or elevate.","example":"to raise your hand if you want to say something; to raise your walking stick to defend yourself"},{"definition":"To create, increase or develop.","example":"We need to raise the motivation level in the company."},{"definition":"To establish contact with (e.g., by telephone or radio).","example":"Despite all the call congestion, she was eventually able to raise the police."},{"definition":"To respond to a bet by increasing the amount required to continue in the hand.","example":"John bet, and Julie raised, requiring John to put in more money."},{"definition":"To exponentiate, to involute.","example":"Two raised to the fifth power equals 32."},{"definition":"(of a verb) To extract (a subject or other verb argument) out of an inner clause."},{"definition":"(of a vowel) To produce a vowel with the tongue positioned closer to the roof of the mouth."},{"definition":"To increase the nominal value of (a cheque, money order, etc.) by fraudulently changing the writing or printing in which the sum payable is specified."},{"definition":"To throw (an exception).","example":"A division by zero will raise an exception."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Elevation."},{"definition":"Nurturing; cultivation; providing sustenance and protection for a living thing from conception to maturity"},{"definition":"Recruitment."},{"definition":"Collection or gathering, especially of money."},{"definition":"The operation or work of setting up the frame of a building.","example":"to help at a raising"},{"definition":"The movement of an argument from an embedded or subordinate clause to a matrix or main clause."},{"definition":"A sound change in which a vowel or consonant becomes higher or raised, meaning that the tongue becomes more elevated or positioned closer to the roof of the mouth than before."},{"definition":"The operation of embossing sheet metal, or of forming it into cup-shaped or hollow articles, by hammering, stamping, or spinning."},{"definition":"The substance used to make bread rise."},{"definition":"The process of deepening colours in dyeing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/raising-us.mp3","text":"/ˈɹeɪzɪŋ/"}]},{"word":"IMPLICATIONS","idx":5019,"count":13188157,"meanings":[{"definitions":[{"definition":"The act of implicating."},{"definition":"The state of being implicated."},{"definition":"(usually in the plural) A possible effect or result of a decision or action.","example":"There are serious implications for the environment of such reforms."},{"definition":"An implying, or that which is implied, but not expressed; an inference, or something which may fairly be understood, though not expressed in words."},{"definition":"The connective in propositional calculus that, when joining two predicates A and B in that order, has the meaning \"if A is true, then B is true\"."},{"definition":"Logical consequence."}],"partOfSpeech":"n"}]},{"word":"FUNCTIONALITY","idx":5020,"count":13187557,"meanings":[{"definitions":[{"definition":"The ability to perform a task or function; that set of functions that something is able or equipped to perform."},{"definition":"In United States trademark law, the tendency of a product design to serve a function other than identification of the product, preventing that design from being protected as a trademark."},{"definition":"The presence of a functional group."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/functionality-us.mp3"}]},{"word":"PARADISE","idx":5021,"count":13186910,"meanings":[{"definitions":[{"definition":"The place where sanctified souls are believed to live after death.","example":"Living in paradise comes with a price."},{"definition":"(Abrahamic religions) A garden where Adam and Eve first lived after being created."},{"definition":"A very pleasant place; a place full of lush vegetation.","example":"an island paradise in the Caribbean; a shoppers’ paradise"},{"definition":"A very pleasant experience."},{"definition":"An open space within a monastery or adjoining a church, such as the space within a cloister, the open court before a basilica, etc."},{"definition":"A churchyard or cemetery."},{"definition":"The upper gallery in a theatre."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place (as) in paradise."},{"definition":"To transform into a paradise."},{"definition":"To affect or exalt with visions of happiness."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/paradise-us.mp3","text":"/ˈpæ.ɹə.daɪs/"}]},{"word":"HYBRID","idx":5022,"count":13174794,"meanings":[{"definitions":[{"definition":"Offspring resulting from cross-breeding different entities, e.g. two different species or two purebred parent strains."},{"definition":"Something of mixed origin or composition; often, a tool or technology that combines the benefits of formerly separate tools or technologies."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Consisting of diverse 'hybridized' components."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/hybrid-us.mp3","text":"/ˈhaɪ.bɹɪd/"}]},{"word":"READS","idx":5023,"count":13174104,"meanings":[{"definitions":[{"definition":"A reading or an act of reading, especially an actor's part of a play."},{"definition":"(in combination) Something to be read; a written work.","example":"His thrillers are always a gripping read."},{"definition":"A person's interpretation or impression of something.","example":"What's your read of the current political situation?"},{"definition":"An instance of reading."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look at and interpret letters or other information that is written.","example":"Have you read this book?"},{"definition":"To speak aloud words or other information that is written. Often construed with a to phrase or an indirect object.","example":"All right, class, who wants to read next?"},{"definition":"To read work(s) written by (a named author).","example":"At the moment I'm reading Milton."},{"definition":"To interpret, or infer a meaning, significance, thought, intention, etc. from.","example":"I can read his feelings in his face."},{"definition":"To consist of certain text.","example":"On the door hung a sign that reads \"No admittance\"."},{"definition":"Of text, etc., to be interpreted or read in a particular way.","example":"Arabic reads right to left."},{"definition":"To substitute (a corrected piece of text in place of an erroneous one); used to introduce an emendation of a text."},{"definition":"(usually ironic) Used after a euphemism to introduce the intended, more blunt meaning of a term."},{"definition":"To be able to hear what another person is saying over a radio connection.","example":"Do you read me?"},{"definition":"To observe and comprehend (a displayed signal)","example":"A repeater signal may be used where the track geometry makes the main signal difficult to read from a distance."},{"definition":"(except Scotland) To make a special study of, as by perusing textbooks.","example":"I am reading theology at university."},{"definition":"To fetch data from (a storage medium, etc.).","example":"to read a hard disk; to read a port; to read the keyboard"},{"definition":"To think, believe; to consider (that)."},{"definition":"To advise; to counsel. See rede."},{"definition":"To tell; to declare; to recite."},{"definition":"To recognise (someone) as being transgender.","example":"Every time I go outside, I worry that someone will read me."},{"definition":"To call attention to the flaws of (someone) in either a playful, a taunting, or an insulting way."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːdz/"}]},{"word":"ROLES","idx":5024,"count":13171507,"meanings":[{"definitions":[{"definition":"A character or part played by a performer or actor.","example":"Her dream was to get a role in a Hollywood movie, no matter how small."},{"definition":"The expected behaviour of an individual in a society.","example":"The role of women has changed significantly in the last century."},{"definition":"The function or position of something.","example":"Local volunteers played an important role in cleaning the beach after the oil spill."},{"definition":"Designation that denotes an associated set of responsibilities, knowledge, skills, and attitudes","example":"The project manager role is responsible for ensuring that everyone on the team knows and executes his or her assigned tasks."},{"definition":"(grammar) The function of a word in a phrase."},{"definition":"In the Raku programming language, a code element akin to an interface, used for composition of classes without adding to their inheritance chain."},{"definition":"An ancient unit of quantity, 72 sheets of parchment."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/roles-uk.mp3","text":"/ɹəʊlz/"}]},{"word":"INTERMEDIATE","idx":5025,"count":13162056,"meanings":[{"definitions":[{"definition":"Anything in an intermediate position."},{"definition":"An intermediary."},{"definition":"Any substance formed as part of a series of chemical reactions that is not the end-product."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mediate, to be an intermediate."},{"definition":"To arrange, in the manner of a broker.","example":"Central banks need to regulate the entities that intermediate monetary transactions."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Being between two extremes, or in the middle of a range."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/intermediate-uk.mp3","text":"/ɪntə(ɹ)ˈmidi.ət/"}]},{"word":"EMOTIONAL","idx":5026,"count":13160826,"meanings":[{"definitions":[{"definition":"Of or relating to the emotions.","example":"emotional crisis"},{"definition":"Characterised by emotion."},{"definition":"Determined by emotion rather than reason.","example":"emotional decision"},{"definition":"Appealing to or arousing emotion.","example":"emotional speech"},{"definition":"Easily affected by emotion.","example":"She’s an emotional person."},{"definition":"Readily displaying emotion.","example":"emotional greeting"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/iˈmoʊʃənəl/"},{"text":"/ɪˈməʊʃnəl/"}]},{"word":"SONS","idx":5027,"count":13160458,"meanings":[{"definitions":[{"definition":"One's male offspring.","example":"Before the birth of the man's child, he said: \"I want a son, not a daughter.\""},{"definition":"A male adopted person in relation to his adoptive parents."},{"definition":"A male person who has such a close relationship with an older or otherwise more authoritative person that he can be regarded as a son of the other person."},{"definition":"A male person considered to have been significantly shaped by some external influence.","example":"He was a son of the mafia system."},{"definition":"A male descendant.","example":"The pharaohs were believed to be sons of the Sun."},{"definition":"A familiar address to a male person from an older or otherwise more authoritative person."},{"definition":"An informal address to a friend or person of equal authority."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/sons-us.mp3","text":"/sʌnz/"}]},{"word":"LEAF","idx":5028,"count":13159307,"meanings":[{"definitions":[{"definition":"The usually green and flat organ that represents the most prominent feature of most vegetative plants."},{"definition":"Anything resembling the leaf of a plant."},{"definition":"A sheet of any substance beaten or rolled until very thin.","example":"gold leaf"},{"definition":"A sheet of a book, magazine, etc (consisting of two pages, one on each face of the leaf)."},{"definition":"(in the plural) Tea leaves."},{"definition":"A flat section used to extend the size of a table."},{"definition":"A moveable panel, e.g. of a bridge or door, originally one that hinged but now also applied to other forms of movement.","example":"The train car has one single-leaf and two double-leaf doors per side."},{"definition":"A foliage leaf or any of the many and often considerably different structures it can specialise into."},{"definition":"In a tree, a node that has no descendants."},{"definition":"The layer of fat supporting the kidneys of a pig, leaf fat."},{"definition":"One of the teeth of a pinion, especially when small."},{"definition":"Marijuana."},{"definition":"(4chan) A Canadian person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce leaves; put forth foliage."},{"definition":"To divide (a vegetable) into separate leaves.","example":"The lettuce in our burgers is 100% hand-leafed."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/leaf-us.mp3","text":"/liːf/"}]},{"word":"PAD","idx":5029,"count":13159201,"meanings":[{"definitions":[{"definition":"A flattened mass of anything soft, to sit or lie on."},{"definition":"A cushion used as a saddle without a tree or frame."},{"definition":"A soft, or small, cushion."},{"definition":"A cushion-like thickening of the skin on the under side of the toes of animals."},{"definition":"The mostly hairless flesh located on the bottom of an animal's foot or paw."},{"definition":"Any cushion-like part of the human body, especially the ends of the fingers."},{"definition":"A stuffed guard or protection, especially one worn on the legs of horses to prevent bruising."},{"definition":"A soft bag or cushion to relieve pressure, support a part, etc."},{"definition":"A sanitary napkin."},{"definition":"A floating leaf of a water lily or similar plant."},{"definition":"A soft cover for a batsman's leg that protects it from damage when hit by the ball."},{"definition":"A kind of cushion for writing upon, or for blotting, especially one formed of many flat sheets of writing paper; now especially such a block of paper sheets as used to write on."},{"definition":"A panel or strip of material designed to be sensitive to pressure or touch."},{"definition":"A keypad."},{"definition":"A flat surface or area from which a helicopter or other aircraft may land or be launched."},{"definition":"An electrical extension cord with a multi-port socket one end: \"trip cord\""},{"definition":"The effect produced by sustained lower reed notes in a musical piece, most common in blues music."},{"definition":"A synthesizer instrument sound used for sustained background sounds."},{"definition":"A bed."},{"definition":"A small house, apartment, or mobile home occupied by a single person; such as a bachelor, playboy, etc."},{"definition":"A prison cell."},{"definition":"A random key (originally written on a disposable pad) of the same length as the plaintext."},{"definition":"A mousepad."},{"definition":"The amount by which a signal has been reduced."},{"definition":"A piece of timber fixed on a beam to fit the curve of the deck."},{"definition":"A toad."},{"definition":"A footpath, particularly one unformed or unmaintained; a road or track. See footpad."},{"definition":"An easy-paced horse; a padnag."},{"definition":"A robber that infests the road on foot; a highwayman or footpad."},{"definition":"A type of wickerwork basket, especially as used as a measure of fish or other goods."},{"definition":"The sound of soft footsteps, or a similar noise made by an animal etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stuff."},{"definition":"To furnish with a pad or padding."},{"definition":"To increase the size of, especially by adding undesirable filler.","example":"May 21, 2008, Austin American-Statesman"},{"definition":"To imbue uniformly with a mordant.","example":"to pad cloth"},{"definition":"To deliberately play the ball with the leg pad instead of the bat."},{"definition":"To travel along (a road, path etc.)."},{"definition":"To travel on foot."},{"definition":"To wear a path by walking."},{"definition":"To walk softly, quietly or steadily, especially without shoes."},{"definition":"To practise highway robbery."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Indicating a soft flat sound, as of bare footsteps.","example":"I heard her soft footsteps, pad, pad along the corridor."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/pad-au.mp3","text":"/pæd/"}]},{"word":"GLORY","idx":5030,"count":13158826,"meanings":[{"definitions":[{"definition":"Great or overwhelming beauty or splendour."},{"definition":"Honour, admiration, or distinction, accorded by common consent to a person or thing; high reputation; renown."},{"definition":"That quality in a person or thing which secures general praise or honour."},{"definition":"Worship or praise."},{"definition":"An optical phenomenon, consisting of concentric rings and somewhat similar to a rainbow, caused by sunlight or moonlight interacting with the water droplets that compose mist or clouds, centered on the antisolar or antilunar point."},{"definition":"Victory; success."},{"definition":"An emanation of light supposed to shine from beings that are specially holy. It is represented in art by rays of gold, or the like, proceeding from the head or body, or by a disk, or a mere line."},{"definition":"The manifestation of the presence of God as perceived by humans in Abrahamic religions."},{"definition":"Pride; boastfulness; arrogance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To exult with joy; to rejoice."},{"definition":"To boast; to be proud."},{"definition":"To shine radiantly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/glory-us.mp3","text":"/ˈɡlo(ː)ɹi/"}]},{"word":"PLATFORMS","idx":5031,"count":13157939,"meanings":[{"definitions":[{"definition":"A raised stage from which speeches are made and on which musical and other performances are made."},{"definition":"A raised floor for any purpose, e.g. for workmen during construction, or formerly for military cannon."},{"definition":"A place or an opportunity to express one's opinion; a tribune.","example":"This new talk show will give a platform to everyday men and women."},{"definition":"A kind of high shoe with an extra layer between the inner and outer soles."},{"definition":"Something that allows an enterprise to advance; a foundation or stage."},{"definition":"A set of components shared by several vehicle models."},{"definition":"A computer system used to deliver services to clients; a solution"},{"definition":"A particular type of operating system or environment such as a database or other specific software, and/or a particular type of computer or microprocessor, used to describe a particular environment for running other software, or for defining a specific software or hardware environment for discussion purposes.","example":"That program runs on the X Window System platform."},{"definition":"A flat expanse of rock, often the result of wave erosion."},{"definition":"A light deck, usually placed in a section of the hold or over the floor of the magazine."},{"definition":"A political stance on a broad set of issues, which are called planks."},{"definition":"(travel) A raised structure from which passengers can enter or leave a train, metro etc."},{"definition":"A plan; a sketch; a model; a pattern."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To furnish with or shape into a platform"},{"definition":"To place on, or as if on, a platform."},{"definition":"To form a plan of; to model; to lay out."},{"definition":"To include in a political platform"},{"definition":"To publish or make visible; to provide a platform for (a topic etc.)."},{"definition":"To open (a film) in a small number of theaters before a broader release in order to generate enthusiasm."}],"partOfSpeech":"ve"}]},{"word":"JA","idx":5032,"count":13156568,"meanings":[{"definitions":[{"definition":"Yes"}],"partOfSpeech":"v"},{"definitions":[{"definition":"Synonym of Korean foot: a traditional unit of length equivalent to about 30.3 cm."}],"partOfSpeech":"n"}]},{"word":"BIGGER","idx":5033,"count":13152228,"meanings":[{"definitions":[{"definition":"Of great size, large.","example":"Elephants are big animals, and they eat a lot."},{"definition":"(of an industry or other field, often capitalized) Thought to have undue influence.","example":"Big Tech"},{"definition":"Popular.","example":"That style is very big right now in Europe, especially among teenagers."},{"definition":"Adult.","example":"Kids should get help from big people if they want to use the kitchen."},{"definition":"Fat.","example":"Gosh, she is big!"},{"definition":"Important or significant.","example":"What's so big about that? I do it all the time."},{"definition":"(with on) Enthusiastic (about).","example":"I'm not big on the idea, but if you want to go ahead with it, I won't stop you."},{"definition":"Mature, conscientious, principled; generous.","example":"I tried to be the bigger person and just let it go, but I couldn't help myself."},{"definition":"Well-endowed, possessing large breasts in the case of a woman or a large penis in the case of a man.","example":"Whoa, Nadia has gotten pretty big since she hit puberty."},{"definition":"(sometimes figurative) Large with young; pregnant; swelling; ready to give birth or produce.","example":"She was big with child."},{"definition":"Used as an intensifier, especially of negative-valence nouns","example":"You are a big liar.  Why are you in such a big hurry?"},{"definition":"(of a city) populous"},{"definition":"(of somebody's age) old, mature. Used to imply that somebody is too old for something, or acting immaturely."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To make or become bigger."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/bigger-us.mp3","text":"/ˈbɪɡɚ/"}]},{"word":"BILLING","idx":5034,"count":13151677,"meanings":[{"definitions":[{"definition":"To dig, chop, etc., with a bill."},{"definition":"To peck"},{"definition":"To stroke bill against bill, with reference to doves; to caress in fondness"},{"definition":"To advertise by a bill or public notice."},{"definition":"To charge; to send a bill to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Amounts billed."},{"definition":"Accounts receivable."},{"definition":"The tracking of bills and amounts owed; the department within an institution or business that deals with the tracking of bills and amounts owed."},{"definition":"The act or situation of including someone or something to those that make up a complete list."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɪlɪŋ/"}]},{"word":"DIESEL","idx":5035,"count":13147963,"meanings":[{"definitions":[{"definition":"A fuel derived from petroleum (or other oils) but heavier than gasoline/petrol. Used to power diesel engines which burn this fuel using the heat produced when air is compressed."},{"definition":"A vehicle powered by a diesel engine."},{"definition":"A rider who has an even energy output, without bursts of speed."},{"definition":"Snakebite and black (a drink)."},{"definition":"A particular cannabis hybrid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ignite a substance by using the heat generated by compression"},{"definition":"For a spark-ignition internal combustion engine to continue running after the electrical current to the spark plugs has been turned off. This occurs when there's enough heat in the combustion chamber to ignite the air and fuel mixture without a spark, the same way that heat and pressure cause ignition in a diesel engine.","example":"The only reason the VW bug has a solenoid is to prevent it from dieseling."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/diesel-au.mp3","text":"/ˈdiːzəl/"}]},{"word":"VERSUS","idx":5036,"count":13147766,"meanings":[{"definitions":[{"definition":"Against; in opposition to.","example":"It is the Packers versus the Steelers in the Super Bowl."},{"definition":"Compared with, as opposed to."},{"definition":"Bringing a legal action against, as used in the title of a court case in which the first party indicates the plaintiff (or appellant or the like), and the second indicates the defendant (or respondent or the like).","example":"Brown v. Board of Education of Topeka, Kans."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/versus-uk.mp3","text":"/ˈvɜːsəs/"}]},{"word":"COMBINE","idx":5037,"count":13139084,"meanings":[{"definitions":[{"definition":"A combine harvester","example":"We can't finish harvesting because our combine is stuck in the mud."},{"definition":"A combination"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bring (two or more things or activities) together; to unite.","example":"Combine the milk and the hot water in a large bowl.   I'm combining business and pleasure on this trip."},{"definition":"To have two or more things or properties that function together.","example":"Joe combines the intelligence of a rock with the honesty of a politician."},{"definition":"To come together; to unite.","example":"two substances that easily combine"},{"definition":"In the game of casino, to play a card which will take two or more cards whose aggregate number of pips equals those of the card played."},{"definition":"To bind; to hold by a moral tie."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/combine-uk.mp3","text":"/kəmˈbaɪn/"}]},{"word":"OVERNIGHT","idx":5038,"count":13137405,"meanings":[{"definitions":[{"definition":"Items delivered or completed overnight.","example":"Have you looked at the overnights yet?"},{"definition":"An overnight stay, especially in a hotel or other lodging facility."},{"definition":"(in the plural) Viewership ratings for a television show that are published the morning after it is broadcast, and may be revised later on."},{"definition":"The fore part of the previous night; yesterday evening."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stay overnight; to spend the night."},{"definition":"To send something for delivery the next day.","example":"We can overnight you the documents for signature."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Occurring between dusk and dawn.","example":"The overnight ferry docked at 10AM."},{"definition":"Complete before the next morning.","example":"Don't expect overnight delivery."},{"definition":"Of an activity or event in which participants stay overnight.","example":"They sent their kids to overnight camp."}],"partOfSpeech":"j"},{"definitions":[{"definition":"During or throughout the night, especially during the evening or night just past.","example":"Let it run overnight and we'll check on it in the morning."},{"definition":"In a very short (but unspecified) amount of time.","example":"The change seemed to happen overnight."}],"partOfSpeech":"v"}]},{"word":"GEOGRAPHIC","idx":5039,"count":13136286,"meanings":[{"definitions":[{"definition":"Pertaining to geography (or to geographics)"},{"definition":"Determined by geography, as opposed to magnetic (i.e. North)"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/d͡ʒiəˈɡɹæfɪk/"}]},{"word":"EXCEED","idx":5040,"count":13135673,"meanings":[{"definitions":[{"definition":"To be larger, greater than (something).","example":"The company's 2005 revenue exceeds that of 2004."},{"definition":"To be better than (something).","example":"The quality of her essay has exceeded my expectations."},{"definition":"To go beyond (some limit); to surpass; to be longer than.","example":"Your password cannot exceed eight characters."},{"definition":"To predominate."},{"definition":"To go too far; to be excessive."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/exceed-uk.mp3","text":"/ɪkˈsiːd/"}]},{"word":"ROD","idx":5042,"count":13124744,"meanings":[{"definitions":[{"definition":"A straight, round stick, shaft, bar, cane, or staff."},{"definition":"A longitudinal pole used for forming part of a framework such as an awning or tent."},{"definition":"A long slender usually tapering pole used for angling; fishing rod.","example":"When I hooked a snake and not a fish, I got so scared I dropped my rod in the water."},{"definition":"A stick, pole, or bundle of switches or twigs (such as a birch), used for personal defense or to administer corporal punishment by whipping."},{"definition":"An implement resembling and/or supplanting a rod (particularly a cane) that is used for corporal punishment, and metonymically called the rod, regardless of its actual shape and composition.","example":"The judge imposed on the thief a sentence of fifteen strokes with the rod."},{"definition":"A stick used to measure distance, by using its established length or task-specific temporary marks along its length, or by dint of specific graduated marks.","example":"I notched a rod and used it to measure the length of rope to cut."},{"definition":"A unit of length equal to 1 pole, a perch, 1/4 chain, 5 1/2 yards, 16 1/2 feet, or exactly 5.0292 meters (these being all equivalent)."},{"definition":"An implement held vertically and viewed through an optical surveying instrument such as a transit, used to measure distance in land surveying and construction layout; an engineer's rod, surveyor's rod, surveying rod, leveling rod, ranging rod. The modern engineer's or surveyor's rod commonly is eight or ten feet long and often designed to extend higher. In former times a surveyor's rod often was a single wooden pole or composed of multiple sectioned and socketed pieces, and besides serving as a sighting target was used to measure distance on the ground horizontally, hence for convenience was of one rod or pole in length, that is, 5 1/2 yards."},{"definition":"A unit of area equal to a square rod, 30 1/4 square yards or 1/160 acre.","example":"The house had a small yard of about six rods in size."},{"definition":"A straight bar that unites moving parts of a machine, for holding parts together as a connecting rod or for transferring power as a drive-shaft.","example":"The engine threw a rod, and then went to pieces before our eyes, springs and coils shooting in all directions."},{"definition":"A rod cell: a rod-shaped cell in the eye that is sensitive to light.","example":"The rods are more sensitive than the cones, but do not discern color."},{"definition":"Any of a number of long, slender microorganisms.","example":"He applied a gram positive stain, looking for rods indicative of Listeria."},{"definition":"A stirring rod: a glass rod, typically about 6 inches to 1 foot long and 1/8 to 1/4 inch in diameter that can be used to stir liquids in flasks or beakers."},{"definition":"A pistol; a gun."},{"definition":"A penis."},{"definition":"A hot rod, an automobile or other passenger motor vehicle modified to run faster and often with exterior cosmetic alterations, especially one based originally on a pre-1940s model or (currently) denoting any older vehicle thus modified."},{"definition":"A rod-shaped object that appears in photographs or videos traveling at high speed, not seen by the person recording the event, often associated with extraterrestrial entities."},{"definition":"A Cuisenaire rod."},{"definition":"A coupling rod or connecting rod, which links the driving wheels of a steam locomotive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reinforce concrete with metal rods."},{"definition":"To furnish with rods, especially lightning rods."},{"definition":"To penetrate sexually."},{"definition":"To hot rod."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/rod-us.mp3","text":"/ɹɑd/"}]},{"word":"FAULT","idx":5044,"count":13112664,"meanings":[{"definitions":[{"definition":"A defect; something that detracts from perfection."},{"definition":"A mistake or error.","example":"No! This is my fault, not yours."},{"definition":"A weakness of character; a failing.","example":"For all her faults, she’s a good person at heart."},{"definition":"A minor offense."},{"definition":"Blame; the responsibility for a mistake.","example":"The fault lies with you."},{"definition":"A fracture in a rock formation causing a discontinuity."},{"definition":"In coal seams, coal rendered worthless by impurities in the seam.","example":"slate fault  dirt fault"},{"definition":"An illegal serve."},{"definition":"An abnormal connection in a circuit."},{"definition":"Want; lack"},{"definition":"A lost scent; act of losing the scent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To criticize, blame or find fault with something or someone."},{"definition":"To fracture."},{"definition":"To commit a mistake or error."},{"definition":"To undergo a page fault."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/fault-uk.mp3","text":"/fɒlt/"}]},{"word":"PRELIMINARY","idx":5047,"count":13106833,"meanings":[{"definitions":[{"definition":"A preparation for a main matter; an introduction."},{"definition":"Any of a series of sports events that determine the finalists"},{"definition":"A relatively minor contest that precedes a major one, especially in boxing"}],"partOfSpeech":"n"},{"definitions":[{"definition":"In preparation for the main matter; initial, introductory, preparatory.","example":"These are just the preliminary results."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹɪˈlɪmɪnɛɹi/"},{"text":"/pɹɪˈlɪmɪnəɹi/"}]},{"word":"DISTRICTS","idx":5048,"count":13106605,"meanings":[{"definitions":[{"definition":"An administrative division of an area.","example":"the Soho district of London"},{"definition":"An area or region marked by some distinguishing feature.","example":"the Lake District in Cumbria"},{"definition":"An administrative division of a county without the status of a borough.","example":"South Oxfordshire District Council"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide into administrative or other districts."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/districts-us.mp3","text":"/ˈdɪstɹɪkts/"}]},{"word":"INTRODUCE","idx":5049,"count":13104630,"meanings":[{"definitions":[{"definition":"(of people) To cause (someone) to be acquainted (with someone else).","example":"Let me introduce you to my friends."},{"definition":"To make (something or someone) known by formal announcement or recommendation.","example":"Let me introduce our guest speaker."},{"definition":"To add (something) to a system, a mixture, or a container.","example":"Various pollutants were introduced into the atmosphere."},{"definition":"To bring (something) into practice.","example":"Wheeled transport was introduced long ago."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/introduce-us.mp3","text":"/ˌɪntɹəˈdus/"}]},{"word":"SILK","idx":5050,"count":13099161,"meanings":[{"definitions":[{"definition":"A fine fiber excreted by the silkworm or other arthropod (such as a spider).","example":"The thread made of silk was barely visible."},{"definition":"A fine, soft cloth woven from silk fibers."},{"definition":"Anything which resembles silk, such as the filiform styles of the female flower of maize, or the seed covering of bombaxes."},{"definition":"The gown worn by a Senior (i.e. Queen's/King's) Counsel."},{"definition":"A Senior (i.e. Queen's or King's) Counsel."},{"definition":"(circus arts, in the plural) A pair of long silk sheets suspended in the air on which a performer performs tricks."},{"definition":"(usually in the plural) The garments worn by a jockey displaying the colors of the horse's owner."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the silk from (corn)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/silk-us.mp3","text":"/sɪlk/"}]},{"word":"PROMOTIONAL","idx":5051,"count":13084826,"meanings":[{"definitions":[{"definition":"An advertising promotion"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to an advertising promotion; serving to promote a service, institution, business, etc.","example":"Collect five promotional vouchers to claim your prize."},{"definition":"Of or relating to promotion to a post of higher status."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹəˈmoʊʃənəl/"},{"text":"/pɹəˈməʊʃənəl/"}]},{"word":"BABIES","idx":5054,"count":13070103,"meanings":[{"definitions":[{"definition":"A very young human, particularly from birth to a couple of years old or until walking is fully mastered."},{"definition":"Any very young animal, especially a vertebrate; many species have specific names for their babies, such as kittens for the babies of cats, puppies for the babies of dogs, and chickens for the babies of birds. See for more."},{"definition":"Unborn young; a fetus.","example":"When is your baby due?"},{"definition":"A person who is immature, infantile or feeble.","example":"Stand up for yourself – don't be such a baby!"},{"definition":"A person who is new to or inexperienced in something.","example":"I only qualified as an architect this summer, so I'm still a baby."},{"definition":"The lastborn of a family; the youngest sibling, irrespective of age.","example":"Adam is the baby of the family."},{"definition":"A term of endearment used to refer to or address one's girlfriend, boyfriend or spouse.","example":"Baby, don't cry."},{"definition":"A form of address to a man or a woman considered to be attractive.","example":"Hey baby, what are you doing later?"},{"definition":"A pet project or responsibility.","example":"You need to talk to John about that – it's his baby."},{"definition":"An affectionate term for anything.","example":"See my new car here? I can't wait to take this baby for a drive."},{"definition":"A small image of an infant; a doll."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To coddle; to pamper somebody like an infant."},{"definition":"To tend (something) with care; to be overly attentive to (something), fuss over."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbeɪbiz/"}]},{"word":"BI","idx":5055,"count":13070039,"meanings":[{"definitions":[{"definition":"A bisexual person."},{"definition":"A type of jade disk produced in ancient China."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Bisexual.","example":"I'm straight, but my oldest sister is bi."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/bi-1-us.mp3","text":"/baɪ/"}]},{"word":"COMPILED","idx":5057,"count":13067154,"meanings":[{"definitions":[{"definition":"To put together; to assemble; to make by gathering things from various sources.","example":"Samuel Johnson compiled one of the most influential dictionaries of the English language."},{"definition":"To construct, build."},{"definition":"To use a compiler to process source code and produce executable code.","example":"After I compile this program I'll run it and see if it works."},{"definition":"To be successfully processed by a compiler into executable code.","example":"There must be an error in my source code because it won't compile."},{"definition":"To contain or comprise."},{"definition":"To write; to compose."}],"partOfSpeech":"ve"}]},{"word":"ROMANTIC","idx":5058,"count":13055842,"meanings":[{"definitions":[{"definition":"Of or dealing with languages or cultures derived from Roman influence and Latin: Italian, French, Portuguese, Spanish, Romanian, Catalan, Occitan, Corsican, etc."},{"definition":"Of or pertaining to Romance."},{"definition":"Of or pertaining to Romanticism."},{"definition":"Of a work of literature, a writer etc.: being like or having the characteristics of a romance, or poetic tale of a mythic or quasi-historical time; fantastic."},{"definition":"Fictitious, imaginary."},{"definition":"Fantastic, unrealistic (of an idea etc.); fanciful, sentimental, impractical (of a person).","example":"Mary sighed, knowing her ideals were far too romantic to work in reality."},{"definition":"Having the qualities of romance (in the sense of something appealing deeply to the imagination); invoking on a powerfully sentimental idea of life; evocative, atmospheric."},{"definition":"Pertaining to an idealised form of love (originally, as might be felt by the heroes of a romance); conducive to romance; loving, affectionate.","example":"Their kiss started casually, but it slowly turned romantic."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A person with romantic character (a character like those of the knights in a mythic romance)."},{"definition":"A person who is behaving romantically (in a manner befitting someone who feels an idealized form of love).","example":"Oh, flowers! You're such a romantic."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/romantic-us.mp3","text":"/ɹoʊˈmæn(t)ɪk/"}]},{"word":"REVEALED","idx":5059,"count":13042465,"meanings":[{"definitions":[{"definition":"To uncover; to show and display that which was hidden."},{"definition":"To communicate that which could not be known or discovered without divine or supernatural instruction."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or pertaining to the revelations of a divinity to humankind."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"https://api.dictionaryapi.dev/media/pronunciations/en/revealed-us.mp3","text":"/ɹəˈviːld/"}]},{"word":"SPECIALISTS","idx":5060,"count":13041955,"meanings":[{"definitions":[{"definition":"Someone who is an expert in, or devoted to, some specific branch of study or research."},{"definition":"A physician whose practice is limited to a particular branch of medicine or surgery."},{"definition":"Any of several non-commissioned ranks corresponding to that of corporal."},{"definition":"An organism that is specialized for a particular environment.","example":"The tree Lepidothamnus laxifolius is a high alpine specialist found in high-altitude bog communities and in scrub."}],"partOfSpeech":"n"}]}]