[{"word":"FANNIES","idx":93111,"count":112406,"meanings":[{"definitions":[{"definition":"The female genitalia.","example":"Her dress was so short you could nearly see her fanny."},{"definition":"The buttocks; arguably the most nearly polite of several euphemisms.","example":"Children, sit down on your fannies, and eat your lunch."},{"definition":"Sexual intercourse with a woman.","example":"get some fanny tonight"},{"definition":"Women viewed as sexual objects.","example":"This club is full of fanny."},{"definition":"(naval slang) Mess kettle or cooking pot."}],"partOfSpeech":"n"}]},{"word":"DIAPHRAGMATIC","idx":93112,"count":112405,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or using a diaphragm."}],"partOfSpeech":"j"}]},{"word":"UNFLATTERING","idx":93113,"count":112402,"meanings":[{"definitions":[{"definition":"To show in a bad light; to portray unfavorably."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not flattering."}],"partOfSpeech":"j"}]},{"word":"BRISTLING","idx":93114,"count":112396,"meanings":[{"definitions":[{"definition":"To rise or stand erect, like bristles."},{"definition":"Abound, to have an abundance of something"},{"definition":"(with at) To be on one's guard or raise one's defenses; to react with fear, suspicion, or distance.","example":"The employees bristled at the prospect of working through the holidays."},{"definition":"To fix a bristle to.","example":"to bristle a thread"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who bristles."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having bristles."},{"definition":"Showing anger."}],"partOfSpeech":"j"}]},{"word":"ZLOTYS","idx":93116,"count":112393,"meanings":[{"definitions":[{"definition":"Złoty, the currency unit of Poland, divided into 100 groszy."}],"partOfSpeech":"n"}]},{"word":"FILBERT","idx":93117,"count":112392,"meanings":[{"definitions":[{"definition":"The hazelnut."},{"definition":"The hazel tree."},{"definition":"A paintbrush used in oil and acrylic painting with a long ferrule and a curving, tongue-shaped head."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɪlbɚt/"}]},{"word":"BLACKHEADS","idx":93120,"count":112389,"meanings":[{"definitions":[{"definition":"A comedo, a skin blemish, a type of acne vulgaris, where a pore becomes clogged with a dark, hard, cheesy keratin-filled substance forming a hard black \"head\" on the skin's surface."},{"definition":"A form of histomoniasis in poultry, characterized by cyanotic discoloration on the bird's head."},{"definition":"A scaup: any of various ducks of the genus Aythya."}],"partOfSpeech":"n"}]},{"word":"STOPING","idx":93124,"count":112381,"meanings":[{"definitions":[{"definition":"In mining, the removal of the desired ore from an underground mine, leaving behind an open space known as a stope."}],"partOfSpeech":"n"}]},{"word":"CHERUBIM","idx":93126,"count":112377,"meanings":[{"definitions":[{"definition":"A winged creature attending God, described by Pseudo-Dionysius the Areopagite (c. 5th–6th century) as the second highest order of angels, ranked above thrones and below seraphim; similar to a lamassu in the pre-exilic texts of the Hebrew Bible, more humanoid in later texts."},{"definition":"An artistic depiction of such a being, typically in the form of a winged child or a child's head with wings but no body."},{"definition":"A person, especially a child, seen as being particularly angelic or innocent."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cherubim-uk"}]},{"word":"LAGAN","idx":93127,"count":112375,"meanings":[{"definitions":[{"definition":"Goods or materials found or left on the sea floor, attached to a floating marker that indicates ownership."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlæɡən/"}]},{"word":"THOROUGHBREDS","idx":93132,"count":112364,"meanings":[{"definitions":[{"definition":"A horse of a breed derived from crosses between Arabian stallions and English mares, bred for racing. (usually capitalized: Thoroughbred.)"},{"definition":"Any purebred horse."},{"definition":"A person of uncommon strength or endurance (like that of a thoroughbred horse).","example":"That athlete is a real thoroughbred."},{"definition":"A well-bred person."}],"partOfSpeech":"n"}]},{"word":"GASTRIN","idx":93135,"count":112359,"meanings":[{"definitions":[{"definition":"A hormone that stimulates the production of gastric acid in the stomach"}],"partOfSpeech":"n"}]},{"word":"NIGHTCAP","idx":93137,"count":112357,"meanings":[{"definitions":[{"definition":"A warm cloth cap worn while sleeping, often with pajamas, being common attire in northern Europe before effective home heating became widespread.","example":"Winston wore a nightcap to stave off the cold."},{"definition":"A beverage drunk before bed that is usually alcoholic.","example":"I'll make myself a nightcap of whisky and lemon before heading to bed."},{"definition":"(by extension) Something the person reads or listens to before bed."},{"definition":"The final match of a sporting contest, especially the second game of a baseball doubleheader."},{"definition":"A cap drawn over the face of the condemned person before they are hanged."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnaɪtˌkæp/"}]},{"word":"MASSY","idx":93142,"count":112352,"meanings":[{"definitions":[{"definition":"Heavy; massive."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Someone who has control over something or someone."},{"definition":"The owner of an animal or slave."},{"definition":"The captain of a merchant ship; a master mariner."},{"definition":"The head of a household."},{"definition":"Someone who employs others."},{"definition":"An expert at something.","example":"Mark Twain was a master of fiction."},{"definition":"A tradesman who is qualified to teach apprentices."},{"definition":"A schoolmaster."},{"definition":"A skilled artist."},{"definition":"A man or a boy; mister. See Master."},{"definition":"A master's degree; a type of postgraduate degree, usually undertaken after a bachelor degree.","example":"She has a master in psychology."},{"definition":"A person holding such a degree.","example":"He is a master of marine biology."},{"definition":"The original of a document or of a recording.","example":"The band couldn't find the master, so they re-recorded their tracks."},{"definition":"The primary wide shot of a scene, into which the closeups will be edited later."},{"definition":"A parajudicial officer (such as a referee, an auditor, an examiner, or an assessor) specially appointed to help a court with its proceedings.","example":"The case was tried by a master, who concluded that the plaintiffs were the equitable owners of the property. [...]"},{"definition":"A device that is controlling other devices or is an authoritative source.","example":"a master database"},{"definition":"A person holding an office of authority, especially the presiding officer."},{"definition":"(by extension) A person holding a similar office in other civic societies."},{"definition":"(in combination) A vessel having a specified number of masts.","example":"a two-master"},{"definition":"Relenting; forbearance to cause or allow harm to another.","example":"She took mercy on him and quit embarrassing him."},{"definition":"Forgiveness or compassion, especially toward those less fortunate.","example":"Have mercy on the poor and assist them if you can."},{"definition":"A tendency toward forgiveness, pity, or compassion.","example":"Mercy is one of his many virtues."},{"definition":"Instances of forbearance or forgiveness.","example":"Psalms 40:11 Do not withhold Your tender mercies from me, O Lord"},{"definition":"A blessing; something to be thankful for.","example":"It was a mercy that we were not inside when the roof collapsed"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmæsi/"}]},{"word":"CONSOLING","idx":93143,"count":112352,"meanings":[{"definitions":[{"definition":"To comfort (someone) in a time of grief, disappointment, etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which somebody is consoled."}],"partOfSpeech":"n"}]},{"word":"ANTIDOTES","idx":93144,"count":112351,"meanings":[{"definitions":[{"definition":"A remedy to counteract the effects of poison (often followed by \"against,\" \"for,\" or \"to\").","example":"She reached the hospital in time to receive the antidote for the snake venom."},{"definition":"Something that counteracts or prevents something harmful.","example":"We need an antidote for this misinformation."}],"partOfSpeech":"n"}]},{"word":"CHARACTERISES","idx":93146,"count":112349,"meanings":[{"definitions":[{"definition":"To depict someone or something a particular way (often negative)."},{"definition":"To be typical of."},{"definition":"To determine the characteristics of."}],"partOfSpeech":"ve"}]},{"word":"SENSATIONALISM","idx":93148,"count":112346,"meanings":[{"definitions":[{"definition":"The use of sensational subject matter, style or methods, or the sensational subject matter itself; behavior, published materials, or broadcasts that are intentionally controversial, exaggerated, lurid, loud, or attention-grabbing. Especially applied to news media in a pejorative sense that they are reporting in a manner to gain audience or notoriety but at the expense of accuracy and professionalism."},{"definition":"A theory of philosophy that all knowledge is ultimately derived from the senses."}],"partOfSpeech":"n"}]},{"word":"KICKBALL","idx":93149,"count":112341,"meanings":[{"definitions":[{"definition":"A sport similar to baseball, where a ball is kicked rather than hit."},{"definition":"The ball used in the above sport."}],"partOfSpeech":"n"}]},{"word":"CUTLETS","idx":93153,"count":112334,"meanings":[{"definitions":[{"definition":"A thin slice of meat, usually fried."},{"definition":"A chop, a specific piece of meat (especially pork, chicken or beef) cut from the side of an animal."},{"definition":"A piece of fish that has been cut perpendicular to the spine, rather than parallel (as with a fillet); often synonymous with steak."},{"definition":"A prawn or shrimp with its head and outer shell removed, leaving only the flesh and tail."}],"partOfSpeech":"n"}]},{"word":"CONDORS","idx":93157,"count":112320,"meanings":[{"definitions":[{"definition":"Either of two New World vultures, Vultur gryphus of the Andes or Gymnogyps californianus, a nearly extinct vulture of the mountains of California."},{"definition":"A gold coin of some South American countries bearing the figure of one of these vultures."},{"definition":"An Argentinian short range ballistic missile."},{"definition":"In golf, four under par (quadruple birdie, triple eagle, or double albatross)"}],"partOfSpeech":"n"}]},{"word":"DIANTHUS","idx":93159,"count":112319,"meanings":[{"definitions":[{"definition":"Any plant, such as carnations and pinks, of the genus Dianthus."}],"partOfSpeech":"n"}]},{"word":"UNCONFINED","idx":93160,"count":112318,"meanings":[{"definitions":[{"definition":"Not confined; free from physical restraint."}],"partOfSpeech":"j"}]},{"word":"HOOFS","idx":93161,"count":112318,"meanings":[{"definitions":[{"definition":"The tip of a toe of an ungulate such as a horse, ox or deer, strengthened by a thick keratin covering."},{"definition":"The human foot.","example":"Get your hooves off me!"},{"definition":"An ungula."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To trample with hooves."},{"definition":"To walk."},{"definition":"To dance, especially as a professional."},{"definition":"(football (soccer)) To kick, especially to kick a football a long way downfield with little accuracy."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hufs/"}]},{"word":"ACCLIMATED","idx":93168,"count":112307,"meanings":[{"definitions":[{"definition":"To habituate to a climate not native; to acclimatize."},{"definition":"To adjust to a new environment; not necessarily a wild, natural, earthy one."},{"definition":"To become accustomed to a new climate or environment."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Accustomed, adapted or hardened to some environment"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈæk.lɪm.eɪt.əd/"}]},{"word":"DRAWL","idx":93173,"count":112289,"meanings":[{"definitions":[{"definition":"A way of speaking slowly while lengthening vowel sounds and running words together. Characteristic of some southern US accents, as well as Scots."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drag on slowly and heavily; to while or dawdle away time indolently."},{"definition":"To utter or pronounce in a dull, spiritless tone, as if by dragging out the utterance."},{"definition":"To move slowly and heavily; move in a dull, slow, lazy manner."},{"definition":"To speak with a slow, spiritless utterance, from affectation, laziness, or lack of interest."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"drawl-uk","text":"/dɹɔːl/"}]},{"word":"UNMASKING","idx":93180,"count":112282,"meanings":[{"definitions":[{"definition":"To remove a mask from someone."},{"definition":"To expose, or reveal the true character of someone."},{"definition":"To remove one's mask."},{"definition":"To enable (an interrupt, etc.) by unsetting or setting the associated bit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which somebody or something is unmasked.","example":"regular unmaskings of criminals"}],"partOfSpeech":"n"}]},{"word":"CONSTRICTOR","idx":93182,"count":112280,"meanings":[{"definitions":[{"definition":"That which constricts or tightens"},{"definition":"A boa constrictor, python or similar snake that kills by constriction"}],"partOfSpeech":"n"}]},{"word":"LEAGUER","idx":93183,"count":112279,"meanings":[{"definitions":[{"definition":"A siege","example":"We must break the leaguer of the city."},{"definition":"The camp of a besieging army; a camp in general."},{"definition":"A measure of liquid."},{"definition":"(usually in compounds) A person in a league","example":"I'm not a major-leaguer; I just play baseball."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To besiege; to beleaguer."},{"definition":"To set up camp."}],"partOfSpeech":"ve"}]},{"word":"SCHIST","idx":93187,"count":112271,"meanings":[{"definitions":[{"definition":"Any of a variety of coarse-grained crystalline metamorphic rocks with a foliated structure that allows easy division into slabs or slates."}],"partOfSpeech":"n"}]},{"word":"EQUATIONAL","idx":93188,"count":112271,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or constructed using equations"}],"partOfSpeech":"j"}]},{"word":"CLEARINGHOUSES","idx":93190,"count":112268,"meanings":[{"definitions":[{"definition":"A central point where clearing banks and other financial firms exchange checks, settle accounts, etc."},{"definition":"(by extension) A hub of goods traffic"},{"definition":"(GIS) A repository structure, physical or virtual, that collects, stores, and disseminates information, metadata, and data"}],"partOfSpeech":"n"}]},{"word":"MANOEUVRING","idx":93193,"count":112259,"meanings":[{"definitions":[{"definition":"To move (something, or oneself) carefully, and often with difficulty, into a certain position."},{"definition":"To guide, steer, manage purposefully"},{"definition":"To intrigue, manipulate, plot, scheme","example":"The patriarch maneuvered till his offspring occupied countless key posts"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A manoeuvre."}],"partOfSpeech":"n"}]},{"word":"LANCES","idx":93197,"count":112245,"meanings":[{"definitions":[{"definition":"A weapon of war, consisting of a long shaft or handle and a steel blade or head; a spear carried by horsemen."},{"definition":"A wooden spear, sometimes hollow, used in jousting or tilting, designed to shatter on impact with the opposing knight’s armour."},{"definition":"A spear or harpoon used by whalers and fishermen."},{"definition":"A soldier armed with a lance; a lancer."},{"definition":"An instrument which conveys the charge of a piece of ordnance and forces it home."},{"definition":"(founding) A small iron rod which suspends the core of the mold in casting a shell."},{"definition":"One of the small paper cases filled with combustible composition, which mark the outlines of a figure."},{"definition":"A lancet."},{"definition":"A platter or dish for serving food in Ancient Rome."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pierce with a lance, or with any similar weapon.","example":"Seized the due victim, and with fury lanced Her back. Dryden."},{"definition":"To open with a lancet; to pierce","example":"to lance a vein or an abscess"},{"definition":"To throw in the manner of a lance; to lanch."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈlænsɪz/"},{"text":"/ˈlɑːnsɪz/"}]},{"word":"DEMYSTIFY","idx":93205,"count":112223,"meanings":[{"definitions":[{"definition":"To remove the mystery from something; to explain or clarify.","example":"The article was written to demystify the mechanics of the internal combustion engine."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/diːˈmɪstɪfaɪ/"}]},{"word":"MACULA","idx":93206,"count":112222,"meanings":[{"definitions":[{"definition":"An oval yellow spot near the center of the retina of the human eye, histologically defined as having two or more layers of ganglion cells, responsible for detailed central vision."},{"definition":"A small chamber of the inner ear of certain vertebrates filled with endolymph and containing an otolith."},{"definition":"A spot, as on the skin, or on the surface of the sun or of some other luminous orb."},{"definition":"A rather large spot or blotch of color."},{"definition":"In planetary geology, an unusually dark area on the surface of a planet or moon."}],"partOfSpeech":"n"}]},{"word":"TOGGLING","idx":93212,"count":112209,"meanings":[{"definitions":[{"definition":"To alternate between two positions using a single switch or lever.","example":"Clicking a button will alternately toggle its light on OR off."},{"definition":"To switch between alternate states.","example":"You can quickly toggle the case of selected text by pressing Alt+C."},{"definition":"To fix like a toggle iron; to fix fast."}],"partOfSpeech":"ve"}]},{"word":"BURSTY","idx":93223,"count":112188,"meanings":[{"definitions":[{"definition":"Occurring in abrupt bursts, especially of information","example":"The router needs to handle bursty traffic."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bursty-us"}]},{"word":"DACRON","idx":93224,"count":112184,"meanings":[{"definitions":[{"definition":"A polymer, polyethylene terephthalate PET, as used for making thread and cloth."}],"partOfSpeech":"n"}]},{"word":"IMPUTE","idx":93238,"count":112150,"meanings":[{"definitions":[{"definition":"To attribute or ascribe (responsibility or fault) to a cause or source.","example":"The teacher imputed the student's failure to his nervousness."},{"definition":"To ascribe (sin or righteousness) to someone by substitution."},{"definition":"To take into account."},{"definition":"To attribute or credit to.","example":"People impute great cleverness to cats."},{"definition":"To replace missing data with substituted values."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"impute-us","text":"/ɪmˈpjuːt/"}]},{"word":"POLYGLOT","idx":93241,"count":112146,"meanings":[{"definitions":[{"definition":"One who has mastered, notably speaks, several languages."},{"definition":"A publication containing several versions of the same text, or the same subject matter in several languages; especially, the Bible in several languages."},{"definition":"A mixture of languages or nomenclatures."},{"definition":"A program written in multiple programming languages."},{"definition":"A file that can be validly interpreted as multiple formats."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Versed in, or speaking, many languages."},{"definition":"Containing, or made up of, several languages.","example":"a polyglot Bible"},{"definition":"Comprising various linguistic groups.","example":"A polyglot region without a clearly dominant culture may develop an artificial lingua franca, such as Pidgin English in the South Sea."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"polyglot-uk","text":"/ˈpɒliːɡlɒt/"}]},{"word":"MAULED","idx":93242,"count":112146,"meanings":[{"definitions":[{"definition":"To handle someone or something in a rough way."},{"definition":"To savage; to cause serious physical wounds (usually used of an animal).","example":"The bear mauled him in a terrible way."},{"definition":"To criticise harshly."},{"definition":"To beat with the heavy hammer called a maul."}],"partOfSpeech":"ve"}]},{"word":"PLUMBED","idx":93245,"count":112145,"meanings":[{"definitions":[{"definition":"To determine the depth, generally of a liquid; to sound."},{"definition":"To attach to a water supply and drain."},{"definition":"To think about or explore in depth, to get to the bottom of, especially to plumb the depths of."},{"definition":"To use a plumb bob as a measuring or aligning tool."},{"definition":"To accurately align vertically or horizontally."},{"definition":"To seal something with lead."},{"definition":"To work as a plumber."},{"definition":"To fall or sink like a plummet."},{"definition":"To trace a road or track; to follow it to its end."},{"definition":"To position vertically above or below."}],"partOfSpeech":"ve"}]},{"word":"DRAINER","idx":93247,"count":112141,"meanings":[{"definitions":[{"definition":"That which drains."},{"definition":"A frame or rack for allowing washed crockery etc to dry naturally."},{"definition":"A person who explores drains, tunnels, or sewers."}],"partOfSpeech":"n"}]},{"word":"CHIVE","idx":93258,"count":112120,"meanings":[{"definitions":[{"definition":"A perennial plant, Allium schoenoprasum, related to the onion."},{"definition":"(in the plural) The leaves of this plant used as a herb."},{"definition":"The style and stigma of a flower, especially saffron."},{"definition":"(thieves' cant) A knife."},{"definition":"(thieves' cant) A file."},{"definition":"(thieves' cant) A saw."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(thieves' cant) To stab."},{"definition":"(thieves' cant) To cut."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chive-1-us","text":"/tʃaɪv/"}]},{"word":"MAYFLIES","idx":93259,"count":112118,"meanings":[{"definitions":[{"definition":"Any of the many fragile insects of the order Ephemeroptera that develop in fresh water and live very briefly as winged adults."}],"partOfSpeech":"n"}]},{"word":"DAINTIES","idx":93261,"count":112114,"meanings":[{"definitions":[{"definition":"Women's undergarments."},{"definition":"A delicacy (in taste)."},{"definition":"Esteem, honour."},{"definition":"(Prairies and northwestern Ontario) A fancy cookie, pastry, or square, typically homemade, served at a social event (usually plural)."},{"definition":"An affectionate term of address."}],"partOfSpeech":"n"}]},{"word":"BLIMPS","idx":93266,"count":112095,"meanings":[{"definitions":[{"definition":"An airship constructed with a non-rigid lifting agent container."},{"definition":"(by extension) Any large airborne inflatable."},{"definition":"An obese person."},{"definition":"A person similar to the cartoon character Colonel Blimp; a pompous, reactionary British man."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To expand like a blimp or balloon; to become fat.","example":"After college, she started blimping and could no longer wear her favorite little black dress."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/blɪmps/"}]},{"word":"PEPSIN","idx":93268,"count":112086,"meanings":[{"definitions":[{"definition":"A digestive enzyme that chemically digests, or breaks down, proteins into shorter chains of amino acids."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɛpsɪn/"}]},{"word":"LEGHORN","idx":93273,"count":112067,"meanings":[{"definitions":[{"definition":"A type of dried plaited wheat straw fabric."},{"definition":"A hat made from that fabric."},{"definition":"A small white chicken of a hardy breed.","example":"The cartoon character Foghorn Leghorn was obviously not actually a leghorn because he was much too big."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɛɡhɔɹn/"},{"text":"/lɛˈɡɔːn/"}]},{"word":"SKETCHBOOKS","idx":93284,"count":112045,"meanings":[{"definitions":[{"definition":"A book or pad with blank pages for sketching; a sketch pad."},{"definition":"A book of printed sketches."},{"definition":"A printed book of literary sketches or skits."}],"partOfSpeech":"n"}]},{"word":"PORKER","idx":93286,"count":112039,"meanings":[{"definitions":[{"definition":"A pig, especially a castrated male, being fattened and raised for slaughter."},{"definition":"An obese person."},{"definition":"A lie (from Cockney rhyming slang pork pie)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"porker-au"}]},{"word":"STOCKROOM","idx":93287,"count":112034,"meanings":[{"definitions":[{"definition":"A room where a store keeps its stock of merchandise."}],"partOfSpeech":"n"}]},{"word":"DIRECTNESS","idx":93288,"count":112034,"meanings":[{"definitions":[{"definition":"The state or quality of being direct."}],"partOfSpeech":"n"}]},{"word":"CAMERAPHONE","idx":93289,"count":112034,"meanings":[{"definitions":[{"definition":"A mobile phone with a built-in camera."}],"partOfSpeech":"n"}]},{"word":"GLUTTON","idx":93290,"count":112033,"meanings":[{"definitions":[{"definition":"One who eats voraciously, obsessively, or to excess; a gormandizer.","example":"Such a glutton would eat until his belly hurts."},{"definition":"One who consumes voraciously, obsessively, or to excess"},{"definition":"The wolverine, Gulo gulo."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To glut; to satisfy (especially an appetite) by filling to capacity."},{"definition":"To glut; to eat voraciously."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Gluttonous; greedy; gormandizing."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"glutton-uk","text":"/ˈɡlʌt(ə)n/"}]},{"word":"CHESNUT","idx":93293,"count":112031,"meanings":[{"definitions":[{"definition":"A tree or shrub of the genus Castanea."},{"definition":"The nut of this tree or shrub."},{"definition":"A dark, reddish-brown colour, as seen on the fruit of the chestnut tree."},{"definition":"A reddish-brown horse."},{"definition":"The wood of a chestnut tree."},{"definition":"An old joke; a worn-out meme, phrase, ploy, etc. so often repeated as to have grown tiresome or ineffective (often in the phrase \"old chestnut\")."},{"definition":"A round or oval horny plate found on the inner side of the leg of a horse or other animal, similar to a birthmark on a human."},{"definition":"The horse-chestnut."}],"partOfSpeech":"n"}]},{"word":"NEUROTOXIC","idx":93294,"count":112028,"meanings":[{"definitions":[{"definition":"(pharmaceutical effect) Having a toxic effect on nerve tissue."}],"partOfSpeech":"j"}]},{"word":"UNNATURALLY","idx":93309,"count":112004,"meanings":[{"definitions":[{"definition":"In an unnatural manner."}],"partOfSpeech":"v"}]},{"word":"FURRIES","idx":93311,"count":112003,"meanings":[{"definitions":[{"definition":"An animal character with human-like characteristics; most commonly refers to such characters created by members of the furry subculture.","example":"What percentage of furries are wolves?"},{"definition":"A member of the furry fandom.","example":"The furry had designed an elaborate costume."},{"definition":"Someone who roleplays or identifies with a furry character. (Compare therianthrope.)"}],"partOfSpeech":"n"}]},{"word":"ELEMENTALS","idx":93313,"count":112001,"meanings":[{"definitions":[{"definition":"(theosophy) A creature (usually a spirit) that is attuned with, or composed of, one of the classical elements: air, earth, fire and water or variations of them like ice, lightning, etc. They sometimes have unique proper names and sometimes are referred to as Air, Earth, Fire, or Water."}],"partOfSpeech":"n"}]},{"word":"SETAE","idx":93315,"count":111998,"meanings":[{"definitions":[{"definition":"A bristle or hair"},{"definition":"The stalk of a moss sporangium, or occasionally in a liverwort."}],"partOfSpeech":"n"}]},{"word":"DISQUIET","idx":93317,"count":111998,"meanings":[{"definitions":[{"definition":"Lack of quiet; absence of tranquility in body or mind"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make (someone or something) worried or anxious.","example":"He felt disquieted by the lack of interest the child had shown."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Deprived of quiet; impatient, restless, uneasy."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disquiet-us"},{"text":"/dɪsˈkwaɪət/"}]},{"word":"FINING","idx":93324,"count":111979,"meanings":[{"definitions":[{"definition":"To make finer, purer, or cleaner; to purify or clarify.","example":"to fine gold"},{"definition":"To become finer, purer, or cleaner."},{"definition":"To make finer, or less coarse, as in bulk, texture, etc.","example":"to fine the soil"},{"definition":"To change by fine gradations.","example":"to fine down a ship's lines, i.e. to diminish her lines gradually"},{"definition":"To clarify (wine and beer) by filtration."},{"definition":"To become gradually fine; to diminish; to dwindle (with away, down, or off)."},{"definition":"To issue a fine as punishment to (someone).","example":"She was fined a thousand dollars for littering, but she appealed."},{"definition":"To pay a fine."},{"definition":"To finish; to cease."},{"definition":"To cause to cease; to stop."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfaɪnɪŋ/"}]},{"word":"UNSANITARY","idx":93327,"count":111967,"meanings":[{"definitions":[{"definition":"Not sanitary; unhealthy; dirty."}],"partOfSpeech":"j"}]},{"word":"DISSOCIATE","idx":93331,"count":111956,"meanings":[{"definitions":[{"definition":"To make unrelated; to sever a connection; to separate.","example":"A number of group members wish to dissociate themselves from the majority."},{"definition":"To part; to stop associating.","example":"After the big fight, the gang totally dissociated from each other."},{"definition":"To separate compounds into simpler component parts, usually by applying heat or through electrolysis.","example":"We dissociated the lead iodide into its elements by heating"},{"definition":"To undergo dissociation."},{"definition":"To undergo dissociation.","example":"Gerald checked himself into the hospital because he was dissociating."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dissociate-uk","text":"/dɪˈsəʊ.si.eɪt/"}]},{"word":"GRAYING","idx":93332,"count":111951,"meanings":[{"definitions":[{"definition":"To become gray.","example":"My hair is beginning to gray."},{"definition":"To cause to become gray."},{"definition":"To turn progressively older, alluding to graying of hair through aging (used in context of the population of a geographic region)","example":"the graying of America"},{"definition":"To give a soft effect to (a photograph) by covering the negative while printing with a ground-glass plate."}],"partOfSpeech":"ve"}]},{"word":"DEERSKIN","idx":93333,"count":111950,"meanings":[{"definitions":[{"definition":"Leather made from deer hide.","example":"Nichole wore a pair of deerskin gloves because she said she could feel more through them."},{"definition":"The hide, whether tanned or not, of one deer.","example":"The hunter exchanged twenty deerskins for a bottle of whiskey at the trading post."},{"definition":"An article of clothing manufactured from deerskin. Often constructed in the plural.","example":"The trapper wore deerskins because they were softer than cow leather garments and rustled less than canvas."}],"partOfSpeech":"n"}]},{"word":"MIDBRAIN","idx":93338,"count":111946,"meanings":[{"definitions":[{"definition":"A part of the brain located rostral to the pons and caudal to the thalamus and the basal ganglia, composed of the tectum (dorsal portion) and the tegmentum (ventral portion)."}],"partOfSpeech":"n"}]},{"word":"SUFFICED","idx":93341,"count":111937,"meanings":[{"definitions":[{"definition":"To be enough or sufficient; to meet the need (of anything); to be adequate; to be good enough.","example":"For this plum cake, two eggs should suffice."},{"definition":"To satisfy; to content; to be equal to the wants or demands of.","example":"A joint of lamb sufficed even his enormous appetite."},{"definition":"To furnish; to supply adequately."}],"partOfSpeech":"ve"}]},{"word":"SPOTLIGHTING","idx":93344,"count":111930,"meanings":[{"definitions":[{"definition":"To illuminate with a spotlight.","example":"We spotlight the star, but the supporting cast has all the great lines in this scene."},{"definition":"To draw attention to.","example":"The news series served to spotlight corruption."}],"partOfSpeech":"ve"}]},{"word":"CORSAGES","idx":93345,"count":111927,"meanings":[{"definitions":[{"definition":"The size or shape of a person's body."},{"definition":"The waist or bodice of a woman's dress."},{"definition":"A small bouquet of flowers, originally worn attached to the bodice of a woman's dress."}],"partOfSpeech":"n"}]},{"word":"DISALLOWING","idx":93349,"count":111925,"meanings":[{"definitions":[{"definition":"To refuse to allow","example":"The prisoners were disallowed to contact with a lawyer."},{"definition":"To reject as invalid, untrue, or improper","example":"The goal was disallowed because the player was offside."}],"partOfSpeech":"ve"}]},{"word":"EXTOLLING","idx":93351,"count":111923,"meanings":[{"definitions":[{"definition":"To praise; to make high."}],"partOfSpeech":"ve"}]},{"word":"VALPROATE","idx":93353,"count":111920,"meanings":[{"definitions":[{"definition":"Any salt or ester of valproic acid."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈvæl.pɹoʊ.eɪt/"},{"text":"/ˈvæl.pɹəʊ.eɪt/"}]},{"word":"WEARIED","idx":93358,"count":111906,"meanings":[{"definitions":[{"definition":"To make or to become weary."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈwɪɹid/"},{"text":"/ˈwɪəɹid/"}]},{"word":"REBUTTED","idx":93369,"count":111888,"meanings":[{"definitions":[{"definition":"To drive back or beat back; to repulse."},{"definition":"To deny the truth of something, especially by presenting arguments that disprove it."}],"partOfSpeech":"ve"}]},{"word":"WASTELANDS","idx":93374,"count":111877,"meanings":[{"definitions":[{"definition":"A region with no remaining resources; a desert.","example":"Ten years of drought had left the area a wasteland."},{"definition":"Any barren or uninteresting place.","example":"After his experiences, he no longer found western Kansas such a wasteland."}],"partOfSpeech":"n"}]},{"word":"PITIED","idx":93375,"count":111876,"meanings":[{"definitions":[{"definition":"To feel pity for (someone or something).","example":"You have got to pity the guy - he lost his wife, mother and job in the same month."},{"definition":"To make (someone) feel pity; to provoke the sympathy or compassion of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pitied-us","text":"/ˈpɪtid/"}]},{"word":"CAROUSELS","idx":93378,"count":111866,"meanings":[{"definitions":[{"definition":"A merry-go-round (type of ride on rotating platform)."},{"definition":"A continuously revolving device for item delivery.","example":"After collecting his suitcase at the baggage carousel, he left the airport."},{"definition":"The rotating glass plate in a microwave oven."},{"definition":"A visual component that displays a horizontal series of items one at a time."},{"definition":"An equestrian discipline in which groups of riders make various formations."},{"definition":"A tilting match or tournament accompanied by games, shows, and allegorical performances."}],"partOfSpeech":"n"}]},{"word":"HAME","idx":93379,"count":111864,"meanings":[{"definitions":[{"definition":"A covering, skin, membrane."},{"definition":"Part of the harness that fits round the neck of a draught horse that the reins pass through."},{"definition":"A dwelling."},{"definition":"One’s native land; the place or country in which one dwells; the place where one’s ancestors dwell or dwelt."},{"definition":"The locality where a thing is usually found, or was first found, or where it is naturally abundant; habitat; seat.","example":"the home of the pine"},{"definition":"A focus point."},{"definition":"A directory that contains a user's files."},{"definition":"The stems of various cultivated plants, left after harvesting the crop to be used as animal litter or for thatching."},{"definition":"An individual plant stem."},{"definition":"Part of a harness; a hame."}],"partOfSpeech":"n"}]},{"word":"SIBYL","idx":93383,"count":111857,"meanings":[{"definitions":[{"definition":"A pagan female oracle or prophetess, especially the Cumaean sibyl."}],"partOfSpeech":"n"}]},{"word":"SESQUICENTENNIAL","idx":93386,"count":111844,"meanings":[{"definitions":[{"definition":"A 150th anniversary.","example":"The city celebrated its sesquicentennial last year."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Occurring every 150 years."},{"definition":"Of, or relating to a sesquicentenary."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sesquicentennial-us","text":"/ˌsɛskwɪsɛnˈtɛni.əl/"}]},{"word":"PERVASIVENESS","idx":93407,"count":111782,"meanings":[{"definitions":[{"definition":"The state or quality of being present in all parts of a particular thing or place."}],"partOfSpeech":"n"}]},{"word":"ERRING","idx":93408,"count":111781,"meanings":[{"definitions":[{"definition":"To make a mistake.","example":"He erred in his calculations, and made many mistakes."},{"definition":"To sin."},{"definition":"To stray."},{"definition":"To utter the word \"er\" when hesitating in speech, found in the phrase um and er.","example":"He ummed and erred his way through the presentation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who errs; sin."}],"partOfSpeech":"n"}]},{"word":"PICKINGS","idx":93411,"count":111775,"meanings":[{"definitions":[{"definition":"A gathering to pick fruit.","example":"We went to a strawberry picking last June."},{"definition":"(usually pluralized) Items remaining after others have selected the best; scraps, as of food."},{"definition":"(usually pluralized) Income or other gains, especially if obtained in an unscrupulous or objectionable manner."},{"definition":"Something picked or pulled out.","example":"The schoolboy flicked his nose pickings across the classroom."},{"definition":"The act of making a choice; selection."},{"definition":"The final finishing of woven fabrics by removing burs, etc."},{"definition":"The removal of defects from electrotype plates."},{"definition":"Dabbing in stoneworking."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɪkɪŋz/"}]},{"word":"ACCLAMATION","idx":93412,"count":111773,"meanings":[{"definitions":[{"definition":"A shout of approbation, favor, or assent; eager expression of approval; loud applause."},{"definition":"The act of winning an election to a post because there were no other candidates.","example":"With no one running against her, she won by acclamation."},{"definition":"A representation, in sculpture or on medals, of people expressing joy."},{"definition":"An oral vote taken without formal ballot and with much fanfare; typically an overwhelmingly affirmative vote."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æk.lə.ˈmeɪ.ʃən/"},{"audio":"acclamation-uk"}]},{"word":"BACKORDERS","idx":93420,"count":111755,"meanings":[{"definitions":[{"definition":"An order that cannot be currently filled or shipped, but is requested nonetheless for when the item becomes available again."}],"partOfSpeech":"n"}]},{"word":"NUCLIDES","idx":93429,"count":111734,"meanings":[{"definitions":[{"definition":"An atomic nucleus specified by its atomic number and atomic mass."}],"partOfSpeech":"n"}]},{"word":"RHABDOMYOLYSIS","idx":93432,"count":111730,"meanings":[{"definitions":[{"definition":"The rapid disintegration of striated muscle tissue accompanied by the excretion of myoglobin in the urine."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rhabdomyolysis-uk","text":"/ˌɹæb.də.mʌɪˈɒl.ɪs.ɪs/"}]},{"word":"UNEXPOSED","idx":93433,"count":111729,"meanings":[{"definitions":[{"definition":"That has not been exposed"}],"partOfSpeech":"j"}]},{"word":"CISTERNS","idx":93444,"count":111714,"meanings":[{"definitions":[{"definition":"A reservoir or tank for holding water, especially for catching and holding rainwater for later use."},{"definition":"In a flush toilet, the container in which the water used for flushing is held; a toilet tank."},{"definition":"A cisterna."},{"definition":"The vessel surrounding the condenser in a steam engine."}],"partOfSpeech":"n"}]},{"word":"FLOORSPACE","idx":93449,"count":111703,"meanings":[{"definitions":[{"definition":"The surface area of the floor in a building."}],"partOfSpeech":"n"}]},{"word":"DUCTUS","idx":93451,"count":111696,"meanings":[{"definitions":[{"definition":"The number of strokes that make up a written letter, and the direction, sequence and speed in which they are written. (Compare graph; see also aspect.)"},{"definition":"A subtle reduction of weight towards the middle of the stroke of the letter."},{"definition":"A duct, tube or canal in the body."}],"partOfSpeech":"n"}]},{"word":"HEADWATER","idx":93452,"count":111695,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) The source (and the initial part) of a stream"}],"partOfSpeech":"n"}]},{"word":"SOCIOPOLITICAL","idx":93453,"count":111694,"meanings":[{"definitions":[{"definition":"Of or pertaining to a combination of social and political factors.","example":"The socio-political environment in France..."}],"partOfSpeech":"j"}]},{"word":"KIST","idx":93454,"count":111691,"meanings":[{"definitions":[{"definition":"To touch with the lips or press the lips against, usually to show love or affection or passion, or as part of a greeting."},{"definition":"To (cause to) touch lightly or slightly; to come into contact.","example":"His ball kissed the black into the corner pocket."},{"definition":"Of two or more people, to touch each other's lips together, usually to express love or affection or passion."},{"definition":"To treat with fondness."},{"definition":"To place in a coffin."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A chest."},{"definition":"A coffin."}],"partOfSpeech":"n"}]},{"word":"PANOPLY","idx":93455,"count":111685,"meanings":[{"definitions":[{"definition":"A splendid display of something."},{"definition":"(by extension) A collection or display of weaponry."},{"definition":"Ceremonial garments, complete with all accessories."},{"definition":"A complete set of armour."},{"definition":"(by extension) Something that covers and protects."},{"definition":"(by extension) A broad or full range or complete set."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fit out in a suit of armour"},{"definition":"To array or bedeck"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"panoply-us","text":"/ˈpænəpli/"}]},{"word":"MAILLOT","idx":93456,"count":111683,"meanings":[{"definitions":[{"definition":"A one-piece swimsuit (for women)"},{"definition":"A leotard or tights of stretchable jersey fabric, generally worn by dancers and gymnasts."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mæˈjoʊ/"},{"audio":"maillot-uk"}]},{"word":"CREDULITY","idx":93457,"count":111679,"meanings":[{"definitions":[{"definition":"A willingness to believe in someone or something in the absence of reasonable proof; credulousness."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɹɪˈdjuːlɪti/"}]},{"word":"FANBASE","idx":93462,"count":111667,"meanings":[{"definitions":[{"definition":"The fans of a thing or person taken as a group.","example":"Building a fan base is crucial to career development of a pop musician."}],"partOfSpeech":"n"}]},{"word":"IMMOBILIZER","idx":93464,"count":111659,"meanings":[{"definitions":[{"definition":"Something or someone that immobilises."}],"partOfSpeech":"n"}]},{"word":"NITRITES","idx":93465,"count":111656,"meanings":[{"definitions":[{"definition":"Any salt or ester of nitrous acid"},{"definition":"The univalent radical -NO2, and the anion NO2-"}],"partOfSpeech":"n"}]},{"word":"HUMVEES","idx":93467,"count":111648,"meanings":[{"definitions":[{"definition":"A diesel-powered, four-wheel drive tactical military vehicle that can carry a wide variety of military hardware","example":"2003: We went out into the streets of Zafaraniya, travelling in the usual two-Humvee convoy, complete with gunners. — The New Yorker, 24 Nov 2003"}],"partOfSpeech":"n"}]},{"word":"POWERHOUSES","idx":93470,"count":111640,"meanings":[{"definitions":[{"definition":"A power station."},{"definition":"Any source of power, energy or strength.","example":"She's a powerhouse of ideas."},{"definition":"A very good hand of cards, likely to win."}],"partOfSpeech":"n"}]},{"word":"MODDER","idx":93472,"count":111628,"meanings":[{"definitions":[{"definition":"One who modifies a mass-manufactured object or software."}],"partOfSpeech":"n"}]},{"word":"GEY","idx":93474,"count":111624,"meanings":[{"definitions":[{"definition":"Fairly good; considerable."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Very."}],"partOfSpeech":"v"}]},{"word":"ASTOUND","idx":93478,"count":111623,"meanings":[{"definitions":[{"definition":"To astonish, bewilder or dazzle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Stunned; astounded; astonished."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"astound-us","text":"/əˈstaʊnd/"}]},{"word":"OVERSUPPLY","idx":93480,"count":111620,"meanings":[{"definitions":[{"definition":"An excessive supply."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply more than is needed."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əʊvəsəˈplʌɪ/"}]},{"word":"COILING","idx":93481,"count":111620,"meanings":[{"definitions":[{"definition":"To wind or reel e.g. a wire or rope into regular rings, often around a centerpiece.","example":"A simple transformer can be made by coiling two pieces of insulated copper wire around an iron heart."},{"definition":"To wind into loops (roughly) around a common center.","example":"The sailor coiled the free end of the hawser on the pier."},{"definition":"To wind cylindrically or spirally.","example":"The snake coiled itself before springing."},{"definition":"To encircle and hold with, or as if with, coils."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The pattern or motion of something that coils."},{"definition":"The process of fitting a ship with electromagnetic coils, so that it can be degaussed while travelling."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɔɪlɪŋ/"}]},{"word":"CAPUCHIN","idx":93482,"count":111619,"meanings":[{"definitions":[{"definition":"A monk in the Order of Friars Minor Capuchin; (generally) a Franciscan."},{"definition":"A garment consisting of a cloak and hood, made in imitation of the dress of Capuchin monks."},{"definition":"A capuchin monkey."},{"definition":"A hooded pigeon."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæpət͡ʃɪn/"}]},{"word":"LONGITUDES","idx":93495,"count":111587,"meanings":[{"definitions":[{"definition":"Angular distance measured west or east of the prime meridian."},{"definition":"Any imaginary line perpendicular to the equator and part of a great circle passing through the North Pole and South Pole."},{"definition":"Length."}],"partOfSpeech":"n"}]},{"word":"PLAIDS","idx":93508,"count":111543,"meanings":[{"definitions":[{"definition":"A type of twilled woollen cloth, often with a tartan or chequered pattern."},{"definition":"A length of such material used as a piece of clothing, formerly worn in the Scottish Highlands and other parts of northern Britain and remaining as an item of ceremonial dress worn by members of Scottish pipe bands."},{"definition":"The typical chequered pattern of a plaid; tartan."}],"partOfSpeech":"n"}]},{"word":"GLASSFISH","idx":93513,"count":111536,"meanings":[{"definitions":[{"definition":"Any of several unrelated small fish that have almost transparent bodies, especially those of the genera Ambassis or Chanda"}],"partOfSpeech":"n"}]},{"word":"PRECANCEROUS","idx":93516,"count":111531,"meanings":[{"definitions":[{"definition":"Of or pertaining to growth that is likely to develop into cancer"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹiˈkænsəɹəs/"}]},{"word":"MONOCULTURE","idx":93520,"count":111524,"meanings":[{"definitions":[{"definition":"The cultivation of a single crop at a time."},{"definition":"A culture or society that lacks diversity; a society marked by monoculturalism."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɒnoʊˌkʌlt͡ʃə(ɹ)/"}]},{"word":"WATERBIRDS","idx":93541,"count":111486,"meanings":[{"definitions":[{"definition":"Any bird that inhabits a freshwater environment."}],"partOfSpeech":"n"}]},{"word":"RECLASSIFICATIONS","idx":93542,"count":111486,"meanings":[{"definitions":[{"definition":"The act of reclassifying; a second or subsequent classification."}],"partOfSpeech":"n"}]},{"word":"HEMATURIA","idx":93551,"count":111462,"meanings":[{"definitions":[{"definition":"The presence of blood in the urine"}],"partOfSpeech":"n"}]},{"word":"SMOLT","idx":93553,"count":111459,"meanings":[{"definitions":[{"definition":"Bright; serene."},{"definition":"(of weather) Calm; fine; fair."},{"definition":"Smooth and shining."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A young salmon two or three years old, when it has acquired its silvery color."}],"partOfSpeech":"n"}]},{"word":"SOUPED","idx":93558,"count":111448,"meanings":[{"definitions":[{"definition":"To feed: to provide with soup or a meal."},{"definition":"To develop (film) in a (chemical) developing solution."},{"definition":"Alternative form of sup"},{"definition":"To sup or swallow."},{"definition":"To breathe out; to draw out."},{"definition":"To sweep."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(Rhode Island, Massachusetts, Connecticut) Excited."},{"definition":"In trouble or in difficulty. (Compare in the soup.)"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"souped-au"}]}]