[{"word":"CONJECTURED","idx":74515,"count":166238,"meanings":[{"definitions":[{"definition":"To guess; to venture an unproven idea.","example":"I do not know if it is true; I am simply conjecturing here."},{"definition":"To infer on slight evidence; to guess at."}],"partOfSpeech":"ve"}]},{"word":"GRANDEST","idx":74517,"count":166232,"meanings":[{"definitions":[{"definition":"Of a large size or extent; great.","example":"a grand army"},{"definition":"Great in size, and fine or imposing in appearance or impression; illustrious, dignified, magnificent.","example":"His simple vision has transformed into something far more grand."},{"definition":"Having higher rank or more dignity, size, or importance than other persons or things of the same name.","example":"The Grand Viziers of the Ottoman Empire."},{"definition":"(usually in compound forms) Standing in the second or some more remote degree of parentage or descent.","example":"grandfather, grandson, grand-child"},{"definition":"Fine; lovely.","example":"A cup of tea? That'd be grand."},{"definition":"Containing all the parts proper to a given form of composition."}],"partOfSpeech":"j"}]},{"word":"DISINCENTIVES","idx":74522,"count":166212,"meanings":[{"definitions":[{"definition":"That which discourages a particular behaviour; a deterrent."}],"partOfSpeech":"n"}]},{"word":"BARKERS","idx":74523,"count":166211,"meanings":[{"definitions":[{"definition":"Someone or something who barks.","example":"My neighbor's dog is a constant barker that keeps me awake at night."},{"definition":"A person employed to solicit customers by calling out to passersby, e.g. at a carnival.","example":"Bob had amassed a considerable stockpile of double entendres from his days working as a barker for a strip joint."},{"definition":"A shelf-talker."},{"definition":"A video game mode where the action is demonstrated to entice someone to play the game.","example":"The barker mode of the arcade video game convinced the teenager to spend a quarter."},{"definition":"A pistol."},{"definition":"The spotted redshank."},{"definition":"A person who removes needed or valuable tree bark, as on a cinnamon or cinchona plantation.","example":"The professor of barker has been made largely obsolete by the realization that in most cases saplings can be cultivated far more profitably."},{"definition":"A tanner.","example":"The profession of barker has been made largely obsolete by the introduction of more effective tanning agents, but it lives on as a surname."},{"definition":"A machine used to remove unneeded bark from wood.","example":"Run these logs through the barker so we can use them as fence posts."}],"partOfSpeech":"n"}]},{"word":"OPPORTUNISM","idx":74528,"count":166191,"meanings":[{"definitions":[{"definition":"The practice of taking advantage of any situations or people to achieve an end, often with no regard for principles or consequences."}],"partOfSpeech":"n"}]},{"word":"PURPLES","idx":74530,"count":166180,"meanings":[{"definitions":[{"definition":"A colour/color that is a dark blend of red and blue; dark magenta."},{"definition":"(colour theory) Any non-spectral colour on the line of purples on a colour chromaticity diagram or a colour wheel between violet and red."},{"definition":"Cloth, or a garment, dyed a purple colour; especially, a purple robe, worn as an emblem of rank or authority; specifically, the purple robe or mantle worn by Ancient Roman emperors as the emblem of imperial dignity.","example":"to put on the imperial purple"},{"definition":"(by extension) Imperial power, because the colour purple was worn by emperors and kings."},{"definition":"Any of various species of mollusks from which Tyrian purple dye was obtained, especially the common dog whelk."},{"definition":"The purple haze cultivar of cannabis in the kush family, either pure or mixed with others, or by extension any variety of smoked marijuana."},{"definition":"Purpura."},{"definition":"Earcockle, a disease of wheat."},{"definition":"Any of the species of large butterflies, usually marked with purple or blue, of the genus Basilarchia (formerly Limenitis).","example":"the banded purple"},{"definition":"A cardinalate."},{"definition":"A recreational drug based on cough syrup, popular in the hip-hop community in the southern United States."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To turn purple in colour."},{"definition":"To dye purple."},{"definition":"To clothe in purple."}],"partOfSpeech":"ve"}]}]