[{"word":"ACCOUNTABLE","idx":12570,"count":3501555,"meanings":[{"definitions":[{"definition":"Obliged, when called upon, to answer (for one’s deeds); answerable.","example":"Every man is accountable to God for his conduct."},{"definition":"Obliged to keep accurate records (of property or funds)."},{"definition":"Liable to be called on to render an account."},{"definition":"Capable of being accounted for; explicable; explainable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"accountable-us","text":"/ə.ˈkaʊn.tə.bəl/"}]},{"word":"THRUST","idx":12571,"count":3500671,"meanings":[{"definitions":[{"definition":"An attack made by moving the sword parallel to its length and landing with the point.","example":"Pierre was a master swordsman, and could parry the thrusts of lesser men with barely a thought."},{"definition":"A push, stab, or lunge forward (the act thereof.)","example":"The cutpurse tried to knock her satchel from her hands, but she avoided his thrust and yelled, \"Thief!\""},{"definition":"The force generated by propulsion, as in a jet engine.","example":"Spacecraft are engineering marvels, designed to resist the thrust of liftoff, as well as the reverse pressure of the void."},{"definition":"The primary effort; the goal.","example":"Ostensibly, the class was about public health in general, but the main thrust was really sex education."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make advance with force.","example":"We thrust at the enemy with our forces."},{"definition":"To force something upon someone.","example":"I asked her not to thrust the responsibility on me."},{"definition":"To push out or extend rapidly or powerfully.","example":"He thrust his arm into the icy stream and grabbed a wriggling fish, astounding the observers."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"thrust-us","text":"/θɹʌst/"}]},{"word":"PROVING","idx":12572,"count":3500329,"meanings":[{"definitions":[{"definition":"To proofread."},{"definition":"To make resistant, especially to water."},{"definition":"To allow yeast-containing dough to rise."},{"definition":"To test the activeness of yeast."},{"definition":"To demonstrate that something is true or viable; to give proof for.","example":"I will prove that my method is more effective than yours."},{"definition":"To turn out; to manifest.","example":"It proved to be a cold day."},{"definition":"To turn out to be.","example":"Have an exit strategy should your calculations prove incorrect."},{"definition":"To put to the test, to make trial of.","example":"The exception proves the rule."},{"definition":"To ascertain or establish the genuineness or validity of; to verify.","example":"to prove a will"},{"definition":"To experience."},{"definition":"To take a trial impression of; to take a proof of.","example":"to prove a page"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Experimentation to determine which substances cause which effects when ingested.","example":"a book of provings"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɹuːvɪŋ/"}]},{"word":"OPPOSING","idx":12574,"count":3498650,"meanings":[{"definitions":[{"definition":"To attempt to stop the progression of; to resist or antagonize by physical means, or by arguments, etc.; to contend against.","example":"There is still time to oppose this plan."},{"definition":"To object to.","example":"Many religious leaders oppose cloning humans."},{"definition":"To present or set up in opposition; to pose.","example":"They are opposed to any form of hierarchy."},{"definition":"To place in front of, or over against; to set opposite; to exhibit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That opposes or oppose; on the opposite side.","example":"opposing armies"}],"partOfSpeech":"j"}]},{"word":"PROD","idx":12575,"count":3498498,"meanings":[{"definitions":[{"definition":"A device (now often electrical) used to goad livestock into moving."},{"definition":"A prick or stab with such a pointed instrument."},{"definition":"A poke.","example":"\"It's your turn,\" she reminded me, giving me a prod on the shoulder."},{"definition":"A light kind of crossbow; a prodd."},{"definition":"A production.","example":"Check our BBS for the latest prods."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To poke, to push, to touch."},{"definition":"To encourage, to prompt."},{"definition":"To prick with a goad."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɹɑd/"},{"text":"/pɹɒd/"}]},{"word":"NOVICE","idx":12576,"count":3498131,"meanings":[{"definitions":[{"definition":"A beginner; one who is not very familiar or experienced in a particular subject.","example":"I'm only a novice at coding, and my programs frequently have bugs that more experienced programmers would avoid."},{"definition":"A new member of a religious order accepted on a conditional basis, prior to confirmation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnɑːvɪs/"},{"text":"/ˈnɒvɪs/"}]},{"word":"SPREADSHEET","idx":12577,"count":3496893,"meanings":[{"definitions":[{"definition":"A sheet of paper, marked with a grid, in which financial data is recorded and totals calculated manually."},{"definition":"A computer simulation of such a system of recording tabular data, with totals and other formulas calculated automatically."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To model or compute by means of a spreadsheet."}],"partOfSpeech":"ve"}]},{"word":"LOWERING","idx":12579,"count":3495906,"meanings":[{"definitions":[{"definition":"The act of one who, or that which, lours."},{"definition":"The act of something being lowered."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of sky or environment) Dark and menacing."},{"definition":"That lowers or frowns."},{"definition":"Lurking, skulking, menacing."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To frown; to look sullen."},{"definition":"To be dark, gloomy, and threatening, as clouds; of the sky: to be covered with dark and threatening clouds; to show threatening signs of approach, as a tempest."},{"definition":"To let descend by its own weight, as something suspended; to let down","example":"lower a bucket into a well"},{"definition":"To pull down","example":"to lower a flag"},{"definition":"To reduce the height of","example":"lower a chimney or turret"},{"definition":"To depress as to direction","example":"lower the aim of a gun"},{"definition":"To make less elevated","example":"to lower one's ambition, aspirations, or hopes"},{"definition":"To reduce the degree, intensity, strength, etc., of","example":"lower distilled liquors"},{"definition":"To bring down; to humble","example":"lower one's pride"},{"definition":"(lower oneself) To humble oneself; to do something one considers to be beneath one's dignity.","example":"I could never lower myself enough to buy second-hand clothes."},{"definition":"To reduce (something) in value, amount, etc.","example":"lower the interest rate"},{"definition":"To fall; to sink; to grow less; to diminish; to decrease","example":"The river lowered as rapidly as it rose."},{"definition":"To decrease in value, amount, etc."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈlaʊərɪŋ/"}]},{"word":"DELIGHTFUL","idx":12581,"count":3495221,"meanings":[{"definitions":[{"definition":"Pleasant; pleasing, bringing enjoyment, satisfaction, or pleasure."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"delightful-us","text":"[dəˈlaɪ̯t̚.fəɫ]"}]},{"word":"CANE","idx":12582,"count":3494916,"meanings":[{"definitions":[{"definition":"A plant with simple stems, like bamboo or sugar cane, or the stem thereof"},{"definition":"The stem of such a plant adapted for use as a tool"},{"definition":"A rod-shaped tool or device, somewhat like a cane"},{"definition":"Split rattan, as used in wickerwork, basketry and the like"},{"definition":"A local European measure of length; the canna."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike or beat with a cane or similar implement"},{"definition":"To destroy; to comprehensively defeat","example":"Mudchester Rovers were caned 10-0."},{"definition":"To do something well, in a competent fashion"},{"definition":"To produce extreme pain","example":"Don't hit me with that. It really canes!"},{"definition":"To make or furnish with cane or rattan.","example":"to cane chairs"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cane-us","text":"[kʰeɪn]"}]},{"word":"CRUISING","idx":12583,"count":3493890,"meanings":[{"definitions":[{"definition":"To sail about, especially for pleasure."},{"definition":"To travel at constant speed for maximum operating efficiency."},{"definition":"To move about an area leisurely in the hope of discovering something, or looking for custom."},{"definition":"To inspect (forest land) for the purpose of estimating the quantity of lumber it will yield."},{"definition":"To actively seek a romantic partner or casual sexual partner by moving about a particular area; to troll."},{"definition":"(child development) To walk while holding on to an object (stage in development of ambulation, typically occurring at 10 months)."},{"definition":"To win easily and convincingly.","example":"Germany cruised to a World Cup victory over the short-handed Australians."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sailing about without an exact destination, usually for pleasure.","example":"Cruising is a popular activity among the over-60s."},{"definition":"Walking or driving about a locality in search of a casual sex partner, especially among gay males.","example":"There was a fair amount of cruising going on at the gay party."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹuːzɪŋ/"}]},{"word":"FURY","idx":12584,"count":3493188,"meanings":[{"definitions":[{"definition":"Extreme anger."},{"definition":"Strength or violence in action."},{"definition":"An angry or malignant person."},{"definition":"A thief."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fury-1-us","text":"/ˈfjʊɹi/"}]},{"word":"PERSONALITIES","idx":12585,"count":3493064,"meanings":[{"definitions":[{"definition":"A set of non-physical psychological and social qualities that make a person (or thing) distinct from another.","example":"The president has a unique personality."},{"definition":"An assumed role or manner of behavior.","example":"In his final act, the comedian takes on a child's personality."},{"definition":"A celebrity.","example":"Johnny Carson was a respected television personality."},{"definition":"Charisma, or qualities that make a person stand out from the crowd.","example":"The best contestant shows most personality."},{"definition":"Something said or written which refers to the person, conduct, etc., of some individual, especially something of a disparaging or offensive nature; personal remarks.","example":"indulgence in personalities"},{"definition":"That quality of a law which concerns the condition, state, and capacity of persons."}],"partOfSpeech":"n"}]},{"word":"DISCOGRAPHY","idx":12586,"count":3493008,"meanings":[{"definitions":[{"definition":"Complete collection of the releases of a musical act."},{"definition":"List of all of the releases of a certain musical act, usually with release dates, and often with other information about the releases."},{"definition":"Radiography of the spine after injection of a contrast medium into a disc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"discography-us","text":"/ˌdɪsˈkɑɡɹəfi/"}]},{"word":"STIFF","idx":12587,"count":3492842,"meanings":[{"definitions":[{"definition":"An average person, usually male, of no particular distinction, skill, or education, often a working stiff or lucky stiff.","example":"A Working Stiff's Manifesto: A Memoir of Thirty Jobs I Quit, Nine That Fired Me, and Three I Can't Remember was published in 2003."},{"definition":"A person who is deceived, as a mark or pigeon in a swindle.","example":"She convinced the stiff to go to her hotel room, where her henchman was waiting to rob him."},{"definition":"A cadaver; a dead person."},{"definition":"A flop; a commercial failure."},{"definition":"A person who leaves (especially a restaurant) without paying the bill."},{"definition":"(by extension) A customer who does not leave a tip."},{"definition":"Any hard hand where it is possible to exceed 21 by drawing an additional card."},{"definition":"Negotiable instruments, possibly forged."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fail to pay that which one owes (implicitly or explicitly) to another, especially by departing hastily.","example":"Realizing he had forgotten his wallet, he stiffed the taxi driver when the cab stopped for a red light."},{"definition":"To cheat someone"},{"definition":"To tip ungenerously"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of an object) Rigid; hard to bend; inflexible."},{"definition":"(of policies and rules and their application and enforcement) Inflexible; rigid."},{"definition":"(of a person) Formal in behavior; unrelaxed."},{"definition":"Harsh, severe.","example":"He was eventually caught, and given a stiff fine."},{"definition":"(of muscles or parts of the body) Painful as a result of excessive or unaccustomed exercise.","example":"My legs are stiff after climbing that hill yesterday."},{"definition":"Potent.","example":"a stiff drink; a stiff dose; a stiff breeze."},{"definition":"Dead, deceased."},{"definition":"(of a penis) Erect."},{"definition":"(of whipping cream or egg whites) Beaten until so aerated that they stand up straight on their own.","example":"beat the egg whites until they are stiff"},{"definition":"Of an equation: for which certain numerical solving methods are numerically unstable, unless the step size is taken to be extremely small."},{"definition":"Keeping upright."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stiff-us","text":"/stɪf/"}]},{"word":"TODO","idx":12588,"count":3492686,"meanings":[{"definitions":[{"definition":"A fuss made over something.","example":"I was embarrassed that they made such a big to-do out of my birthday."},{"definition":"A task that has been noted as one that must be completed, especially on a list.","example":"I have so many to-dos, I don't know where to start."}],"partOfSpeech":"n"}]},{"word":"ENCODED","idx":12589,"count":3492618,"meanings":[{"definitions":[{"definition":"To convert (plain text) into code."},{"definition":"(communication) To convert source information into another form."},{"definition":"To constitute the code necessary for the biosynthesis of a protein by means of a matrix so as to transcribe DNA material."}],"partOfSpeech":"ve"}]},{"word":"RESEARCHING","idx":12590,"count":3490518,"meanings":[{"definitions":[{"definition":"To search or examine with continued care; to seek diligently."},{"definition":"To make an extensive investigation into."},{"definition":"To search again."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of carrying out research."}],"partOfSpeech":"n"}]},{"word":"WORE","idx":12592,"count":3490088,"meanings":[{"definitions":[{"definition":"To carry or have equipped on or about one's body, as an item of clothing, equipment, decoration, etc.","example":"He's wearing some nice pants today.  She wore her medals with pride.  Please wear your seatbelt.  Can you wear makeup and sunscreen at the same time?  He was wearing his lunch after tripping and falling into the buffet."},{"definition":"To have or carry on one's person habitually, consistently; or, to maintain in a particular fashion or manner.","example":"He wears eyeglasses.  She wears her hair in braids."},{"definition":"To bear or display in one's aspect or appearance.","example":"She wore a smile all day.  He walked out of the courtroom wearing an air of satisfaction."},{"definition":"(with \"it\") To overcome one's reluctance and endure a (previously specified) situation.","example":"I know you don't like working with him, but you'll just have to wear it."},{"definition":"To eat away at, erode, diminish, or consume gradually; to cause a gradual deterioration in; to produce (some change) through attrition, exposure, or constant use.","example":"You're going to wear a hole in the bottom of those shoes.  The water has slowly worn a channel into these rocks.  Long illness had worn the bloom from her cheeks.  Exile had worn the man to a shadow."},{"definition":"To undergo gradual deterioration; become impaired; be reduced or consumed gradually due to any continued process, activity, or use.","example":"The tiles were wearing thin due to years of children's feet."},{"definition":"To exhaust, fatigue, expend, or weary.","example":"His neverending criticism has finally worn my patience.  Toil and care soon wear the spirit.  Our physical advantage allowed us to wear the other team out and win."},{"definition":"To last or remain durable under hard use or over time; to retain usefulness, value, or desirable qualities under any continued strain or long period of time; sometimes said of a person, regarding the quality of being easy or difficult to tolerate.","example":"Don't worry, this fabric will wear. These pants will last you for years.  This color wears so well. I must have washed this sweater a thousand times.  I have to say, our friendship has worn pretty well.  It's hard to get to know him, but he wears well."},{"definition":"(in the phrase \"wearing on (someone)\") To cause annoyance, irritation, fatigue, or weariness near the point of an exhaustion of patience.","example":"Her high pitched voice is really wearing on me lately."},{"definition":"(of time) To pass slowly, gradually or tediously.","example":"wear on, wear away.  As the years wore on, we seemed to have less and less in common."},{"definition":"To bring (a sailing vessel) onto the other tack by bringing the wind around the stern (as opposed to tacking when the wind is brought around the bow); to come round on another tack by turning away from the wind. Also written \"ware\". Past: weared, or wore/worn."},{"definition":"To guard; watch; keep watch, especially from entry or invasion."},{"definition":"To defend; protect."},{"definition":"To ward off; prevent from approaching or entering; drive off; repel.","example":"to wear the wolf from the sheep"},{"definition":"To conduct or guide with care or caution, as into a fold or place of safety."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wore-us","text":"/wɔɹ/"}]},{"word":"PEDIATRICS","idx":12594,"count":3489597,"meanings":[{"definitions":[{"definition":"The branch of medicine that deals with the treatment of children."}],"partOfSpeech":"n"}]},{"word":"TRACES","idx":12595,"count":3488821,"meanings":[{"definitions":[{"definition":"An act of tracing.","example":"Your cell phone company can put a trace on your line."},{"definition":"An enquiry sent out for a missing article, such as a letter or an express package."},{"definition":"A mark left as a sign of passage of a person or animal."},{"definition":"A residue of some substance or material.","example":"There are traces of chocolate around your lips."},{"definition":"A very small amount.","example":"All of our chocolates may contain traces of nuts."},{"definition":"A current-carrying conductive pathway on a printed circuit board."},{"definition":"An informal road or prominent path in an arid area."},{"definition":"One of two straps, chains, or ropes of a harness, extending from the collar or breastplate to a whippletree attached to a vehicle or thing to be drawn; a tug."},{"definition":"A connecting bar or rod, pivoted at each end to the end of another piece, for transmitting motion, especially from one plane to another; specifically, such a piece in an organ stop action to transmit motion from the trundle to the lever actuating the stop slider."},{"definition":"(fortification) The ground plan of a work or works."},{"definition":"The intersection of a plane of projection, or an original plane, with a coordinate plane."},{"definition":"The sum of the diagonal elements of a square matrix."},{"definition":"(grammar) An empty category occupying a position in the syntactic structure from which something has been moved, used to explain constructions such as wh-movement and the passive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To follow the trail of."},{"definition":"To follow the history of."},{"definition":"To draw or sketch lightly or with care.","example":"He carefully traced the outlines of the old building before him."},{"definition":"To copy onto a sheet of paper superimposed over the original, by drawing over its lines."},{"definition":"To copy; to imitate."},{"definition":"To walk; to go; to travel."},{"definition":"To walk over; to pass through; to traverse."},{"definition":"To follow the execution of the program by making it to stop after every instruction, or by making it print a message after every step."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"traces-us","text":"/ˈtɹeɪsɪz/"}]},{"word":"RABBI","idx":12596,"count":3488700,"meanings":[{"definitions":[{"definition":"A Jewish scholar or teacher of halacha (Jewish law), capable of making halachic decisions."},{"definition":"A Jew who is or is qualified to be the leader of a Jewish congregation."},{"definition":"(police) A senior officer who acts as a mentor."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rabbi-us","text":"/ˈɹæ.baɪ/"}]},{"word":"SUSHI","idx":12597,"count":3488691,"meanings":[{"definitions":[{"definition":"A Japanese dish made of small portions of sticky white rice flavored with vinegar, usually wrapped in seaweed and filled or topped with fish, vegetables or meat.","example":"For the vegetarians, she served cucumber sushi."},{"definition":"Raw fish, especially as a Japanese dish."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsuʃi/"}]},{"word":"PUFFY","idx":12598,"count":3488647,"meanings":[{"definitions":[{"definition":"Swollen or inflated in shape, as if filled with air; pillow-like."},{"definition":"Coming or exhaling in puffs.","example":"A puffy fat man in a tracksuit came jogging around the corner."},{"definition":"Speaking or writing in an exaggeratedly eloquent and self-important manner."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpʌfi/"}]},{"word":"ASAP","idx":12599,"count":3488320,"meanings":[{"definitions":[{"definition":"As soon as is possible; at one's earliest convenience; at the earliest possible time."}],"partOfSpeech":"v"}]},{"word":"HEADINGS","idx":12601,"count":3488165,"meanings":[{"definitions":[{"definition":"The title or topic of a document, article, chapter, or of a section thereof."},{"definition":"The direction into which a seagoing or airborne vessel's bow is pointing (apparent heading) and/or the direction into which it is actually moving relative to the ground (true heading)"},{"definition":"Material for the heads of casks, barrels, etc."},{"definition":"A gallery, drift, or adit in a mine; also, the end of a drift or gallery; the vein above a drift."},{"definition":"The extension of a line ruffling above the line of stitch."},{"definition":"The end of a stone or brick which is presented outward."},{"definition":"(flags) A strip of material at the hoist end of a flag, used for attaching the flag to its halyard."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɛdɪŋz/"}]},{"word":"ENTHUSIASTS","idx":12602,"count":3487179,"meanings":[{"definitions":[{"definition":"A person filled with or guided by enthusiasm."},{"definition":"A person exhibiting over-zealous religious fervour."}],"partOfSpeech":"n"}]},{"word":"RIDICULOUS","idx":12603,"count":3486556,"meanings":[{"definitions":[{"definition":"Deserving of ridicule; foolish; absurd.","example":"It's ridiculous to charge so much for a little souvenir."},{"definition":"Astonishing; unbelievable.","example":"Gaines is a classic motor player with a low center of gravity and ridiculous strength."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ridiculous-us","text":"/ɹiːˈdɪkjʊləs/"}]},{"word":"SCATTERING","idx":12604,"count":3485873,"meanings":[{"definitions":[{"definition":"To (cause to) separate and go in different directions; to disperse.","example":"The crowd scattered in terror."},{"definition":"To distribute loosely as by sprinkling.","example":"Her ashes were scattered at the top of a waterfall."},{"definition":"To deflect (radiation or particles)."},{"definition":"To occur or fall at widely spaced intervals."},{"definition":"To frustrate, disappoint, and overthrow.","example":"to scatter hopes or plans"},{"definition":"To be dispersed upon.","example":"Desiccated stalks scattered the fields."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A small quantity of something occurring at irregular intervals and dispersed at random points,","example":"There will be a scattering of showers, with heavy rain in places."},{"definition":"(elections) The total number of votes awarded to nonmajor or unlisted candidates."},{"definition":"The process whereby a beam of waves or particles is dispersed by collisions or similar interactions."}],"partOfSpeech":"n"}]},{"word":"SECRETARIES","idx":12605,"count":3484723,"meanings":[{"definitions":[{"definition":"Someone entrusted with a secret; a confidant."},{"definition":"A person who keeps records, takes notes and handles general clerical work."},{"definition":"(often capitalized) The head of a department of government."},{"definition":"A managerial or leading position in certain non-profit organizations, such as political parties, trade unions, international organizations.","example":"Ban Ki-Moon was a secretary general of the United Nations."},{"definition":"A type of desk, secretary desk; a secretaire."},{"definition":"A secretary bird, a bird of the species Sagittarius serpentarius."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To serve as a secretary of."}],"partOfSpeech":"ve"}]},{"word":"ONSITE","idx":12606,"count":3484653,"meanings":[{"definitions":[{"definition":"On or at a site."}],"partOfSpeech":"j"},{"definitions":[{"definition":"On or at a site."}],"partOfSpeech":"v"}]},{"word":"CONTRACTED","idx":12608,"count":3484408,"meanings":[{"definitions":[{"definition":"To draw together or nearer; to shorten, narrow, or lessen.","example":"The snail's body contracted into its shell."},{"definition":"(grammar) To shorten by omitting a letter or letters or by reducing two or more vowels or syllables to one.","example":"The word \"cannot\" is often contracted into \"can't\"."},{"definition":"To enter into a contract with."},{"definition":"To enter into, with mutual obligations; to make a bargain or covenant for."},{"definition":"To make an agreement or contract; to covenant; to agree; to bargain.","example":"to contract for carrying the mail"},{"definition":"To bring on; to incur; to acquire.","example":"She contracted the habit of smoking in her teens."},{"definition":"To gain or acquire (an illness)."},{"definition":"To draw together so as to wrinkle; to knit."},{"definition":"To betroth; to affiance."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Arranged by contract; established by agreement."},{"definition":"Made smaller by contraction."},{"definition":"Incurred; acquired."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"contracted-us","text":"/kənˈtɹæktɪd/"}]},{"word":"ELBOW","idx":12609,"count":3484326,"meanings":[{"definitions":[{"definition":"The joint between the upper arm and the forearm."},{"definition":"(by extension) Any turn or bend like that of the elbow, in a wall, building, coastline, etc.; an angular or jointed part of any structure, such as the raised arm of a chair or sofa, or a short pipe fitting, turning at an angle or bent.","example":"the sides of windows, where the jamb makes an elbow with the window back"},{"definition":"A detective."},{"definition":"Part of a basketball court located at the intersection of the free-throw line and the free-throw lane."},{"definition":"A hit with the elbow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To push with the elbow.","example":"He elbowed his way through the crowd."},{"definition":"(by extension) To nudge, jostle or push."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"elbow-us","text":"/ˈɛl.boʊ/"}]},{"word":"FIGHTS","idx":12610,"count":3483909,"meanings":[{"definitions":[{"definition":"To contend in physical conflict, either singly or in war, battle etc.","example":"A wounded animal will fight like a maniac, relentless, savage and murderous."},{"definition":"To contend in physical conflict with each other, either singly or in war, battle etc.","example":"The two boxers have been fighting for more than half an hour."},{"definition":"To strive for something; to campaign or contend for success.","example":"He fought for the Democrats in the last election."},{"definition":"To conduct or engage in (battle, warfare etc.).","example":"The battle was fought just over that hill."},{"definition":"To engage in combat with; to oppose physically, to contest with.","example":"My grandfather fought the Nazis in World War II."},{"definition":"To try to overpower; to fiercely counteract.","example":"The government pledged to fight corruption."},{"definition":"To cause to fight; to manage or manoeuvre in a fight.","example":"to fight cocks; to fight one's ship"},{"definition":"Of colours or other design elements: to clash; to fail to harmonize."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An occasion of fighting.","example":"One of them got stuck in a chokehold and got stabbed to death during the fight."},{"definition":"A battle between opposing armies."},{"definition":"A physical confrontation or combat between two or more people or groups.","example":"Watch your language, are you looking for a fight?"},{"definition":"A boxing or martial arts match.","example":"I'm going to Nick’s to watch the big fight tomorrow night."},{"definition":"A conflict, possibly nonphysical, with opposing ideas or forces; strife.","example":"I'll put up a fight to save this company."},{"definition":"The will or ability to fight.","example":"That little guy has a bit of fight in him after all.   As soon as he saw the size of his opponent, all the fight went out of him."},{"definition":"A screen for the combatants in ships."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/faɪts/"}]},{"word":"DELETING","idx":12611,"count":3483887,"meanings":[{"definitions":[{"definition":"To remove, get rid of or erase, especially written or printed material, or data on a computer or other device."}],"partOfSpeech":"ve"}]},{"word":"COMPILATIONS","idx":12612,"count":3482030,"meanings":[{"definitions":[{"definition":"The act or process of compiling or gathering together from various sources."},{"definition":"That which is compiled; especially, a book or document composed of materials gathering from other books or documents."},{"definition":"Translation of source code into object code by a compiler."}],"partOfSpeech":"n"}]},{"word":"THERAPISTS","idx":12613,"count":3481142,"meanings":[{"definitions":[{"definition":"Someone who provides therapy, usually professionally."}],"partOfSpeech":"n"}]},{"word":"APPEALING","idx":12614,"count":3480503,"meanings":[{"definitions":[{"definition":"To call upon another to decide a question controverted, to corroborate a statement, to vindicate one's rights, etc."},{"definition":"To call on (someone) for aid","example":"I appeal to all of you to help the orphans."},{"definition":"(informal elsewhere) To apply for the removal of a cause from an inferior to a superior judge or court for the purpose of reexamination or for decision."},{"definition":"To be attractive.","example":"That idea appeals to me."},{"definition":"To ask an umpire for a decision on whether a batsman is out or not, usually by saying \"How's that\" or \"Howzat\"."},{"definition":"To accuse (someone of something)."},{"definition":"To summon; to challenge."},{"definition":"To invoke (used with to)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of making an appeal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having appeal; attractive."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈpi.lɪŋ/"},{"text":"/əˈpiː.lɪŋ/"}]},{"word":"SCHOLARLY","idx":12615,"count":3479874,"meanings":[{"definitions":[{"definition":"Characteristic of a scholar."},{"definition":"Of or relating to scholastics or scholarship."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a scholarly manner"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"scholarly-uk"}]},{"word":"DETAILING","idx":12616,"count":3479450,"meanings":[{"definitions":[{"definition":"Something small enough to escape casual notice.","example":"Note this fine detail in the lower left corner."},{"definition":"A profusion of details.","example":"This etching is full of fine detail."},{"definition":"The small things that can escape casual notice."},{"definition":"Something considered trivial enough to ignore.","example":"I don't concern myself with the details of accounting."},{"definition":"A person's name, address and other personal information.","example":"The arresting officer asked the suspect for his details."},{"definition":"(law enforcement) A temporary unit or assignment."},{"definition":"An individual feature, fact, or other item, considered separately from the whole of which it is a part."},{"definition":"A narrative which relates minute points; an account which dwells on particulars."},{"definition":"A selected portion of a painting"},{"definition":"Ornamentation on something that has been constructed.","example":"a dress with elaborate neck detailings"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To explain in detail.","example":"I'll detail the exact procedure to you later."},{"definition":"To clean carefully (particularly of road vehicles) (always pronounced. /ˈdiːteɪl/)","example":"We need to have the minivan detailed."},{"definition":"To assign to a particular task"}],"partOfSpeech":"ve"}]},{"word":"STARK","idx":12617,"count":3479265,"meanings":[{"definitions":[{"definition":"Hard, firm; obdurate."},{"definition":"Severe; violent; fierce (now usually in describing the weather)."},{"definition":"Strong; vigorous; powerful."},{"definition":"Stiff, rigid."},{"definition":"Plain in appearance; barren, desolate.","example":"I picked my way forlornly through the stark, sharp rocks."},{"definition":"Complete, absolute, full.","example":"A flower was growing, in stark contrast, out of the sidewalk."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Starkly; entirely, absolutely","example":"He's gone stark, staring mad."}],"partOfSpeech":"v"},{"definitions":[{"definition":"To stiffen."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stark-us","text":"/stɑɹk/"}]},{"word":"LIFESTYLES","idx":12618,"count":3479186,"meanings":[{"definitions":[{"definition":"A style of living that reflects the attitudes and values of a person or group."},{"definition":"The totality of the likes and dislikes of a particular section of the market, especially when expressed in terms of the products and services that they would buy; a marketing strategy based on the self-image of such a group."}],"partOfSpeech":"n"}]},{"word":"DST","idx":12620,"count":3479167,"meanings":[{"definitions":[{"definition":"The act of destining or appointing."},{"definition":"Purpose for which anything is destined; predetermined end, object, or use; ultimate design."},{"definition":"The place set for the end of a journey, or to which something is sent; place or point aimed at."}],"partOfSpeech":"n"}]},{"word":"STRONGEST","idx":12621,"count":3478166,"meanings":[{"definitions":[{"definition":"Capable of producing great physical force.","example":"a big strong man; Jake was tall and strong"},{"definition":"Capable of withstanding great physical force.","example":"a strong foundation; good strong shoes"},{"definition":"(of water, wind, etc.) Having a lot of power.","example":"The man was nearly drowned after a strong undercurrent swept him out to sea."},{"definition":"Determined; unyielding.","example":"He is strong in the face of adversity."},{"definition":"Highly stimulating to the senses.","example":"a strong light; a strong taste"},{"definition":"Having an offensive or intense odor or flavor.","example":"a strong smell"},{"definition":"Having a high concentration of an essential or active ingredient.","example":"a strong cup of coffee; a strong medicine"},{"definition":"(specifically) Having a high alcoholic content.","example":"a strong drink"},{"definition":"(grammar) Inflecting in a different manner than the one called weak, such as Germanic verbs which change vowels.","example":"a strong verb"},{"definition":"That completely ionizes into anions and cations in a solution.","example":"a strong acid;  a strong base"},{"definition":"Not easily subdued or taken.","example":"a strong position"},{"definition":"Having wealth or resources.","example":"a strong economy"},{"definition":"Impressive, good.","example":"You're working with troubled youth in your off time? That’s strong!"},{"definition":"Having a specified number of people or units.","example":"The enemy's army force was five thousand strong."},{"definition":"(of a disease or symptom) Severe; very bad or intense."},{"definition":"Having a wide range of logical consequences; widely applicable. (Often contrasted with a weak statement which it implies.)"},{"definition":"(of an argument) Convincing."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"strongest-us","text":"/ˈstɹɔŋɡəst/"}]},{"word":"SWIMWEAR","idx":12623,"count":3476745,"meanings":[{"definitions":[{"definition":"Items of clothing appropriate for swimming"}],"partOfSpeech":"n"}]},{"word":"PADDED","idx":12624,"count":3476722,"meanings":[{"definitions":[{"definition":"To stuff."},{"definition":"To furnish with a pad or padding."},{"definition":"To increase the size of, especially by adding undesirable filler.","example":"May 21, 2008, Austin American-Statesman"},{"definition":"To imbue uniformly with a mordant.","example":"to pad cloth"},{"definition":"To deliberately play the ball with the leg pad instead of the bat."},{"definition":"To travel along (a road, path etc.)."},{"definition":"To travel on foot."},{"definition":"To wear a path by walking."},{"definition":"To walk softly, quietly or steadily, especially without shoes."},{"definition":"To practise highway robbery."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having padding."}],"partOfSpeech":"j"}]},{"word":"APPLET","idx":12625,"count":3476474,"meanings":[{"definitions":[{"definition":"A small program module that runs under the control of a larger application, typically a web browser"}],"partOfSpeech":"n"}]},{"word":"CIRCA","idx":12627,"count":3475462,"meanings":[{"definitions":[{"definition":"Approximately, about, around (typically in relation to time)","example":"Julius Caesar visited this area circa 50 BC."}],"partOfSpeech":"pr"}],"phonetics":[{"text":"/ˈsɝkə/"},{"text":"/ˈsɜːkə/"}]},{"word":"REVISE","idx":12628,"count":3475221,"meanings":[{"definitions":[{"definition":"A review or a revision."},{"definition":"A second proof sheet; a proof sheet taken after the first or a subsequent correction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look at again, to reflect on."},{"definition":"To review, alter and amend, especially of written material.","example":"This statute should be revised."},{"definition":"To look over again (something previously written or learned), especially in preparation for an examination.","example":"2008, Tom Burns, Sandra Sinfield, Chapter 19: How to build your memory and revise effectively, Essential Study Skills: The Complete Guide to Success at University, SAGE Publications, UK, page 273."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"revise-us","text":"/ɹɪˈvaɪ̯z/"},{"audio":"revise-au","text":"/ɹɪˈvaɪ̯z/"}]},{"word":"CONTRIBUTES","idx":12629,"count":3474637,"meanings":[{"definitions":[{"definition":"To give something that is or becomes part of a larger whole.","example":"to contribute articles to a journal"}],"partOfSpeech":"ve"}]},{"word":"THREESOMES","idx":12630,"count":3474230,"meanings":[{"definitions":[{"definition":"A group of three people or things."},{"definition":"An instance of sexual activity involving three people."}],"partOfSpeech":"n"}]},{"word":"SURROUNDINGS","idx":12631,"count":3473796,"meanings":[{"definitions":[{"definition":"An outlying area; area in proximity to something"},{"definition":"An environment"},{"definition":"The area surrounding someone or something, together with the objects and circumstances in the vicinity; the environment or ambiance."},{"definition":"All parts of the universe that are not within the thermodynamic system of interest."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"surroundings-us","text":"/səˈɹaʊndɪŋz/"}]},{"word":"PROFICIENCY","idx":12632,"count":3473626,"meanings":[{"definitions":[{"definition":"Ability, skill, competence.","example":"a test of proficiency in English"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɹəˈfɪʃənsi/"}]},{"word":"URANIUM","idx":12634,"count":3471336,"meanings":[{"definitions":[{"definition":"The element with atomic number 92 and symbol U: a radioactive silvery-grey metal in the actinide series."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"uranium-us","text":"/jʊˈɹeɪniəm/"}]},{"word":"HONOURS","idx":12635,"count":3471334,"meanings":[{"definitions":[{"definition":"Recognition of importance or value; respect; veneration (of someone, usually for being morally upright or successful)","example":"The crowds gave the returning general much honor and praise."},{"definition":"The state of being morally upright, honest, noble, virtuous, and magnanimous; excellence of character; the perception of such a state; favourable reputation; dignity","example":"He was a most perfect knight, for he had great honor and chivalry."},{"definition":"A token of praise or respect; something that represents praiseworthiness or respect, such as a prize or award given by the state to a citizen","example":"Audie Murphy received many honors, such as the Distinguished Service Cross."},{"definition":"A privilege","example":"I had the honour of dining with the ambassador."},{"definition":"(in the plural) the privilege of going first","example":"I'll let you have the honours, Bob—go ahead."},{"definition":"A cause of respect and fame; a glory; an excellency; an ornament.","example":"He is an honour to his nation."},{"definition":"(feudal law) a seigniory or lordship held of the king, on which other lordships and manors depended"},{"definition":"The center point of the upper half of an armorial escutcheon (compare honour point)"},{"definition":"In bridge, an ace, king, queen, jack, or ten especially of the trump suit. In some other games, an ace, king, queen or jack."},{"definition":"(in the plural) (courses for) an honours degree: a university qualification of the highest rank","example":"At university I took honours in modern history."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To think of highly, to respect highly; to show respect for; to recognise the importance or spiritual value of","example":"The freedom fighters will be forever remembered and honored by the people."},{"definition":"To conform to, abide by, act in accordance with (an agreement, treaty, promise, request, or the like)","example":"I trusted you, but you have not honored your promise."},{"definition":"To confer (bestow) an honour or privilege upon (someone)","example":"Ten members of the profession were honored at the ceremony."},{"definition":"To make payment in respect of (a cheque, banker's draft, etc.)","example":"I'm sorry Sir, but the bank did not honour your cheque."}],"partOfSpeech":"ve"}]},{"word":"CONSOLIDATE","idx":12636,"count":3471334,"meanings":[{"definitions":[{"definition":"To combine into a single unit; to group together or join.","example":"He consolidated his luggage into a single large bag."},{"definition":"To make stronger or more solid."},{"definition":"To pay off several debts with a single loan."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Formed into a solid mass; made firm; consolidated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"consolidate-us"},{"text":"/kənˈsɒlɪdeɪt/"}]},{"word":"BILLIONS","idx":12638,"count":3471276,"meanings":[{"definitions":[{"definition":"(modern British & Australian, short scale) a thousand million (logic: 1,000 × 1,000^2): 1 followed by nine zeros, 109; a milliard"},{"definition":"(British & Australian, long scale) A million million (logic: 1,000,000^2): a 1 followed by twelve zeros; 1012"},{"definition":"An unspecified very large number.","example":"There were billions of people at the concert."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɪljənz/"}]},{"word":"HUT","idx":12639,"count":3471098,"meanings":[{"definitions":[{"definition":"A small, simple one-storey dwelling or shelter, often with just one room, and generally built of readily available local materials.","example":"a thatched hut; a mud hut; a shepherd’s hut"},{"definition":"A small wooden shed.","example":"a groundsman’s hut"},{"definition":"A small stack of grain."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide (someone) with shelter in a hut.","example":"to hut troops in winter quarters"},{"definition":"To take shelter in a hut."},{"definition":"To stack (sheaves of grain)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hut-us","text":"/hʌt/"}]},{"word":"ANTIGEN","idx":12641,"count":3470196,"meanings":[{"definitions":[{"definition":"A substance that induces an immune response, usually foreign."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"antigen-us"}]},{"word":"ULTRASOUND","idx":12642,"count":3469808,"meanings":[{"definitions":[{"definition":"Sound with a frequency greater than the upper limit of human hearing, which is approximately 20 kilohertz."},{"definition":"The use of ultrasonic waves for diagnostic or therapeutic purposes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat with ultrasound."}],"partOfSpeech":"ve"}]},{"word":"PROCEDURAL","idx":12645,"count":3467397,"meanings":[{"definitions":[{"definition":"A type of literature, film, or television program involving a sequence of technical detail."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Related to procedure.","example":"The judge dismissed the case on procedural grounds: it wasn't the facts or the law, but just that they hadn't filed the correct forms."},{"definition":"Generated by means of a procedure, rather than being designed.","example":"a procedural texture; procedural terrain"}],"partOfSpeech":"j"}]},{"word":"LABRADOR","idx":12646,"count":3467068,"meanings":[{"definitions":[{"definition":"A Labrador retriever."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlæb.ɹə.dɔɹ/"},{"text":"/ˈlæb.ɹə.dɔː(ɹ)/"}]},{"word":"REFUSAL","idx":12647,"count":3466381,"meanings":[{"definitions":[{"definition":"The act of refusing."},{"definition":"Depth or point at which well or borehole drilling cannot continue."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"refusal-us","text":"/ɹɪˈfjuːzl̩/"}]},{"word":"SUPPRESSION","idx":12649,"count":3465258,"meanings":[{"definitions":[{"definition":"The act or instance of suppressing."},{"definition":"The state of being suppressed."},{"definition":"A process in which a person consciously excludes anxiety-producing thoughts, feelings, or memories."},{"definition":"(of an eye) A subconscious adaptation by a person's brain to eliminate the symptoms of disorders of binocular vision such as strabismus, convergence insufficiency and aniseikonia."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"suppression-us","text":"/səˈpɹɛʃən/"}]},{"word":"WEAVER","idx":12650,"count":3464764,"meanings":[{"definitions":[{"definition":"One who weaves."},{"definition":"A strand of material used in weaving."},{"definition":"A weaverbird."},{"definition":"An aquatic beetle of the genus Gyrinus."},{"definition":"Certain fish of the family Pinguipedidae"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwi.vɚ/"},{"text":"/ˈwiː.və(ɹ)/"}]},{"word":"READINESS","idx":12652,"count":3464199,"meanings":[{"definitions":[{"definition":"The state or degree of being ready; preparedness."},{"definition":"Willingness."}],"partOfSpeech":"n"}]},{"word":"SECULAR","idx":12653,"count":3463905,"meanings":[{"definitions":[{"definition":"A secular ecclesiastic, or one not bound by monastic rules."},{"definition":"A church official whose functions are confined to the vocal department of the choir."},{"definition":"A layman, as distinguished from a clergyman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not specifically religious; lay or civil, as opposed to clerical."},{"definition":"Temporal; worldly, or otherwise not based on something timeless."},{"definition":"Not bound by the vows of a monastic order.","example":"secular clergy in Catholicism"},{"definition":"Happening once in an age or century.","example":"The secular games of ancient Rome were held to mark the end of a saeculum and the beginning of the next."},{"definition":"Continuing over a long period of time, long-term.","example":"The long-term growth in population and income accounts for most secular trends in economic phenomena."},{"definition":"Centuries-old, ancient."},{"definition":"Relating to long-term non-periodic irregularities, especially in planetary motion or magnetic field."},{"definition":"(atomic physics) Unperturbed over time."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"secular-us","text":"/ˈsɛkjələɹ/"}]},{"word":"MACROS","idx":12654,"count":3463828,"meanings":[{"definitions":[{"definition":"A comparatively human-friendly abbreviation of complex input to a computer program.","example":"The preprocessor expands any embedded macros into source code before it is compiled."},{"definition":"Macro lens"},{"definition":"The study of the entire economy in terms of the total amount of goods and services produced, total income earned, the level of employment of productive resources, and the general behavior of prices."},{"definition":"Any of the elements required in large amounts by all living things."}],"partOfSpeech":"n"}]},{"word":"MAJESTY","idx":12655,"count":3463329,"meanings":[{"definitions":[{"definition":"The quality of being impressive and great.","example":"the majesty of the Great Pyramids"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"majesty-us","text":"/ˈmædʒ.əs.ti/"}]},{"word":"FISHERY","idx":12657,"count":3461156,"meanings":[{"definitions":[{"definition":"Fishing: the catching, processing and marketing of fish or other seafood."},{"definition":"A place related to fishing, particularly:"},{"definition":"A right to fish in a particular location; Territorial fishing waters."},{"definition":"A fishing company."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɪʃəɹi/"}]},{"word":"DISTRIBUTING","idx":12659,"count":3460996,"meanings":[{"definitions":[{"definition":"To divide into portions and dispense.","example":"He distributed the bread amongst his followers."},{"definition":"To supply to retail outlets.","example":"The agency distributes newspapers to local shops."},{"definition":"To deliver or pass out.","example":"A network of children distributes flyers to every house."},{"definition":"To scatter or spread.","example":"I raked the soil then distributed grass seed."},{"definition":"To apportion (more or less evenly).","example":"The robot's six legs distributed its weight over a wide area."},{"definition":"To classify or separate into categories.","example":"The database distributed verbs into transitive and intransitive segments."},{"definition":"To be distributive."},{"definition":"To separate (type which has been used) and return it to the proper boxes in the cases."},{"definition":"To spread (ink) evenly, as upon a roller or a table."},{"definition":"To employ (a term) in its whole extent; to take as universal in one premise."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"distributing-us","text":"/dɪsˈtɹɪbjutɪŋ/"}]},{"word":"ESTIMATING","idx":12660,"count":3460789,"meanings":[{"definitions":[{"definition":"To calculate roughly, often from imperfect data."},{"definition":"To judge and form an opinion of the value of, from imperfect data."}],"partOfSpeech":"ve"}]},{"word":"OUTDATED","idx":12661,"count":3459713,"meanings":[{"definitions":[{"definition":"Out of date, old-fashioned, antiquated.","example":"His outdated wordprocessing software could not read the files I sent."},{"definition":"Out of date; not the latest; obsolete.","example":"Your version of the document is outdated."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/aʊtˈdeɪtɪd/"}]},{"word":"ADVISORIES","idx":12663,"count":3458840,"meanings":[{"definitions":[{"definition":"A warning.","example":"The Coast Guard issued a small craft advisory, warning little boats to watch out for bad weather."}],"partOfSpeech":"n"}]},{"word":"DUES","idx":12664,"count":3458564,"meanings":[{"definitions":[{"definition":"Deserved acknowledgment.","example":"Give him his due — he is a good actor."},{"definition":"(in plural dues) A membership fee."},{"definition":"That which is owed; debt; that which belongs or may be claimed as a right; whatever custom, law, or morality requires to be done, duty."},{"definition":"Right; just title or claim."},{"definition":"Membership fees."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/duz/"},{"text":"/djuːz/"}]},{"word":"PEWTER","idx":12665,"count":3458542,"meanings":[{"definitions":[{"definition":"An alloy of approximately 93–98% tin, 1–2% copper, and the balance of antimony."},{"definition":"An alloy of tin and lead."},{"definition":"Items made of pewter; pewterware."},{"definition":"A beer tankard made from pewter."},{"definition":"A dark, dull grey colour, like that of the metal."},{"definition":"Prize money."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To coat with pewter."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a dark, dull grey colour, like that of the metal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pewter-uk","text":"/ˈpjuːtə/"}]},{"word":"DISTRESS","idx":12668,"count":3457884,"meanings":[{"definitions":[{"definition":"(Cause of) discomfort."},{"definition":"Serious danger."},{"definition":"An aversive state of stress to which a person cannot fully adapt."},{"definition":"A seizing of property without legal process to force payment of a debt."},{"definition":"The thing taken by distraining; that which is seized to procure satisfaction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause strain or anxiety to someone."},{"definition":"To retain someone’s property against the payment of a debt; to distrain."},{"definition":"To treat a new object to give it an appearance of age.","example":"She distressed the new media cabinet so that it fit with the other furniture in the room."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"distress-us","text":"/dɪˈstɹɛs/"}]},{"word":"PUMPKIN","idx":12669,"count":3457437,"meanings":[{"definitions":[{"definition":"A domesticated plant, in species Cucurbita pepo, similar in growth pattern, foliage, flower, and fruit to the squash or melon."},{"definition":"The round yellow or orange fruit of this plant."},{"definition":"The color of the fruit of the pumpkin plant."},{"definition":"Any of a number of cultivars from the genus Cucurbita; known in the US as winter squash."},{"definition":"A term of endearment for someone small and cute."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pumpkin-us","text":"/ˈpʌmpkɪn/"},{"audio":"pumpkin-au","text":"/ˈpʌmpkɪn/"}]},{"word":"NOTABLY","idx":12670,"count":3457363,"meanings":[{"definitions":[{"definition":"(focus) As a pointed example; in a notable manner."}],"partOfSpeech":"v"}]},{"word":"INTENDS","idx":12671,"count":3457058,"meanings":[{"definitions":[{"definition":"(usually followed by the particle \"to\") To hope; to wish (something, or something to be accomplished); be intent upon","example":"He intends to go to university."},{"definition":"To fix the mind on; attend to; take care of; superintend; regard."},{"definition":"To stretch to extend; distend."},{"definition":"To strain; make tense."},{"definition":"To intensify; strengthen."},{"definition":"To apply with energy."},{"definition":"To bend or turn; direct, as one’s course or journey."},{"definition":"To design mechanically or artistically; fashion; mold."},{"definition":"To pretend; counterfeit; simulate."}],"partOfSpeech":"ve"}]},{"word":"HOMOSEXUAL","idx":12673,"count":3454221,"meanings":[{"definitions":[{"definition":"A person who is attracted solely or primarily to others of the same sex."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a person or animal) Possessing sexual and/or emotional attraction towards members of the same sex. Examples being a male androphile or a female gynephile. (Sometimes used in the sense of sole/exclusive attraction.)"},{"definition":"(of a romantic or sexual act or relationship) Between two people of the same gender-area; gay.","example":"My sister is currently in a homosexual relationship with a girl in her class."},{"definition":"Intended for or used by homosexuals, as a nightclub, a bar, etc."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"homosexual-us","text":"/ˌhoʊmoʊˈsɛkʃuːəl/"},{"audio":"homosexual-uk","text":"/ˌhɒməʊˈsɛksjuːəl/"}]},{"word":"GARMENT","idx":12674,"count":3454166,"meanings":[{"definitions":[{"definition":"A single item of clothing."},{"definition":"Short for temple garment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clothe in a garment."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡɑɹ.mənt/"},{"text":"/ˈɡɑː.mənt/"}]},{"word":"BILINGUAL","idx":12676,"count":3453570,"meanings":[{"definitions":[{"definition":"A person who is able to use two languages."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the ability to speak two languages."},{"definition":"Spoken or written in two different languages.","example":"a bilingual dictionary"},{"definition":"Characterized by the use or presence of two languages.","example":"bilingual education"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/baɪˈlɪŋ.ɡju.əl/"}]},{"word":"BARBECUE","idx":12677,"count":3453189,"meanings":[{"definitions":[{"definition":"A fireplace or pit for grilling food, typically used outdoors and traditionally employing hot charcoal as the heating medium.","example":"We cooked our food on the barbecue."},{"definition":"A meal or event highlighted by food cooked in such an apparatus.","example":"We're having a barbecue on Saturday, and you're invited."},{"definition":"Meat, especially pork or beef, which has been cooked in such an apparatus (i.e. smoked over indirect heat from high-smoke fuels) and then chopped up or shredded.","example":"She ordered a plate of barbecue with a side of slaw."},{"definition":"A hog, ox, or other large animal roasted or broiled whole for a feast."},{"definition":"A floor on which coffee beans are sun-dried."},{"definition":"A framework of sticks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook food on a barbecue; to smoke it over indirect heat from high-smoke fuels."},{"definition":"To grill."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"barbecue-us","text":"/ˈbɑɹbɪˌkju/"}]},{"word":"LOCALIZATION","idx":12678,"count":3452676,"meanings":[{"definitions":[{"definition":"The act of localizing."},{"definition":"The state of being localized."},{"definition":"A systematic method of adding multiplicative inverses to a ring."},{"definition":"A ring of fractions of a given ring, such that the complement of the set of allowed denominators is an ideal."}],"partOfSpeech":"n"}]},{"word":"SUPPLYING","idx":12679,"count":3452542,"meanings":[{"definitions":[{"definition":"To provide (something), to make (something) available for use.","example":"to supply money for the war"},{"definition":"To furnish or equip with.","example":"to supply a furnace with fuel; to supply soldiers with ammunition"},{"definition":"To fill up, or keep full.","example":"Rivers are supplied by smaller streams."},{"definition":"To compensate for, or make up a deficiency of."},{"definition":"To serve instead of; to take the place of."},{"definition":"To act as a substitute."},{"definition":"To fill temporarily; to serve as substitute for another in, as a vacant place or office; to occupy; to have possession of.","example":"to supply a pulpit"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"supplying-us","text":"/səˈplaɪ.ɪŋ/"}]},{"word":"SECONDLY","idx":12680,"count":3452503,"meanings":[{"definitions":[{"definition":"In the second place."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈsɛk.(ə)ndli/"},{"text":"/ˈsɛkəndli/"}]},{"word":"RAZOR","idx":12681,"count":3451657,"meanings":[{"definitions":[{"definition":"A keen-edged knife of peculiar shape, used in shaving the hair from the face or other parts of the body."},{"definition":"Any tool or instrument designed for shaving."},{"definition":"The sharp tusk of a wild boar."},{"definition":"A conceptual device that allows one to shave away unlikely explanations for a phenomenon.","example":"Occam's razor, Hanlon's razor"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shave with a razor."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"razor-us","text":"/ˈɹeɪzə/"}]},{"word":"COUGH","idx":12682,"count":3451640,"meanings":[{"definitions":[{"definition":"A sudden, usually noisy expulsion of air from the lungs, often involuntary.","example":"Behind me, I heard a distinct, dry cough."},{"definition":"A condition that causes one to cough; a tendency to cough.","example":"Sorry, I can't come to work today – I've got a nasty cough."},{"definition":"Used to focus attention on a following utterance, often a euphemism or an attribution of blame","example":"He was – cough – indisposed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To push air from the lungs in a quick, noisy explosion.","example":"I breathed in a lungful of smoke by mistake, and started to cough."},{"definition":"(sometimes followed by \"up\") To force something out of the throat or lungs by coughing.","example":"Sometimes she coughed (up) blood."},{"definition":"To make a noise like a cough.","example":"The engine coughed and sputtered."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cough-us","text":"/kɔf/"}]},{"word":"CEREBRAL","idx":12683,"count":3451100,"meanings":[{"definitions":[{"definition":"Of, or relating to the brain, cerebrum, or cerebral cortex."},{"definition":"Intellectual rather than emotional."},{"definition":"Retroflex."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cerebral-1-us","text":"/səˈɹiː.bɹəl/"}]},{"word":"GRANDMA","idx":12684,"count":3450933,"meanings":[{"definitions":[{"definition":"Grandmother"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹænmɑː/"}]},{"word":"CUSTOMIZATION","idx":12685,"count":3450194,"meanings":[{"definitions":[{"definition":"The act of customizing something."}],"partOfSpeech":"n"}]},{"word":"GIGS","idx":12686,"count":3449514,"meanings":[{"definitions":[{"definition":"A performing engagement by a musical group; or, generally, any job or role, especially for a musician or performer.","example":"Hey, when are we gonna get that hotel gig again?"},{"definition":"(by extension) Any job; especially one that is temporary; or alternately, one that is very desirable.","example":"Hey, that guy's got a great gig over at the bike shop. He hardly works all day"},{"definition":"A forked spear for catching fish, frogs, or other small animals."},{"definition":"A two-wheeled horse-drawn carriage."},{"definition":"(South England) A six-oared sea rowing boat commonly found in Cornwall and the Isles of Scilly."},{"definition":"An open boat used to transport the captain of a ship, the captain's gig."},{"definition":"A demerit received for some infraction of military dress or deportment codes.","example":"I received gigs for having buttons undone."},{"definition":"Clipped form of gigabyte.","example":"My new computer has over 500 gigs of hard drive space."},{"definition":"Any unit having the SI prefix giga-"},{"definition":"A playful or wanton girl; a giglot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish or catch with a gig, or fish spear."},{"definition":"To engage in musical performances.","example":"The Stones were gigging around Richmond at the time"},{"definition":"To make fun of; to make a joke at someone's expense, often condescending.","example":"His older cousin was just gigging him about being in love with that girl from school."},{"definition":"To impose a demerit for an infraction of a dress or deportment code.","example":"His sergeant gigged him for an unmade bunk."},{"definition":"To engender."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɪɡz/"}]},{"word":"INDEXING","idx":12687,"count":3449511,"meanings":[{"definitions":[{"definition":"To arrange an index for something, especially a long text."},{"definition":"To inventory, to take stock."},{"definition":"To normalise in order to account for inflation; to correct for inflation by linking to a price index in order to maintain real levels."},{"definition":"To be indexical for (some situation or state of affairs); to indicate."},{"definition":"To access a value in a data container by an index."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A system used to assign indexes.","example":"In zero-based indexing, array variables in a computer program are numbered upwards from zero."}],"partOfSpeech":"n"}]},{"word":"OCEANS","idx":12689,"count":3449148,"meanings":[{"definitions":[{"definition":"One of the large bodies of water separating the continents."},{"definition":"Water belonging to an ocean.","example":"The island is surrounded by ocean"},{"definition":"An immense expanse; any vast space or quantity without apparent limits.","example":"an ocean of affairs"},{"definition":"A blue colour, like that of the ocean (also called ocean blue)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"oceans-uk"}]},{"word":"DISPLACEMENT","idx":12690,"count":3448688,"meanings":[{"definitions":[{"definition":"The act of displacing, or the state of being displaced; a putting out of place."},{"definition":"The quantity of a liquid displaced by a floating body, as water by a ship, the weight of the displaced liquid being equal to that of the displacing body."},{"definition":"The process of extracting soluble substances from organic material and the like, whereby a quantity of saturated solvent is displaced, or removed, for another quantity of the solvent."},{"definition":"Moving the target to avoid an attack; dodging."},{"definition":"A vector quantity which denotes distance with a directional component."},{"definition":"(grammar) The capability of a communication system to refer to things that are not present (that existed or will exist at another time, or that exist at another location)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"displacement-uk","text":"/dɪsˈpleɪsmɪnt/"}]},{"word":"SPACECRAFT","idx":12691,"count":3448191,"meanings":[{"definitions":[{"definition":"A vehicle that travels through space."}],"partOfSpeech":"n"}]},{"word":"BACKWARDS","idx":12693,"count":3447629,"meanings":[{"definitions":[{"definition":"Oriented toward the back.","example":"The battleship had three backwards guns at the stern, in addition to the primary complement."},{"definition":"Reversed.","example":"The backwards lettering on emergency vehicles makes it possible to read in the rear-view mirror."},{"definition":"Behind current trends or technology.","example":"Modern medicine regards the use of leeches as a backwards practice."},{"definition":"Clumsy, inept, or inefficient, especially in learning.","example":"He was a very backwards scholar, but he was a marvel on the football field."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Toward the back.","example":"Life is lived forwards, but understood backwards.—Søren Kierkegaard"},{"definition":"In the opposite direction to usual.","example":"The clock did not work because the battery was inserted backwards."},{"definition":"In a manner such that the back precedes the front.","example":"The tour guide walked backwards while droning on to the bored seniors."},{"definition":"Towards the past; ago"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈbæk.wə(ɹ)dz/"}]},{"word":"ARROWS","idx":12694,"count":3447386,"meanings":[{"definitions":[{"definition":"A projectile consisting of a shaft, a point and a tail with stabilizing fins that is shot from a bow."},{"definition":"A sign or symbol used to indicate a direction (e.g. →)."},{"definition":"A directed edge."},{"definition":"A dart."},{"definition":"The -> symbol, which has specific meanings in various programming languages."},{"definition":"The inflorescence or tassel of a mature sugar cane plant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move swiftly and directly (like an arrow)"},{"definition":"To let fly swiftly and directly"},{"definition":"(of a sugar cane plant) To develop an inflorescence."},{"definition":"To navigate using the arrow keys.","example":"Arrow left until you reach the start of the text you want to delete."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɛɹ.oʊz/"},{"text":"/ˈæɹ.əʊz/"}]},{"word":"VOLUNTEERING","idx":12695,"count":3447271,"meanings":[{"definitions":[{"definition":"To enlist oneself as a volunteer."},{"definition":"To do or offer to do something voluntarily.","example":"to volunteer for doing the dishes"},{"definition":"To offer, usually unprompted.","example":"to volunteer an explanation"},{"definition":"To grow without human sowing or intentional cultivation."},{"definition":"To offer the services of (someone else) to do something.","example":"My sister volunteered me to do the dishes."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of volunteering; the action of the verb volunteer"}],"partOfSpeech":"n"}]},{"word":"TELECOMMUNICATION","idx":12697,"count":3446799,"meanings":[{"definitions":[{"definition":"The science and technology of the communication of messages over a distance using electric, electronic or electromagnetic impulses."},{"definition":"A message so transmitted."},{"definition":"(in the plural) Systems used in transmitting such signals."}],"partOfSpeech":"n"}]},{"word":"PRESUMABLY","idx":12698,"count":3446073,"meanings":[{"definitions":[{"definition":"Able to be sensibly presumed","example":"Presumably, he will attend the opening."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"presumably-us","text":"/pɹɪˈzuːməbli/"}]},{"word":"COATINGS","idx":12699,"count":3446023,"meanings":[{"definitions":[{"definition":"A thin outer layer.","example":"They painted on a coating to protect it from the weather."},{"definition":"Cloth for making coats."},{"definition":"A telling-off; a reprimand."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkoʊtɪŋz/"},{"text":"/ˈkəʊtɪŋz/"}]},{"word":"EUREKA","idx":12700,"count":3445857,"meanings":[{"definitions":[{"definition":"An alloy of copper and nickel whose resistivity is constant over a wide temperature range"}],"partOfSpeech":"n"},{"definitions":[{"definition":"An exclamation indicating sudden discovery.","example":"1821: Eureka! I have found it! What I mean / To say is, not that love is idleness, / But that in love such idleness has been / An accessory, as I have cause to guess. — Byron, Don Juan, 1821"}],"partOfSpeech":"i"}],"phonetics":[{"text":"/juˈɹikə/"}]},{"word":"PLEA","idx":12701,"count":3445286,"meanings":[{"definitions":[{"definition":"An appeal, petition, urgent prayer or entreaty.","example":"a plea for mercy"},{"definition":"An excuse; an apology."},{"definition":"That which is alleged or pleaded, in defense or in justification."},{"definition":"That which is alleged by a party in support of his cause."},{"definition":"An allegation of fact in a cause, as distinguished from a demurrer."},{"definition":"The defendant’s answer to the plaintiff’s declaration and demand."},{"definition":"A cause in court; a lawsuit; as, the Court of Common Pleas."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To plead; to argue."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"plea-uk","text":"/pliː/"}]},{"word":"CONSTRUCTIVE","idx":12702,"count":3445093,"meanings":[{"definitions":[{"definition":"Relating to or causing construction."},{"definition":"Carefully considered and meant to be helpful."},{"definition":"Imputed by law; created to give legal effect to something for equitable reasons, as with constructive notice or a constructive trust."},{"definition":"Not direct or expressed, but inferred."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kənˈstɹʌktɪv/"}]},{"word":"BUNDLES","idx":12703,"count":3444807,"meanings":[{"definitions":[{"definition":"A group of objects held together by wrapping or tying.","example":"a bundle of straw or of paper; a bundle of old clothes"},{"definition":"A package wrapped or tied up for carrying."},{"definition":"A group of products or services sold together as a unit.","example":"This software bundle includes a wordprocessor, a spreadsheet, and two games."},{"definition":"A large amount, especially of money.","example":"The inventor of that gizmo must have made a bundle."},{"definition":"A cluster of closely bound muscle or nerve fibres."},{"definition":"A sequence of two or more words that occur in language with high frequency but are not idiomatic; a chunk, cluster, or lexical bundle.","example":"examples of bundles would include \"in accordance with\", \"the results of\" and \"so far\""},{"definition":"(Mac OS X) A directory containing related resources such as source code; application bundle."},{"definition":"A quantity of paper equal to two reams (1000 sheets)."},{"definition":"A court bundle, the assemblage of documentation prepared for, and referred to during, a court case."},{"definition":"Topological space composed of a base space and fibers projected to the base space."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tie or wrap together into a bundle."},{"definition":"To hustle; to dispatch something or someone quickly."},{"definition":"To prepare for departure; to set off in a hurry or without ceremony; used with away, off, out."},{"definition":"To dress someone warmly."},{"definition":"To dress warmly. Usually bundle up"},{"definition":"To sell hardware and software as a single product."},{"definition":"To hurry."},{"definition":"To hastily or clumsily push, put, carry or otherwise send something into a particular place."},{"definition":"To sleep on the same bed without undressing."},{"definition":"(often with 'on') To jump into a dogpile."},{"definition":"To pile on, to overwhelm in other senses."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bundles-us"}]},{"word":"PREPAREDNESS","idx":12707,"count":3443760,"meanings":[{"definitions":[{"definition":"The state of being prepared.","example":"preparedness for an exam"},{"definition":"Precautionary measures in the face of potential disasters."}],"partOfSpeech":"n"}]},{"word":"PRES","idx":12708,"count":3443513,"meanings":[{"definitions":[{"definition":"To precum, to pre-ejaculate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A preparty."},{"definition":"The act of presenting, or something presented"},{"definition":"A dramatic performance"},{"definition":"An award given to someone on a special occasion"},{"definition":"Money given as a wedding gift."},{"definition":"A lecture or speech given in front of an audience"},{"definition":"The symptoms and other possible indications of disease, trauma, etc., that are exhibited by a patient who has sought, or has otherwise come to, the attention of a physician, e.g., \"Thirty-four-year-old male presented in the emergency room with slight fever, dilated pupils, and marked disorientation.\""},{"definition":"The position of the foetus in the uterus at birth"},{"definition":"Offering one's blade for engagement by the opponent"},{"definition":"The specification of a group by generators and relators."},{"definition":"The act or right of offering a clergyman to the bishop or ordinary for institution in a benefice."},{"definition":"The preparation of antigen fragments during the immune response"}],"partOfSpeech":"n"}]},{"word":"ISLES","idx":12709,"count":3443470,"meanings":[{"definitions":[{"definition":"A wing of a building, notably in a church separated from the nave proper by piers."},{"definition":"A clear path through rows of seating."},{"definition":"A clear corridor in a supermarket with shelves on both sides containing goods for sale."},{"definition":"Any path through an otherwise obstructed space."},{"definition":"Seat in public transport, such as a plane, train or bus, that's beside the aisle.","example":"Do you want to seat window or aisle?"},{"definition":"An idiomatic divide between the Republican Party and the Democratic Party, who are said to be on two sides of the aisle."},{"definition":"A (small) island, compare with islet."}],"partOfSpeech":"n"}]},{"word":"STRETCHING","idx":12710,"count":3443172,"meanings":[{"definitions":[{"definition":"The act by which something is stretched."},{"definition":"A form of physical exercise in which a specific skeletal muscle (or muscle group) is deliberately elongated to its fullest length in order to improve the muscle's felt elasticity and reaffirm comfortable muscle tone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lengthen by pulling.","example":"I stretched the rubber band until it almost broke."},{"definition":"To lengthen when pulled.","example":"The rubber band stretched almost to the breaking point."},{"definition":"To pull tight.","example":"First, stretch the skin over the frame of the drum."},{"definition":"To get more use than expected from a limited resource.","example":"I managed to stretch my coffee supply a few more days."},{"definition":"To make inaccurate by exaggeration.","example":"To say crossing the street was brave is stretching the meaning of \"brave\" considerably."},{"definition":"To extend physically, especially from limit point to limit point.","example":"The beach stretches from Cresswell to Amble."},{"definition":"To extend one’s limbs or another part of the body in order to improve the elasticity of one's muscles","example":"Cats stretch with equal ease and agility beyond the point that breaks a man on the rack."},{"definition":"To extend to a limit point","example":"His mustache stretched all the way to his sideburns."},{"definition":"To increase."},{"definition":"To stretch the truth; to exaggerate.","example":"a man apt to stretch in his report of facts"},{"definition":"To sail by the wind under press of canvas.","example":"The ship stretched to the eastward."},{"definition":"To execute by hanging."},{"definition":"To make great demands on the capacity or resources of something."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Requiring a high level of effort or performance."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈstɹɛtʃɪŋ/"}]},{"word":"OVENS","idx":12711,"count":3443150,"meanings":[{"definitions":[{"definition":"A chamber used for baking or heating."}],"partOfSpeech":"n"}]},{"word":"SYSTEMIC","idx":12712,"count":3442940,"meanings":[{"definitions":[{"definition":"Embedded within and spread throughout and affecting a whole system, group, body, economy, market, or society."},{"definition":"Pertaining to an entire organism."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"systemic-us"}]},{"word":"PLAYOFFS","idx":12715,"count":3441571,"meanings":[{"definitions":[{"definition":"A final game in a series needed to break a tie."},{"definition":"A short series of games to select a league champion."}],"partOfSpeech":"n"}]},{"word":"ABUNDANT","idx":12716,"count":3441495,"meanings":[{"definitions":[{"definition":"Fully sufficient; found in copious supply; in great quantity; overflowing.","example":"[W]ith their magical words they [poets] bring forth to our eyesight the abundant images and beauties of creation. — Leigh Hunt, On the Realities of Imagination"},{"definition":"Richly supplied; wealthy; possessing in great quantity.","example":"Abundant in goodness and truth. — Exodus, 34:6"},{"definition":"Being an abundant number, i.e. less than the sum of all of its divisors except itself."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"abundant-us","text":"/əˈbn̩.dn̩t/"}]},{"word":"DEDUCTIBLE","idx":12717,"count":3440538,"meanings":[{"definitions":[{"definition":"An amount of expenses that must be paid out of pocket before an insurer will pay further expenses."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Eligible to be deducted."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[dɪˈdʊktəbəɫ]"}]},{"word":"ADAPTORS","idx":12718,"count":3440007,"meanings":[{"definitions":[{"definition":"One who is capable of adapting to differing situations.","example":"He was an able adapter, and could easily adjust to the differences when the company changed ownership."},{"definition":"One who adapts a thing, e.g. a play.","example":"The critic gave rave reviews to the adapter of the ancient play, who worked to give the text more relevance to the modern day."},{"definition":"A device or application used to achieve operative compatibility between devices that otherwise are incompatible.","example":"He had an adapter that let him plug his phone into the car's cigarette lighter for power."}],"partOfSpeech":"n"}]},{"word":"PRIESTS","idx":12719,"count":3439634,"meanings":[{"definitions":[{"definition":"A religious clergyman (clergywoman, clergyperson) who is trained to perform services or sacrifices at a church or temple","example":"The Israelite priests were descended from Moses' brother Aaron."},{"definition":"A blunt tool, used for quickly stunning and killing fish"},{"definition":"The highest office in the Aaronic priesthood"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ordain as a priest."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"priests-us","text":"/ˈpɹiːsts/"}]},{"word":"ACCOMPANY","idx":12720,"count":3439497,"meanings":[{"definitions":[{"definition":"To go with or attend as a companion or associate; to keep company with; to go along with.","example":"Geoffrey accompanied the group on their pilgrimage."},{"definition":"To supplement with; add to."},{"definition":"To perform an accompanying part or parts in a composition."},{"definition":"To perform an accompanying part next to (another instrument or musician).","example":"I will accompany her on the oboe."},{"definition":"To associate in a company; to keep company."},{"definition":"To cohabit (with)."},{"definition":"To cohabit with; to coexist with; occur with."},{"definition":"To be found at the same time.","example":"Thunder almost always accompanies lightning during a rain storm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"accompany-us","text":"/ə.ˈkʌm.pə.ni/"}]},{"word":"COMPARES","idx":12721,"count":3439141,"meanings":[{"definitions":[{"definition":"Comparison."},{"definition":"An instruction or command that compares two values."},{"definition":"Illustration by comparison; simile."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To assess the similarities and differences between two or more things [\"to compare X with Y\"]. Having made the comparison of X with Y, one might have found it similar to Y or different from Y.","example":"Compare the tiger's coloration with that of the zebra."},{"definition":"To declare two things to be similar in some respect [\"to compare X to Y\"].","example":"Astronomers have compared comets to dirty snowballs."},{"definition":"(grammar) To form the three degrees of comparison of (an adjective).","example":"We compare \"good\" as \"good\", \"better\", \"best\"."},{"definition":"To be similar (often used in the negative).","example":"A sapling and a fully-grown oak tree do not compare."},{"definition":"To get; to obtain."}],"partOfSpeech":"ve"}]},{"word":"FORECASTING","idx":12722,"count":3438703,"meanings":[{"definitions":[{"definition":"To estimate how something will be in the future.","example":"to forecast a rise in prices"},{"definition":"To foreshadow; to suggest something in advance."},{"definition":"To contrive or plan beforehand."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A forecast or prediction."}],"partOfSpeech":"n"}]},{"word":"HESITATE","idx":12723,"count":3438637,"meanings":[{"definitions":[{"definition":"To stop or pause respecting decision or action; to be in suspense or uncertainty as to a determination.","example":"He hesitated whether to accept the offer or not; men often hesitate in forming a judgment."},{"definition":"To stammer; to falter in speaking."},{"definition":"To utter with hesitation or to intimate by a reluctant manner."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhɛzɪteɪt/"}]},{"word":"INSPIRING","idx":12724,"count":3438173,"meanings":[{"definitions":[{"definition":"To infuse into the mind; to communicate to the spirit; to convey, as by a divine or supernatural influence; to disclose preternaturally; to produce in, as by inspiration."},{"definition":"To infuse into; to affect, as with a superior or supernatural influence; to fill with what animates, enlivens or exalts; to communicate inspiration to.","example":"Elders should inspire children with sentiments of virtue."},{"definition":"To draw in by the operation of breathing; to inhale."},{"definition":"To infuse by breathing, or as if by breathing."},{"definition":"To breathe into; to fill with the breath; to animate."},{"definition":"To spread rumour indirectly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Inspiration"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Providing inspiration; encouraging; stimulating."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪn.ˈspaɪ(ə)ɹɪŋ/"}]},{"word":"SPECIALIZE","idx":12725,"count":3438151,"meanings":[{"definitions":[{"definition":"To make distinct or separate, particularly:"},{"definition":"To become distinct or separate, particularly:"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈspɛʃəˌlaɪz/"}]},{"word":"PREY","idx":12726,"count":3437872,"meanings":[{"definitions":[{"definition":"Anything, as goods, etc., taken or got by violence; anything taken by force from an enemy in war"},{"definition":"That which is or may be seized by animals or birds to be devoured; hence, a person given up as a victim."},{"definition":"A living thing that is eaten by another living thing.","example":"The rabbit was eaten by the coyote, so the rabbit is the coyote's prey."},{"definition":"The act of devouring other creatures; ravage."},{"definition":"The victim of a disease."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a predator."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prey-us","text":"/pɹeɪ/"}]},{"word":"DEPOSITION","idx":12727,"count":3437780,"meanings":[{"definitions":[{"definition":"The removal of someone from office."},{"definition":"The act of depositing material, especially by a natural process; the resultant deposit."},{"definition":"The production of a thin film of material onto an existing surface."},{"definition":"The process of taking sworn testimony out of court; the testimony so taken."},{"definition":"The formation of snow or frost directly from water vapor."},{"definition":"The transformation of a gas into a solid without an intermediate liquid phase (reverse of sublimation)"},{"definition":"The formal placement of relics in a church or shrine, and the feast day commemorating it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɛpəˈzɪʃən/"}]},{"word":"TAS","idx":12730,"count":3436669,"meanings":[{"definitions":[{"definition":"A heap, pile."},{"definition":"A cup or cupful."},{"definition":"An Oriental silk fabric, with gold or silver thread."},{"definition":"A piece of armor for the thighs, forming an appendage to the ancient corselet. Usually the tasse was a plate of iron swinging from the cuirass, but the skirts of sliding splints were also called by this name."}],"partOfSpeech":"n"}]},{"word":"ZODIAC","idx":12731,"count":3436050,"meanings":[{"definitions":[{"definition":"The belt-like region of the celestial sphere approximately eight degrees north and south of the ecliptic which include the apparent path of the sun, moon, and visible planets."},{"definition":"The twelve equal divisions of the zodiacal region into signs or houses, each named for a prominent constellation in the region."},{"definition":"The ecliptic: the belt-like region of the celestial sphere corresponding to the apparent path of the sun over the course of a year."},{"definition":"Any of various astrological systems considered similar to the above."},{"definition":"A circle decorated with the signs of the zodiac."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈzoʊ.dɪ.æk/"},{"text":"/ˈzəʊ.dɪ.æk/"}]},{"word":"PAVEMENT","idx":12732,"count":3435844,"meanings":[{"definitions":[{"definition":"(now chiefly in technical contexts) A paved surface; a hard covering on the ground."},{"definition":"The paved part of a road or other thoroughfare; the roadway."},{"definition":"A paved footpath, especially at the side of a road."},{"definition":"The interior flooring of a church sanctuary, between the communion rail and the altar."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pavement-uk","text":"/ˈpeɪvmənt/"}]},{"word":"TUBING","idx":12735,"count":3435220,"meanings":[{"definitions":[{"definition":"To supply with, or enclose in, a tube.","example":"She tubes lipstick in the cosmetics factory."},{"definition":"To ride an inner tube.","example":"They tubed down the Colorado River."},{"definition":"To intubate.","example":"The patient was tubed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Tubes, considered as a group"},{"definition":"A length of tube, or a system of tubes"},{"definition":"The recreation of riding down a river on an inner tube"},{"definition":"The recreation of tobogganing down a snowy slope or toboggan run on an inner tube"}],"partOfSpeech":"n"}]},{"word":"PEDESTRIAN","idx":12737,"count":3434750,"meanings":[{"definitions":[{"definition":"A walker; one who walks or goes on foot, especially as opposed to one who uses a vehicle."},{"definition":"Specifically, an expert or professional walker or runner; one who performs feats of walking or running."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or intended for those who are walking.","example":"pedestrian crossing"},{"definition":"Ordinary, dull; everyday; unexceptional.","example":"His manner of dress was pedestrian but tidy."},{"definition":"Pertaining to ordinary, everyday movements incorporated in postmodern dance.","example":"The choreographer prefers pedestrian movements."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pedestrian-us","text":"/pəˈdɛst.ɹi.ən/"}]},{"word":"FENCING","idx":12738,"count":3434739,"meanings":[{"definitions":[{"definition":"To enclose, contain or separate by building fence."},{"definition":"To defend or guard."},{"definition":"To engage in the selling or buying of stolen goods."},{"definition":"To engage in the sport of fencing."},{"definition":"To jump over a fence."},{"definition":"To conceal the truth by giving equivocal answers; to hedge; to be evasive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The art or sport of duelling with swords, especially with the 17th- to 18th-century European dueling swords and the practice weapons descended from them (sport fencing)"},{"definition":"Material used to make fences, fences used as barriers or an enclosure.","example":"Fencing was erected around the field to keep the horses in."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɛnsɪŋ/"}]},{"word":"ARTERY","idx":12740,"count":3434468,"meanings":[{"definitions":[{"definition":"An efferent blood vessel from the heart, conveying blood away from the heart regardless of oxygenation status; see pulmonary artery."},{"definition":"A major transit corridor."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"artery-us","text":"/ˈɑɹ.təɹɪ/"}]},{"word":"CONDITIONER","idx":12741,"count":3434323,"meanings":[{"definitions":[{"definition":"Anything that improves the condition of something"},{"definition":"Hair conditioner"},{"definition":"Fabric conditioner, fabric softener"},{"definition":"Someone who trains athletes or racehorses"},{"definition":"An agricultural machine that crimps and crushes newly cut hay to promote faster and more even drying."}],"partOfSpeech":"n"}]},{"word":"PLAINTIFFS","idx":12742,"count":3433271,"meanings":[{"definitions":[{"definition":"A party bringing a suit in civil law against a defendant; accusers."}],"partOfSpeech":"n"}]},{"word":"INLET","idx":12743,"count":3433125,"meanings":[{"definitions":[{"definition":"To let in; admit."},{"definition":"To insert; inlay."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A body of water let into a coast, such as a bay, cove, fjord or estuary."},{"definition":"A passage that leads into a cavity."}],"partOfSpeech":"n"}]},{"word":"RUB","idx":12744,"count":3432829,"meanings":[{"definitions":[{"definition":"An act of rubbing.","example":"Give that lamp a good rub and see if any genies come out"},{"definition":"A difficulty or problem."},{"definition":"A quip or sarcastic remark."},{"definition":"In the game of crown green bowls, any obstacle by which a bowl is diverted from its normal course."},{"definition":"Any substance designed to be applied by rubbing.","example":"a heat rub intended for muscular strains"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move (one object) while maintaining contact with another object over some area, with pressure and friction.","example":"I rubbed my hands together for warmth."},{"definition":"To rub something against (a second thing).","example":"I rubbed the glass with the cloth."},{"definition":"To be rubbed against something.","example":"My shoes are beginning to rub."},{"definition":"To spread a substance thinly over; to smear.","example":"meat rubbed with spices before barbecuing"},{"definition":"To move or pass with difficulty.","example":"to rub through woods, as huntsmen"},{"definition":"To scour; to burnish; to polish; to brighten; to cleanse; often with up or over.","example":"to rub up silver"},{"definition":"To hinder; to cross; to thwart."},{"definition":"(bowls) To touch the jack with the bowl."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rub-us","text":"/ɹʌb/"}]},{"word":"VIOLATE","idx":12745,"count":3432718,"meanings":[{"definitions":[{"definition":"To break or disregard (a rule or convention).","example":"Accessing unauthorized files violates security protocol."},{"definition":"To rape."},{"definition":"To cite (a person) for a parole violation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"violate-us","text":"/ˈvaɪəˌleɪt/"}]},{"word":"STIMULATE","idx":12746,"count":3432622,"meanings":[{"definitions":[{"definition":"To encourage into action."},{"definition":"To arouse an organism to functional activity."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stimulate-us","text":"/ˈstɪmjʊleɪt/"}]},{"word":"REALISE","idx":12747,"count":3432591,"meanings":[{"definitions":[{"definition":"To make real; to convert from the imaginary or fictitious into reality; to bring into real existence","example":"The objectives of the project were never fully realized."},{"definition":"To become aware of (a fact or situation, especially of something that has been true for a long time).","example":"He realized that he had left his umbrella on the train."},{"definition":"To cause to seem real; to sense vividly or strongly; to make one's own in thought or experience."},{"definition":"To acquire as an actual possession; to obtain as the result of plans and efforts; to gain; to get","example":"to realize large profits from a speculation"},{"definition":"To convert any kind of property into money, especially property representing investments, such as shares, bonds, etc.","example":"By realizing the company's assets, the liquidator was able to return most of the shareholders' investments."},{"definition":"To convert into real property; to make real estate of."},{"definition":"To turn an abstract linguistic object into actual language, especially said of a phoneme's conversion into speech sound.","example":"The southern /v/ is realized as the voiced approximant [ʋ]."}],"partOfSpeech":"ve"}]},{"word":"FLUIDS","idx":12748,"count":3432473,"meanings":[{"definitions":[{"definition":"Any substance which can flow with relative ease, tends to assume the shape of its container, and obeys Bernoulli's principle; a liquid, gas or plasma."},{"definition":"A liquid (as opposed to a solid or gas)."},{"definition":"(specifically, typically in the plural) Intravenous fluids."}],"partOfSpeech":"n"}]},{"word":"CONVENIENTLY","idx":12749,"count":3432407,"meanings":[{"definitions":[{"definition":"In a convenient manner, form, or situation; without difficulty."}],"partOfSpeech":"v"}]},{"word":"LICK","idx":12750,"count":3431970,"meanings":[{"definitions":[{"definition":"The act of licking; a stroke of the tongue.","example":"The cat gave its fur a lick."},{"definition":"The amount of some substance obtainable with a single lick.","example":"Give me a lick of ice cream."},{"definition":"A quick and careless application of anything, as if by a stroke of the tongue.","example":"a lick of paint"},{"definition":"A place where animals lick minerals from the ground.","example":"The birds gathered at the clay lick."},{"definition":"A small watercourse or ephemeral stream. It ranks between a rill and a stream.","example":"We used to play in the lick."},{"definition":"A stroke or blow.","example":"Hit that wedge a good lick with the sledgehammer."},{"definition":"A small amount; a whit.","example":"I didn't do a lick of work today."},{"definition":"An attempt at something."},{"definition":"A short motif.","example":"There are some really good blues licks in this solo."},{"definition":"A rate of speed. (Always qualified by good, fair, or a similar adjective.)","example":"The bus was travelling at a good lick when it swerved and left the road."},{"definition":"An act of cunnilingus.","example":"You up for a lick tonight?"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stroke with the tongue.","example":"The cat licked its fur."},{"definition":"To lap; to take in with the tongue.","example":"She licked the last of the honey off the spoon before washing it."},{"definition":"To beat with repeated blows."},{"definition":"To defeat decisively, particularly in a fight.","example":"My dad can lick your dad."},{"definition":"To overcome.","example":"I think I can lick this."},{"definition":"To perform cunnilingus."},{"definition":"To do anything partially."},{"definition":"(of flame, waves etc.) To lap."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lick-us","text":"/lɪk/"}]},{"word":"GOV","idx":12752,"count":3431706,"meanings":[{"definitions":[{"definition":"(abbreviation, shortened form) Governor."},{"definition":"(abbreviation, shortened form) Government."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gov-au","text":"/ɡʌv/"}]},{"word":"STEALTH","idx":12753,"count":3431519,"meanings":[{"definitions":[{"definition":"The attribute or characteristic of acting in secrecy, or in such a way that the actions are unnoticed or difficult to detect by others."},{"definition":"An act of secrecy, especially one involving thievery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To conceal or infiltrate through the use of stealth."},{"definition":"To have sexual intercourse without a condom through deception (for example, removing the condom mid-act)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a transgender person, hiding their transgender status from society after transition.","example":"He has been/lived stealth for 10 years."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stealth-us","text":"/stɛlθ/"}]},{"word":"NUCLEOTIDE","idx":12754,"count":3431150,"meanings":[{"definitions":[{"definition":"The monomer constituting DNA or RNA biopolymer molecules. Each nucleotide consists of a nitrogenous heterocyclic base (or nucleobase), which can be either a double-ringed purine or a single-ringed pyrimidine; a five-carbon pentose sugar (deoxyribose in DNA or ribose in RNA); and a phosphate group."}],"partOfSpeech":"n"}]},{"word":"TER","idx":12755,"count":3431134,"meanings":[{"definitions":[{"definition":"Toward a closed, touching or engaging position.","example":"Please push the door to."},{"definition":"Into the wind."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Indicating destination: In the direction of, and arriving at.","example":"We are walking to the shop."},{"definition":"Used to indicate the target or recipient of an action.","example":"He devoted himself to education."},{"definition":"Used to indicate result of action.","example":"His face was beaten to a pulp."},{"definition":"Used to indicate a resulting feeling or emotion.","example":"To everyone's great relief, the tuneless carol singers finally ceased their warbling."},{"definition":"Used after an adjective to indicate its application.","example":"similar to ..., relevant to ..., pertinent to ..., I was nice to him, he was cruel to her, I am used to walking."},{"definition":"Denotes the end of a range.","example":"It takes 2 to 4 weeks to process typical applications."},{"definition":"As a.","example":"With God to friend (with God as a friend);   with The Devil to fiend (with the Devil as a foe);   lambs slaughtered to lake (lambs slaughtered as a sacrifice);   took her to wife (took her as a wife);   was sold to slave (was sold as a slave)."},{"definition":"Used to indicate a ratio or comparison.","example":"I have ten dollars to your four."},{"definition":"Used to indicate that the preceding term is to be raised to the power of the following value; indicates exponentiation.","example":"Three squared or three to the second power is nine."},{"definition":"(time) Preceding.","example":"ten to ten = 9:50; We're going to leave at ten to (the hour)."},{"definition":"Used to describe what something consists of or contains.","example":"Anyone could do this job; there's nothing to it."},{"definition":"At.","example":"Stay where you're to and I'll come find you, b'y."}],"partOfSpeech":"pr"}]},{"word":"NESS","idx":12756,"count":3430085,"meanings":[{"definitions":[{"definition":"A promontory; a cape or headland. (Frequently used as a suffix in placenames.)"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ness-us","text":"/nɛs/"},{"audio":"ness-au","text":"/nɛs/"}]},{"word":"REPAYMENT","idx":12759,"count":3427858,"meanings":[{"definitions":[{"definition":"The act of repaying."},{"definition":"The money or other resource that is repaid."}],"partOfSpeech":"n"}]},{"word":"CANOPY","idx":12762,"count":3426751,"meanings":[{"definitions":[{"definition":"A high cover providing shelter, such as a cloth supported above an object, particularly over a bed."},{"definition":"Any overhanging or projecting roof structure, typically over entrances or doors."},{"definition":"The zone of the highest foliage and branches of a forest."},{"definition":"In an airplane, the transparent cockpit cover."},{"definition":"In a parachute, the cloth that fills with air and thus limits the falling speed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover with or as if with a canopy."},{"definition":"To go through the canopy of a forest on a zipline."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"canopy-us"},{"text":"/ˈkæ.nə.pi/"}]},{"word":"GLOSS","idx":12763,"count":3426618,"meanings":[{"definitions":[{"definition":"A surface shine or luster/lustre"},{"definition":"A superficially or deceptively attractive appearance"},{"definition":"A brief explanatory note or translation of a foreign, archaic, technical, difficult, complex, or uncommon expression, inserted after the original, in the margin of a document, or between lines of a text."},{"definition":"A glossary; a collection of such notes."},{"definition":"An expression requiring such explanatory treatment."},{"definition":"An extensive commentary on some text."},{"definition":"A brief explanation in speech or in a written work, including a synonym used with the intent of indicating the meaning of the word to which it is applied"},{"definition":"An interpretation by a court of specific point within a statute or case law"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a gloss or sheen to."},{"definition":"To make (something) attractive by deception"},{"definition":"To become shiny."},{"definition":"To add a gloss to (a text)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gloss-us","text":"/ɡlɔs/"}]},{"word":"PANDA","idx":12764,"count":3424825,"meanings":[{"definitions":[{"definition":"The red panda (Ailurus fulgens), a small raccoon-like animal of northeast Asia with reddish fur and a long, ringed tail."},{"definition":"Short for giant panda."},{"definition":"(law enforcement) Short for panda car."},{"definition":"A brahmin who acts as the hereditary superintendent of a particular ghat or temple, and is regarded as knowledgeable in matters of genealogy and ritual."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"panda-1-us","text":"/ˈpændə/"}]},{"word":"WHIP","idx":12766,"count":3423347,"meanings":[{"definitions":[{"definition":"A lash; a pliant, flexible instrument, such as a rod (commonly of cane or rattan) or a plaited or braided rope or thong (commonly of leather) used to create a sharp \"crack\" sound for directing or herding animals.","example":"I had to use the whip to get the sheep's attention."},{"definition":"A blow administered with a whip."},{"definition":"A whipper-in."},{"definition":"A member of a political party who is in charge of enforcing the party's policies in votes.","example":"I was going to vote against the bill, but the party whip came to see me and made it clear I needed to vote for it."},{"definition":"(UK politics, with definite article) A document distributed weekly to MPs by party whips informing them of upcoming votes in parliament."},{"definition":"Whipped cream.","example":"Did you want to add some whip to your coffee, ma'am?"},{"definition":"A purchase in which one block is used to gain a 2:1 mechanical advantage."},{"definition":"A mode of personal motorized transportation; an automobile, all makes and models including motorcycles, excluding public transportation.","example":"Come on, let's take my whip so we can get there in time."},{"definition":"A move in which one player transfers momentum to another."},{"definition":"A whipping motion; a thrashing about.","example":"I was startled by the whip of the rope when it finally snapped."},{"definition":"The quality of being whiplike or flexible; suppleness, as of the shaft of a golf club."},{"definition":"Any of various pieces that operate with a quick vibratory motion"},{"definition":"A coach driver; a coachman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit with a whip.","example":"The rider whipped the horse."},{"definition":"(by extension) To hit with any flexible object.","example":"I whipped her with a newspaper."},{"definition":"To defeat, as in a contest or game."},{"definition":"To mix in a rapid aerating fashion, especially food.","example":"to whip eggs or cream"},{"definition":"To urge into action or obedience.","example":"He whipped the department into shape."},{"definition":"To enforce a member voting in accordance with party policy."},{"definition":"To bind the end of a rope with twine or other small stuff to prevent its unlaying: fraying or unravelling."},{"definition":"To hoist or purchase by means of a whip."},{"definition":"To sew lightly; specifically, to form (a fabric) into gathers by loosely overcasting the rolled edge and drawing up the thread.","example":"to whip a ruffle"},{"definition":"To throw or kick an object at a high velocity.","example":"He whipped the ball at me."},{"definition":"To fish a body of water especially by making repeated casts."},{"definition":"To snap back and forth like a whip.","example":"The pennants whipped in the wind."},{"definition":"To move very fast.","example":"The wind whipped through the valley."},{"definition":"To move (something) very fast; often with up, out, etc."},{"definition":"To transfer momentum from one skater to another."},{"definition":"To lash with sarcasm, abuse, etc."},{"definition":"To thrash; to beat out, as grain, by striking.","example":"to whip wheat"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"whip-us","text":"/wɪp/"}]},{"word":"PORCH","idx":12768,"count":3420626,"meanings":[{"definitions":[{"definition":"A covered and enclosed entrance to a building, whether taken from the interior, and forming a sort of vestibule within the main wall, or projecting without and with a separate roof."},{"definition":"A portico; a covered walk."},{"definition":"The platform outside the external hatch of a spacecraft."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"porch-us","text":"/pɔɹtʃ/"}]},{"word":"PERTINENT","idx":12769,"count":3419181,"meanings":[{"definitions":[{"definition":"Important with regard to (a subject or matter); relevant"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pertinent-us"},{"text":"/ˈpəːtɪnənt/"}]},{"word":"LIFELONG","idx":12770,"count":3418717,"meanings":[{"definitions":[{"definition":"Extending for the entire duration of life.","example":"They were lifelong friends; they met in elementary school and ended their lives in the same rest home."}],"partOfSpeech":"j"}]},{"word":"EMAILED","idx":12771,"count":3418262,"meanings":[{"definitions":[{"definition":"To send an email or emails to.","example":"She emailed me last week, asking about the status of the project."},{"definition":"(may take two objects) To send (something) through email.","example":"He emailed the file out to everyone."},{"definition":"To send, or compose and send, an email or emails.","example":"Most teenagers seem to spend almost the whole day emailing and surfing the Web."}],"partOfSpeech":"ve"}]},{"word":"PROMOTER","idx":12772,"count":3416706,"meanings":[{"definitions":[{"definition":"One who promotes, particularly with respect to entertainment events or goods."},{"definition":"The section of DNA that controls the initiation of RNA transcription as a product of a gene."},{"definition":"An accelerator of catalysis that is not itself a catalyst."}],"partOfSpeech":"n"}]},{"word":"COLLEGIATE","idx":12774,"count":3416336,"meanings":[{"definitions":[{"definition":"Another name for a high school (e.g. some high schools are called collegiates rather than high schools)"},{"definition":"A member of a college, a collegian; someone who has received a college education."},{"definition":"A fellow-collegian; a colleague."},{"definition":"An inmate of a prison."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to a college, or college students."},{"definition":"Collegial."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"collegiate-au","text":"/kəˈliːdʒi.ət/"}]},{"word":"CONSTANTS","idx":12775,"count":3416072,"meanings":[{"definitions":[{"definition":"That which is permanent or invariable."},{"definition":"A quantity that remains at a fixed value throughout a given discussion."},{"definition":"Any property of an experiment, determined numerically, that does not change under given circumstances."},{"definition":"An identifier that is bound to an invariant value; a fixed value given a name to aid in readability of source code."}],"partOfSpeech":"n"}]},{"word":"CONSTRUED","idx":12776,"count":3415805,"meanings":[{"definitions":[{"definition":"To interpret or explain the meaning of something.","example":"The world must construe according to its wits; this court must construe according to the law."},{"definition":"(grammar) To analyze the grammatical structure of a clause or sentence; to parse."},{"definition":"(grammar) To admit of grammatical analysis."},{"definition":"To translate."},{"definition":"To infer."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kənˈstɹuːd/"}]},{"word":"INTERCHANGE","idx":12777,"count":3415606,"meanings":[{"definitions":[{"definition":"An act of interchanging."},{"definition":"A highway junction in which traffic may change from one road to another without crossing a stream of traffic."},{"definition":"A connection between two or more lines, services or modes of transport; a station at which such a connection can be made.","example":"Holborn tube station is the only interchange between the London Underground Central and Piccadilly Lines"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To switch (each of two things)","example":"to interchange places"},{"definition":"To mutually give and receive (something); to exchange"},{"definition":"To swap or change places"},{"definition":"To alternate; to intermingle or vary","example":"to interchange cares with pleasures"},{"definition":"To act as or carry out an interchange (noun, senses 2, 3)."}],"partOfSpeech":"ve"}]},{"word":"REMOTELY","idx":12778,"count":3415582,"meanings":[{"definitions":[{"definition":"At a distance, far away."},{"definition":"Not much; scarcely; hardly.","example":"I'm not remotely in love with you."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"remotely-us","text":"/ɹɪˈmoʊtli/"}]},{"word":"FLETCHER","idx":12780,"count":3414495,"meanings":[{"definitions":[{"definition":"One who fletches or feathers arrows."},{"definition":"A device to assist in fletching or feathering arrows."},{"definition":"Generally, a manufacturer of bows and arrows."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fletcher-us"},{"text":"/ˈflɛtʃ.ə(ɹ)/"}]},{"word":"CONCISE","idx":12781,"count":3414187,"meanings":[{"definitions":[{"definition":"To make concise; to abridge or summarize."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Brief, yet including all important information"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"concise-us","text":"/kənˈsaɪs/"}]},{"word":"FIBERS","idx":12783,"count":3413234,"meanings":[{"definitions":[{"definition":"A single elongated piece of a given material, roughly round in cross-section, often twisted with other fibers to form thread.","example":"The microscope showed a single blue fiber stuck to the sole of the shoe."},{"definition":"A material in the form of fibers.","example":"The cloth is made from strange, somewhat rough fiber."},{"definition":"A material whose length is at least 1000 times its width.","example":"Please use polyester fiber for this shirt."},{"definition":"Dietary fiber.","example":"Fresh vegetables are a good source of fiber"},{"definition":"Moral strength and resolve.","example":"The ordeal was a test of everyone's fiber."},{"definition":"The preimage of a given point in the range of a map.","example":"Under this map, any two values in the fiber of a given point on the circle differ by 2π"},{"definition":"Said to be of a morphism over a global element: The pullback of the said morphism along the said global element."},{"definition":"A kind of lightweight thread of execution."}],"partOfSpeech":"n"}]},{"word":"HANDFUL","idx":12784,"count":3413211,"meanings":[{"definitions":[{"definition":"The amount that a hand will grasp or contain."},{"definition":"A hand's breadth; four inches."},{"definition":"A small number, usually approximately five."},{"definition":"A group or number of things; a bunch."},{"definition":"Something which can only be managed with difficulty.","example":"Those twins are a real handful to look after."},{"definition":"A five-year prison sentence."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"handful-us","text":"/ˈhæn(d)fəl/"}]},{"word":"BRAINS","idx":12785,"count":3413001,"meanings":[{"definitions":[{"definition":"The control center of the central nervous system of an animal located in the skull which is responsible for perception, cognition, attention, memory, emotion, and action."},{"definition":"An intelligent person.","example":"She was a total brain."},{"definition":"(in the plural) Intellect.","example":"She has a lot of brains."},{"definition":"By analogy with a human brain, the part of a machine or computer that performs calculations.","example":"The computer's brain is capable of millions of calculations a second."},{"definition":"Oral sex."},{"definition":"Mind.","example":"I have too much on my brain today."},{"definition":"The substance of a brain as a material or foodstuff."},{"definition":"The figurative substance of a brain: mental ability, intelligence.","example":"Sadly, I got my brains from my mom and my looks from the mailman."},{"definition":"(with 'the') The intelligent person or people in a group: the director, planner, administrator, &c.","example":"Who's the brains behind this operation?"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dash out the brains of; to kill by smashing the skull."},{"definition":"To strike (someone) on the head."},{"definition":"To destroy; to put an end to."},{"definition":"To conceive in the mind; to understand."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"brains-us","text":"/bɹeɪnz/"}]},{"word":"CURTAINS","idx":12786,"count":3412919,"meanings":[{"definitions":[{"definition":"A piece of cloth covering a window, bed, etc. to offer privacy and keep out light."},{"definition":"A similar piece of cloth that separates the audience and the stage in a theater."},{"definition":"(by extension) The beginning of a show; the moment the curtain rises.","example":"He took so long to shave his head that we arrived 45 minutes after curtain and were denied late entry."},{"definition":"(fortifications) The flat area of wall which connects two bastions or towers; the main area of a fortified wall."},{"definition":"(also \"final curtain\") Death."},{"definition":"That part of a wall of a building which is between two pavilions, towers, etc."},{"definition":"A flag; an ensign."},{"definition":"(in reference to curtains closing at the end of a stage show) An end, death","example":"\"What if a bunch of scuba divers nosed about here?\" / \"Curtains for them, when our side-scan sonar sees them.\""},{"definition":"A ring of clear liquid, forming into drops, near the top of a glass of fortified wine; the result of differential evaporation of alcohol and subsequent changes in surface tension; an example of the Marangoni effect"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover (a window) with a curtain; to hang curtains."},{"definition":"To hide, cover or separate as if by a curtain."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"curtains-us"},{"text":"/ˈkɜː(ɹ).tənz/"}]},{"word":"EATEN","idx":12787,"count":3412832,"meanings":[{"definitions":[{"definition":"To ingest; to be ingested."},{"definition":"To use up."},{"definition":"To cause (someone) to worry.","example":"What’s eating you?"},{"definition":"To take the loss in a transaction."},{"definition":"To be injured or killed by (something such as a firearm or its projectile), especially in the mouth."},{"definition":"To corrode or erode.","example":"The acid rain ate away the statue.  The strong acid eats through the metal."},{"definition":"To perform oral sex (on a person or body part).","example":"Eat me!"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(especially in combination) That has been consumed by eating"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"eaten-us","text":"/ˈiːt(ə)n/"}]},{"word":"INDIGO","idx":12788,"count":3412827,"meanings":[{"definitions":[{"definition":"A purplish-blue colour"},{"definition":"An indigo-colored dye obtained from certain plants (the indigo plant or woad), or a similar synthetic dye."},{"definition":"An indigo plant, such as from species in genera Indigofera, Amorpha (false indigo), Baptisia (wild indigo), and Psorothamnus and Dalea (indigo bush)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a deep purplish-blue colour"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɪndɪˌɡoʊ/"},{"text":"/ˈɪn.dɪˌɡəʊ/"}]},{"word":"RETAINING","idx":12789,"count":3412818,"meanings":[{"definitions":[{"definition":"To keep in possession or use."},{"definition":"To keep in one's pay or service."},{"definition":"To employ by paying a retainer."},{"definition":"To hold secure."},{"definition":"To hold back (a pupil) instead of allowing them to advance to the next class or year."},{"definition":"To restrain; to prevent."},{"definition":"To belong; to pertain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something or someone is retained; a retention."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to something that retains something else, as with a retaining wall."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈteɪnɪŋ/"}]},{"word":"AUTOBIOGRAPHY","idx":12791,"count":3411910,"meanings":[{"definitions":[{"definition":"A self-written biography; the story of one's own life."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"autobiography-us"},{"text":"/ˌɔː.tə.baɪˈɒɡ.ɹə.fi/"}]},{"word":"CONDITIONED","idx":12792,"count":3411409,"meanings":[{"definitions":[{"definition":"To subject to the process of acclimation.","example":"I became conditioned to the absence of seasons in San Diego."},{"definition":"To subject to different conditions, especially as an exercise.","example":"They were conditioning their shins in their karate class."},{"definition":"To place conditions or limitations upon."},{"definition":"To shape the behaviour of someone to do something."},{"definition":"To treat (the hair) with hair conditioner."},{"definition":"To contract; to stipulate; to agree."},{"definition":"To test or assay, as silk (to ascertain the proportion of moisture it contains)."},{"definition":"(colleges) To put under conditions; to require to pass a new examination or to make up a specified study, as a condition of remaining in one's class or in college.","example":"to condition a student who has failed in some branch of study"},{"definition":"To impose upon an object those relations or conditions without which knowledge and thought are alleged to be impossible."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Determined or dependent on some condition"},{"definition":"Physically fit, especially as the result of exercise"},{"definition":"Prepared for a specific use"},{"definition":"Exhibiting a conditioned reflex"}],"partOfSpeech":"j"}]},{"word":"WEBRING","idx":12793,"count":3410783,"meanings":[{"definitions":[{"definition":"A collection of related web sites which are interlinked in a circular structure, each site having links to the previous and next site in the ring."}],"partOfSpeech":"n"}]},{"word":"PROHIBITION","idx":12794,"count":3410059,"meanings":[{"definitions":[{"definition":"An act of prohibiting, forbidding, disallowing, or proscribing something."},{"definition":"A law prohibiting the manufacture or sale of alcohol."},{"definition":"A period of time when specific socially disapproved consumables are considered controlled substances."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"prohibition-us","text":"/ˌpɹoʊ(h)ɪˈbɪʃən/"}]},{"word":"MOTIONS","idx":12795,"count":3409091,"meanings":[{"definitions":[{"definition":"A state of progression from one place to another."},{"definition":"A change of position with respect to time."},{"definition":"A change from one place to another."},{"definition":"A parliamentary action to propose something. A similar procedure in any official or business meeting.","example":"The motion to amend is now open for discussion."},{"definition":"An entertainment or show, especially a puppet show."},{"definition":"From κίνησις (kinesis); any change. Traditionally of four types: generation and corruption, alteration, augmentation and diminution, and change of place."},{"definition":"Movement of the mind, desires, or passions; mental act, or impulse to any action; internal activity."},{"definition":"A formal request, oral or written, made to a judge or court of law to obtain an official court ruling or order for a legal action to be taken by, or on behalf of, the movant."},{"definition":"A movement of the bowels; the product of such movement."},{"definition":"Change of pitch in successive sounds, whether in the same part or in groups of parts. (Conjunct motion is that by single degrees of the scale. Contrary motion is when parts move in opposite directions. Disjunct motion is motion by skips. Oblique motion is when one part is stationary while another moves. Similar or direct motion is when parts move in the same direction.)"},{"definition":"A puppet, or puppet show."},{"definition":"A piece of moving mechanism, such as on a steam locomotive."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To gesture indicating a desired movement.","example":"He motioned for me to come closer."},{"definition":"To introduce a motion in parliamentary procedure."},{"definition":"To make a proposal; to offer plans."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"motions-us"}]},{"word":"REDIRECT","idx":12796,"count":3408086,"meanings":[{"definitions":[{"definition":"A redirection."},{"definition":"An examination of a witness, following cross-examination, by the party that conducted the direct examination."},{"definition":"The substitution of one address or identifier for another one, so as to navigate to a different location."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give new direction to, change the direction of.","example":"redirect output to /dev/null"},{"definition":"To instruct to go, inquire, elsewhere."},{"definition":"To substitute an address or pointer to a new location."},{"definition":"To send to a new location by substituting an address or pointer.","example":"You will be redirected shortly."}],"partOfSpeech":"ve"}]},{"word":"INTEROPERABILITY","idx":12797,"count":3408052,"meanings":[{"definitions":[{"definition":"The capability of a product or system, to interact and function with others reciprocally."},{"definition":"The capacity for a service, piece of equipment etc., to be operated by different forces or groups."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɪntəɹɒpəɹəˈbɪləti/"}]},{"word":"SHAMPOO","idx":12800,"count":3404715,"meanings":[{"definitions":[{"definition":"A traditional Indian and Persian body massage given after pouring warm water over the body and rubbing it with extracts from herbs."},{"definition":"A commercial liquid soap product for washing hair or other fibres/fibers, such as carpets."},{"definition":"An instance of washing the hair or other fibres with shampoo.","example":"I’m going to give the carpet a shampoo."},{"definition":"Champagne."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wash one's own hair with shampoo.","example":"My neat-freak of a friend has been compulsively shampooing for every bath he has taken."},{"definition":"To wash (i.e. the hair, carpet, etc.) with shampoo."},{"definition":"To press or knead the whole surface of the body of (a person), and at the same time to stretch the limbs and joints, in connection with the hot bath."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shampoo-us","text":"/ʃæmˈpuː/"}]},{"word":"EMPHASIZE","idx":12801,"count":3404529,"meanings":[{"definitions":[{"definition":"To stress, give emphasis or extra weight to (something).","example":"His two-fingered gesture emphasized what he had told his boss to do with his job."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɛm.fə.saɪz/"}]},{"word":"EXCITE","idx":12802,"count":3404340,"meanings":[{"definitions":[{"definition":"To stir the emotions of.","example":"The fireworks which opened the festivities excited anyone present."},{"definition":"To arouse or bring out (e.g. feelings); to stimulate.","example":"Favoritism tends to excite jealousy in the ones not being favored."},{"definition":"To cause an electron to move to a higher than normal state; to promote an electron to an outer level.","example":"By applying electric potential to the neon atoms, the electrons become excited, then emit a photon when returning to normal."},{"definition":"To energize (an electromagnet); to produce a magnetic field in.","example":"to excite a dynamo"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"excite-us","text":"/ɪkˈsaɪt/"}]},{"word":"REBELS","idx":12803,"count":3403877,"meanings":[{"definitions":[{"definition":"A person who resists an established authority, often violently"},{"definition":"A person from the Confederate States of America"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To resist or become defiant toward an authority."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɹɛbl̩z/"}]},{"word":"NEOPLASMS","idx":12804,"count":3402814,"meanings":[{"definitions":[{"definition":"An abnormal new growth of disorganized tissue in animals or plants."}],"partOfSpeech":"n"}]},{"word":"ARTIFACTS","idx":12805,"count":3402215,"meanings":[{"definitions":[{"definition":"An object made or shaped by human hand or labor."},{"definition":"An object made or shaped by some agent or intelligence, not necessarily of direct human origin."},{"definition":"Something viewed as a product of human agency or conception rather than an inherent element."},{"definition":"A finding or structure in an experiment or investigation that is not a true feature of the object under observation, but is a result of external action, the test arrangement, or an experimental error.","example":"The spot on his lung turned out to be an artifact of the X-ray process."},{"definition":"An object, such as a tool, ornament, or weapon of archaeological or historical interest, especially such an object found at an archaeological excavation.","example":"The dig produced many Roman artifacts."},{"definition":"An appearance or structure in protoplasm due to death, the method of preparation of specimens, or the use of reagents, and not present during life."},{"definition":"A perceptible distortion that appears in an audio or video file or a digital image as a result of applying a lossy compression algorithm.","example":"This JPEG image has been so highly compressed that it has unsightly compression artifacts, making it unsuitable for the cover of our magazine."}],"partOfSpeech":"n"}]},{"word":"BELIEVING","idx":12806,"count":3401919,"meanings":[{"definitions":[{"definition":"To accept as true, particularly without absolute certainty (i.e., as opposed to knowing)","example":"I believe there are faeries."},{"definition":"To accept that someone is telling the truth.","example":"Why did I ever believe you?"},{"definition":"To have religious faith; to believe in a greater truth.","example":"After that night in the church, I believed."},{"definition":"To opine, think, reckon"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process of having faith, trust, or confidence in."},{"definition":"Belief."}],"partOfSpeech":"n"}]},{"word":"VAC","idx":12807,"count":3401745,"meanings":[{"definitions":[{"definition":"A vacation."},{"definition":"A vacuum cleaner."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To vacuum; to clean with a vacuum cleaner."}],"partOfSpeech":"ve"}]},{"word":"HILARIOUS","idx":12808,"count":3401735,"meanings":[{"definitions":[{"definition":"Very funny; causing great merriment and laughter.","example":"a hilarious joke"},{"definition":"Full of hilarity; merry."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hilarious-us","text":"/haɪˈleɹiəs/"}]},{"word":"PSEUDO","idx":12810,"count":3401665,"meanings":[{"definitions":[{"definition":"An intellectually pretentious person; a pseudointellectual."},{"definition":"A poseur; one who is fake."},{"definition":"(travel industry) pseudo-city code"},{"definition":"(clipping) A pseudonym; a false name used for online anonymity."},{"definition":"A sympathomimetic alkaloid commonly used as a decongestant; a chemical compound, an isomer of ephedrine, with the formula C10H15NO."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Other than what is apparent; spurious; sham."},{"definition":"Insincere."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pseudo-us","text":"/ˈsuːdoʊ/"},{"audio":"pseudo-uk","text":"/ˈs(j)uːdəʊ/"}]},{"word":"QUOTING","idx":12812,"count":3399751,"meanings":[{"definitions":[{"definition":"To repeat the exact words of (a person).","example":"The writer quoted the president."},{"definition":"To repeat (the exact words of a person).","example":"The writer quoted the president's speech."},{"definition":"To prepare a summary of work to be done and set a price."},{"definition":"(Commerce) To name the current price, notably of a financial security."},{"definition":"To indicate verbally or by equivalent means the start of a quotation."},{"definition":"To observe, to take account of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A quoted statement; a quote."}],"partOfSpeech":"n"}]},{"word":"SINKS","idx":12813,"count":3399604,"meanings":[{"definitions":[{"definition":"A basin used for holding water for washing."},{"definition":"A drain for carrying off wastewater."},{"definition":"A sinkhole."},{"definition":"A depression in land where water collects, with no visible outlet."},{"definition":"A heat sink."},{"definition":"A place that absorbs resources or energy."},{"definition":"The motion of a sinker pitch.","example":"Jones has a two-seamer with heavy sink."},{"definition":"An object or callback that captures events; event sink"},{"definition":"A destination vertex in a transportation network"},{"definition":"An abode of degraded persons; a wretched place."},{"definition":"A depression in a stereotype plate."},{"definition":"A stage trap-door for shifting scenery."},{"definition":"An excavation less than a shaft."},{"definition":"(game development) One or several systems that remove currency from the game's economy, thus controlling or preventing inflation"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(heading, physical) To move or be moved into something."},{"definition":"(heading, social) To diminish or be diminished."},{"definition":"To conceal and appropriate."},{"definition":"To keep out of sight; to suppress; to ignore."},{"definition":"To pay absolutely.","example":"I have sunk thousands of pounds into this project."},{"definition":"To reduce or extinguish by payment.","example":"to sink the national debt"},{"definition":"To be overwhelmed or depressed; to fail in strength."},{"definition":"To decrease in volume, as a river; to subside; to become diminished in volume or in apparent height."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sɪŋks/"}]},{"word":"STEEP","idx":12814,"count":3399504,"meanings":[{"definitions":[{"definition":"The steep side of a mountain etc.; a slope or acclivity."},{"definition":"A liquid used in a steeping process","example":"Corn steep has many industrial uses."},{"definition":"A rennet bag."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a near-vertical gradient; of a slope, surface, curve, etc. that proceeds upward at an angle near vertical.","example":"a steep hill or mountain; a steep roof; a steep ascent; a steep barometric gradient"},{"definition":"Expensive","example":"Twenty quid for a shave? That's a bit steep."},{"definition":"Difficult to access; not easy reached; lofty; elevated; high."},{"definition":"(of the rake of a ship's mast, or a car's windshield) resulting in a mast or windshield angle that strongly diverges from the perpendicular","example":"The steep rake of the windshield enhances the fast lines of the exterior. http//legacy.sandiegouniontribune.com/uniontrib/20070303/news_lz1dd3maynard.html"}],"partOfSpeech":"j"},{"definitions":[{"definition":"(middle voice) To soak or wet thoroughly.","example":"The tea is steeping."},{"definition":"To imbue with something; to be deeply immersed in.","example":"The learned of the nation were steeped in Latin."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"steep-us","text":"/stiːp/"}]},{"word":"DINAR","idx":12815,"count":3399128,"meanings":[{"definitions":[{"definition":"The official currency of several countries, including Algeria, Bahrain, Iraq, Jordan, Kuwait, Libya, Serbia and Tunisia."},{"definition":"An ancient Arab gold coin of 65 grains in weight."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdiːnɑː(ɹ)/"}]},{"word":"DYNASTY","idx":12816,"count":3398997,"meanings":[{"definitions":[{"definition":"A series of rulers or dynasts from one family."},{"definition":"A team or organization which has an extended period of success or dominant performance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dynasty-us","text":"/ˈdaɪnəsti/"}]},{"word":"CREED","idx":12817,"count":3398609,"meanings":[{"definitions":[{"definition":"That which is believed; accepted doctrine, especially religious doctrine; a particular set of beliefs; any summary of principles or opinions professed or adhered to."},{"definition":"(specifically) A reading or statement of belief that summarizes the faith it represents; a confession of faith for public use, especially one which is brief and comprehensive.","example":"A creed is a manifesto of religious or spiritual beliefs"},{"definition":"The fact of believing; belief, faith."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(only survives in \"creeded\") To believe; to credit."},{"definition":"To provide with a creed."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"creed-us","text":"/kɹid/"},{"audio":"creed-uk","text":"/kɹiːd/"}]},{"word":"CARAT","idx":12818,"count":3398374,"meanings":[{"definitions":[{"definition":"A unit of weight for precious stones and pearls, equivalent to 200 milligrams."},{"definition":"Any of several units of weight, varying from 189 to 212 mg, the weight of a carob seed."},{"definition":"A measure of the purity of gold, pure gold being 24 carats."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæɹ.ət/"}]},{"word":"NAN","idx":12819,"count":3398089,"meanings":[{"definitions":[{"definition":"A mother of someone's parent."},{"definition":"A female ancestor or progenitor."},{"definition":"A girl or an unmarried young woman; maiden."},{"definition":"A female servant or cleaner (short for maidservant)."},{"definition":"A virgin, now female but originally one of either gender."},{"definition":"An effeminate man, especially a homosexual."},{"definition":"A woman or girl employed to care for children"},{"definition":"A type of round, flat bread baked in a tandoor popular in South and Central Asian cuisine."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nan-1-us","text":"/næn/"}]},{"word":"MICROPHONES","idx":12820,"count":3398004,"meanings":[{"definitions":[{"definition":"A device (transducer) used to convert sound waves into a varying electric current; normally fed into an amplifier and either recorded or broadcast."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put one or more microphones on or in."}],"partOfSpeech":"ve"}]},{"word":"RAIDERS","idx":12822,"count":3396978,"meanings":[{"definitions":[{"definition":"One who engages in a raid; a plunderer."},{"definition":"A person who takes or attempts to take control of a firm against the will of current management by purchasing a controlling interest of stock and acquiring proxies."},{"definition":"A special forces operative; a commando."},{"definition":"A warship which is light, maneuverable, and fast-moving."},{"definition":"A person who uncovers evidence of improper behavior within governmental or private organizations."}],"partOfSpeech":"n"}]},{"word":"GALAXIES","idx":12823,"count":3396836,"meanings":[{"definitions":[{"definition":"The Milky Way; the apparent band of concentrated stars which appears in the night sky over earth."},{"definition":"Any of the collections of many millions or billions of stars, galactic dust, black holes, etc. existing as independent and coherent systems, of which there are billions in the known universe."},{"definition":"Any print or pattern reminiscent of a galaxy, generally consisting of blending, semiopaque patches of vibrant color on a dark background."}],"partOfSpeech":"n"}]},{"word":"SPREADS","idx":12824,"count":3396812,"meanings":[{"definitions":[{"definition":"The act of spreading."},{"definition":"Something that has been spread."},{"definition":"A layout, pattern or design of cards arranged for a reading."},{"definition":"An expanse of land."},{"definition":"A large tract of land used to raise livestock; a cattle ranch."},{"definition":"A piece of material used as a cover (such as a bedspread)."},{"definition":"A large meal, especially one laid out on a table."},{"definition":"(bread, etc.) Any form of food designed to be spread, such as butters or jams."},{"definition":"Food improvised by inmates from various ingredients to relieve the tedium of prison food."},{"definition":"An item in a newspaper or magazine that occupies more than one column or page."},{"definition":"Two facing pages in a book, newspaper etc."},{"definition":"A numerical difference."},{"definition":"The difference between the wholesale and retail prices."},{"definition":"The difference between the price of a futures month and the price of another month of the same commodity."},{"definition":"The purchase of a futures contract of one delivery month against the sale of another futures delivery month of the same commodity."},{"definition":"The purchase of one delivery month of one commodity against the sale of that same delivery month of a different commodity."},{"definition":"An arbitrage transaction of the same commodity in two markets, executed to take advantage of a profit from price discrepancies."},{"definition":"The difference between bidding and asking price."},{"definition":"The difference between the prices of two similar items."},{"definition":"An unlimited expanse of discontinuous points."},{"definition":"The surface in proportion to the depth of a cut gemstone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stretch out, open out (a material etc.) so that it more fully covers a given area of space.","example":"He spread his newspaper on the table."},{"definition":"To extend (individual rays, limbs etc.); to stretch out in varying or opposing directions.","example":"I spread my arms wide and welcomed him home."},{"definition":"To disperse, to scatter or distribute over a given area.","example":"I spread the rice grains evenly over the floor."},{"definition":"To proliferate; to become more widely present, to be disseminated."},{"definition":"To disseminate; to cause to proliferate, to make (something) widely known or present.","example":"The missionaries quickly spread their new message across the country."},{"definition":"To take up a larger area or space; to expand, be extended.","example":"I dropped my glass; the water spread quickly over the tiled floor."},{"definition":"To smear, to distribute in a thin layer.","example":"She liked to spread butter on her toast while it was still hot."},{"definition":"To cover (something) with a thin layer of some substance, as of butter.","example":"He always spreads his toast with peanut butter and strawberry jam."},{"definition":"To prepare; to set and furnish with provisions.","example":"to spread a table"},{"definition":"To open one’s legs, especially for sexual favours."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spreads-us"}]},{"word":"ELEGANCE","idx":12826,"count":3396159,"meanings":[{"definitions":[{"definition":"Grace, refinement, and beauty in movement, appearance, or manners.","example":"The bride was elegance personified."},{"definition":"Restraint and grace of style.","example":"The simple dress had a quiet elegance."},{"definition":"The beauty of an idea characterized by minimalism and intuitiveness while preserving exactness and precision.","example":"The proof of the theorem had a pleasing elegance."},{"definition":"A refinement or luxury."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛl.ɪ.ɡəns/"}]},{"word":"VOLATILE","idx":12827,"count":3395681,"meanings":[{"definitions":[{"definition":"A chemical or compound that changes into a gas easily."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Evaporating or vaporizing readily under normal conditions."},{"definition":"(of a substance) Explosive."},{"definition":"(of a price etc) Variable or erratic."},{"definition":"(of a person) Quick to become angry or violent."},{"definition":"Fickle."},{"definition":"Temporary or ephemeral."},{"definition":"(of a situation) Potentially violent."},{"definition":"(of a variable) Having its associated memory immediately updated with any changes in value."},{"definition":"(of memory) Whose content is lost when the computer is powered down"},{"definition":"Passing through the air on wings, or by the buoyant force of the atmosphere; flying; having the power to fly."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"volatile-us","text":"/ˈvɑl.ə.tl̩/"},{"audio":"volatile-uk","text":"/ˈvɒl.əˌtaɪ.(ə)l/"}]},{"word":"POINTERS","idx":12828,"count":3395547,"meanings":[{"definitions":[{"definition":"Anything that points or is used for pointing."},{"definition":"A teacher's pointer, pointing stick, a rod with an arrow."},{"definition":"A needle-like component of a timepiece or measuring device that indicates the time or the current reading of the device."},{"definition":"A breed of hunting dog, trained to point out game."},{"definition":"A variable that holds the address of a memory location where a value can be stored."},{"definition":"An icon that indicates the position of the pointing device, such as a mouse."},{"definition":"(chiefly in the plural) A tip, a bit of advice.","example":"The instructor gave me some pointers on writing a good paper."},{"definition":"(in combinations) Something worth a given number of points.","example":"a ten-pointer"}],"partOfSpeech":"n"}]},{"word":"SENSORY","idx":12829,"count":3394914,"meanings":[{"definitions":[{"definition":"Sensorium"},{"definition":"An organ or faculty of sense."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of the senses or sensation."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɛnsəɹi/"}]},{"word":"SCRAPBOOK","idx":12830,"count":3394030,"meanings":[{"definitions":[{"definition":"A book, similar to a notebook or journal, in which personal or family memorabilia and photos are collected and arranged"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create scrapbooks."}],"partOfSpeech":"ve"}]},{"word":"DUMMIES","idx":12831,"count":3392894,"meanings":[{"definitions":[{"definition":"A silent person; a person who does not talk."},{"definition":"An unintelligent person.","example":"Don't be such a dummy!"},{"definition":"A figure of a person or animal used by a ventriloquist; a puppet."},{"definition":"Something constructed with the size and form of a human, to be used in place of a person.","example":"To understand the effects of the accident, we dropped a dummy from the rooftop."},{"definition":"A person who is the mere tool of another; a man of straw."},{"definition":"A deliberately nonfunctional device or tool used in place of a functional one.","example":"The hammer and drill in the display are dummies."},{"definition":"A \"dummy teat\"; a plastic or rubber teat used to soothe or comfort a baby; a pacifier.","example":"The baby wants her dummy."},{"definition":"A player whose hand is shown and is to be played from by another player."},{"definition":"A word serving only to make a construction grammatical.","example":"The pronoun \"it\" in \"It's a mystery why this happened\" is a dummy."},{"definition":"An unused parameter or value.","example":"If flag1 is false, the other parameters are dummies."},{"definition":"A feigned pass or kick or play in order to deceive an opponent."},{"definition":"A bodily gesture meant to fool an opposing player; a feint."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a mock-up or prototype version of something, without some or all off its intended functionality.","example":"The carpenters dummied some props for the rehearsals."},{"definition":"To feint."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdʌmiz/"}]},{"word":"THRONE","idx":12832,"count":3392423,"meanings":[{"definitions":[{"definition":"An impressive seat used by a monarch, often on a raised dais in a throne room and reserved for formal occasions.","example":"He approached the throne reverently."},{"definition":"Leadership, particularly the position of a monarch."},{"definition":"The seat of a bishop in the cathedral-church of his diocese; also, the seat of a pope."},{"definition":"Other seats, particularly:"},{"definition":"A member of an order of angels ranked above dominions and below cherubim."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place on a royal seat; to enthrone."},{"definition":"To place in an elevated position; to give sovereignty or dominion to; to exalt."},{"definition":"To be in, or sit upon, a throne; to be placed as if upon a throne."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"throne-us","text":"[θɹoʊn]"}]},{"word":"MAGNESIUM","idx":12833,"count":3391051,"meanings":[{"definitions":[{"definition":"The chemical element (symbol Mg) with an atomic number of 12. It is a light, easily flammable, silvery-white alkaline earth metal."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"magnesium-us","text":"/ˌmæɡˈnizi.əm/"}]},{"word":"CHARTERED","idx":12836,"count":3390853,"meanings":[{"definitions":[{"definition":"To grant or establish a charter."},{"definition":"To lease or hire something by charter."},{"definition":"(of a peace officer) To inform (an arrestee) of their constitutional rights under the Canadian Charter of Rights and Freedoms upon arrest."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a charter."}],"partOfSpeech":"j"}]},{"word":"SLOPES","idx":12837,"count":3390340,"meanings":[{"definitions":[{"definition":"An area of ground that tends evenly upward or downward.","example":"I had to climb a small slope to get to the site."},{"definition":"The degree to which a surface tends upward or downward.","example":"The road has a very sharp downward slope at that point."},{"definition":"The ratio of the vertical and horizontal distances between two points on a line; zero if the line is horizontal, undefined if it is vertical.","example":"The slope of this line is 0.5"},{"definition":"The slope of the line tangent to a curve at a given point.","example":"The slope of a parabola increases linearly with x."},{"definition":"The angle a roof surface makes with the horizontal, expressed as a ratio of the units of vertical rise to the units of horizontal length (sometimes referred to as run).","example":"The slope of an asphalt shingle roof system should be 4:12 or greater."},{"definition":"A person of Chinese or other East Asian descent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tend steadily upward or downward.","example":"The road slopes sharply down at that point."},{"definition":"To form with a slope; to give an oblique or slanting direction to; to incline or slant.","example":"to slope the ground in a garden;   to slope a piece of cloth in cutting a garment"},{"definition":"(usually followed by a preposition) To try to move surreptitiously.","example":"I sloped in through the back door, hoping my boss wouldn't see me."},{"definition":"To hold a rifle at a slope with forearm perpendicular to the body in front holding the butt, the rifle resting on the shoulder.","example":"The order was given to \"slope arms\"."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slopes-us"}]},{"word":"SOCIALLY","idx":12838,"count":3388736,"meanings":[{"definitions":[{"definition":"In a social manner; sociably."},{"definition":"In social contexts.","example":"socially awkward"}],"partOfSpeech":"v"}]},{"word":"UNFORTUNATE","idx":12839,"count":3388419,"meanings":[{"definitions":[{"definition":"An unlucky person; one who has fallen into bad circumstances."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not favored by fortune"},{"definition":"Marked or accompanied by or resulting in misfortune"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈfɔɹt͡ʃənɪt/"},{"text":"/ʌnˈfɔːtjʊnət/"}]},{"word":"SEIZED","idx":12840,"count":3388226,"meanings":[{"definitions":[{"definition":"To deliberately take hold of; to grab or capture."},{"definition":"To take advantage of (an opportunity or circumstance)."},{"definition":"To take possession of (by force, law etc.).","example":"to seize a ship after libeling"},{"definition":"To have a sudden and powerful effect upon.","example":"a fever seized him"},{"definition":"To bind, lash or make fast, with several turns of small rope, cord, or small line.","example":"to seize or stop one rope on to another"},{"definition":"To fasten, fix."},{"definition":"To lay hold in seizure, by hands or claws (+ on or upon).","example":"to seize on the neck of a horse"},{"definition":"To have a seizure."},{"definition":"To bind or lock in position immovably; see also seize up.","example":"Rust caused the engine to seize, never to run again."},{"definition":"To submit for consideration to a deliberative body."},{"definition":"(with of) To cause (an action or matter) to be or remain before (a certain judge or court).","example":"This Court will remain seized of this matter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"seized-us","text":"/siːzd/"}]},{"word":"ROUNDUP","idx":12841,"count":3387046,"meanings":[{"definitions":[{"definition":"An activity in which cattle are herded together in order to be inspected, counted, branded or shipped."},{"definition":"(law enforcement) The similar police activity of gathering together suspects."},{"definition":"The forcible gathering together of any particular group of people."},{"definition":"The summary to a news bulletin."},{"definition":"An upward curvature or convexity, as in the deck of a vessel."},{"definition":"The finishing of an arrangement."}],"partOfSpeech":"n"}]},{"word":"TERRITORIAL","idx":12842,"count":3387028,"meanings":[{"definitions":[{"definition":"A non-professional member of a territorial army."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to or restricted to a specific geographic area, or territory."},{"definition":"Of or relating to geography or territory."},{"definition":"(often capitalized) Organized for home defence - such as the Territorial Army."},{"definition":"Displaying territoriality."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌtɛ.ɹɪˈtɔː.ɹi.əl/"}]},{"word":"LEASES","idx":12843,"count":3386999,"meanings":[{"definitions":[{"definition":"(chiefly dialectal) To gather."},{"definition":"(chiefly dialectal) To pick, select, pick out; to pick up."},{"definition":"(chiefly dialectal) To glean."},{"definition":"(chiefly dialectal) To glean, gather up leavings."},{"definition":"To tell lies; tell lies about; slander; calumniate."},{"definition":"To release; let go; unloose."},{"definition":"To operate or live in some property or land through purchasing a long-term contract (or leasehold) from the owner (or freeholder)."},{"definition":"To take or hold by lease."},{"definition":"To grant a lease; to let or rent."}],"partOfSpeech":"ve"}]},{"word":"CONSISTED","idx":12845,"count":3386917,"meanings":[{"definitions":[{"definition":"To be."},{"definition":"To exist."},{"definition":"(with in) To be comprised or contained."},{"definition":"(with of) To be composed, formed, or made up (of).","example":"The greeting package consists of some brochures, a pen, and a notepad."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"consisted-us","text":"/kənˈsɪstɪd/"}]},{"word":"FAXES","idx":12847,"count":3386604,"meanings":[{"definitions":[{"definition":"The hair of the head."},{"definition":"A fax machine or a document received and printed by one."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send a document via a fax machine."}],"partOfSpeech":"ve"}]},{"word":"PLUMP","idx":12848,"count":3386553,"meanings":[{"definitions":[{"definition":"To grow plump; to swell out.","example":"Her cheeks have plumped."},{"definition":"To make plump; to fill (out) or support; often with up.","example":"to plump oysters or scallops by placing them in fresh or brackish water"},{"definition":"To cast or let drop all at once, suddenly and heavily.","example":"to plump a stone into water"},{"definition":"To give a plumper (kind of vote)."},{"definition":"To give (a vote), as a plumper."},{"definition":"To favor or decide in favor of something."},{"definition":"To drop or fall suddenly or heavily, all at once."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a full and rounded shape; chubby, somewhat overweight.","example":"a plump baby;  plump cheeks"},{"definition":"Fat."},{"definition":"Sudden and without reservation; blunt; direct; downright."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The sound of a sudden heavy fall."},{"definition":"A knot or cluster; a group; a crowd.","example":"a plump of trees, fowls, or spears"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Directly; suddenly; perpendicularly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"plump-uk","text":"/plʌmp/"}]},{"word":"MEMOIRS","idx":12850,"count":3384732,"meanings":[{"definitions":[{"definition":"An autobiography; a book describing the personal experiences of an author.","example":"When I retire, I'm going to write my memoirs."},{"definition":"A biography; a book describing the experiences of a subject from personal knowledge of the subject or from sources with personal knowledge of the subject.","example":"James wrote a memoir of his grandmother shortly after she passed away."},{"definition":"Any form of narrative describing the personal experiences of a writer."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɛmˌwɑɹz/"}]},{"word":"ALKALINE","idx":12851,"count":3382714,"meanings":[{"definitions":[{"definition":"An alkaline battery."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to an alkali, one of a class of caustic bases."},{"definition":"Having a pH greater than 7."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"alkaline-us","text":"/ˈæl.kə.laɪn/"}]},{"word":"EXPIRE","idx":12852,"count":3381897,"meanings":[{"definitions":[{"definition":"To die.","example":"The patient expired in hospital."},{"definition":"To lapse and become invalid.","example":"My library card will expire next week."},{"definition":"To exhale; to breathe out."},{"definition":"To give forth insensibly or gently, as a fluid or vapour; to emit in minute particles."},{"definition":"To bring to a close; to terminate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"expire-us","text":"/ɛkˈspaɪ.ə(ɹ)/"}]},{"word":"OCH","idx":12853,"count":3381894,"meanings":[{"definitions":[{"definition":"General interjection of confirmation, affirmation, and often disapproval."},{"definition":"An expression of anger, frustration, surprise"}],"partOfSpeech":"i"}],"phonetics":[{"text":"/ɒx/"}]},{"word":"MIDST","idx":12855,"count":3381410,"meanings":[{"definitions":[{"definition":"A place in the middle of something; may be used of a literal or metaphorical location."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Among, in the middle of; amid."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"midst-us","text":"/mɪdst/"}]},{"word":"METHYL","idx":12856,"count":3381243,"meanings":[{"definitions":[{"definition":"The univalent hydrocarbon radical, CH3-, formally derived from methane by the loss of a hydrogen atom; a compound or part of a compound formed by the attachment of such a radical."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"methyl-ca","text":"/ˈmɛθəl/"}]},{"word":"CAMPUSES","idx":12857,"count":3380970,"meanings":[{"definitions":[{"definition":"The grounds or property of a school, college, university, business, church, or hospital, often understood to include buildings and other structures.","example":"The campus is sixty hectares in size."},{"definition":"An institution of higher education and its ambiance.","example":"During the late 1960s, many an American campus was in a state of turmoil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To confine to campus as a punishment."}],"partOfSpeech":"ve"}]},{"word":"BORNE","idx":12858,"count":3379421,"meanings":[{"definitions":[{"definition":"To carry or convey, literally or figuratively.","example":"Judging from the look on his face, he wasn't bearing good news."},{"definition":"To support, sustain, or endure."},{"definition":"To support, keep up, or maintain."},{"definition":"To press or impinge upon."},{"definition":"To produce, yield, give birth to."},{"definition":"(originally nautical) To be, or head, in a specific direction or azimuth (from somewhere).","example":"By my readings, we're bearing due south, so we should turn about ten degrees east."},{"definition":"To gain or win."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Carried, supported."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"borne-us","text":"/bɔɹn/"}]},{"word":"FORGIVE","idx":12859,"count":3379266,"meanings":[{"definitions":[{"definition":"To pardon; to waive any negative feeling or desire for punishment, retribution, or compensation.","example":"Forgive others, not because they deserve forgiveness, but because you deserve peace."},{"definition":"To accord forgiveness."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɚˈɡɪv/"}]},{"word":"RAMADA","idx":12860,"count":3379181,"meanings":[{"definitions":[{"definition":"A simple arbour or open porch, typically roofed with branches."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ramada-uk","text":"/ɹəˈmɑːdə/"}]},{"word":"COMPETITOR","idx":12861,"count":3378603,"meanings":[{"definitions":[{"definition":"A person or organization against whom one is competing."},{"definition":"A participant in a competition, especially in athletics."}],"partOfSpeech":"n"}]},{"word":"NEIGHBOURS","idx":12863,"count":3378230,"meanings":[{"definitions":[{"definition":"A person living on adjacent or nearby land; a person situated adjacently or nearby; anything (of the same type of thing as the subject) in an adjacent or nearby position.","example":"My neighbour has two noisy cats."},{"definition":"One who is near in sympathy or confidence."},{"definition":"A fellow human being."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be adjacent to","example":"Though France neighbours Germany, its culture is significantly different."},{"definition":"(followed by \"on\"; figurative) To be similar to, to be almost the same as.","example":"That sort of talk is neighbouring on treason."},{"definition":"To associate intimately with; to be close to."}],"partOfSpeech":"ve"}]},{"word":"DBA","idx":12866,"count":3376018,"meanings":[{"definitions":[{"definition":"An alias of a business entity.","example":"His company has done business under a succession of dbas because he can't settle on a good name."},{"definition":"A business doing business under such an alias.","example":"Many dbas have used that mailbox service."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Doing business as; used to indicate the public alias of a business legally constituted under a different name","example":"His company is \"Simon Enterprises, Inc. (2007)\", dba \"Simon's Party Spot\"."}],"partOfSpeech":"pr"}]},{"word":"ARCHITECTURES","idx":12867,"count":3374071,"meanings":[{"definitions":[{"definition":"The art and science of designing and managing the construction of buildings and other structures, particularly if they are well proportioned and decorated.","example":"Architecture is the visual public expression of a culture’s achievements, values, and outlook. ― Max Roscoe, \"How Your City Is Killing You With Ugliness\""},{"definition":"The profession of an architect."},{"definition":"Any particular style of building design."},{"definition":"Construction, in a more general sense; frame or structure; workmanship."},{"definition":"A unifying structure."},{"definition":"A specific model of a microchip or CPU.","example":"The Intel architectures have more software written for them."},{"definition":"The structure and design of a system or product.","example":"The architecture of the company's billing system is designed to support its business goals."}],"partOfSpeech":"n"}]},{"word":"CONVERSIONS","idx":12868,"count":3373910,"meanings":[{"definitions":[{"definition":"The act of converting something or someone.","example":"His conversion to Christianity"},{"definition":"A software product converted from one platform to another."},{"definition":"A chemical reaction wherein a substrate is transformed into a product."},{"definition":"A free kick, after scoring a try, worth two points."},{"definition":"An extra point (or two) scored by kicking a field goal or carrying the ball into the end zone after scoring a touchdown."},{"definition":"An online advertising performance metric representing a visitor performing whatever the intended result of an ad is defined to be."},{"definition":"Under the common law, the tort of the taking of someone's personal property with intent to permanently deprive them of it, or damaging property to the extent that the owner is deprived of the utility of that property, thus making the tortfeasor liable for the entire value of the property.","example":"the conversion of a horse"},{"definition":"The process whereby a new word is created without changing the form, often by allowing the word to function as a new part of speech."},{"definition":"The act of turning round; revolution; rotation."},{"definition":"The act of interchanging the terms of a proposition, as by putting the subject in the place of the predicate, or vice versa."},{"definition":"A change or reduction of the form or value of a proposition.","example":"the conversion of equations; the conversion of proportions"}],"partOfSpeech":"n"}]},{"word":"USABLE","idx":12870,"count":3373023,"meanings":[{"definitions":[{"definition":"Capable of being used."},{"definition":"Easy to use; exhibiting good usability."},{"definition":"Homosexual"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈjuː.zə.bəl/"}]},{"word":"TEMPO","idx":12871,"count":3372997,"meanings":[{"definitions":[{"definition":"A frequency or rate."},{"definition":"A move which is part of one's own plan or strategy and forces, e.g. by means of a check or attacking a piece, the opponent to make a move which is not bad but of no use for him (the player gains a tempo, the opponent loses a tempo), or equivalently a player achieves the same result in fewer moves by one approach rather than another."},{"definition":"The timing advantage of being on lead, thus being first to initiate a strategy to develop tricks for one's side."},{"definition":"The timing of a particular event – earlier or later than in an alternative situation (as in chess example)"},{"definition":"The number of beats per minute in a piece of music; also, an indicative term denoting approximate rate of speed in written music (examples: allegro, andante)"},{"definition":"The steady pace set by the frontmost riders."},{"definition":"A small truck or cargo van with three or four wheels, commonly used for commercial transport and deliveries (particularly in Asian and African countries): a genericized trademark, originally associated with the manufacturer Vidal & Sohn Tempo-Werke GmbH."},{"definition":"A rapid rate of play by the offense resulting from reducing the amount of time which elapses after one play ends and the next starts."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛm.pəʊ/"}]},{"word":"MUTATIONS","idx":12873,"count":3371343,"meanings":[{"definitions":[{"definition":"Any alteration or change."},{"definition":"Any heritable change of the base-pair sequence of genetic material."},{"definition":"A mutant."},{"definition":"An alteration a particular sound of a word, especially the initial consonant, which is triggered by the word's morphological or syntactic context and not by its phonological context."},{"definition":"A group of thrushes."}],"partOfSpeech":"n"}]},{"word":"CDR","idx":12874,"count":3370870,"meanings":[{"definitions":[{"definition":"The second part of a cons in LISP. The rest of a list when the first element is removed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cdr-us","text":"/ˈku.də/"}]},{"word":"READABLE","idx":12875,"count":3370832,"meanings":[{"definitions":[{"definition":"(of handwriting, print, etc) legible, possible to read or at least decipher","example":"If that sign was still readable we'd know where we are!"},{"definition":"Which can be read—i.e. accessed or played—by a certain technical type of device","example":"No sale, those aren't readable with my DVD-player!"},{"definition":"(of a book) enjoyable to read, of an acceptable stylistic quality or at least functionally composed","example":"These assembly instructions aren't readable, I still don't have a clue how to start!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"readable-us","text":"/ˈɹiːdəbl̩/"}]},{"word":"ALMANAC","idx":12876,"count":3370384,"meanings":[{"definitions":[{"definition":"A book or table listing nautical, astronomical, astrological or other events for the year; sometimes, but not essentially, containing historical and statistical information."},{"definition":"A handbook, typically published annually, containing information on a particular subject"},{"definition":"A GPS signal consisting of coarse orbit and status information for each satellite in the constellation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[ˈɒl-]"},{"text":"[ˈæl-]"}]},{"word":"AY","idx":12878,"count":3370187,"meanings":[{"definitions":[{"definition":"Ah! alas!"},{"definition":"Yes; yea; a word expressing assent, or an affirmative answer to a question."},{"definition":"Used as a tag question, to emphasise what goes before or to request that the listener express an opinion about what has been said.","example":"These hot dogs are pretty good, eh?"},{"definition":"In isolation, a request for repetition or clarification of what has just been said. Compare what, pardon."},{"definition":"An interjection used to ascertain the continued attention of an individual addressed by the speaker","example":"I went to the restaurant, eh, but my friends didn't show up."},{"definition":"Expressing apathy or lack of enthusiasm; meh."}],"partOfSpeech":"i"},{"definitions":[{"definition":"An affirmative vote; one who votes in the affirmative.","example":"\"To call for the ayes and nays;\" \"The ayes have it.\""}],"partOfSpeech":"n"},{"definitions":[{"definition":"Always; ever; continually; for an indefinite time."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/aɪ/"}]},{"word":"RESPONDS","idx":12881,"count":3369562,"meanings":[{"definitions":[{"definition":"A response."},{"definition":"A versicle or short anthem chanted at intervals during the reading of a lection."},{"definition":"A half-pillar, pilaster, or any corresponding device engaged in a wall to receive the impost of an arch."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To say something in return; to answer; to reply.","example":"to respond to a question or an argument"},{"definition":"To act in return; to carry out an action or in return to a force or stimulus; to do something in response."},{"definition":"To correspond with; to suit."},{"definition":"To satisfy; to answer.","example":"The prisoner was held to respond the judgment of the court."},{"definition":"To be liable for payment."}],"partOfSpeech":"ve"}]},{"word":"DENOTE","idx":12882,"count":3369529,"meanings":[{"definitions":[{"definition":"To indicate; to mark.","example":"The yellow blazes denote the trail."},{"definition":"To make overt."},{"definition":"To refer to literally; to convey as meaning."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"denote-us","text":"/dɪˈnoʊt/"}]},{"word":"SLAYER","idx":12883,"count":3369067,"meanings":[{"definitions":[{"definition":"A killer; a murderer; someone who slays"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsleɪə/"}]},{"word":"PROG","idx":12885,"count":3368487,"meanings":[{"definitions":[{"definition":"Progressive rock.","example":"He listens to a lot of prog."},{"definition":"A program."},{"definition":"(university slang) A proctor."},{"definition":"A progressive."},{"definition":"Victuals got by begging, or vagrancy; victuals of any kind; food; supplies."},{"definition":"A vagrant beggar; a tramp."},{"definition":"A pointed instrument."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Favouring or promoting progress; advanced."},{"definition":"Gradually advancing in extent; increasing."},{"definition":"Promoting or favoring progress towards improved conditions or new policies, ideas or methods.","example":"a progressive politician"},{"definition":"Liberal."},{"definition":"Of or relating to progressive education.","example":"a progressive school"},{"definition":"(of an income tax or other tax) Increasing in rate as the taxable amount increases."},{"definition":"Advancing in severity.","example":"progressive paralysis"},{"definition":"(grammar) Continuous."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To wander about and beg; to seek food or other supplies by low arts; to seek advantage by mean tricks."},{"definition":"To steal; to rob; to filch."},{"definition":"To prick; to goad; to progue."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɹɒɡ/"}]},{"word":"FIREWALLS","idx":12886,"count":3367617,"meanings":[{"definitions":[{"definition":"A fireproof barrier used to prevent the spread of fire between or through buildings, structures, electrical substation transformers, or within an aircraft or vehicle."},{"definition":"The software that monitors traffic in and out of a private network or a personal computer and allows or blocks such traffic depending on its perceived threat."},{"definition":"A hypothetical phenomenon where an observer falling into a black hole encounters high-energy quanta at or near the event horizon."}],"partOfSpeech":"n"}]},{"word":"TESTER","idx":12887,"count":3366908,"meanings":[{"definitions":[{"definition":"A canopy over a bed."},{"definition":"Something that overhangs something else; especially a canopy or soundboard over a pulpit."},{"definition":"A person who administers a test."},{"definition":"A device used for testing."},{"definition":"A punishment of 25 lashes (strokes of a whip) across a person′s back."},{"definition":"A sample of perfume available in a shop for customers to try before they buy."},{"definition":"A cyclist who focuses on success in time trials."},{"definition":"An old French silver coin."},{"definition":"A sixpence."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛstə/"},{"audio":"tester-au"}]},{"word":"POLLING","idx":12888,"count":3366784,"meanings":[{"definitions":[{"definition":"To take, record the votes of (an electorate)."},{"definition":"To solicit mock votes from (a person or group)."},{"definition":"To vote at an election."},{"definition":"To register or deposit, as a vote; to elicit or call forth, as votes or voters.","example":"He polled a hundred votes more than his opponent."},{"definition":"To cut off; to remove by clipping, shearing, etc.; to mow or crop.","example":"to poll the hair; to poll wool; to poll grass"},{"definition":"To cut the hair of (a creature)."},{"definition":"To remove the horns of (an animal)."},{"definition":"To remove the top or end of; to clip; to lop.","example":"to poll a tree"},{"definition":"(communication) To (repeatedly) request the status of something (such as a computer or printer on a network).","example":"The network hub polled the department's computers to determine which ones could still respond."},{"definition":"(with adverb) To be judged in a poll."},{"definition":"To extort from; to plunder; to strip."},{"definition":"To impose a tax upon."},{"definition":"To pay as one's personal tax."},{"definition":"To enter, as polls or persons, in a list or register; to enroll, especially for purposes of taxation; to enumerate one by one."},{"definition":"To cut or shave smooth or even; to cut in a straight line without indentation.","example":"a polled deed"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of taking a poll."},{"definition":"A technique that continually interrogates a peripheral or service to see if it has data to transfer."},{"definition":"The process of voting in an election."}],"partOfSpeech":"n"}]},{"word":"PURCHASER","idx":12890,"count":3366429,"meanings":[{"definitions":[{"definition":"One who purchases."}],"partOfSpeech":"n"}]},{"word":"BINS","idx":12891,"count":3366341,"meanings":[{"definitions":[{"definition":"A box, frame, crib, or enclosed place, used as a storage container.","example":"a corn bin; a wine bin; a coal bin"},{"definition":"A container for rubbish or waste.","example":"a rubbish bin; a wastepaper bin; an ashes bin"},{"definition":"Any of the discrete intervals in a histogram, etc"},{"definition":"(birding) Binoculars."},{"definition":"Eyeglasses or spectacles."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dispose of (something) by putting it into a bin, or as if putting it into a bin."},{"definition":"To throw away, reject, give up."},{"definition":"To convert continuous data into discrete groups."},{"definition":"To place into a bin for storage.","example":"to bin wine"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bins-au","text":"/bɪnz/"}]},{"word":"RELIES","idx":12892,"count":3365831,"meanings":[{"definitions":[{"definition":"(with on or upon, formerly also with in) to trust; to have confidence in; to depend."}],"partOfSpeech":"ve"}]},{"word":"INSERTING","idx":12893,"count":3365663,"meanings":[{"definitions":[{"definition":"To put in between or into.","example":"In order to withdraw money from a cash machine, you have to insert your debit card."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something inserted or set in, such as lace in garments."}],"partOfSpeech":"n"}]},{"word":"PREPARES","idx":12895,"count":3365530,"meanings":[{"definitions":[{"definition":"To make ready for a specific future purpose; to set up; to assemble or equip.","example":"We prepared the spacecraft for takeoff."},{"definition":"To make ready for eating or drinking; to cook.","example":"We prepared a fish for dinner."},{"definition":"To make oneself ready; to get ready, make preparation.","example":"We prepared for a bumpy ride."},{"definition":"To produce or make by combining elements; to synthesize, compound.","example":"She prepared a meal from what was left in the cupboards."}],"partOfSpeech":"ve"}]},{"word":"CONCLUDES","idx":12896,"count":3364816,"meanings":[{"definitions":[{"definition":"To end; to come to an end.","example":"The story concluded with a moral."},{"definition":"To bring to an end; to close; to finish."},{"definition":"To bring about as a result; to effect; to make.","example":"to conclude a bargain"},{"definition":"To come to a conclusion, to a final decision.","example":"From the evidence, I conclude that this man was murdered."},{"definition":"To make a final determination or judgment concerning; to judge; to decide."},{"definition":"To shut off; to restrain; to limit; to estop; to bar; generally in the passive.","example":"A judgment concludes the introduction of further evidence."},{"definition":"To shut up; to enclose."},{"definition":"To include; to comprehend; to shut up together; to embrace."},{"definition":"To deduce, to infer (develop a causal relation)"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kənˈkluːdz/"}]},{"word":"CONSUMABLES","idx":12897,"count":3364039,"meanings":[{"definitions":[{"definition":"A material or product that is produced for consumption.","example":"printer consumables such as toner and ink cartridges"}],"partOfSpeech":"n"}]},{"word":"CYLINDERS","idx":12900,"count":3363442,"meanings":[{"definitions":[{"definition":"A surface created by projecting a closed two-dimensional curve along an axis intersecting the plane of the curve.","example":"When the two-dimensional curve is a circle, the cylinder is called a circular cylinder. When the axis is perpendicular to the plane of the curve, the cylinder is called a right cylinder. In non-mathematical usage, both right and circular are usually implied."},{"definition":"A solid figure bounded by a cylinder and two parallel planes intersecting the cylinder."},{"definition":"Any object in the form of a circular cylinder."},{"definition":"A cylindrical cavity or chamber in a mechanism, such as the counterpart to a piston found in a piston-driven engine."},{"definition":"The space in which a piston travels inside a reciprocating engine or pump."},{"definition":"A container in the form of a cylinder with rounded ends for storing pressurized gas; a gas cylinder."},{"definition":"An early form of phonograph recording, made on a wax cylinder."},{"definition":"The part of a revolver that contains chambers for the cartridges."},{"definition":"The corresponding tracks on a vertical arrangement of disks in a disk drive considered as a unit of data capacity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To calender; to press (paper, etc.) between rollers to make it glossy."}],"partOfSpeech":"ve"}]},{"word":"MUS","idx":12901,"count":3363179,"meanings":[{"definitions":[{"definition":"The 12th letter of the Modern Greek alphabet."}],"partOfSpeech":"n"}]},{"word":"SELECTS","idx":12902,"count":3362986,"meanings":[{"definitions":[{"definition":"To choose one or more elements of a set, especially a set of options.","example":"He looked over the menu, and selected the roast beef."},{"definition":"To obtain a set of data from a database using a query."}],"partOfSpeech":"ve"}]},{"word":"DIRECTING","idx":12904,"count":3361991,"meanings":[{"definitions":[{"definition":"To manage, control, steer.","example":"to direct the affairs of a nation or the movements of an army"},{"definition":"To aim (something) at (something else).","example":"He directed his question to the room in general."},{"definition":"To point out or show to (somebody) the right course or way; to guide, as by pointing out the way.","example":"He directed me to the left-hand road."},{"definition":"To point out to with authority; to instruct as a superior; to order.","example":"She directed them to leave immediately."},{"definition":"To put a direction or address upon; to mark with the name and residence of the person to whom anything is sent.","example":"to direct a letter"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"directing-us"}]},{"word":"NATIONALITY","idx":12905,"count":3361977,"meanings":[{"definitions":[{"definition":"Membership of a particular nation or state, by origin, birth, naturalization, ownership, allegiance or otherwise."},{"definition":"National, i.e. ethnic and/or cultural, character or identity."},{"definition":"A people sharing a common origin, culture and/or language, and possibly constituting a nation-state."},{"definition":"Political existence, independence or unity as a national entity."},{"definition":"Nationalism or patriotism."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nationality-us","text":"/-ˈnæl.ti/"}]},{"word":"STATISTICALLY","idx":12908,"count":3360392,"meanings":[{"definitions":[{"definition":"In a statistical way.","example":"He made his point statistically."},{"definition":"From a statistical point of view.","example":"Statistically, the study was almost worthless."},{"definition":"From statistical evidence.","example":"Statistically, what he said is true."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/stəˈtɪstɪkl̩i/"}]},{"word":"TORCH","idx":12909,"count":3360286,"meanings":[{"definitions":[{"definition":"A stick with a flame on one end, used chiefly as a light source; a similarly shaped implement with a replaceable supply of flammable material.","example":"The mob of angry villagers carried torches and pitchforks to the vampire's castle."},{"definition":"A portable light source powered by electricity; a flashlight.","example":"Ernst slipped and dropped his torch on the flagstones, shattering the bulb and plunging us into darkness."},{"definition":"An arsonist."},{"definition":"A blowtorch or oxy-gas torch."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To set fire to, especially by use of a torch (flaming stick).","example":"Some hoodlums had torched a derelict automobile, which emitted a ghastly pall of thick, black smoke that filled the street."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"torch-us","text":"/tɔɹtʃ/"}]},{"word":"STRETCHED","idx":12911,"count":3358892,"meanings":[{"definitions":[{"definition":"To lengthen by pulling.","example":"I stretched the rubber band until it almost broke."},{"definition":"To lengthen when pulled.","example":"The rubber band stretched almost to the breaking point."},{"definition":"To pull tight.","example":"First, stretch the skin over the frame of the drum."},{"definition":"To get more use than expected from a limited resource.","example":"I managed to stretch my coffee supply a few more days."},{"definition":"To make inaccurate by exaggeration.","example":"To say crossing the street was brave is stretching the meaning of \"brave\" considerably."},{"definition":"To extend physically, especially from limit point to limit point.","example":"The beach stretches from Cresswell to Amble."},{"definition":"To extend one’s limbs or another part of the body in order to improve the elasticity of one's muscles","example":"Cats stretch with equal ease and agility beyond the point that breaks a man on the rack."},{"definition":"To extend to a limit point","example":"His mustache stretched all the way to his sideburns."},{"definition":"To increase."},{"definition":"To stretch the truth; to exaggerate.","example":"a man apt to stretch in his report of facts"},{"definition":"To sail by the wind under press of canvas.","example":"The ship stretched to the eastward."},{"definition":"To execute by hanging."},{"definition":"To make great demands on the capacity or resources of something."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stretched-us","text":"/stɹɛtʃt/"}]},{"word":"DEPRESSED","idx":12912,"count":3358586,"meanings":[{"definitions":[{"definition":"To press down.","example":"Depress the upper lever to start the machine."},{"definition":"To make depressed, sad or bored.","example":"Winter depresses me."},{"definition":"To cause a depression or a decrease in parts of the economy.","example":"Lower productivity will eventually depress wages."},{"definition":"To bring down or humble; to abase (pride, etc.)."},{"definition":"To reduce (an equation) in a lower degree."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Unhappy; despondent"},{"definition":"Suffering damaging effects of economic recession."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈpɹɛst/"}]},{"word":"ENCOUNTERS","idx":12914,"count":3357331,"meanings":[{"definitions":[{"definition":"A meeting, especially one that is unplanned or unexpected.","example":"Their encounter was a matter of chance."},{"definition":"A hostile, often violent meeting; a confrontation, skirmish, or clash, as between combatants."},{"definition":"A match between two opposing sides."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To meet (someone) or find (something), especially unexpectedly."},{"definition":"To confront (someone or something) face to face."},{"definition":"To engage in conflict, as with an enemy.","example":"Three armies encountered at Waterloo."}],"partOfSpeech":"ve"}]},{"word":"HAUNTED","idx":12915,"count":3357045,"meanings":[{"definitions":[{"definition":"To inhabit, or visit frequently (most often used in reference to ghosts).","example":"A couple of ghosts haunt the old, burnt-down house."},{"definition":"To make uneasy, restless.","example":"The memory of his past failures haunted him."},{"definition":"To stalk, to follow","example":"The policeman haunted him, following him everywhere."},{"definition":"To live habitually; to stay, to remain."},{"definition":"To accustom; habituate; make accustomed to."},{"definition":"To practise; to devote oneself to."},{"definition":"To persist in staying or visiting."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a location, frequented by a ghost or ghosts.","example":"The hotel was haunted by a disembodied spirit."},{"definition":"Obsessed (by an idea, threat, etc.).","example":"a soldier haunted by the memories of combat"},{"definition":"Showing a feeling of being disturbed.","example":"a haunted expression"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"haunted-us","text":"/ˈhɔːntɪd/"}]},{"word":"SPARES","idx":12916,"count":3357011,"meanings":[{"definitions":[{"definition":"The act of sparing; moderation; restraint."},{"definition":"Parsimony; frugal use."},{"definition":"An opening in a petticoat or gown; a placket."},{"definition":"That which has not been used or expended."},{"definition":"A spare part, especially a spare tire."},{"definition":"A superfluous or second-best person, specially (in a dynastic context) in the phrase \"An heir and a spare\"."},{"definition":"The right of bowling again at a full set of pins, after having knocked all the pins down in less than three bowls. If all the pins are knocked down in one bowl it is a double spare; in two bowls, a single spare."},{"definition":"The act of knocking down all remaining pins in second ball of a frame; this entitles the pins knocked down on the next ball to be added to the score for that frame."},{"definition":"A free period; a block of school during which one does not have a class."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To show mercy."},{"definition":"To keep."},{"definition":"To give up To deprive oneself of, as by being frugal; to do without; to dispense with; to give up; to part with."}],"partOfSpeech":"ve"}]},{"word":"SYMMETRY","idx":12917,"count":3355779,"meanings":[{"definitions":[{"definition":"Exact correspondence on either side of a dividing line, plane, center or axis."},{"definition":"The satisfying arrangement of a balanced distribution of the elements of a whole."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɪmɪtɹi/"}]},{"word":"BOUT","idx":12919,"count":3355216,"meanings":[{"definitions":[{"definition":"A period of something, usually painful or unpleasant.","example":"a bout of drought."},{"definition":"A boxing match."},{"definition":"An assault (a fencing encounter) at which the score is kept."},{"definition":"A roller derby match."},{"definition":"A fighting competition."},{"definition":"A bulge or widening in a musical instrument, such as either of the two characteristic bulges of a guitar."},{"definition":"The going and returning of a plough, or other implement used to mark the ground and create a headland, across a field."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To contest a bout."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In a circle around; all round; on every side of; on the outside of.","example":"The snake was coiled about his ankle."},{"definition":"Over or upon different parts of; through or over in various directions; here and there in; to and fro in; throughout.","example":"He was well known about town."},{"definition":"Indicates that something will happen very soon; indicates a plan or intention to do something."},{"definition":"Concerning; with regard to; on account of; on the subject of; to affect.","example":"He talked a lot about his childhood."},{"definition":"Concerned with; engaged in; intent on.","example":"to be about one's business"},{"definition":"Within or in the immediate neighborhood of; in contiguity or proximity to; near, as to place.","example":"I can't find my reading glasses, but they must be somewhere about the house."},{"definition":"On one's person; nearby the person.","example":"I had no weapon about me but a stick."},{"definition":"In or near, as in mental faculties or in the possession of; under the control of; at one's command; in one's makeup.","example":"He has his wits about him."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"bout-uk","text":"/ˈbaʊt/"}]},{"word":"CONT","idx":12920,"count":3354965,"meanings":[{"definitions":[{"definition":"To proceed with (doing an activity); to prolong (an activity).","example":"Do you want me to continue to unload these?"},{"definition":"To make last; to prolong."},{"definition":"To retain (someone or something) in a given state, position, etc."},{"definition":"To remain in a given place or condition; to remain in connection with; to abide; to stay."},{"definition":"To resume.","example":"When will the concert continue?"},{"definition":"To adjourn, prorogue, put off.","example":"This meeting has been continued to the thirteenth of July."},{"definition":"To make a continuation bet."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Without stopping; without a break, cessation, or interruption","example":"a continuous current of electricity"},{"definition":"Without intervening space; continued","example":"a continuous line of railroad"},{"definition":"Not deviating or varying from uniformity; not interrupted; not joined or articulated."},{"definition":"(of a function) Such that, for every x in the domain, for each small open interval D about f(x), there's an interval containing x whose image is in D."},{"definition":"(more generally, of a function between two topological spaces) Such that each open set in the target space has an open preimage (in the domain space, with respect to the given function).","example":"Each continuous function from the real line to the rationals is constant, since the rationals are totally disconnected."},{"definition":"(grammar) Expressing an ongoing action or state."}],"partOfSpeech":"j"}]},{"word":"ADVERTS","idx":12921,"count":3354956,"meanings":[{"definitions":[{"definition":"An advertisement, an ad."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take notice, to pay attention (to)."},{"definition":"To turn attention to, to take notice of (something)."},{"definition":"To call attention, refer (to)."}],"partOfSpeech":"ve"}]},{"word":"PROGRAMMED","idx":12922,"count":3352969,"meanings":[{"definitions":[{"definition":"To enter a program or other instructions into (a computer or other electronic device) to instruct it to do a particular task.","example":"He programmed the DVR to record his favorite show."},{"definition":"To develop (software) by writing program code.","example":"I programmed a small game as a demonstration."},{"definition":"To put together the schedule of an event.","example":"Mary will program Tuesday’s festivities."},{"definition":"To cause to automatically behave in a particular way.","example":"The lab rat was programmed to press the lever when the bell rang."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a minister or pastor who conducts religious services."}],"partOfSpeech":"j"}]},{"word":"SALONS","idx":12924,"count":3352628,"meanings":[{"definitions":[{"definition":"A large room, especially one used to receive and entertain guests."},{"definition":"A gathering of people for a social or intellectual meeting."},{"definition":"An art gallery or exhibition; especially the Paris salon or autumn salon."},{"definition":"A beauty salon or similar establishment."}],"partOfSpeech":"n"}]},{"word":"HANK","idx":12926,"count":3350823,"meanings":[{"definitions":[{"definition":"A coil or loop of something, especially twine, yarn, or rope."},{"definition":"A ring or shackle that secures a staysail to its stay and allows the sail to glide smoothly up and down."},{"definition":"Doubt, difficulty."},{"definition":"Mess, tangle."},{"definition":"A rope or withe for fastening a gate."},{"definition":"Hold; influence."},{"definition":"A throw in which a wrestler turns his left side to his opponent, twines his left leg about his opponent's right leg from the inside, and throws him backward."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into hanks."},{"definition":"To fasten with a rope, as a gate."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hæŋk/"}]},{"word":"NEGLIGENCE","idx":12927,"count":3350614,"meanings":[{"definitions":[{"definition":"The state of being negligent."},{"definition":"The tort whereby a duty of reasonable care was breached, causing damage: any conduct short of intentional or reckless action that falls below the legal standard for preventing unreasonable injury."},{"definition":"The breach of a duty of care: the failure to exercise a standard of care that a reasonable person would have in a similar situation."}],"partOfSpeech":"n"}]},{"word":"UNCLEAR","idx":12928,"count":3350414,"meanings":[{"definitions":[{"definition":"Ambiguous; liable to more than one interpretation."},{"definition":"Not clearly or explicitly defined."},{"definition":"Not easy to see or read; indecipherable or unreadable."},{"definition":"Not having a clear idea; uncertain.","example":"I'm still unclear about what she meant by that remark."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unclear-us","text":"/ʌnˈklɪɚ/"}]},{"word":"SCREENED","idx":12929,"count":3350332,"meanings":[{"definitions":[{"definition":"To filter by passing through a screen.","example":"Mary screened the beans to remove the clumps of gravel."},{"definition":"To shelter or conceal."},{"definition":"To remove information, or censor intellectual material from viewing.","example":"The news report was screened because it accused the politician of wrongdoing."},{"definition":"To present publicly (on the screen).","example":"The news report will be screened at 11:00 tonight."},{"definition":"To fit with a screen.","example":"We need to screen this porch. These bugs are driving me crazy."},{"definition":"To examine patients or treat a sample in order to detect a chemical or a disease, or to assess susceptibility to a disease."},{"definition":"To search chemical libraries by means of a computational technique in order to identify chemical compounds which would potentially bind to a given biological target such as a protein."},{"definition":"To stand so as to block a defender from reaching a teammate."},{"definition":"To determine the source or subject matter of a call before deciding whether to answer the phone."}],"partOfSpeech":"ve"}]},{"word":"HELPER","idx":12930,"count":3350286,"meanings":[{"definitions":[{"definition":"One who helps; an aide."},{"definition":"That which helps; anything serving to assist."},{"definition":"A person who does cleaning and cooking in a family home, or in a market; domestic employee."},{"definition":"A locomotive that assists a train, usually on steep gradients."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɛlpɚ/"}]},{"word":"AROMATHERAPY","idx":12932,"count":3349561,"meanings":[{"definitions":[{"definition":"The use of selected fragrances in lotions and inhalants in an effort to affect mood and promote health."}],"partOfSpeech":"n"}]},{"word":"TRANSFERRING","idx":12934,"count":3349384,"meanings":[{"definitions":[{"definition":"To move or pass from one place, person or thing to another.","example":"to transfer the laws of one country to another; to transfer suspicion"},{"definition":"To convey the impression of (something) from one surface to another.","example":"to transfer drawings or engravings to a lithographic stone"},{"definition":"To be or become transferred."},{"definition":"To arrange for something to belong to or be officially controlled by somebody else.","example":"The title to land is transferred by deed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is transferred; a transfer."}],"partOfSpeech":"n"}]},{"word":"STEPPING","idx":12937,"count":3348507,"meanings":[{"definitions":[{"definition":"To move the foot in walking; to advance or recede by raising and moving one of the feet to another resting place, or by moving both feet in succession."},{"definition":"To walk; to go on foot; especially, to walk a little distance.","example":"to step to one of the neighbors"},{"definition":"To walk slowly, gravely, or resolutely."},{"definition":"To move mentally; to go in imagination."},{"definition":"To set, as the foot."},{"definition":"To fix the foot of (a mast) in its step; to erect."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of taking a step."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈstɛpɪŋ/"}]},{"word":"HACKS","idx":12938,"count":3348166,"meanings":[{"definitions":[{"definition":"A tool for chopping."},{"definition":"A hacking blow."},{"definition":"A gouge or notch made by such a blow."},{"definition":"A dry cough."},{"definition":"A hacking; a catch in speaking; a short, broken cough."},{"definition":"A try, an attempt."},{"definition":"The foothold traditionally cut into the ice from which the person who throws the rock pushes off for delivery."},{"definition":"A mattock or a miner's pickaxe."},{"definition":"An expedient, temporary solution, such as a small patch or change to code, meant to be replaced with a more elegant solution at a later date."},{"definition":"An interesting technical achievement, particularly in computer programming."},{"definition":"A trick, shortcut, skill, or novelty method to increase productivity, efficiency or ease.","example":"Putting your phone in a sandwich bag when you go to the beach is such a great hack."},{"definition":"An illegal attempt to gain access to a computer network."},{"definition":"A video game or any computer software that has been altered from its original state."},{"definition":"Time check."},{"definition":"A swing of the bat at a pitched ball by the batter.","example":"He took a few hacks, but the pitcher finally struck him out."},{"definition":"A kick on the shins in football."},{"definition":"Confinement of an officer to their stateroom as a punishment."},{"definition":"A board which the falcon's food is placed on; used by extension for the state of partial freedom in which they are kept before being trained."},{"definition":"A food-rack for cattle."},{"definition":"A rack used to dry something, such as bricks, fish, or cheese."},{"definition":"A grating in a mill race."},{"definition":"A horse for hire, especially one which is old and tired."},{"definition":"A person, often a journalist, hired to do routine work.","example":"I got by on hack work for years before I finally published my novel."},{"definition":"Someone who is available for hire; hireling, mercenary."},{"definition":"A taxicab (hackney cab) driver."},{"definition":"A vehicle let for hire; originally, a hackney coach, now typically a taxicab."},{"definition":"A hearse."},{"definition":"(authorship) An untalented writer.","example":"Dason is nothing but a two-bit hack."},{"definition":"One who is professionally successful despite producing mediocre work. (Usually applied to persons in a creative field.)"},{"definition":"A talented writer-for-hire, paid to put others' thoughts into felicitous language."},{"definition":"A political agitator. (slightly derogatory)"},{"definition":"A writer who hires himself out for any sort of literary work; an overworked man; a drudge."},{"definition":"A procuress."},{"definition":"A small ball usually made of woven cotton or suede and filled with rice, sand or some other filler, for use in hackeysack."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To chop or cut down in a rough manner.","example":"They hacked the brush down and made their way through the jungle."},{"definition":"To cough noisily.","example":"This cold is awful. I can't stop hacking."},{"definition":"To withstand or put up with a difficult situation.","example":"Can you hack it out here with no electricity or running water?"},{"definition":"To make a quick code change to patch a computer program, often one that, while being effective, is inelegant or makes the program harder to maintain.","example":"I hacked in a fix for this bug, but we'll still have to do a real fix later."},{"definition":"To accomplish a difficult programming task.","example":"He can hack like no one else and make the program work as expected."},{"definition":"To work with something on an intimately technical level.","example":"I'm currently hacking distributed garbage collection."},{"definition":"(by extension) To apply a trick, shortcut, skill, or novelty method to something to increase productivity, efficiency or ease.","example":"I read up on dating tips so I can hack my sex life."},{"definition":"To hack into; to gain unauthorized access to (a computer system, e.g., a website, or network) by manipulating code."},{"definition":"(by extension) To gain unauthorised access to a computer or online account belonging to (a person or organisation).","example":"When I logged into the social network, I discovered I'd been hacked."},{"definition":"To strike an opponent's leg with one's hockey stick.","example":"He's going to the penalty box after hacking the defender in front of the goal."},{"definition":"To make a flailing attempt to hit the puck with a hockey stick.","example":"There's a scramble in front of the net as the forwards are hacking at the bouncing puck."},{"definition":"To swing at a pitched ball.","example":"He went to the batter's box hacking."},{"definition":"(soccer and rugby) To kick (a player) on the shins."},{"definition":"To strike in a frantic movement."},{"definition":"To strike lightly as part of tapotement massage."},{"definition":"To lay (bricks) on a rack to dry."},{"definition":"To keep (young hawks) in a state of partial freedom, before they are trained."},{"definition":"To make common or cliched; to vulgarise."},{"definition":"To ride a horse at a regular pace; to ride on a road (as opposed to riding cross-country etc.)."},{"definition":"To be exposed or offered or to common use for hire; to turn prostitute."},{"definition":"To live the life of a drudge or hack."},{"definition":"To use as a hack; to let out for hire."},{"definition":"To use frequently and indiscriminately, so as to render trite and commonplace."},{"definition":"To play hackeysack."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hæks/"}]},{"word":"ATTIC","idx":12940,"count":3347389,"meanings":[{"definitions":[{"definition":"The space, often unfinished and with sloped walls, directly below the roof in the uppermost part of a house or other building, generally used for storage or habitation.","example":"We went up to the attic to look for the boxes containing our childhood keepsakes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈætɪk/"}]},{"word":"TOPOLOGY","idx":12942,"count":3346921,"meanings":[{"definitions":[{"definition":"A branch of mathematics studying those properties of a geometric figure or solid that are not changed by stretching, bending and similar homeomorphisms."},{"definition":"A collection τ of subsets of a set X such that the empty set and X are both members of τ, and τ is closed under finitary intersections and arbitrary unions."},{"definition":"The anatomical structure of part of the body."},{"definition":"The arrangement of nodes in a communications network."},{"definition":"The properties of a particular technological embodiment that are not affected by differences in the physical layout or form of its application."},{"definition":"(topography) The topographical study of geographic locations or given places in relation to their history."},{"definition":"The art of, or method for, assisting the memory by associating the thing or subject to be remembered with some place."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/təˈpɑlədʒi/"},{"text":"/təˈpɒlədʒi/"}]},{"word":"APPETITE","idx":12943,"count":3346826,"meanings":[{"definitions":[{"definition":"Desire to eat food or consume drink."},{"definition":"Any strong desire; an eagerness or longing."},{"definition":"The desire for some personal gratification, either of the body or of the mind.","example":"appetite for reading"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"appetite-us","text":"/ˈæp.ə.taɪt/"}]},{"word":"SENSATION","idx":12944,"count":3346679,"meanings":[{"definitions":[{"definition":"A physical feeling or perception from something that comes into contact with the body; something sensed."},{"definition":"A widespread reaction of interest or excitement."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sensation-us","text":"/sɛnˈseɪʃən/"}]},{"word":"PIPER","idx":12945,"count":3346631,"meanings":[{"definitions":[{"definition":"A musician who plays a pipe."},{"definition":"A bagpiper."},{"definition":"A baby pigeon."},{"definition":"A common European gurnard (Trigla lyra), having a large head, with prominent nasal projection, and with large, sharp, opercular spines."},{"definition":"A sea urchin (Goniocidaris hystrix) with very long spines, native to the American and European coasts."},{"definition":"A plant of the family Piperaceae."},{"definition":"A spice prepared from the fermented, dried, unripe berries of this plant."},{"definition":"A bell pepper, a fruit of the capsicum plant: red, green, yellow or white, hollow and containing seeds, and in very spicy and mild varieties."},{"definition":"A game used by baseball players to warm up where fielders standing close to a batter rapidly return the batted ball to be hit again","example":"Some ballparks have signs saying \"No pepper games\"."},{"definition":"A randomly-generated value that is added to another value (such as a password) prior to hashing. Unlike a salt, a new one is generated for each value and it is held separately from the value."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpaɪ.pɚ/"},{"text":"/ˈpaɪ.pə/"}]},{"word":"AIRBORNE","idx":12946,"count":3346446,"meanings":[{"definitions":[{"definition":"Military infantry intended to be transported by air and delivered to the battlefield by parachute or helicopter."}],"partOfSpeech":"n"},{"definitions":[{"definition":"In or carried by the air.","example":"Airborne pollen can aggravate allergies."},{"definition":"In flight."},{"definition":"Fitted to an aircraft.","example":"airborne radar"},{"definition":"Transported by air in an aircraft.","example":"airborne troops"}],"partOfSpeech":"j"}]},{"word":"MORALITY","idx":12947,"count":3346248,"meanings":[{"definitions":[{"definition":"Recognition of the distinction between good and evil or between right and wrong; respect for and obedience to the rules of right conduct; the mental disposition or characteristic of behaving in a manner intended to produce morally good results."},{"definition":"A set of social rules, customs, traditions, beliefs, or practices which specify proper, acceptable forms of conduct."},{"definition":"A set of personal guiding principles for conduct or a general notion of how to behave, whether respectable or not."},{"definition":"A lesson or pronouncement which contains advice about proper behavior."},{"definition":"A morality play."},{"definition":"Moral philosophy, the branch of philosophy which studies the grounds and nature of rightness, wrongness, good, and evil."},{"definition":"A particular theory concerning the grounds and nature of rightness, wrongness, good, and evil."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/məˈɹælɪti/"}]},{"word":"HONORABLE","idx":12948,"count":3346100,"meanings":[{"definitions":[{"definition":"Worthy of respect; respectable."},{"definition":"A courtesy title, given in Britain and the Commonwealth to a cabinet minister, minister of state, or senator, and in the United States to the president, vice president, congresspeople, state governors and legislators, and mayors."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"honorable-us","text":"/ˈɑnəɹəbl̩/"}]},{"word":"WEALTHY","idx":12949,"count":3345627,"meanings":[{"definitions":[{"definition":"A rich person."},{"definition":"(with \"the\") Rich people."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Possessing financial wealth; rich."},{"definition":"Abundant in quality or quantity; profuse."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈwɛl.θi/"}]},{"word":"HANDICAP","idx":12950,"count":3345415,"meanings":[{"definitions":[{"definition":"Something that prevents, hampers, or hinders.","example":"Age is often a handicap."},{"definition":"An allowance of a certain amount of time or distance in starting, granted in a race (or other contest of skill) to the competitor possessing disadvantages; or an additional weight or other hindrance imposed upon the one possessing advantages, in order to equalize, as much as possible, the chances of success.","example":"A handicap in chess often involves removal of the queen's rook."},{"definition":"(sometimes considered offensive) The disadvantage itself, in particular physical or mental disadvantages of people."},{"definition":"A race or similar contest in which there is an allowance of time, distance, weight, or other advantage, to equalize the chances of the competitors."},{"definition":"(card game) An old card game, similar to lanterloo."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To encumber with a handicap in any contest."},{"definition":"(by extension) To place at disadvantage.","example":"The candidate was handicapped by her lack of experience."},{"definition":"To estimate betting odds.","example":"Grandpa Andy would buy the racing form the day ahead of time so he could handicap the race before he even arrived at the track."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhændɪkæp/"}]},{"word":"SKINNY","idx":12951,"count":3345336,"meanings":[{"definitions":[{"definition":"The details or facts; especially, those obtained by gossip or rumor.","example":"She called to get the skinny on the latest goings-on in the club."},{"definition":"A state of nakedness; nudity."},{"definition":"A low-fat serving of coffee."},{"definition":"A skinny being."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To reduce or cut down."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Thin, generally in a negative sense (as opposed to slim, which is thin in a positive sense).","example":"Her recent weight loss has made her look rather skinny than slender"},{"definition":"(of food or beverages) Low-fat."},{"definition":"Naked; nude (chiefly used in the phrase skinny dipping)."},{"definition":"(of clothing) tight-fitting"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"skinny-us","text":"/ˈskɪni/"}]},{"word":"SEWAGE","idx":12952,"count":3345305,"meanings":[{"definitions":[{"definition":"A suspension of water and solid waste, transported by sewers to be disposed of or processed."},{"definition":"Sewerage."}],"partOfSpeech":"n"}]},{"word":"ENDOWMENT","idx":12953,"count":3345150,"meanings":[{"definitions":[{"definition":"Something with which a person or thing is endowed."},{"definition":"Property or funds invested for the support and benefit of a person or not-for-profit institution."},{"definition":"Endowment assurance or pure endowment."},{"definition":"A ceremony designed to prepare participants for their role in the afterlife."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɛnˈdaʊmənt/"}]},{"word":"DEMONSTRATING","idx":12954,"count":3345093,"meanings":[{"definitions":[{"definition":"To show how to use (something).","example":"Can you demonstrate the new tools for us?"},{"definition":"To show the steps taken to create a logical argument or equation."},{"definition":"To participate in or organize a demonstration.","example":"Those people outside are demonstrating against the election results."},{"definition":"To show, display, or present; to prove or make evident"}],"partOfSpeech":"ve"}]},{"word":"ANTENNAS","idx":12955,"count":3344187,"meanings":[{"definitions":[{"definition":"A feeler organ on the head of an insect, crab, or other animal."},{"definition":"An apparatus to receive or transmit electromagnetic waves and convert respectively to or from an electrical signal."},{"definition":"The faculty of intuitive astuteness."},{"definition":"A fragment of an oligosaccharide"},{"definition":"The spar to which a lateen sail is attached, which is then hoisted up the mast."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ænˈtɛnəz/"}]},{"word":"SUNDANCE","idx":12956,"count":3344089,"meanings":[{"definitions":[{"definition":"Any of various Native American religious rituals with song, dance, praying, etc."},{"definition":"Gaillardia pulchella, a flowering plant of southern US, from Arizona to Florida, and northern Mexico."}],"partOfSpeech":"n"}]},{"word":"LIFECYCLE","idx":12957,"count":3344061,"meanings":[{"definitions":[{"definition":"The course of stages through which an organism passes from fertilized zygote until maturity, reproduction, and death."},{"definition":"(by extension) The useful life of a product or system; the developmental history of an individual or group in society."}],"partOfSpeech":"n"}]},{"word":"TRUCKING","idx":12960,"count":3343556,"meanings":[{"definitions":[{"definition":"To drive a truck: Generally a truck driver's slang."},{"definition":"To convey by truck.","example":"Last week, Cletus trucked 100 pounds of lumber up to Dubuque."},{"definition":"To travel or live contentedly.","example":"Keep on trucking!"},{"definition":"To persist, to endure.","example":"Keep on trucking!"},{"definition":"(film production) To move a camera parallel to the movement of the subject."},{"definition":"To fight or otherwise physically engage with."},{"definition":"To run over or through a tackler in American football."},{"definition":"To fail; run out; run short; be unavailable; diminish; abate."},{"definition":"To give in; give way; knuckle under; truckle."},{"definition":"To deceive; cheat; defraud."},{"definition":"To tread (down); stamp on; trample (down)."},{"definition":"To trade, exchange; barter."},{"definition":"To engage in commerce; to barter or deal."},{"definition":"To have dealings or social relationships with; to engage with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Trading, bartering."},{"definition":"The conveyance of freight by trucks."},{"definition":"Lateral movement of the camera."},{"definition":"Moving quickly"},{"definition":"Walking"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɹʌkɪŋ/"}]},{"word":"DEFENDER","idx":12963,"count":3340033,"meanings":[{"definitions":[{"definition":"Someone who defends people or property"},{"definition":"One of the players whose primary task is to prevent the opposition from scoring"},{"definition":"A fighter who seeks to repel an attack"},{"definition":"A lawyer who represents defendants, especially a public defender; a defense attorney (US) or defence counsel (UK)"},{"definition":"A defendant in a civil action"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"defender-us"},{"text":"/dɪˈfɛndə(ɹ)/"}]},{"word":"SHORTCUT","idx":12966,"count":3338749,"meanings":[{"definitions":[{"definition":"A path between two points that is faster than the commonly used paths."},{"definition":"A method to accomplish something that omits one or more steps."},{"definition":"(in the Microsoft family of operating systems) A file that points to the location of another file and serves as a quick way to access it.","example":"There are shortcuts to some of my favourite applications on my desktop."},{"definition":"A keyboard shortcut: a combination of keystrokes that provides easier access to a command or operation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take or use a shortcut"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈʃɔːtkʌt/"}]},{"word":"WRETCH","idx":12967,"count":3337521,"meanings":[{"definitions":[{"definition":"An unhappy, unfortunate, or miserable person."},{"definition":"An unpleasant, annoying, worthless, or despicable person."},{"definition":"An exile."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wretch-1-us","text":"/ɹɛtʃ/"}]},{"word":"SUNLIGHT","idx":12968,"count":3337150,"meanings":[{"definitions":[{"definition":"All the electromagnetic radiation given off by the Sun, especially that in the visible spectrum that bathes the Earth.","example":"Sunlight on the skin gives you vitamin D."},{"definition":"Brightness, hope; a positive outlook."},{"definition":"The time of day when the sun appears above the eastern horizon.","example":"I'll meet you at the docks at sunrise."},{"definition":"The change in color of the sky at dawn.","example":"Did you see the beautiful sunrise this morning?"},{"definition":"Any great awakening.","example":"It was the sunrise of her spirit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To work on the side (at a secondary job) during the daytime."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sunlight-us","text":"/ˈsʌnˌlaɪt/"}]},{"word":"STEMS","idx":12969,"count":3336905,"meanings":[{"definitions":[{"definition":"Acronym of science, technology, engineering, (and) mathematics."},{"definition":"An electron microscope that transmits a very narrow beam of electrons through a sample; it can detect individual large or heavy atoms."},{"definition":"A gleam of light; a flame."},{"definition":"The stock of a family; a race or generation of progenitors."},{"definition":"A branch of a family."},{"definition":"An advanced or leading position; the lookout."},{"definition":"The above-ground stalk (technically axis) of a vascular plant, and certain anatomically similar, below-ground organs such as rhizomes, bulbs, tubers, and corms."},{"definition":"A slender supporting member of an individual part of a plant such as a flower or a leaf; also, by analogy, the shaft of a feather.","example":"the stem of an apple or a cherry"},{"definition":"A narrow part on certain man-made objects, such as a wine glass, a tobacco pipe, a spoon."},{"definition":"The main part of an uninflected word to which affixes may be added to form inflections of the word. A stem often has a more fundamental root. Systematic conjugations and declensions derive from their stems."},{"definition":"A person's leg."},{"definition":"The penis."},{"definition":"A vertical stroke of a letter."},{"definition":"A vertical stroke marking the length of a note in written music."},{"definition":"A premixed portion of a track for use in audio mastering and remixing."},{"definition":"The vertical or nearly vertical forward extension of the keel, to which the forward ends of the planks or strakes are attached."},{"definition":"A component on a bicycle that connects the handlebars to the bicycle fork"},{"definition":"A part of an anatomic structure considered without its possible branches or ramifications."},{"definition":"A crack pipe; or the long, hollow portion of a similar pipe (i.e. meth pipe) resembling a crack pipe."},{"definition":"(chiefly British) A winder on a clock, watch, or similar mechanism"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the stem from.","example":"to stem cherries; to stem tobacco leaves"},{"definition":"To be caused or derived; to originate.","example":"The current crisis stems from the short-sighted politics of the previous government."},{"definition":"To descend in a family line."},{"definition":"To direct the stem (of a ship) against; to make headway against."},{"definition":"To hit with the stem of a ship; to ram."},{"definition":"To ram (clay, etc.) into a blasting hole."},{"definition":"To stop, hinder (for instance, a river or blood).","example":"to stem a tide"},{"definition":"To move the feet apart and point the tips of the skis inward in order to slow down the speed or to facilitate a turn."}],"partOfSpeech":"ve"}]},{"word":"RACIST","idx":12970,"count":3336285,"meanings":[{"definitions":[{"definition":"A person who believes in or supports racism; a person who believes that a particular race is superior to others."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Constituting, exhibiting, advocating or pertaining to racism."},{"definition":"Discriminatory.","example":"They don't allow Muslims and gays to join the club? That's racist!"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹeɪsɪst/"}]},{"word":"WO","idx":12971,"count":3336121,"meanings":[{"definitions":[{"definition":"A falconer's call to a hawk."},{"definition":"A call to cause a horse to slow down or stop; whoa."}],"partOfSpeech":"i"},{"definitions":[{"definition":"Great sadness or distress; a misfortune causing such sadness."},{"definition":"Calamity, trouble."},{"definition":"A curse; a malediction."},{"definition":"A wall."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(possibly obsolete) To wall (to build a wall, or build a wall around)."}],"partOfSpeech":"ve"}]},{"word":"PROFITABILITY","idx":12972,"count":3335983,"meanings":[{"definitions":[{"definition":"The quality or state of being profitable; capacity to make a profit."}],"partOfSpeech":"n"}]},{"word":"CONVEY","idx":12976,"count":3335192,"meanings":[{"definitions":[{"definition":"To move (something) from one place to another.","example":"Air conveys sound. Water is conveyed through the pipe."},{"definition":"To take or carry (someone) from one place to another."},{"definition":"To communicate; to make known; to portray.","example":"to convey an impression; to convey information"},{"definition":"To transfer legal rights (to).","example":"He conveyed ownership of the company to his daughter."},{"definition":"To manage with privacy; to carry out."},{"definition":"To carry or take away secretly; to steal; to thieve."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"convey-us","text":"/kənˈveɪ/"}]},{"word":"EVERGREEN","idx":12978,"count":3333511,"meanings":[{"definitions":[{"definition":"A tree or shrub that does not shed its leaves or needles seasonally."},{"definition":"(specifically) A conifer tree."},{"definition":"A news story that can be published or broadcast at any time."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(pharmaceuticals) To extend the term of a patent beyond the normal legal limit, usually through repeated small modifications."},{"definition":"To set the repayment rate of a loan at or below the interest rate, so low that the principal will never be repaid."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of plants, especially trees, that do not shed their leaves seasonally."},{"definition":"Continually fresh or self-renewing."},{"definition":"Suitable for transmission at any time; not urgent or time-dependent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"evergreen-uk","text":"/ˈɛvəɡɹiːn/"}]},{"word":"GLOBALLY","idx":12979,"count":3332875,"meanings":[{"definitions":[{"definition":"In all places or situations."},{"definition":"Over the entire planet."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈɡloʊbəli/"},{"text":"/ˈɡləʊbəli/"}]},{"word":"BEARINGS","idx":12980,"count":3331864,"meanings":[{"definitions":[{"definition":"A mechanical device that supports another part and/or reduces friction."},{"definition":"The horizontal angle between the direction of an object and another object, or between it and that of true north; a heading or direction."},{"definition":"Relevance; a relationship or connection.","example":"That has no bearing on this issue."},{"definition":"One's posture, demeanor, or manner.","example":"She walks with a confident, self-assured bearing."},{"definition":"(in the plural) Direction or relative position."},{"definition":"That part of any member of a building which rests upon its supports.","example":"A lintel or beam may have four inches of bearing upon the wall."},{"definition":"The portion of a support on which anything rests."},{"definition":"The unsupported span.","example":"The beam has twenty feet of bearing between its supports."},{"definition":"Any single emblem or charge in an escutcheon or coat of arms."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bearings-us"}]},{"word":"GOVERN","idx":12981,"count":3331779,"meanings":[{"definitions":[{"definition":"The act of governing"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make and administer the public policy and affairs of; to exercise sovereign authority in.","example":"The old king governed the land wisely."},{"definition":"To control the actions or behavior of; to keep under control; to restrain.","example":"Govern yourselves like civilized people."},{"definition":"To exercise a deciding or determining influence on.","example":"Chance governs the outcome of many card games."},{"definition":"To control the speed, flow etc. of; to regulate.","example":"a valve that governs fuel intake"},{"definition":"To exercise political authority; to run a government."},{"definition":"To have or exercise a determining influence."},{"definition":"(grammar) To require that a certain preposition, grammatical case, etc. be used with a word; sometimes used synonymously with collocate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"govern-us","text":"/ˈɡʌvɚn/"}]},{"word":"FEATHER","idx":12982,"count":3331460,"meanings":[{"definitions":[{"definition":"A branching, hair-like structure that grows on the bodies of birds, used for flight, swimming, protection and display."},{"definition":"Long hair on the lower legs of a dog or horse, especially a draft horse, notably the Clydesdale breed. Narrowly only the rear hair."},{"definition":"One of the fins or wings on the shaft of an arrow."},{"definition":"A longitudinal strip projecting from an object to strengthen it, or to enter a channel in another object and thereby prevent displacement sideways but permit motion lengthwise; a spline."},{"definition":"Kind; nature; species (from the proverbial phrase \"birds of a feather\")."},{"definition":"One of the two shims of the three-piece stone-splitting tool known as plug and feather or plug and feathers; the feathers are placed in a borehole and then a wedge is driven between them, causing the stone to split."},{"definition":"The angular adjustment of an oar or paddle-wheel float, with reference to a horizontal axis, as it leaves or enters the water."},{"definition":"Anything petty or trifling; a whit or jot."},{"definition":"(in the plural) Partridges and pheasants, as opposed to rabbits and hares (called fur)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or furnish with feathers."},{"definition":"To arrange in the manner or appearance of feathers.","example":"The stylist feathered my hair."},{"definition":"To rotate the oars while they are out of the water to reduce wind resistance."},{"definition":"To streamline the blades of an aircraft's propeller by rotating them perpendicular to the axis of the propeller when the engine is shut down so that the propeller does not windmill during flight.","example":"After striking the bird, the pilot feathered the left, damaged engine’s propeller."},{"definition":"To finely shave or bevel an edge."},{"definition":"To intergrade or blend the pixels of an image with those of a background or neighboring image."},{"definition":"To adorn, as with feathers; to fringe."},{"definition":"To render light as a feather; to give wings to."},{"definition":"To enrich; to exalt; to benefit."},{"definition":"To tread, as a cock."},{"definition":"To accidentally touch the cue ball with the tip of the cue when taking aim"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"feather-us","text":"/ˈfɛð.ɚ/"}]},{"word":"FOND","idx":12983,"count":3331064,"meanings":[{"definitions":[{"definition":"To have a foolish affection for, to be fond of."},{"definition":"To caress; to fondle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(chiefly with of) Having a liking or affection (for)."},{"definition":"Affectionate.","example":"a fond farewell"},{"definition":"Indulgent.","example":"I have fond grandparents who spoil me."},{"definition":"Outlandish; foolish; silly."},{"definition":"Foolish; simple; weak."},{"definition":"Doted on; regarded with affection."}],"partOfSpeech":"j"},{"definitions":[{"definition":"The background design in lace-making."},{"definition":"Brown residue in pans from cooking meats and vegetables.","example":"He used the fond to make a classic French pan sauce."},{"definition":"A group of records having shared provenance."},{"definition":"Foundation; bottom; groundwork."},{"definition":"Fund, stock, or store."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fond-us","text":"/fɑnd/"}]},{"word":"SORE","idx":12984,"count":3330335,"meanings":[{"definitions":[{"definition":"An injured, infected, inflamed or diseased patch of skin.","example":"They put ointment and a bandage on the sore."},{"definition":"Grief; affliction; trouble; difficulty."},{"definition":"A group of ducks on land."},{"definition":"A young hawk or falcon in its first year."},{"definition":"A young buck in its fourth year."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mutilate the legs or feet of (a horse) in order to induce a particular gait."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Causing pain or discomfort; painfully sensitive.","example":"Her feet were sore from walking so far."},{"definition":"Sensitive; tender; easily pained, grieved, or vexed; very susceptible of irritation."},{"definition":"Dire; distressing.","example":"The school was in sore need of textbooks, theirs having been ruined in the flood."},{"definition":"Feeling animosity towards someone; annoyed or angered.","example":"Joe was sore at Bob for beating him at checkers."},{"definition":"Criminal; wrong; evil."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Very, excessively, extremely (of something bad)."},{"definition":"Sorely."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"sore-us","text":"/sɔɹ/"}]},{"word":"FIAT","idx":12986,"count":3329725,"meanings":[{"definitions":[{"definition":"An arbitrary or authoritative command or order to do something; an effectual decree.","example":"A presidential fiat."},{"definition":"Authorization, permission or (official) sanction.","example":"A government fiat."},{"definition":"(English law) A warrant of a judge for certain processes."},{"definition":"(English law) An authority for certain proceedings given by the Lord Chancellor's signature."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(used in academic debate and role-playing games) To make (something) happen."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfaɪæt/"}]},{"word":"REBOOT","idx":12987,"count":3329413,"meanings":[{"definitions":[{"definition":"An instance of rebooting."},{"definition":"The restarting of a series' storyline, discarding all previous continuity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To execute a computer's boot process, effectively resetting the computer and causing the operating system to reload, possibly after a system failure.","example":"The system reboots every weekend after updates are installed."},{"definition":"To start afresh.","example":"They rebooted the TV series, but it's even worse than the original."},{"definition":"Restart; to return to a an initial configuration or state."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"reboot-us"}]},{"word":"SIXTEEN","idx":12988,"count":3329001,"meanings":[{"definitions":[{"definition":"The cardinal number occurring after fifteen and before seventeen, represented in Arabic numerals as 16 and in Roman numerals as XVI."}],"partOfSpeech":"nu"}],"phonetics":[{"audio":"sixteen-us"},{"text":"/ˈsɪks.tiːn/"}]},{"word":"NEWSGROUP","idx":12989,"count":3327975,"meanings":[{"definitions":[{"definition":"A repository on a computer network where people can post messages, usually about a single subject."}],"partOfSpeech":"n"}]},{"word":"BLINDS","idx":12990,"count":3326896,"meanings":[{"definitions":[{"definition":"A covering for a window to keep out light. The covering may be made of cloth or of narrow slats that can block light or allow it to pass."},{"definition":"A destination sign mounted on a public transport vehicle displaying the route destination, number, name and/or via points, etc."},{"definition":"Any device intended to conceal or hide.","example":"a duck blind"},{"definition":"Something to mislead the eye or the understanding, or to conceal some covert deed or design; a subterfuge."},{"definition":"A blindage."},{"definition":"A halting place."},{"definition":"The blindside."},{"definition":"(1800s) No score."},{"definition":"A forced bet: the small blind or the big blind.","example":"The blinds are $10/$20 and the ante is $1."},{"definition":"A player who is forced to pay such a bet.","example":"The blinds immediately folded when I reraised."},{"definition":"(as a plural) Those who are blind, taken as a group."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make temporarily or permanently blind.","example":"Don't wave that pencil in my face - do you want to blind me?"},{"definition":"To curse."},{"definition":"To darken; to obscure to the eye or understanding; to conceal."},{"definition":"To cover with a thin coating of sand and fine gravel, for example a road newly paved, in order that the joints between the stones may be filled."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/blaɪndz/"}]},{"word":"TRAITS","idx":12992,"count":3326573,"meanings":[{"definitions":[{"definition":"An identifying characteristic, habit or trend.","example":"The number one personality trait I hate is hypocrisy. Why can't you be consistent!?"},{"definition":"An uninstantiable collection of methods that provides functionality to a class by using the class’s own interface.","example":"Traits are somewhat between an interface and a mixin."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tɹeɪts/"}]},{"word":"TIGHTLY","idx":12993,"count":3326221,"meanings":[{"definitions":[{"definition":"In a tight manner.","example":"tightly clenched fingers"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈtaɪtli/"}]},{"word":"GRADED","idx":12994,"count":3325972,"meanings":[{"definitions":[{"definition":"To assign scores to the components of an academic test."},{"definition":"To assign a score to overall academic performance."},{"definition":"To organize in grades.","example":"a graded reader"},{"definition":"To flatten, level, or smooth a large surface."},{"definition":"To remove or trim part of a seam allowance from a finished seam so as to reduce bulk and make the finished piece more even when turned right side out."},{"definition":"To pass imperceptibly from one grade into another."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been smoothed by a grader.","example":"a graded road"},{"definition":"Forming a series decreasing or increasing in intensity of a given quality."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɹeɪdɪd/"}]},{"word":"SUCCESSOR","idx":12996,"count":3324793,"meanings":[{"definitions":[{"definition":"A person or thing that immediately follows another in holding an office or title.","example":"George W. Bush was successor to Bill Clinton as President of the US."},{"definition":"The next heir in order or succession."},{"definition":"A person who inherits a title or office."},{"definition":"The integer, ordinal number or cardinal number immediately following another.","example":"A limit ordinal is not the successor of any ordinal."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"successor-us","text":"/səkˈsɛsə(ɹ)/"}]},{"word":"INTRUSION","idx":12998,"count":3324387,"meanings":[{"definitions":[{"definition":"The forcible inclusion or entry of an external group or individual; the act of intruding.","example":"He viewed sales calls as an unwelcome intrusion."},{"definition":"Magma forced into other rock formations; the rock formed when such magma solidifies."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"intrusion-us","text":"/ɪnˈtɹuːʒən/"}]},{"word":"SICKNESS","idx":12999,"count":3323415,"meanings":[{"definitions":[{"definition":"The quality or state of being sick or diseased; illness."},{"definition":"Nausea; qualmishness; as, sickness of stomach."},{"definition":"The analogical misuse of a rarer or marked grammatical case in the place of a more common or unmarked case."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sickness-us","text":"/ˈsɪknɪs/"}]},{"word":"UNDERNEATH","idx":13001,"count":3321843,"meanings":[{"definitions":[{"definition":"The lower surface or part of something.","example":"The underneath of the aircraft was painted blue."},{"definition":"A background radio sound track played during a specific announcement or program."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Under, lower.","example":"You can have the underneath bunk."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Below; in a place beneath."},{"definition":"On the underside or lower face."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Under, below, beneath.","example":"Underneath the water, all was calm."},{"definition":"Under the control or power of.","example":"There was little freedom underneath the jackboot."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"underneath-us","text":"/ʌndɚˈnið/"},{"audio":"underneath-uk","text":"/ʌndəˈniθ/"}]},{"word":"PROHIBIT","idx":13002,"count":3321335,"meanings":[{"definitions":[{"definition":"To forbid, disallow, or proscribe officially; to make illegal or illicit.","example":"The restaurant prohibits smoking on the patio."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prohibit-us","text":"/pɹoʊˈhɪbɪt/"}]},{"word":"METABOLIC","idx":13003,"count":3320296,"meanings":[{"definitions":[{"definition":"A nutritional supplement"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to metamorphosis; pertaining to, or involving, change."},{"definition":"Of or pertaining to metabolism","example":"metabolic activity"}],"partOfSpeech":"j"}]},{"word":"NOEL","idx":13004,"count":3320139,"meanings":[{"definitions":[{"definition":"Christmas"},{"definition":"A kind of hymn, or canticle, of mediaeval origin, sung in honor of the birth of Christ; a Christmas carol."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/nəʊˈɛl/"}]},{"word":"CANS","idx":13005,"count":3319959,"meanings":[{"definitions":[{"definition":"A more or less cylindrical vessel for liquids, usually of steel or aluminium, but sometimes of plastic, and with a carrying handle over the top."},{"definition":"A container used to carry and dispense water for plants (a watering can)."},{"definition":"A tin-plate canister, often cylindrical, for preserved foods such as fruit, meat, or fish."},{"definition":"A chamber pot, now a toilet or lavatory.","example":"Bob's in the can. You can wait a few minutes or just leave it with me."},{"definition":"Buttocks."},{"definition":"Jail or prison.","example":"Bob's in the can. He won't be back for a few years."},{"definition":"(in the plural) Headphones."},{"definition":"A drinking cup."},{"definition":"A cube-shaped buoy or marker used to denote a port-side lateral mark"},{"definition":"A chimney pot."},{"definition":"(in the plural) an E-meter used in Scientology auditing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To seal in a can.","example":"They canned air to sell as a novelty to tourists."},{"definition":"To preserve by heating and sealing in a jar or can.","example":"They spent August canning fruit and vegetables."},{"definition":"To discard, scrap or terminate (an idea, project, etc.).","example":"He canned the whole project because he thought it would fail."},{"definition":"To shut up.","example":"Can your gob."},{"definition":"To fire or dismiss an employee.","example":"The boss canned him for speaking out."},{"definition":"To hole the ball."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cans-au"}]},{"word":"ABUSED","idx":13006,"count":3319897,"meanings":[{"definitions":[{"definition":"To put to a wrong use; to misapply; to use improperly; to misuse; to use for a wrong purpose or end; to pervert","example":"He abused his authority."},{"definition":"To injure; to maltreat; to hurt; to treat with cruelty, especially repeatedly."},{"definition":"To attack with coarse language; to insult; to revile; malign; to speak in an offensive manner to or about someone; to disparage."},{"definition":"To imbibe a drug for a purpose other than it was intended; to intentionally take more of a drug than was prescribed for recreational reasons; to take illegal drugs habitually."},{"definition":"To violate; defile; to rape."},{"definition":"Misrepresent; adulterate."},{"definition":"To deceive; to trick; to impose on; misuse the confidence of."},{"definition":"Disuse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been a victim of some form of abuse, most commonly child abuse or domestic violence."},{"definition":"Overused; used profligately or in excess."}],"partOfSpeech":"j"}]},{"word":"BILLED","idx":13008,"count":3318960,"meanings":[{"definitions":[{"definition":"To dig, chop, etc., with a bill."},{"definition":"To peck"},{"definition":"To stroke bill against bill, with reference to doves; to caress in fondness"},{"definition":"To advertise by a bill or public notice."},{"definition":"To charge; to send a bill to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a specified kind of bill (beak or beak-like projection)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/bɪld/"}]},{"word":"TOONS","idx":13011,"count":3318074,"meanings":[{"definitions":[{"definition":"A cartoon, especially an animated television show."},{"definition":"A player's avatar or visible character in a massively multiplayer online role-playing game."},{"definition":"A southeast Asian and Australian tree (Toona ciliata or Toona australis) of the mahogany family with fragrant dark red wood and flowers that yield a dye."},{"definition":"The wood of this tree."},{"definition":"A town."},{"definition":"A melody."},{"definition":"A song, or short musical composition."},{"definition":"The act of tuning or maintenance.","example":"Your engine needs a good tune."},{"definition":"The state or condition of being correctly tuned.","example":"This piano is not in tune."},{"definition":"Temper; frame of mind."},{"definition":"A sound; a note; a tone."},{"definition":"Order; harmony; concord."}],"partOfSpeech":"n"}]},{"word":"BRUSHES","idx":13013,"count":3317239,"meanings":[{"definitions":[{"definition":"An implement consisting of multiple more or less flexible bristles or other filaments attached to a handle, used for any of various purposes including cleaning, painting, and arranging hair."},{"definition":"The act of brushing something.","example":"She gave her hair a quick brush."},{"definition":"A piece of conductive material, usually carbon, serving to maintain electrical contact between the stationary and rotating parts of a machine."},{"definition":"A brush-like electrical discharge of sparks."},{"definition":"Wild vegetation, generally larger than grass but smaller than trees."},{"definition":"A short and sometimes occasional encounter or experience.","example":"He has had brushes with communism from time to time."},{"definition":"The furry tail of an animal, especially of a fox."},{"definition":"A tuft of hair on the mandibles."},{"definition":"A short contest, or trial, of speed."},{"definition":"An instrument, resembling a brush, used to produce a soft sound from drums or cymbals."},{"definition":"An on-screen tool for \"painting\" a particular colour or texture."},{"definition":"A set of defined design and parameters that produce drawn strokes of a certain texture and quality.","example":"donwloading brushes for Photoshop"},{"definition":"In 3D video games, a convex polyhedron, especially one that defines structure of the play area."},{"definition":"The floorperson of a poker room, usually in a casino."},{"definition":"(North Wisconsin) Evergreen boughs, especially balsam, locally cut and baled for export, usually for use in making wreaths."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clean with a brush.","example":"Brush your teeth."},{"definition":"To untangle or arrange with a brush.","example":"Brush your hair."},{"definition":"To apply with a brush.","example":"Brush the paint onto the walls."},{"definition":"To remove with a sweeping motion.","example":"Brush the flour off your clothes."},{"definition":"To touch with a sweeping motion, or lightly in passing.","example":"Her scarf brushed his skin."},{"definition":"To clean one's teeth by brushing them."}],"partOfSpeech":"ve"}]},{"word":"TENTH","idx":13014,"count":3317039,"meanings":[{"definitions":[{"definition":"The person or thing coming next after the ninth in a series; that which is in the tenth position."},{"definition":"One of ten equal parts of a whole."},{"definition":"The interval between any tone and the tone represented on the tenth degree of the staff above it, as between one of the scale and three of the octave above; the octave of the third."},{"definition":"(in the plural) A temporary aid issuing out of personal property, and granted to the king by Parliament; formerly, the real tenth part of all the movables belonging to the subject."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To divide by ten, into tenths."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The ordinal numeral form of ten; next in order after that which is ninth."},{"definition":"Being one of ten equal parts of a whole."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tenth-us","text":"/tɛnθ/"}]},{"word":"ANTHOLOGY","idx":13015,"count":3316652,"meanings":[{"definitions":[{"definition":"A collection of literary works, such as poems or short stories, especially a collection from various authors."},{"definition":"Of a work or series containing various stories with no direct relation to one another."},{"definition":"(by extension) An assortment of things."},{"definition":"The study of flowers."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ænˈθɑlədʒi/"},{"text":"/ænˈθɒlədʒɪ/"}]},{"word":"PROSECUTOR","idx":13016,"count":3316544,"meanings":[{"definitions":[{"definition":"A prosecuting attorney.","example":"Annie Jay was the Wisconsin government prosecutor in the trial of a man for forging his client's signature."},{"definition":"A person, as a complainant, victim, or chief witness, who institutes prosecution in a criminal proceeding.","example":"The prosecutor got the witness to admit he was lying."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɹɑsəˌkjuːtəɹ/"}]},{"word":"SMILES","idx":13017,"count":3316364,"meanings":[{"definitions":[{"definition":"A facial expression comprised by flexing the muscles of both ends of one's mouth, often showing the front teeth, without vocalisation, and in humans is a common involuntary or voluntary expression of happiness, pleasure, amusement or anxiety.","example":"He always puts a smile on my face."},{"definition":"Favour; propitious regard.","example":"the smile of the gods"},{"definition":"A drink bought by one person for another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have (a smile) on one's face.","example":"I don't know what he's smiling about."},{"definition":"To express by smiling.","example":"to smile consent, or a welcome"},{"definition":"To express amusement, pleasure, or love and kindness."},{"definition":"To look cheerful and joyous; to have an appearance suited to excite joy.","example":"The sun smiled down from a clear summer sky."},{"definition":"To be propitious or favourable; to countenance.","example":"The gods smiled on his labours."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/smaɪlz/"}]},{"word":"MERGED","idx":13018,"count":3316000,"meanings":[{"definitions":[{"definition":"To combine into a whole.","example":"Headquarters merged the operations of the three divisions."},{"definition":"To combine into a whole.","example":"The two companies merged."},{"definition":"To blend gradually into something else.","example":"The lanes of traffic merged."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Joined by merging"}],"partOfSpeech":"j"}]},{"word":"AUDITORS","idx":13019,"count":3315685,"meanings":[{"definitions":[{"definition":"One who audits bookkeeping accounts."},{"definition":"In many jurisdictions, an elected or appointed public official in charge of the public accounts; a comptroller."},{"definition":"One who audits an academic course; who attends the lectures but does not earn academic credit."},{"definition":"One who listens, typically as a member of an audience."},{"definition":"One trained to perform spiritual guidance procedures."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"auditors-us"}]}]