[{"word":"DROVE","idx":9420,"count":5545848,"meanings":[{"definitions":[{"definition":"A number of cattle driven to market or new pastures."},{"definition":"(usually in the plural) A large number of people on the move (literally or figuratively)."},{"definition":"(collective) A group of hares."},{"definition":"A road or track along which cattle are habitually driven."},{"definition":"A narrow drain or channel used in the irrigation of land."},{"definition":"A broad chisel used to bring stone to a nearly smooth surface."},{"definition":"The grooved surface of stone finished by the drove chisel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide an impetus for motion or other physical change, to move an object by means of the provision of force thereto.","example":"You drive nails into wood with a hammer."},{"definition":"To provide an impetus for a non-physical change, especially a change in one's state of mind.","example":"My wife's constant harping about the condition of the house threatens to drive me to distraction."},{"definition":"To displace either physically or non-physically, through the application of force."},{"definition":"To cause intrinsic motivation through the application or demonstration of force: to impel or urge onward thusly, to compel to move on, to coerce, intimidate or threaten."},{"definition":"(especially of animals) To impel or urge onward by force; to push forward; to compel to move on.","example":"to drive twenty thousand head of cattle from Texas to the Kansas railheads; to drive sheep out of a field"},{"definition":"To direct a vehicle powered by a horse, ox or similar animal."},{"definition":"To cause animals to flee out of.","example":"The beaters drove the brambles, causing a great rush of rabbits and other creatures."},{"definition":"To move (something) by hitting it with great force.","example":"You drive nails into wood with a hammer."},{"definition":"To cause (a mechanism) to operate.","example":"The pistons drive the crankshaft."},{"definition":"To operate (a wheeled motorized vehicle).","example":"drive a car"},{"definition":"To motivate; to provide an incentive for.","example":"What drives a person to run a marathon?"},{"definition":"To compel (to do something).","example":"Their debts finally drove them to sell the business."},{"definition":"To cause to become.","example":"This constant complaining is going to drive me to insanity.   You are driving me crazy!"},{"definition":"To hit the ball with a drive."},{"definition":"To travel by operating a wheeled motorized vehicle.","example":"I drive to work every day."},{"definition":"To convey (a person, etc) in a wheeled motorized vehicle.","example":"My wife drove me to the airport."},{"definition":"To move forcefully."},{"definition":"To be moved or propelled forcefully (especially of a ship)."},{"definition":"To urge, press, or bring to a point or state."},{"definition":"To carry or to keep in motion; to conduct; to prosecute."},{"definition":"To clear, by forcing away what is contained."},{"definition":"To dig horizontally; to cut a horizontal gallery or tunnel."},{"definition":"To put together a drive (n.): to string together offensive plays and advance the ball down the field."},{"definition":"To distrain for rent."},{"definition":"To separate the lighter (feathers or down) from the heavier, by exposing them to a current of air."},{"definition":"To be the dominant party in a sex act."},{"definition":"To herd cattle; particularly over a long distance."},{"definition":"To finish (stone) with a drove chisel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"drove-us","text":"/dɹoʊv/"},{"audio":"drove-uk","text":"/dɹəʊv/"}]},{"word":"WASHER","idx":9421,"count":5545568,"meanings":[{"definitions":[{"definition":"Something that washes; especially an appliance such as a washing machine or dishwasher."},{"definition":"A person who washes (especially clothes) for a living; a washerman or washerwoman."},{"definition":"A flat disk, placed beneath a nut or at some joint, to distribute pressure, alleviate friction or prevent leakage."},{"definition":"A face cloth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fit (a mechanical device) with a washer."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"washer-us"}]},{"word":"UPSET","idx":9422,"count":5544484,"meanings":[{"definitions":[{"definition":"Disturbance or disruption.","example":"My late arrival caused the professor considerable upset."},{"definition":"An unexpected victory of a competitor or candidate that was not favored to win."},{"definition":"(automobile insurance) An overturn.","example":"\"collision and upset\": impact with another object or an overturn for whatever reason."},{"definition":"An upset stomach."},{"definition":"An upper set; a subset (X,≤) of a partially ordered set with the property that, if x is in U and x≤y, then y is in U."},{"definition":"The dangerous situation where the flight attitude or airspeed of an aircraft is outside the designed bounds of operation, possibly resulting in loss of control."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make (a person) angry, distressed, or unhappy.","example":"I’m sure the bad news will upset him, but he needs to know."},{"definition":"To disturb, disrupt or adversely alter (something).","example":"Introducing a foreign species can upset the ecological balance."},{"definition":"To tip or overturn (something)."},{"definition":"To defeat unexpectedly.","example":"Truman upset Dewey in the 1948 US presidential election."},{"definition":"To be upset or knocked over.","example":"The carriage upset when the horse bolted."},{"definition":"To set up; to put upright."},{"definition":"To thicken and shorten, as a heated piece of iron, by hammering on the end."},{"definition":"To shorten (a tire) in the process of resetting, originally by cutting it and hammering on the ends."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a person) Angry, distressed or unhappy.","example":"He was upset when she refused his friendship."},{"definition":"(of a stomach or gastrointestinal tract, referred to as stomach) Feeling unwell, nauseated, or ready to vomit.","example":"His stomach was upset, so he didn't want to move."}],"partOfSpeech":"j"}]},{"word":"RESTRICT","idx":9423,"count":5544351,"meanings":[{"definitions":[{"definition":"To restrain within boundaries; to limit; to confine","example":"After suffering diahrroea, the patient was restricted to a diet of rice, cold meat, and yoghurt."},{"definition":"(specifically) To consider (a function) as defined on a subset of its original domain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Restricted."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈstɹɪkt/"}]},{"word":"SPRINGER","idx":9424,"count":5544157,"meanings":[{"definitions":[{"definition":"A person that springs."},{"definition":"Anything that springs."},{"definition":"A spring salmon."},{"definition":"A stone at the base of an arch (from which the arch springs)."},{"definition":"A springing cow."},{"definition":"A springer spaniel."},{"definition":"A springbok."}],"partOfSpeech":"n"}]},{"word":"BESIDE","idx":9425,"count":5543255,"meanings":[{"definitions":[{"definition":"Otherwise; else."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Next to; at the side of.","example":"A small table beside the bed"},{"definition":"Not relevant to.","example":"That is beside the point"},{"definition":"Besides; in addition to."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"beside-us","text":"/biˈsaɪd/"}]},{"word":"MINES","idx":9426,"count":5542234,"meanings":[{"definitions":[{"definition":"Demeanor; facial expression or attitude, especially one which is intended by its bearer."},{"definition":"A specific facial expression."},{"definition":"An excavation from which ore or solid minerals are taken, especially one consisting of underground tunnels."},{"definition":"Any source of wealth or resources."},{"definition":"A passage dug toward or underneath enemy lines, which is then packed with explosives."},{"definition":"A device intended to explode when stepped upon or touched, or when approached by a ship, vehicle, or person."},{"definition":"A type of firework that explodes on the ground, shooting sparks upward."},{"definition":"The cavity made by a caterpillar while feeding inside a leaf."},{"definition":"A machine or network of machines used to extract units of a cryptocurrency."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove (ore) from the ground."},{"definition":"To dig into, for ore or metal."},{"definition":"To sow mines (the explosive devices) in (an area)."},{"definition":"To damage (a vehicle or ship) with a mine (an explosive device)."},{"definition":"To dig a tunnel or hole; to burrow in the earth."},{"definition":"To dig away, or otherwise remove, the substratum or foundation of; to lay a mine under; to sap; to undermine."},{"definition":"(by extension) To ruin or destroy by slow degrees or secret means."},{"definition":"To pick one's nose."},{"definition":"To earn new units of cryptocurrency by doing certain calculations."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Variation of mine, formed through analogy based on the final -s of the other possessive pronouns (ours, yours, hers, theirs, his)"}],"partOfSpeech":"p"}],"phonetics":[{"text":"/maɪnz/"}]},{"word":"PORTRAITS","idx":9427,"count":5541504,"meanings":[{"definitions":[{"definition":"A painting or other picture of a person, especially the head and shoulders."},{"definition":"An accurate depiction of a person, a mood, etc.","example":"The author painted a good portrait of urban life in New York in his latest book."},{"definition":"A print orientation where the vertical sides are longer than the horizontal sides."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"portraits-us"}]},{"word":"REBOUND","idx":9428,"count":5540042,"meanings":[{"definitions":[{"definition":"The recoil of an object bouncing off another."},{"definition":"A return to health or well-being; a recovery.","example":"I am on the rebound."},{"definition":"An effort to recover from a setback."},{"definition":"A romantic partner with whom one begins a relationship (or the relationship one begins) for the sake of getting over a previous, recently-ended romantic relationship."},{"definition":"The strike of the ball after it has bounced off a defending player, the crossbar or goalpost."},{"definition":"An instance of catching the ball after it has hit the rim or backboard without a basket being scored, generally credited to a particular player."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bound or spring back from a force."},{"definition":"To give back an echo."},{"definition":"To jump up or get back up again."},{"definition":"To send back; to reverberate."},{"definition":"To bind again."},{"definition":"To associate a command with a different key."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rebound-1-uk","text":"/ɹiˈbaʊnd/"}]},{"word":"LOGAN","idx":9429,"count":5539308,"meanings":[{"definitions":[{"definition":"A rocking or balanced stone."},{"definition":"A marsh."}],"partOfSpeech":"n"}]},{"word":"MENTOR","idx":9430,"count":5537836,"meanings":[{"definitions":[{"definition":"A wise and trusted counselor or teacher"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as someone's mentor"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmɛn.tɔɹ/"},{"text":"/ˈmɛn.tɔː/"}]},{"word":"INTERPRETED","idx":9431,"count":5535882,"meanings":[{"definitions":[{"definition":"To explain or tell the meaning of; to translate orally into intelligible or familiar language or terms. applied especially to language, but also to dreams, signs, conduct, mysteries, etc.","example":"to interpret an Indian speech"},{"definition":"To apprehend and represent by means of art; to show by illustrative representation","example":"The actor interpreted the character of Hamlet with great skill."},{"definition":"To act as an interpreter.","example":"He interpreted at the meeting between the Chinese and French associates."},{"definition":"To analyse or execute (a program) by reading the instructions as they are encountered, rather than compiling in advance."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"interpreted-us","text":"/ɪnˈtɝpɹɪtɪd/"}]},{"word":"EVALUATIONS","idx":9432,"count":5535717,"meanings":[{"definitions":[{"definition":"An assessment, such as an annual personnel performance review used as the basis for a salary increase or bonus, or a summary of a particular situation."},{"definition":"A completion of a mathematical operation; a valuation."},{"definition":"Determination of the value of a variable or expression."}],"partOfSpeech":"n"}]},{"word":"FOUGHT","idx":9433,"count":5535215,"meanings":[{"definitions":[{"definition":"To contend in physical conflict, either singly or in war, battle etc.","example":"A wounded animal will fight like a maniac, relentless, savage and murderous."},{"definition":"To contend in physical conflict with each other, either singly or in war, battle etc.","example":"The two boxers have been fighting for more than half an hour."},{"definition":"To strive for something; to campaign or contend for success.","example":"He fought for the Democrats in the last election."},{"definition":"To conduct or engage in (battle, warfare etc.).","example":"The battle was fought just over that hill."},{"definition":"To engage in combat with; to oppose physically, to contest with.","example":"My grandfather fought the Nazis in World War II."},{"definition":"To try to overpower; to fiercely counteract.","example":"The government pledged to fight corruption."},{"definition":"To cause to fight; to manage or manoeuvre in a fight.","example":"to fight cocks; to fight one's ship"},{"definition":"Of colours or other design elements: to clash; to fail to harmonize."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fought-us","text":"/fɔt/"}]},{"word":"ELIMINATION","idx":9435,"count":5533839,"meanings":[{"definitions":[{"definition":"The act of eliminating, expelling or throwing off."},{"definition":"The act of excluding a losing contestant from a match, tournament, or other competition."},{"definition":"The act of voting off or throwing off a contestant in a reality television competition."},{"definition":"The act of discharging or excreting waste products or foreign substances through the various emunctories."},{"definition":"The act of causing a quantity to disappear from an equation; especially, in the operation of deducing from several equations containing several unknown quantities a less number of equations containing a less number of unknown quantities."},{"definition":"The act of obtaining by separation, or as the result of eliminating; deduction."},{"definition":"The act of recording amounts in a consolidation statement to remove the effects of inter-company transactions."}],"partOfSpeech":"n"}]},{"word":"METRES","idx":9436,"count":5533820,"meanings":[{"definitions":[{"definition":"To measure with a metering device."},{"definition":"To imprint a postage mark with a postage meter."},{"definition":"To regulate the flow of or to deliver in regulated amounts (usually of fluids but sometimes of other things such as anticipation or breath)."},{"definition":"To put into metrical form."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The basic unit of length in the International System of Units (SI: Système International d'Unités), equal to the distance travelled by light in a vacuum in 1/299 792 458 seconds. The metre is equal to 39 47/127 (approximately 39.37) imperial inches."},{"definition":"The rhythm or measure in verse and musical composition."}],"partOfSpeech":"n"}]},{"word":"HYPOTHETICAL","idx":9437,"count":5532893,"meanings":[{"definitions":[{"definition":"A hypothetical situation or proposition","example":"These hypotheticals serve no purpose until we have more information."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Based upon a hypothesis; conjectural"},{"definition":"Conditional; contingent upon some hypothesis/antecedent"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌhaɪpəˈθɛtɪkl/"}]},{"word":"IMMIGRANTS","idx":9438,"count":5531013,"meanings":[{"definitions":[{"definition":"A non-native person who comes to a country from another country in order to permanently settle there."},{"definition":"A plant or animal that establishes itself in an area where it previously did not exist."}],"partOfSpeech":"n"}]},{"word":"COMPLIMENTARY","idx":9439,"count":5530978,"meanings":[{"definitions":[{"definition":"In the nature of a compliment.","example":"a complimentary remark"},{"definition":"Free; provided at no charge.","example":"complimentary drinks"},{"definition":"With respect to the closing of a letter, formal and professional."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"complimentary-us","text":"/ˌkɑmplɪ̈ˈmɛnt(ə)ɹi/"}]},{"word":"HELICOPTER","idx":9440,"count":5528827,"meanings":[{"definitions":[{"definition":"An aircraft that is borne along by one or more sets of long rotating blades which allow it to hover, move in any direction including reverse, or land; and typically having a smaller set of blades on its tail that stabilize the aircraft.","example":"We flew over the city in a helicopter."},{"definition":"A powered troweling machine with spinning blades used to spread concrete."},{"definition":"The winged fruit of certain trees, such as ash, elm, and maple."},{"definition":"A dragonfly."},{"definition":"A whirling trick performed with devil sticks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transport by helicopter."},{"definition":"To travel by helicopter."},{"definition":"To rotate like a helicopter blade.","example":"helicoptering his jacket, helicoptering his arms"},{"definition":"To overprotect one's children."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"helicopter-au","text":"/ˈheliˌkɔptə(ɹ)/"}]},{"word":"PENCIL","idx":9441,"count":5527529,"meanings":[{"definitions":[{"definition":"A paintbrush."},{"definition":"A writing utensil with a graphite (commonly referred to as lead) shaft, usually blended with clay, clad in wood, and sharpened to a taper."},{"definition":"An aggregate or collection of rays of light, especially when diverging from, or converging to, a point."},{"definition":"A family of geometric objects with a common property, such as the set of lines that pass through a given point in a projective plane."},{"definition":"A small medicated bougie."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write (something) using a pencil.","example":"I penciled (BrE: pencilled) a brief reminder in my notebook."},{"definition":"To mark with, or as if with, a pencil."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pencil-us","text":"/ˈpɛnsəl/"}]},{"word":"FREEZE","idx":9442,"count":5526731,"meanings":[{"definitions":[{"definition":"Especially of a liquid, to become solid due to low temperature.","example":"The lake froze solid."},{"definition":"To lower something's temperature to the point that it freezes or becomes hard.","example":"Don't freeze meat twice."},{"definition":"To drop to a temperature below zero degrees celsius, where water turns to ice.","example":"It didn't freeze this winter, but last winter was very harsh."},{"definition":"To be affected by extreme cold.","example":"Don't go outside wearing just a t-shirt; you'll freeze!"},{"definition":"(of machines and software) To come to a sudden halt, stop working (functioning).","example":"Since the last update, the program freezes / freezes up after a few minutes of use."},{"definition":"(of people and other animals) To stop (become motionless) or be stopped due to attentiveness, fear, surprise, etc.","example":"Despite all of the rehearsals, I froze up as soon as I got on stage."},{"definition":"To cause someone to become motionless."},{"definition":"To lose or cause to lose warmth of feeling; to shut out; to ostracize.","example":"Over time, he froze towards her, and ceased to react to her friendly advances."},{"definition":"To cause loss of animation or life in, from lack of heat; to give the sensation of cold to; to chill."},{"definition":"To prevent the movement or liquidation of a person's financial assets","example":"The court froze the criminal's bank account."},{"definition":"Of prices, spending etc., to keep at the same level, without any increase."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A period of intensely cold weather."},{"definition":"A halt of a regular operation."},{"definition":"The state when either a single computer program, or the whole system ceases to respond to inputs."},{"definition":"A precise draw weight shot where a delivered stone comes to a stand-still against a stationary stone, making it nearly impossible to knock out."},{"definition":"A block on pay rises or on the hiring of new employees etc.","example":"a hiring freeze; a pay freeze"},{"definition":"A kind of coarse woolen cloth or stuff with a shaggy or tufted (friezed) nap on one side."},{"definition":"That part of the entablature of an order which is between the architrave and cornice. It is a flat member or face, either uniform or broken by triglyphs, and often enriched with figures and other ornaments of sculpture."},{"definition":"Any sculptured or richly ornamented band in a building or, by extension, in rich pieces of furniture."},{"definition":"A banner with a series of pictures.","example":"The classroom had an alphabet frieze that showed an animal for each letter."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"freeze-us","text":"/ˈfɹiːz/"}]},{"word":"PERFORMER","idx":9444,"count":5525369,"meanings":[{"definitions":[{"definition":"One who performs for, or entertains, an audience."},{"definition":"One who performs or does anything.","example":"the performer of an action"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɚˈfɔɹmɚ/"},{"text":"/pəˈfɔːmə/"}]},{"word":"TITLED","idx":9446,"count":5523710,"meanings":[{"definitions":[{"definition":"To assign a title to; to entitle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Bearing a title."}],"partOfSpeech":"j"}]},{"word":"COMMISSIONS","idx":9447,"count":5523311,"meanings":[{"definitions":[{"definition":"A sending or mission (to do or accomplish something)."},{"definition":"An official charge or authority to do something, often used of military officers.","example":"David received his commission after graduating from West Point."},{"definition":"The thing to be done as agent for another.","example":"I have three commissions for the city."},{"definition":"A body or group of people, officially tasked with carrying out a particular function.","example":"The company's sexual harassment commission made sure that every employee completed the on-line course."},{"definition":"A fee charged by an agent or broker for carrying out a transaction.","example":"The real-estate broker charged a four percent commission for their knowledge on bidding for commercial properties; for their intellectual perspective on making a formal offer and the strategy to obtain a mutually satisfying deal with the seller in favour of the buyer."},{"definition":"The act of committing (e.g. a crime).","example":"the commission, preparation or instigation of an act of terrorism"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send or officially charge someone or some group to do something.","example":"James Bond was commissioned with recovering the secret documents."},{"definition":"To place an order for (often piece of art)","example":"He commissioned a replica of the Mona Lisa for his living room, but the painter gave up after six months."},{"definition":"To put into active service","example":"The aircraft carrier was commissioned in 1944, during WWII."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəˈmɪʃənz/"}]},{"word":"SPHERE","idx":9448,"count":5522351,"meanings":[{"definitions":[{"definition":"A regular three-dimensional object in which every cross-section is a circle; the figure described by the revolution of a circle about its diameter ."},{"definition":"A spherical physical object; a globe or ball."},{"definition":"The apparent outer limit of space; the edge of the heavens, imagined as a hollow globe within which celestial bodies appear to be embedded."},{"definition":"Any of the concentric hollow transparent globes formerly believed to rotate around the Earth, and which carried the heavenly bodies; there were originally believed to be eight, and later nine and ten; friction between them was thought to cause a harmonious sound (the music of the spheres)."},{"definition":"An area of activity for a planet; or by extension, an area of influence for a god, hero etc."},{"definition":"The region in which something or someone is active; one's province, domain."},{"definition":"The set of all points in three-dimensional Euclidean space (or n-dimensional space, in topology) that are a fixed distance from a fixed point ."},{"definition":"The extension of a general conception, or the totality of the individuals or species to which it may be applied."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place in a sphere, or among the spheres; to ensphere."},{"definition":"To make round or spherical; to perfect."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sphere-us","text":"/sfɪɹ/"}]},{"word":"MOSS","idx":9450,"count":5518013,"meanings":[{"definitions":[{"definition":"Any of various small, green, seedless plants growing on the ground or on the surfaces of trees, stones, etc.; now specifically, a plant of the phylum Bryophyta (formerly division Musci)."},{"definition":"A kind or species of such plants."},{"definition":"Any alga, lichen, bryophyte, or other plant of seemingly simple structure.","example":"Irish moss"},{"definition":"A bog; a fen.","example":"the mosses of the Scottish border"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become covered with moss.","example":"An oak whose boughs were mossed with age."},{"definition":"To cover (something) with moss."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"moss-us","text":"/mɔs/"}]},{"word":"RATIOS","idx":9451,"count":5517678,"meanings":[{"definitions":[{"definition":"A number representing a comparison between two named things."},{"definition":"The relative magnitudes of two quantities (usually expressed as a quotient)."},{"definition":"Short for ratio decidendi."},{"definition":"The amount of comments to a post or other expression on social media relative to the number of likes."}],"partOfSpeech":"n"}]},{"word":"CONCORD","idx":9452,"count":5516199,"meanings":[{"definitions":[{"definition":"A state of agreement; harmony; union."},{"definition":"Agreement by stipulation; compact; covenant; treaty or league"},{"definition":"(grammar) Agreement of words with one another, in gender, number, person or case."},{"definition":"An agreement between the parties to a fine of land in reference to the manner in which it should pass, being an acknowledgment that the land in question belonged to the complainant. See fine."},{"definition":"(probably influenced by chord) An agreeable combination of tones simultaneously heard; a consonant chord; consonance; harmony."},{"definition":"A variety of sweet American grape, with large dark blue (almost black) grapes in compact clusters; a Concord grape."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To agree; to act together"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"concord-1-us","text":"/ˈkɒn.kɔɹd/"}]},{"word":"GRADUATED","idx":9453,"count":5515808,"meanings":[{"definitions":[{"definition":"To be recognized by a school or university as having completed the requirements of a degree studied at the institution.","example":"The man graduated in 1967."},{"definition":"To be certified as having earned a degree from; to graduate from (an institution).","example":"Trisha graduated college."},{"definition":"To certify (a student) as having earned a degree","example":"Indiana University graduated the student."},{"definition":"To mark (something) with degrees; to divide into regular steps or intervals, as the scale of a thermometer, a scheme of punishment or rewards, etc."},{"definition":"To change gradually.","example":"sandstone which graduates into gneiss; carnelian sometimes graduates into quartz"},{"definition":"To prepare gradually; to arrange, temper, or modify by degrees or to a certain degree; to determine the degrees of.","example":"to graduate the heat of an oven"},{"definition":"To bring to a certain degree of consistency, by evaporation, as a fluid."},{"definition":"To taper, as the tail of certain birds."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In steps."},{"definition":"Having a university degree; having completed training."},{"definition":"Marked with graduations."},{"definition":"Arranged by grade, level, degree."},{"definition":"Increasing in rate with the taxable base."},{"definition":"Of a tail, having successively longer feathers towards the middle."}],"partOfSpeech":"j"}]},{"word":"ENDORSED","idx":9454,"count":5515213,"meanings":[{"definitions":[{"definition":"To support, to back, to give one's approval to, especially officially or by signature."},{"definition":"To write one's signature on the back of a cheque, or other negotiable instrument, when transferring it to a third party, or cashing it."},{"definition":"To give an endorsement."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Flanked by endorses."}],"partOfSpeech":"j"}]},{"word":"TY","idx":9455,"count":5512992,"meanings":[{"definitions":[{"definition":"An expression of gratitude or politeness in response to something done or given.","example":"“Thank you!” said the girl after her mom gave her a gift."}],"partOfSpeech":"i"}]},{"word":"SURPRISING","idx":9456,"count":5510793,"meanings":[{"definitions":[{"definition":"To cause (someone) to feel unusually alarmed or delighted by something unexpected.","example":"It surprises me that I owe twice as much as I thought I did."},{"definition":"To do something to (a person) that they are not expecting, as a surprise.","example":"He doesn’t know that I’m in the country – I thought I’d turn up at his house and surprise him."},{"definition":"To undergo or witness something unexpected.","example":"He doesn’t surprise easily."},{"definition":"To cause surprise."},{"definition":"To attack unexpectedly."},{"definition":"To take unawares."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A situation in which somebody is surprised."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing surprise.","example":"A surprising number of people attended the rally."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"surprising-us","text":"/səˈpɹaɪzɪŋ/"}]},{"word":"WALNUT","idx":9457,"count":5509894,"meanings":[{"definitions":[{"definition":"A hardwood tree of the genus Juglans."},{"definition":"A nut of the walnut tree."},{"definition":"Wood of the walnut tree."},{"definition":"Dark brown colour, the colour of walnut wood."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a dark brown colour, the colour of walnut wood."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"walnut-us","text":"/ˈwɑlnət/"}]},{"word":"LANCE","idx":9458,"count":5509634,"meanings":[{"definitions":[{"definition":"A weapon of war, consisting of a long shaft or handle and a steel blade or head; a spear carried by horsemen."},{"definition":"A wooden spear, sometimes hollow, used in jousting or tilting, designed to shatter on impact with the opposing knight’s armour."},{"definition":"A spear or harpoon used by whalers and fishermen."},{"definition":"A soldier armed with a lance; a lancer."},{"definition":"An instrument which conveys the charge of a piece of ordnance and forces it home."},{"definition":"(founding) A small iron rod which suspends the core of the mold in casting a shell."},{"definition":"One of the small paper cases filled with combustible composition, which mark the outlines of a figure."},{"definition":"A lancet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pierce with a lance, or with any similar weapon.","example":"Seized the due victim, and with fury lanced Her back. Dryden."},{"definition":"To open with a lancet; to pierce","example":"to lance a vein or an abscess"},{"definition":"To throw in the manner of a lance; to lanch."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lance-us","text":"/læns/"}]},{"word":"LADDER","idx":9459,"count":5508719,"meanings":[{"definitions":[{"definition":"A frame, usually portable, of wood, metal, or rope, used for ascent and descent, consisting of two side pieces to which are fastened rungs (cross strips or rounds acting as steps)."},{"definition":"A series of stages by which one progresses to a better position."},{"definition":"The hierarchy or ranking system within an organization, such as the corporate ladder."},{"definition":"A length of unravelled fabric in a knitted garment, especially in nylon stockings; a run."},{"definition":"In the game of go, a sequence of moves following a zigzag pattern and ultimately leading to the capture of the attacked stones."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To arrange or form into a shape of a ladder."},{"definition":"To ascend (a building, a wall, etc.) using a ladder."},{"definition":"Of a knitted garment: to develop a ladder as a result of a broken thread.","example":"Oh damn it, I've laddered my tights!"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ladder-us","text":"/ˈlædɚ/"}]},{"word":"UNNECESSARY","idx":9461,"count":5507431,"meanings":[{"definitions":[{"definition":"Not needed or necessary.","example":"The automatic child-frightener made clowns unnecessary."},{"definition":"Done in addition to requirements; unrequired."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unnecessary-us","text":"/ʌnˈnɛ.səˌsɛ.ɹi/"}]},{"word":"DRAMATICALLY","idx":9462,"count":5507401,"meanings":[{"definitions":[{"definition":"In a dramatic manner."}],"partOfSpeech":"v"}]},{"word":"CORK","idx":9465,"count":5502436,"meanings":[{"definitions":[{"definition":"The bark of the cork oak, which is very light and porous and used for making bottle stoppers, flotation devices, and insulation material."},{"definition":"A bottle stopper made from this or any other material.","example":"Snobs feel it's hard to call it wine with a straight face when the cork is made of plastic."},{"definition":"An angling float, also traditionally made of oak cork."},{"definition":"The cork oak, Quercus suber."},{"definition":"The dead protective tissue between the bark and cambium in woody plants, with suberin deposits making it impervious to gasses and water."},{"definition":"An aerialist maneuver involving a rotation where the rider goes heels over head, with the board overhead."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To seal or stop up, especially with a cork stopper."},{"definition":"To blacken (as) with a burnt cork"},{"definition":"To leave the cork in a bottle after attempting to uncork it."},{"definition":"To fill with cork, as the center of a baseball bat.","example":"He corked his bat, which was discovered when it broke, causing a controversy."},{"definition":"To injure through a blow; to induce a haematoma.","example":"The vicious tackle corked his leg."},{"definition":"To position one's drift net just outside of another person's net, thereby intercepting and catching all the fish that would have gone into that person's net."},{"definition":"To perform such a maneuver."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having the property of a head over heels rotation."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cork-us","text":"/kɔɹk/"}]},{"word":"MAXIMIZE","idx":9466,"count":5500366,"meanings":[{"definitions":[{"definition":"To make as large as possible"},{"definition":"To expand (a window) to fill the main display area"}],"partOfSpeech":"ve"}]},{"word":"SENATORS","idx":9469,"count":5497805,"meanings":[{"definitions":[{"definition":"A member, normally elected, in the house or chamber of a legislature called a senate. The legislatures of the United States and Canada have senators."},{"definition":"A position in government held in ancient Rome by experienced, elder officials as advisors or consultants for younger, less experienced functionaries."},{"definition":"A member of the king's council."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɛn.ə.tɚz/"},{"text":"/ˈsɛn.ə.təz/"}]},{"word":"WORKOUT","idx":9470,"count":5497220,"meanings":[{"definitions":[{"definition":"An exercise session; a period of physical exercise."},{"definition":"A schedule or program of specific exercises, especially one intended to achieve a particular goal."},{"definition":"(by extension) Any activity that requires much physical or mental effort, or produces strain."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɚk.aʊt/"},{"text":"/ˈwəːk.aʊt/"}]},{"word":"MALI","idx":9471,"count":5496693,"meanings":[{"definitions":[{"definition":"A member of a caste in South Asia whose traditional occupation is gardening; hence, any native gardener."},{"definition":"Money, cash."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmæli/"},{"text":"/ˈmɑːli/"}]},{"word":"BLEEDING","idx":9473,"count":5496166,"meanings":[{"definitions":[{"definition":"(of a person or animal) To lose blood through an injured blood vessel.","example":"If her nose bleeds, try to use ice."},{"definition":"To let or draw blood from."},{"definition":"To take large amounts of money from."},{"definition":"To steadily lose (something vital).","example":"The company was bleeding talent."},{"definition":"(of an ink or dye) To spread from the intended location and stain the surrounding cloth or paper.","example":"Ink traps counteract bleeding."},{"definition":"To remove air bubbles from a pipe containing other fluids."},{"definition":"To bleed on; to make bloody."},{"definition":"To show one's group loyalty by showing (its associated color) in one's blood.","example":"He was a devoted Vikings fan: he bled purple."},{"definition":"To lose sap, gum, or juice.","example":"A tree or a vine bleeds when tapped or wounded."},{"definition":"To issue forth, or drop, like blood from an incision."},{"definition":"(of a phonological rule) To destroy the environment where another phonological rule would have applied.","example":"Labialization bleeds palatalization."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The flow or loss of blood from a damaged blood vessel.","example":"Internal bleeding is often difficult to detect and can lead to death in a short time."},{"definition":"Bloodletting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Losing blood"},{"definition":"(intensifier) extreme, outright; see also bloody (sense 3).","example":"\"You are a bleeding liar. Truth is of no interest to you at all.\" — http//groups-beta.google.com/group/comp.software.year-2000/msg/ba82c9dd28cde368"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Used as an intensifier: Extremely.","example":"His car's motor is bleeding smoking down the motorway."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"bleeding-us","text":"/ˈbliːdɪŋ/"}]},{"word":"CHARACTERIZATION","idx":9474,"count":5495259,"meanings":[{"definitions":[{"definition":"The act or process of characterizing."}],"partOfSpeech":"n"}]},{"word":"COLON","idx":9475,"count":5494297,"meanings":[{"definitions":[{"definition":"The punctuation mark \":\"."},{"definition":"The triangular colon (especially in context of not being able to type the actual triangular colon)."},{"definition":"A rhetorical figure consisting of a clause which is grammatically, but not logically, complete."},{"definition":"A clause or group of clauses written as a line, or taken as a standard of measure in ancient manuscripts or texts."},{"definition":"Part of the large intestine; the final segment of the digestive system, after (distal to) the ileum and before (proximal to) the anus."},{"definition":"A husbandman."},{"definition":"A European colonial settler, especially in a French colony."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"colon-1-us","text":"/ˈkoʊ.lən/"}]},{"word":"LIKELIHOOD","idx":9476,"count":5493171,"meanings":[{"definitions":[{"definition":"The probability of a specified outcome; the chance of something happening; probability; the state or degree of being probable.","example":"In all likelihood the meeting will be cancelled."},{"definition":"The probability that some fixed outcome was generated by a random distribution with a specific parameter."},{"definition":"Likeness, resemblance.","example":"\"There is no likelihood between pure light and black darkness, or between righteousness and reprobation.\" (Sir W. Raleigh)"},{"definition":"Appearance, show, sign, expression.","example":"\"What of his heart perceive you in his face by any likelihood he showed to-day ?\" (Shak)"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlaɪklihʊd/"}]},{"word":"LANES","idx":9477,"count":5489762,"meanings":[{"definitions":[{"definition":"(used in street names) A road, street, or similar thoroughfare."},{"definition":"A narrow passageway between fences, walls, hedges or trees."},{"definition":"A narrow road, as in the country."},{"definition":"A lengthwise division of roadway intended for a single line of vehicles."},{"definition":"A similar division of a racetrack to keep runners apart."},{"definition":"A course designated for ships or aircrafts."},{"definition":"An elongated wooden strip of floor along which a bowling ball is rolled."},{"definition":"An empty space in the tableau, formed by the removal of an entire row of cards."},{"definition":"Any of the parallel slots in which values can be stored in a SIMD architecture."},{"definition":"In MOBA (multiplayer online battle arena) games, a particular path on the map that may be traversed by enemy characters."},{"definition":"The homestretch.","example":"And it's Uncle Mo in front by two as they come to the top of the lane."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/leɪnz/"}]},{"word":"PURSE","idx":9478,"count":5488891,"meanings":[{"definitions":[{"definition":"A small bag for carrying money."},{"definition":"A handbag (small bag usually used by women for carrying various small personal items)"},{"definition":"A quantity of money given for a particular purpose."},{"definition":"A specific sum of money in certain countries: formerly 500 piastres in Turkey or 50 tomans in Persia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press (one's lips) in and together so that they protrude."},{"definition":"To draw up or contract into folds or wrinkles; to pucker; to knit."},{"definition":"To put into a purse."},{"definition":"To steal purses; to rob."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"purse-us","text":"/pɝs/"}]},{"word":"FUNDAMENTALS","idx":9479,"count":5488781,"meanings":[{"definitions":[{"definition":"(usually in the plural) A leading or primary principle, rule, law, or article, which serves as the groundwork of a system; an essential part","example":"one of the fundamentals of linear algebra"},{"definition":"The lowest frequency of a periodic waveform."},{"definition":"The lowest partial of a complex tone."},{"definition":"The fundamental analysis data.","example":"While this stock has been trading at a low P/E multiple lately, I think its fundamentals are sound, and consider it a good buy for long-term investors."}],"partOfSpeech":"n"}]},{"word":"CONTAMINATION","idx":9480,"count":5488731,"meanings":[{"definitions":[{"definition":"The act or process of contaminating"},{"definition":"Something which contaminates."},{"definition":"A process whereby words with related meanings come to have similar sounds."},{"definition":"(etymology) The influence of one form (often from a foreign language) on the historical development of another form to which it may be related in meaning."},{"definition":"The process of making a material or surface unclean or unsuited for its intended purpose, usually by the addition or attachment of undesirable foreign substances."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kənˌtæmɪˈneɪʃən/"}]},{"word":"ENDANGERED","idx":9482,"count":5486113,"meanings":[{"definitions":[{"definition":"To put (someone or something) in danger; to risk causing harm to."},{"definition":"To incur the hazard of; to risk; to run the risk of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In danger, at risk, said of something where there is a strong possibility something bad will happen to it (for example, a species in danger of going extinct)"}],"partOfSpeech":"j"}]},{"word":"COMPROMISE","idx":9483,"count":5485442,"meanings":[{"definitions":[{"definition":"The settlement of differences by arbitration or by consent reached by mutual concessions."},{"definition":"A committal to something derogatory or objectionable; a prejudicial concession; a surrender.","example":"a compromise of character or right"},{"definition":"In data security, a violation of the security system such that an unauthorized disclosure or loss of sensitive information may have occurred, or the unauthorized disclosure or loss itself."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bind by mutual agreement."},{"definition":"To adjust and settle by mutual concessions; to compound."},{"definition":"To find a way between extremes."},{"definition":"To pledge by some act or declaration; to endanger the life, reputation, etc., of, by some act which can not be recalled; to expose to suspicion."},{"definition":"To cause impairment of."},{"definition":"To breach (a security system).","example":"He tried to compromise the security in the computer by guessing the password."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"compromise-us","text":"/ˈkɑmpɹəˌmaɪz/"},{"audio":"compromise-uk","text":"/ˈkɒmpɹəˌmaɪz/"}]},{"word":"MASTURBATION","idx":9484,"count":5484672,"meanings":[{"definitions":[{"definition":"Manual erotic stimulation of the genitals or other erotic regions, often to orgasm, either by oneself or a partner.","example":"Masturbation is our first and natural form of sexual activity and if that's inhibited or damaged, then we suffer for the rest of our lives. ―Betty Dodson"},{"definition":"A vain activity."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌmæstɚˈbeɪʃən/"},{"text":"/ˌmæstəˈbeɪʃ(ə)n/"}]},{"word":"OPTIMIZE","idx":9485,"count":5483874,"meanings":[{"definitions":[{"definition":"(originally intransitive) To act optimistically or as an optimist."},{"definition":"To make (something) optimal."},{"definition":"To make (something) more efficient, such as a computer program."},{"definition":"To become optimal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"optimize-us","text":"/ˈɑptɪmaɪz/"}]},{"word":"STATING","idx":9486,"count":5483075,"meanings":[{"definitions":[{"definition":"To declare to be a fact.","example":"He stated that he was willing to help."},{"definition":"To make known.","example":"State your intentions."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Statement"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsteɪtɪŋ/"}]},{"word":"DOME","idx":9487,"count":5482989,"meanings":[{"definitions":[{"definition":"A structural element resembling the hollow upper half of a sphere; a cupola"},{"definition":"Anything shaped like an upset bowl, often used as a cover","example":"a cake dome"},{"definition":"Head (uppermost part of one's body)"},{"definition":"Head, oral sex"},{"definition":"A building; a house; an edifice"},{"definition":"Any erection resembling the dome or cupola of a building, such as the upper part of a furnace, the vertical steam chamber on the top of a boiler, etc."},{"definition":"A prism formed by planes parallel to a lateral axis which meet above in a horizontal edge, like the roof of a house; also, one of the planes of such a form"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a domed shape to."},{"definition":"To perform fellatio on."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dome-au","text":"/dəʊm/"}]},{"word":"CAROLINE","idx":9488,"count":5482412,"meanings":[{"definitions":[{"definition":"An old silver coin of Italy."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɛɹ.əˌlaɪn/"},{"text":"/ˈkæ.ɹəˌlaɪn/"}]},{"word":"LEU","idx":9489,"count":5480452,"meanings":[{"definitions":[{"definition":"The unit of currency of Romania, equal to one hundred bani."},{"definition":"The unit of currency of Moldova, equal to one hundred bani."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈleɪ.uː/"}]},{"word":"EXPIRATION","idx":9490,"count":5479431,"meanings":[{"definitions":[{"definition":"The act of expiring."},{"definition":"The act or process of breathing out, or forcing air from the lungs through the nose or mouth","example":"respiration consists of inspiration and expiration"},{"definition":"Emission of volatile matter; exhalation."},{"definition":"The last emission of breath; death."},{"definition":"A cessation, extinction, ending"},{"definition":"That which is produced by breathing out, as a sound."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɛk.spəˈɹeɪ.ʃən/"}]},{"word":"NAMESPACE","idx":9491,"count":5478669,"meanings":[{"definitions":[{"definition":"A conceptual space that groups classes, identifiers, etc. to avoid conflicts with items in unrelated code that have the same names."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To categorize by placing into a namespace."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"namespace-us","text":"/ˈneɪmspeɪs/"}]},{"word":"ALIGN","idx":9492,"count":5478643,"meanings":[{"definitions":[{"definition":"To form a line; to fall into line."},{"definition":"To adjust or form to a line; to range or form in line; to bring into line."},{"definition":"To store (data) in a way that is consistent with the memory architecture, i.e. by beginning each item at an offset equal to some multiple of the word size."},{"definition":"To identify with or match the behaviour, thoughts, etc of another person."},{"definition":"To organize a linear arrangement of DNA, RNA or protein sequences which have regions of similarity."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/æˈlaɪn/"}]},{"word":"PERIPHERAL","idx":9493,"count":5477849,"meanings":[{"definitions":[{"definition":"A peripheral device."},{"definition":"Perhipheral vision."}],"partOfSpeech":"n"},{"definitions":[{"definition":"On the periphery or boundary."},{"definition":"Beside the point."},{"definition":"Unimportant."},{"definition":"Auxiliary."},{"definition":"Related to or located in the peripheral nervous system."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"peripheral-us","text":"/pəˈɹɪf(ə)ɹ(ə)l/"}]},{"word":"BLESS","idx":9494,"count":5477461,"meanings":[{"definitions":[{"definition":"To make something holy by religious rite, sanctify."},{"definition":"To make the sign of the cross upon, so as to sanctify."},{"definition":"To invoke divine favor upon."},{"definition":"To honor as holy, glorify; to extol for excellence."},{"definition":"To esteem or account happy; to felicitate."},{"definition":"To wave; to brandish."},{"definition":"(past tense only blessed) To turn (a reference) into an object."},{"definition":"(with from) To secure, defend, or prevent from."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Used as an expression of endearment, gratitude, or (ironically) belittlement."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"bless-us","text":"/blɛs/"}]},{"word":"ENGAGING","idx":9495,"count":5477196,"meanings":[{"definitions":[{"definition":"(heading) To interact socially."},{"definition":"(heading) To interact antagonistically."},{"definition":"(heading) To interact contractually."},{"definition":"(heading) To interact mechanically."},{"definition":"To enter into (an activity), to participate (construed with in)."},{"definition":"To entangle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That engages the attention; engrossing, interesting; enthralling.","example":"I found the first of the Harry Potter books a very engaging read."},{"definition":"Charming; attractive, especially of a manner or behaviour.","example":"Beauty, of course, and a bright, engaging personality — or at least the ability to fake one — are prerequisites for entering the Miss World competition."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"engaging-us","text":"/ɪnˈɡeɪd͡ʒɪŋ/"}]},{"word":"NEGOTIATION","idx":9496,"count":5477161,"meanings":[{"definitions":[{"definition":"The process of achieving agreement through discussion."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"negotiation-us","text":"/nɪˌɡoʊʃiˈeɪʃən/"}]},{"word":"CREST","idx":9497,"count":5477034,"meanings":[{"definitions":[{"definition":"The summit of a hill or mountain ridge."},{"definition":"A tuft, or other natural ornament, growing on an animal's head, for example the comb of a cockerel, the swelling on the head of a snake, the lengthened feathers of the crown or nape of bird, etc."},{"definition":"The plume of feathers, or other decoration, worn on or displayed on a helmet; the distinctive ornament of a helmet."},{"definition":"A bearing worn, not upon the shield, but usually on a helmet above it, sometimes (as for clerics) separately above the shield or separately as a mark for plate, in letterheads, and the like."},{"definition":"The upper curve of a horse's neck."},{"definition":"The ridge or top of a wave."},{"definition":"The helm or head, as typical of a high spirit; pride; courage."},{"definition":"The ornamental finishing which surmounts the ridge of a roof, canopy, etc."},{"definition":"The top line of a slope or embankment."},{"definition":"A ridge along the surface of a bone."},{"definition":"A design or logo, especially one of an institution, association or high-class family."},{"definition":"Any of several birds in the family Regulidae, including the goldcrests and firecrests."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Particularly with reference to waves, to reach a peak."},{"definition":"To reach the crest of (a hill or mountain)"},{"definition":"To furnish with, or surmount as, a crest; to serve as a crest for."},{"definition":"To mark with lines or streaks like waving plumes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crest-uk","text":"/kɹɛst/"}]},{"word":"OPPONENTS","idx":9498,"count":5474963,"meanings":[{"definitions":[{"definition":"One who opposes another; one who works or takes a position against someone or something; one who attempts to stop the progress of someone or something.","example":"During the crackdown, many opponents of the regime were arrested."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"opponents-us"}]},{"word":"TRIUMPH","idx":9499,"count":5473738,"meanings":[{"definitions":[{"definition":"A conclusive success following an effort, conflict, or confrontation of obstacles; victory; conquest.","example":"the triumph of knowledge"},{"definition":"A magnificent and imposing ceremonial performed in honor of a victor."},{"definition":"Any triumphal procession; a pompous exhibition; a stately show or pageant."},{"definition":"A state of joy or exultation at success."},{"definition":"A trump card."},{"definition":"A card game, also called trump."},{"definition":"A ceremony held to publicly celebrate and sanctify the military achievement of an army commander."},{"definition":"A work of art, cuisine, etc. of very high quality.","example":"Scorsese's latest film is a triumph."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To celebrate victory with pomp; to rejoice over success; to exult in an advantage gained; to exhibit exultation."},{"definition":"To prevail over rivals, challenges, or difficulties."},{"definition":"To succeed, win, or attain ascendancy."},{"definition":"To be prosperous; to flourish."},{"definition":"To play a trump in a card game."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"triumph-us","text":"/ˈtɹaɪ.əmf/"}]},{"word":"NOMINATED","idx":9500,"count":5473700,"meanings":[{"definitions":[{"definition":"To name someone as a candidate for a particular role or position, including that of an office."},{"definition":"To entitle, confer a name upon.","example":"1658: the City of Norwich [...] was enlarged, builded and nominated by the Saxons. — Sir Thomas Browne, Urne-Burial (Penguin 2005, p. 12)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having received a nomination.","example":"The nominated candidates will each give a speech before the election."}],"partOfSpeech":"j"}]},{"word":"CONFIDENTIALITY","idx":9501,"count":5473407,"meanings":[{"definitions":[{"definition":"The property of being confidential."},{"definition":"Something told in confidence; a secret."}],"partOfSpeech":"n"}]},{"word":"ELECTORAL","idx":9502,"count":5472569,"meanings":[{"definitions":[{"definition":"Relating to or composed of electors."},{"definition":"Of, or relating to elections."}],"partOfSpeech":"j"}]},{"word":"WELDING","idx":9504,"count":5471850,"meanings":[{"definitions":[{"definition":"To join two materials (especially two metals) together by applying heat, pressure and filler, either separately or in any combination."},{"definition":"To bind together inseparably; to unite closely or intimately."},{"definition":"To wield."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action or process of welding."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɛldɪŋ/"}]},{"word":"ORGASM","idx":9505,"count":5470251,"meanings":[{"definitions":[{"definition":"A spasm or sudden contraction."},{"definition":"A rush of sexual excitement; now specifically, the climax or peak of sexual pleasure, which occurs during sexual activity and which in males may include ejaculation and in females vaginal contractions.","example":"If you want to get an orgasm, I recommend buying a vibrator."},{"definition":"A creamy white alcoholic cocktail containing amaretto, Irish cream, and coffee liqueur."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have an orgasm."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɔɹ.ɡæz.əm/"},{"text":"/ˈɔːɡaz(ə)m/"}]},{"word":"DEFERRED","idx":9506,"count":5470097,"meanings":[{"definitions":[{"definition":"To delay or postpone","example":"We're going to defer the decision until we have all the facts."},{"definition":"After winning the opening coin toss, to postpone until the start of the second half a team's choice of whether to kick off or receive (and to allow the opposing team to make this choice at the start of the first half)."},{"definition":"To delay, to wait."},{"definition":"To submit to the opinion or desire of another in respect to their judgment or authority."},{"definition":"To render, to offer."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A deferred bond."},{"definition":"An oath or affirmation; a vow","example":"if I make a promise, I always stick to it;  he broke his promise"},{"definition":"A transaction between two persons whereby the first person undertakes in the future to render some service or gift to the second person or devotes something valuable now and here to his use"},{"definition":"Reason to expect improvement or success; potential","example":"She shows great promise as an actress."},{"definition":"A placeholder object representing the eventual result of an asynchronous operation"},{"definition":"Bestowal or fulfillment of what is promised"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Delayed; put off till later.","example":"requested a deferred payment"},{"definition":"Yielded to someone else's decision or judgment.","example":"The decision was deferred to the regional manager"},{"definition":"Whose value is not realized until a future date: e.g. annuities, charges, taxes and income, either as an asset or liability."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈfɜːd/"}]},{"word":"ALTERNATIVELY","idx":9507,"count":5469870,"meanings":[{"definitions":[{"definition":"In an alternative way"},{"definition":"Used to link a pair of possibilities"}],"partOfSpeech":"v"}]},{"word":"HEEL","idx":9508,"count":5468921,"meanings":[{"definitions":[{"definition":"The rear part of the foot, where it joins the leg."},{"definition":"The part of a shoe's sole which supports the foot's heel."},{"definition":"The rear part of a sock or similar covering for the foot."},{"definition":"The part of the palm of a hand closest to the wrist.","example":"He drove the heel of his hand into the man's nose."},{"definition":"(usually in the plural) A woman's high-heeled shoe."},{"definition":"The back, upper part of the stock."},{"definition":"The last or lowest part of anything.","example":"the heel of a mast"},{"definition":"A crust end-piece of a loaf of bread."},{"definition":"The base of a bun sliced in half lengthwise."},{"definition":"A contemptible, inconsiderate or thoughtless person."},{"definition":"A headlining wrestler regarded as a \"bad guy,\" whose ring persona embodies villainous or reprehensible traits and demonstrates characteristics of a braggart and a bully."},{"definition":"The cards set aside for later use in a patience or solitaire game."},{"definition":"Anything resembling a human heel in shape; a protuberance; a knob."},{"definition":"The lower end of a timber in a frame, as a post or rafter."},{"definition":"(specifically) The obtuse angle of the lower end of a rafter set sloping."},{"definition":"(workman slang) A cyma reversa."},{"definition":"The short side of an angled cut."},{"definition":"The part of a club head's face nearest the shaft."},{"definition":"The lower end of the bit (cutting edge) of an axehead; as opposed to the toe (upper end)."},{"definition":"In a carding machine, the part of a flat nearest the cylinder."},{"definition":"The act of inclining or canting from a vertical position; a cant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To follow at somebody's heels; to chase closely.","example":"She called to her dog to heel."},{"definition":"To add a heel to, or increase the size of the heel of (a shoe or boot)."},{"definition":"To kick with the heel."},{"definition":"To perform by the use of the heels, as in dancing, running, etc."},{"definition":"To arm with a gaff, as a cock for fighting."},{"definition":"To hit (the ball) with the heel of the club."},{"definition":"To make (a fair catch) standing with one foot forward, the heel on the ground and the toe up."},{"definition":"To incline to one side; to tilt."},{"definition":"To make better from a disease, wound, etc.; to revive or cure.","example":"This bandage will heal your cut."},{"definition":"To become better or healthy again.","example":"Bandages allow cuts to heal."},{"definition":"To reconcile, as a breach or difference; to make whole; to free from guilt.","example":"to heal dissensions"},{"definition":"To hide, conceal, and keep secret, especially for a secret society (such as the masons)."},{"definition":"(now especially in the phrase \"hele in\") To cover or conceal (a seedling, plant, roots, etc)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"heel-us","text":"/hiːl/"}]},{"word":"ALLOY","idx":9509,"count":5468839,"meanings":[{"definitions":[{"definition":"A metal that is a combination of two or more elements, at least one of which is a metal."},{"definition":"A metal of lesser value, mixed with a metal of greater value.","example":"gold without alloy"},{"definition":"An admixture; something added which stains, taints etc."},{"definition":"Fusion, marriage, combination."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mix or combine; often used of metals."},{"definition":"To reduce the purity of by mixing with a less valuable substance.","example":"to alloy gold with silver or copper, or silver with copper"},{"definition":"To impair or debase by mixture.","example":"to alloy pleasure with misfortunes"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"alloy-us"}]},{"word":"CONDOS","idx":9510,"count":5466903,"meanings":[{"definitions":[{"definition":"Joint sovereignty over a territory by two or more countries."},{"definition":"A region or territory under such rule."},{"definition":"A building in which each unit is owned by an individual but the grounds, structure etc are owned jointly."},{"definition":"The system of ownership by which such condominiums operate"},{"definition":"A unit or apartment in such a complex."},{"definition":"The legal tenure involved."}],"partOfSpeech":"n"}]},{"word":"PLOTS","idx":9511,"count":5466589,"meanings":[{"definitions":[{"definition":"(authorship) The course of a story, comprising a series of incidents which are gradually unfolded, sometimes by unexpected means."},{"definition":"An area or land used for building on or planting on."},{"definition":"A graph or diagram drawn by hand or produced by a mechanical or electronic device."},{"definition":"A secret plan to achieve an end, the end or means usually being illegal or otherwise questionable.","example":"The assassination of Lincoln was part of a larger plot."},{"definition":"Contrivance; deep reach thought; ability to plot or intrigue."},{"definition":"Participation in any stratagem or conspiracy."},{"definition":"A plan; a purpose."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To conceive (a crime, etc).","example":"They had plotted a robbery."},{"definition":"To trace out (a graph or diagram).","example":"They plotted the number of edits per day."},{"definition":"To mark (a point on a graph, chart, etc).","example":"Every five minutes they plotted their position."},{"definition":"To conceive a crime, misdeed, etc.","example":"They were plotting against the king."}],"partOfSpeech":"ve"}]},{"word":"POLISHED","idx":9512,"count":5465964,"meanings":[{"definitions":[{"definition":"To shine; to make a surface very smooth or shiny by rubbing, cleaning, or grinding.","example":"He polished up the chrome until it gleamed."},{"definition":"To refine; remove imperfections from.","example":"The band has polished its performance since the last concert."},{"definition":"To apply shoe polish to shoes."},{"definition":"To become smooth, as from friction; to receive a gloss; to take a smooth and glossy surface.","example":"Steel polishes well."},{"definition":"To refine; to wear off the rudeness, coarseness, or rusticity of; to make elegant and polite."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made smooth or shiny by polishing.","example":"polished shoes"},{"definition":"Refined, elegant.","example":"a polished performance"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"polished-us","text":"/ˈpɑlɪʃt/"}]},{"word":"YANG","idx":9513,"count":5465949,"meanings":[{"definitions":[{"definition":"A principle in Chinese and related East Asian philosophies associated with bright, hot, masculine, etc. elements of the natural world."},{"definition":"The monetary unit of Korea from 1892 to 1902, divided into 100 pun."},{"definition":"The cry of the wild goose; a honk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make the cry of the wild goose."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"yang-1-uk","text":"/jæŋ/"}]},{"word":"GENTLY","idx":9514,"count":5465493,"meanings":[{"definitions":[{"definition":"In a gentle manner"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"gently-us","text":"/ˈdʒɛntli/"}]},{"word":"LOCKING","idx":9517,"count":5463134,"meanings":[{"definitions":[{"definition":"To become fastened in place.","example":"If you put the brakes on too hard, the wheels will lock."},{"definition":"To fasten with a lock.","example":"Remember to lock the door when you leave."},{"definition":"To be capable of becoming fastened in place.","example":"This door locks with a key."},{"definition":"To intertwine or dovetail.","example":"We locked arms and stepped out into the night."},{"definition":"(break dancing) To freeze one's body or a part thereof in place.","example":"a pop and lock routine"},{"definition":"To furnish (a canal) with locks."},{"definition":"To raise or lower (a boat) in a lock."},{"definition":"To seize (e.g. the sword arm of an antagonist) by turning the left arm around it, to disarm him."},{"definition":"To modify (a thread) so that users cannot make new posts in it."},{"definition":"(WMF jargon) To prevent a page from being edited by other users.","example":"Frequently vandalized pages are generally locked to prevent further damage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is locked."},{"definition":"The use of a lock or a mutex to restrict access to a part of the code to at most one process."}],"partOfSpeech":"n"}]},{"word":"CONTROVERSIAL","idx":9519,"count":5460493,"meanings":[{"definitions":[{"definition":"Arousing controversy—a debate or discussion of opposing opinions."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"controversial-uk","text":"/kɒn.tɹə.ˈvɜː.sjəl/"}]},{"word":"DRAWS","idx":9520,"count":5458448,"meanings":[{"definitions":[{"definition":"The result of a contest that neither side has won; a tie.","example":"The game ended in a draw."},{"definition":"The procedure by which the result of a lottery is determined.","example":"The draw is on Saturday."},{"definition":"Something that attracts e.g. a crowd."},{"definition":"The result of a two-innings match in which at least one side did not complete all their innings before time ran out (as distinguished from a tie)."},{"definition":"A golf shot that (for the right-handed player) curves intentionally to the left. See hook, slice, fade."},{"definition":"A shot that is intended to land gently in the house (the circular target) without knocking out other stones; cf. takeout."},{"definition":"A dry stream bed that drains surface water only during periods of heavy rain or flooding."},{"definition":"A bag of cannabis."},{"definition":"Cannabis."},{"definition":"In a commission-based job, an advance on future (potential) commissions given to an employee by the employer."},{"definition":"A situation in which one or more players has four cards of the same suit or four out of five necessary cards for a straight and requires a further card to make their flush or straight."},{"definition":"The act of pulling back the strings in preparation of firing."},{"definition":"The spin or twist imparted to a ball etc. by a drawing stroke."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move or develop something."},{"definition":"To exert or experience force."},{"definition":"(fluidic) To remove or separate or displace."},{"definition":"To change in size or shape."},{"definition":"To attract or be attracted."},{"definition":"(usually as draw on or draw upon) To rely on; utilize as a source.","example":"She had to draw upon her experience to solve the problem."},{"definition":"To disembowel."},{"definition":"To end a game in a draw (with neither side winning).","example":"We drew last time we played.  I drew him last time I played him.  I drew my last game against him."},{"definition":"To choose by means of a random selection process."},{"definition":"To make a shot that lands gently in the house (the circular target) without knocking out other stones."},{"definition":"To play (a short-length ball directed at the leg stump) with an inclined bat so as to deflect the ball between the legs and the wicket."},{"definition":"To hit (the ball) with the toe of the club so that it is deflected toward the left."},{"definition":"To strike (the cue ball) below the center so as to give it a backward rotation which causes it to take a backward direction on striking another ball."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɹɑz/"}]},{"word":"FRIDGE","idx":9521,"count":5458180,"meanings":[{"definitions":[{"definition":"A refrigerator."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place inside of a refrigerator."},{"definition":"To gratuitously kill, disempower, or otherwise remove a character, usually female, from a narrative, often strictly to hurt another character, usually male, and provide him with a personal motivation for fighting the antagonist(s)."},{"definition":"To rub, chafe."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fridge-uk","text":"/fɹɪd͡ʒ/"}]},{"word":"BLANKET","idx":9522,"count":5457762,"meanings":[{"definitions":[{"definition":"A heavy, loosely woven fabric, usually large and woollen, used for warmth while sleeping or resting.","example":"The baby was cold, so his mother put a blanket over him."},{"definition":"A layer of anything.","example":"The city woke under a thick blanket of fog."},{"definition":"A thick rubber mat used in the offset printing process to transfer ink from the plate to the paper being printed.","example":"A press operator must carefully wash the blanket whenever changing a plate."},{"definition":"A streak or layer of blubber in whales."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover with, or as if with, a blanket.","example":"A fresh layer of snow blanketed the area."},{"definition":"To traverse or complete thoroughly.","example":"The salesman blanketed the entire neighborhood."},{"definition":"To toss in a blanket by way of punishment."},{"definition":"To take the wind out of the sails of (another vessel) by sailing to windward of it."},{"definition":"To nullify the impact of someone or something."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"General; covering or encompassing everything.","example":"They sought to create a blanket solution for all situations."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"blanket-us","text":"/ˈblæŋkɪt/"},{"audio":"blanket-uk","text":"/ˈblæŋkɪt/"}]},{"word":"BLOOM","idx":9523,"count":5456938,"meanings":[{"definitions":[{"definition":"A blossom; the flower of a plant; an expanded bud."},{"definition":"Flowers, collectively."},{"definition":"The opening of flowers in general; the state of blossoming or of having the flowers open.","example":"The cherry trees are in bloom."},{"definition":"A state or time of beauty, freshness, and vigor; an opening to higher perfection, analogous to that of buds into blossoms.","example":"the bloom of youth"},{"definition":"Rosy colour; the flush or glow on a person's cheek."},{"definition":"The delicate, powdery coating upon certain growing or newly-gathered fruits or leaves, as on grapes, plums, etc."},{"definition":"Anything giving an appearance of attractive freshness."},{"definition":"The clouded appearance which varnish sometimes takes upon the surface of a picture."},{"definition":"A yellowish deposit or powdery coating which appears on well-tanned leather."},{"definition":"A bright-hued variety of some minerals.","example":"the rose-red cobalt bloom"},{"definition":"A white area of cocoa butter that forms on the surface of chocolate when warmed and cooled."},{"definition":"An undesirable halo effect that may occur when a very bright region is displayed next to a very dark region of the screen."},{"definition":"The spongy mass of metal formed in a furnace by the smelting process."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to blossom; to make flourish."},{"definition":"To bestow a bloom upon; to make blooming or radiant."},{"definition":"Of a plant, to produce blooms; to open its blooms."},{"definition":"Of a person, business, etc, to flourish; to be in a state of healthful, growing youth and vigour; to show beauty and freshness."},{"definition":"(Cooking) To bring out the flavor of a spice by cooking it in oil."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bloom-us","text":"/bluːm/"}]},{"word":"QC","idx":9524,"count":5455396,"meanings":[{"definitions":[{"definition":"Quaternionic contact"}],"partOfSpeech":"n"}]},{"word":"RECOVERED","idx":9528,"count":5448893,"meanings":[{"definitions":[{"definition":"To get back, to regain (a physical thing; in astronomy and navigation, sight of a thing or a signal).","example":"After days of inquiries, he finally recovered his lost wallet."},{"definition":"To salvage, to extricate, to rescue (a thing or person)","example":"They recovered three of the explorers very much alive, then another, wracked with severe hypothermia, who was taken to hospital."},{"definition":"To replenish to, resume (a good state of mind or body).","example":"At the top of the hill I asked to stop for a few minutes to recover my strength."},{"definition":"To obtain a positive judgement; to win in a lawsuit.","example":"The plaintiff recovered in his suit, being awarded declaratory relief and a clearing of his name."},{"definition":"To gain as compensation or reparation, usually by formal legal process","example":"to recover damages in trespass; to recover debt and costs in a legal action or that is owing"},{"definition":"To reach (a place), arrive at."},{"definition":"To restore to good health, consciousness, life etc."},{"definition":"To make good by reparation; to make up for; to retrieve; to repair the loss or injury of.","example":"to recover lost time"},{"definition":"To get better, to regain health or prosperity","example":"I lost out in the deal, but I quickly recovered financially"},{"definition":"To regain one's composure, balance etc.","example":"Spinning round, he caught a stone with his ankle, but recovered quickly before turning to face me."},{"definition":"To cover again."},{"definition":"(roofing) To add a new roof membrane or steep-slope covering over an existing one."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"recovered-us","text":"/ɹɪˈkʌvɚd/"}]},{"word":"JUSTIFY","idx":9530,"count":5448520,"meanings":[{"definitions":[{"definition":"To provide an acceptable explanation for.","example":"How can you justify spending so much money on clothes?"},{"definition":"To be a good, acceptable reason for; warrant.","example":"Nothing can justify your rude behaviour last night."},{"definition":"To arrange (text) on a page or a computer screen such that the left and right ends of all lines within paragraphs are aligned.","example":"The text will look better justified."},{"definition":"To absolve, and declare to be free of blame or sin."},{"definition":"To give reasons for one’s actions; to make an argument to prove that one is in the right.","example":"She felt no need to justify herself for deciding not to invite him."},{"definition":"To prove; to ratify; to confirm."},{"definition":"To show (a person) to have had a sufficient legal reason for an act that has been made the subject of a charge or accusation."},{"definition":"To qualify (oneself) as a surety by taking oath to the ownership of sufficient property."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"justify-us","text":"/ˈdʒʌstɪfaɪ/"}]},{"word":"UPGRADING","idx":9531,"count":5448063,"meanings":[{"definitions":[{"definition":"To improve, usually applied to technology, generally by complete replacement of one or more components","example":"When you upgrade your standard of living, you become addicted to that standard of living."},{"definition":"To replace with something better.","example":"I had to upgrade my anti-virus software to protect my computer from the newer threats."},{"definition":"To improve the equipment or furnishings of or services rendered to","example":"They upgraded him to the latest model."},{"definition":"To improve in condition or status.","example":"She upgraded to a more successful husband."},{"definition":"To replace a program with a later version of itself, a version having a higher version number or marketed under a more recent product name."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is upgraded."}],"partOfSpeech":"n"}]},{"word":"BLADES","idx":9532,"count":5446861,"meanings":[{"definitions":[{"definition":"The sharp cutting edge of a knife, chisel, or other tool, a razor blade/sword."},{"definition":"The flat functional end of a propeller, oar, hockey stick, screwdriver, skate, etc."},{"definition":"The narrow leaf of a grass or cereal."},{"definition":"The thin, flat part of a plant leaf, attached to a stem (petiole). The lamina."},{"definition":"A flat bone, especially the shoulder blade."},{"definition":"A cut of beef from near the shoulder blade (part of the chuck)."},{"definition":"The part of the tongue just behind the tip, used to make laminal consonants."},{"definition":"A sword or knife."},{"definition":"A piece of prepared, sharp-edged stone, often flint, at least twice as long as it is wide; a long flake of ground-edge stone or knapped vitreous stone."},{"definition":"(ultimate frisbee) A throw characterized by a tight parabolic trajectory due to a steep lateral attitude."},{"definition":"The rudder, daggerboard, or centerboard of a vessel."},{"definition":"A bulldozer or surface-grading machine with mechanically adjustable blade that is nominally perpendicular to the forward motion of the vehicle."},{"definition":"A dashing young man."},{"definition":"A homosexual, usually male."},{"definition":"Thin plate, foil."},{"definition":"One of a series of small plates that make up the aperture or the shutter of a camera."},{"definition":"(in the plural) The principal rafters of a roof."},{"definition":"The four large shell plates on the sides, and the five large ones of the middle, of the carapace of the sea turtle, which yield the best tortoise shell."},{"definition":"Airfoil in windmills and windturbines."},{"definition":"A blade server."},{"definition":"An exterior product of vectors. (The product may have more than two factors. Also, a scalar counts as a 0-blade, a vector as a 1-blade; an exterior product of k vectors may be called a k-blade.)"},{"definition":"The part of a key that is inserted into the lock."},{"definition":"A kind of piton used in thin cracks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To skate on rollerblades.","example":"Want to go blading with me later in the park?"},{"definition":"To furnish with a blade."},{"definition":"To put forth or have a blade."},{"definition":"To stab with a blade","example":"The gang member got bladed in a fight."},{"definition":"To cut (a person) so as to provoke bleeding."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"blades-us","text":"/bleɪdz/"}]},{"word":"LOOPS","idx":9534,"count":5439483,"meanings":[{"definitions":[{"definition":"A length of thread, line or rope that is doubled over to make an opening."},{"definition":"The opening so formed."},{"definition":"A shape produced by a curve that bends around and crosses itself.","example":"Arches, loops, and whorls are patterns found in fingerprints."},{"definition":"A ring road or beltway."},{"definition":"An endless strip of tape or film allowing continuous repetition."},{"definition":"A complete circuit for an electric current."},{"definition":"A programmed sequence of instructions that is repeated until or while a particular condition is satisfied."},{"definition":"An edge that begins and ends on the same vertex."},{"definition":"A path that starts and ends at the same point."},{"definition":"A bus or rail route, walking route, etc. that starts and ends at the same point."},{"definition":"A place at a terminus where trains or trams can turn round and go back the other way without having to reverse; a balloon loop, turning loop, or reversing loop."},{"definition":"A quasigroup with an identity element."},{"definition":"A loop-shaped intrauterine device."},{"definition":"An aerobatic maneuver in which an aircraft flies a circular path in a vertical plane."},{"definition":"A small, narrow opening; a loophole."},{"definition":"A flexible region in a protein's secondary structure."},{"definition":"A mass of iron in a pasty condition gathered into a ball for the tilt hammer or rolls."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form something into a loop."},{"definition":"To fasten or encircle something with a loop."},{"definition":"To fly an aircraft in a loop."},{"definition":"To move something in a loop."},{"definition":"To join electrical components to complete a circuit."},{"definition":"To duplicate the route of a pipeline."},{"definition":"To create an error in a computer program so that it runs in an endless loop and the computer freezes up."},{"definition":"To form a loop."},{"definition":"To move in a loop.","example":"The program loops until the user presses a key."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/luːps/"}]},{"word":"SURGE","idx":9535,"count":5436623,"meanings":[{"definitions":[{"definition":"A sudden transient rush, flood or increase.","example":"He felt a surge of excitement."},{"definition":"The maximum amplitude of a vehicle's forward/backward oscillation"},{"definition":"A sudden electrical spike or increase of voltage and current.","example":"A power surge at that generator created a blackout across the whole district."},{"definition":"The swell or heave of the sea. (FM 55-501)."},{"definition":"A spring; a fountain."},{"definition":"The tapered part of a windlass barrel or a capstan, upon which the cable surges, or slips."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rush, flood, or increase suddenly.","example":"Toaster sales surged last year."},{"definition":"To accelerate forwards, particularly suddenly.","example":"A ship surges forwards, sways sideways and heaves up."},{"definition":"To slack off a line."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"surge-us","text":"/sɝdʒ/"}]},{"word":"FRONTPAGE","idx":9536,"count":5435430,"meanings":[{"definitions":[{"definition":"The first, and initially visible, page of a publication.","example":"Congratulations, Dave, you made the front page."}],"partOfSpeech":"n"}]},{"word":"TRAUMA","idx":9537,"count":5434737,"meanings":[{"definitions":[{"definition":"Any serious injury to the body, often resulting from violence or an accident."},{"definition":"An emotional wound leading to psychological injury."},{"definition":"An event that causes great distress."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɹaʊ.mə/"}]},{"word":"AW","idx":9538,"count":5433668,"meanings":[{"definitions":[{"definition":"An instance of aw."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Used to express disappointment or dismay.","example":"Aw, that's too bad..."},{"definition":"Used to express mild protest, entreaty, consternation, or disapproval.","example":"Aw, dad, why can't we go to Legoland?"},{"definition":"Used to express affection.","example":"Aw, you've got such a cute baby bird!"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"aw-us","text":"/ɑː/"}]},{"word":"ADVERT","idx":9540,"count":5431594,"meanings":[{"definitions":[{"definition":"An advertisement, an ad."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take notice, to pay attention (to)."},{"definition":"To turn attention to, to take notice of (something)."},{"definition":"To call attention, refer (to)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈædvɜː(ɹ)t/"}]},{"word":"POSSESS","idx":9541,"count":5431346,"meanings":[{"definitions":[{"definition":"To have; to have ownership of.","example":"He does not even possess a working telephone."},{"definition":"To take control of someone's body or mind, especially in a supernatural manner.","example":"They thought he was possessed by evil spirits."},{"definition":"(chiefly with of) To vest ownership in (someone, or oneself); to give someone power or knowledge; to acquaint; to inform."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"possess-us","text":"/pəˈzɛs/"}]},{"word":"DEMANDING","idx":9542,"count":5431042,"meanings":[{"definitions":[{"definition":"To request forcefully.","example":"I demand to see the manager."},{"definition":"To claim a right to something.","example":"The bank is demanding the mortgage payment."},{"definition":"To ask forcefully for information.","example":"I demand an immediate explanation."},{"definition":"To require of someone.","example":"This job demands a lot of patience."},{"definition":"To issue a summons to court."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Requiring much endurance, strength, or patience."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dəˈmændɪŋ/"},{"text":"/dɪˈmɑːndɪŋ/"}]},{"word":"DEFENSIVE","idx":9543,"count":5430651,"meanings":[{"definitions":[{"definition":"A means, attitude or position of defense."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Intended for defence; protective.","example":"a defensive perimeter"},{"definition":"Intended to deter attack.","example":"a defensive missile system"},{"definition":"Performed so as to minimise risk.","example":"defensive driving"},{"definition":"Displaying an inordinate sensitivity to criticism or intrusion."},{"definition":"Of a bowling or fielding tactic designed to prevent the other side from scoring runs; of a batting tactic designed to prevent being out."},{"definition":"Pertaining to defense, as opposed to attack.","example":"The victim held up his hand to repel the attacker and received a defensive knife wound."},{"definition":"In a state or posture of defense."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈfɛnsɪv/"},{"audio":"defensive-au"}]},{"word":"SIP","idx":9544,"count":5430090,"meanings":[{"definitions":[{"definition":"To ooze or pass slowly through pores or other small openings, and in overly small quantities; said of liquids, etc.","example":"The water steadily seeped in through the thirl."},{"definition":"To enter or penetrate slowly; to spread or diffuse.","example":"Fear began to seep into the local community over the contamination of their fishpond."},{"definition":"To diminish or wane away slowly.","example":"The resistance movement against the invaders had slowly  seeped away."},{"definition":"To drink slowly, small mouthfuls at a time."},{"definition":"To drink a small quantity."},{"definition":"To taste the liquor of; to drink out of."},{"definition":"To consume slowly — in contrast to faster consumption, in contrast to zero consumption"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A small mouthful of drink"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sip-uk","text":"/sɪp/"}]},{"word":"FLASHERS","idx":9545,"count":5426891,"meanings":[{"definitions":[{"definition":"Anything that flashes, especially a device that switches a light on and off."},{"definition":"An indicator or turn signal."},{"definition":"A person who exposes their genitals or female nipples."}],"partOfSpeech":"n"}]},{"word":"FORBIDDEN","idx":9547,"count":5424002,"meanings":[{"definitions":[{"definition":"To disallow; to proscribe.","example":"Smoking in the restaurant is forbidden."},{"definition":"(ditransitive) To deny, exclude from, or warn off, by express command."},{"definition":"To oppose, hinder, or prevent, as if by an effectual command.","example":"An impassable river forbids the approach of the army."},{"definition":"To accurse; to blast."},{"definition":"To defy; to challenge.","example":"What part of \"no\" do you forbid to understand?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not allowed; specifically disallowed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"forbidden-uk","text":"/fɝˈbɪdən/"}]},{"word":"TF","idx":9548,"count":5423440,"meanings":[{"definitions":[{"definition":"(texting) Initialism of the fuck.","example":"Why TF do you think that??"}],"partOfSpeech":"n"}]},{"word":"VANILLA","idx":9549,"count":5422197,"meanings":[{"definitions":[{"definition":"Any tropical, climbing orchid of the genus Vanilla (especially Vanilla planifolia), bearing podlike fruit yielding an extract used in flavoring food or in perfumes."},{"definition":"The fruit or bean of the vanilla plant."},{"definition":"The extract of the fruit of the vanilla plant."},{"definition":"The distinctive fragrant flavour/flavor characteristic of vanilla extract.","example":"You can tell that the secret ingredient missing from New CokeTM was vanilla, because certain South American economies collapsed when it was introduced, and miraculously revived when the old formula was used again."},{"definition":"Any artificially produced homologue of vanilla extract, principally vanillin produced from lignin from the paper industry or from petrochemicals."},{"definition":"(sexuality) Someone who is not into fetishism; a normophile"},{"definition":"An unmodded version of a game"},{"definition":"A yellowish-white colour, like that of vanilla ice cream."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of flavor, etc.) Of vanilla."},{"definition":"(retronym) Standard, plain, default, unmodified, basic.","example":"vanilla JavaScript"},{"definition":"(sexuality) Not kinky, not involving BDSM."},{"definition":"Plain; conventional; unimaginative."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"vanilla-us","text":"/vəˈnɛlə/"}]},{"word":"PROGRAMMERS","idx":9550,"count":5421887,"meanings":[{"definitions":[{"definition":"One who writes computer programs; a software developer."},{"definition":"One who decides which programs will be shown on a television station, or which songs will be played on a radio station."},{"definition":"A device that installs or controls a software program in some other machine."},{"definition":"A short film feature as part of a longer film program."}],"partOfSpeech":"n"}]},{"word":"MONITORED","idx":9552,"count":5418966,"meanings":[{"definitions":[{"definition":"To watch over; to guard."}],"partOfSpeech":"ve"}]},{"word":"INSTALLATIONS","idx":9553,"count":5417492,"meanings":[{"definitions":[{"definition":"An act of installing."},{"definition":"Something installed, especially the whole of a system of machines, apparatus, and accessories, when set up and arranged for practical working, as in electric lighting, transmission of power, etc."},{"definition":"A work of installation art."},{"definition":"A grouping of facilities that constitute a permanent military base."}],"partOfSpeech":"n"}]},{"word":"PICNIC","idx":9555,"count":5417141,"meanings":[{"definitions":[{"definition":"An informal social gathering, usually in a natural outdoor setting, to which the participants bring their own food and drink.","example":"We went out for a picnic in the forest."},{"definition":"The meal eaten at such a gathering."},{"definition":"An easy or pleasant task.","example":"We remind the guests that dealing with this problem is no picnic, and to be patient."},{"definition":"An entertainment at which each person contributed some dish to a common table."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a picnic."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɪknɪk/"}]},{"word":"SOULS","idx":9556,"count":5416970,"meanings":[{"definitions":[{"definition":"The spirit or essence of a person usually thought to consist of one's thoughts and personality. Often believed to live on after the person's death."},{"definition":"The spirit or essence of anything."},{"definition":"Life, energy, vigor."},{"definition":"Soul music."},{"definition":"A person, especially as one among many."},{"definition":"An individual life.","example":"Fifty souls were lost when the ship sank."},{"definition":"A kind of submanifold involved in the soul theorem of Riemannian geometry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To endow with a soul; to furnish with a soul or mind."},{"definition":"To beg on All Soul's Day."},{"definition":"To afford suitable sustenance."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"souls-us","text":"/soʊlz/"}]},{"word":"ARRIVALS","idx":9557,"count":5416415,"meanings":[{"definitions":[{"definition":"The act of arriving or something that has arrived.","example":"The early arrival of the bride created a stir."},{"definition":"The attainment of an objective, especially as a result of effort.","example":"The arrival of the railway made the local tourist industry viable."},{"definition":"A person who has arrived.","example":"There has been a significant growth in illegal arrivals."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈɹaɪvəlz/"}]},{"word":"SPANK","idx":9558,"count":5416004,"meanings":[{"definitions":[{"definition":"An instance of spanking, separately or part of a multiple blows-beating; a smack, swat, or slap."},{"definition":"A slapping sound, as produced by spanking."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To beat, smack or slap a person's buttocks, with the bare hand or other object, as punishment, gesture, or form of sexual interaction."},{"definition":"To soundly defeat, to trounce."},{"definition":"To hit very hard"},{"definition":"To move rapidly.","example":"The ship was really spanking along."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spank-uk","text":"/spæŋk/"}]},{"word":"PRACTITIONER","idx":9560,"count":5411869,"meanings":[{"definitions":[{"definition":"A person who practices a profession or art, especially law or medicine."},{"definition":"One who does anything customarily or habitually."},{"definition":"A sly or artful person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"practitioner-uk","text":"/pɹækˈtɪʃənə/"}]},{"word":"MOTIVATED","idx":9561,"count":5411329,"meanings":[{"definitions":[{"definition":"To provide someone with an incentive to do something; to encourage.","example":"The weekly staff meeting was meant to motivate employees."},{"definition":"To animate; to propel; to cause to take action","example":"He was motivated purely by self-interest."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Enthusiastic, especially about striving toward a goal.","example":"We're looking for a highly motivated individual who will fit into our fast-paced corporate culture."}],"partOfSpeech":"j"}]},{"word":"DUMB","idx":9563,"count":5409969,"meanings":[{"definitions":[{"definition":"Unable to speak; lacking power of speech (kept in \"deaf, dumb, and blind\").","example":"His younger brother was born dumb, and communicated with sign language."},{"definition":"Silent; unaccompanied by words.","example":"dumb show"},{"definition":"(especially of a person) Extremely stupid.","example":"You are so dumb! You don't even know how to make toast!"},{"definition":"Pointless, foolish, lacking intellectual content or value.","example":"Brendan had the dumb job of moving boxes from one conveyor belt to another."},{"definition":"Lacking brightness or clearness, as a colour."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To silence."},{"definition":"To make stupid."},{"definition":"To represent as stupid."},{"definition":"To reduce the intellectual demands of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dumb-ca","text":"/dʌm/"}]},{"word":"HOLLOW","idx":9565,"count":5408962,"meanings":[{"definitions":[{"definition":"A small valley between mountains.","example":"He built himself a cabin in a hollow high up in the Rockies."},{"definition":"A sunken area or unfilled space in something solid; a cavity, natural or artificial.","example":"the hollow of the hand or of a tree"},{"definition":"A sunken area."},{"definition":"A feeling of emptiness.","example":"a hollow in the pit of one's stomach"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a hole in something; to excavate"},{"definition":"To call or urge by shouting; to hollo."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of something solid) Having an empty space or cavity inside.","example":"a hollow tree; a hollow sphere"},{"definition":"(of a sound) Distant, eerie; echoing, reverberating, as if in a hollow space; dull, muffled; often low-pitched.","example":"He let out a hollow moan."},{"definition":"Without substance; having no real or significant worth; meaningless.","example":"a hollow victory"},{"definition":"Insincere, devoid of validity; specious.","example":"a hollow promise"},{"definition":"Concave; gaunt; sunken."},{"definition":"Pertaining to hollow body position"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Completely, as part of the phrase beat hollow or beat all hollow."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Hey, hello"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"hollow-us","text":"/hɑlɚ/"}]},{"word":"VAULT","idx":9566,"count":5408483,"meanings":[{"definitions":[{"definition":"An arched masonry structure supporting and forming a ceiling, whether freestanding or forming part of a larger building."},{"definition":"Any arched ceiling or roof."},{"definition":"Anything resembling such a downward-facing concave structure, particularly the sky and caves."},{"definition":"The space covered by an arched roof, particularly underground rooms and church crypts."},{"definition":"Any cellar or underground storeroom."},{"definition":"Any burial chamber, particularly those underground.","example":"Family members had been buried in the vault for centuries."},{"definition":"The secure room or rooms in or below a bank used to store currency and other valuables; similar rooms in other settings.","example":"The bank kept their money safe in a large vault."},{"definition":"A piece of apparatus used for performing jumps."},{"definition":"A gymnastic movement performed on this apparatus."},{"definition":"An encrypted digital archive."},{"definition":"An underground or covered conduit for water or waste; a drain; a sewer."},{"definition":"An underground or covered reservoir for water or waste; a cistern; a cesspit."},{"definition":"A room employing a cesspit or sewer: an outhouse; a lavatory."},{"definition":"An act of vaulting, formerly by deer; a leap or jump."},{"definition":"An event or performance involving a vaulting horse."},{"definition":"A turning; a time (chiefly used in phrases signifying that the part is to be repeated)."},{"definition":"A volte"},{"definition":"A turning point or point of change in a poem, most commonly a sonnet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To build as, or cover with a vault."},{"definition":"To jump or leap over.","example":"The fugitive vaulted over the fence to escape."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vault-us","text":"/vɑlt/"}]},{"word":"SECURELY","idx":9567,"count":5408425,"meanings":[{"definitions":[{"definition":"(manner) In a secure manner; without fear or apprehension; without danger"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"securely-us","text":"/səˈkjɝli/"}]},{"word":"EXAMINING","idx":9568,"count":5407874,"meanings":[{"definitions":[{"definition":"To observe or inspect carefully or critically","example":"He examined the crime scene for clues."},{"definition":"To check the health or condition of something or someone","example":"The doctor examined the patient."},{"definition":"To determine the aptitude, skills or qualifications of someone by subjecting them to an examination"},{"definition":"To interrogate","example":"The witness was examined under oath."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Examination"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"examining-us","text":"/ɪɡˈzæmɪnɪŋ/"}]},{"word":"GROOVE","idx":9570,"count":5407261,"meanings":[{"definitions":[{"definition":"A long, narrow channel or depression; e.g., such a slot cut into a hard material to provide a location for an engineering component, a tyre groove, or a geological channel or depression."},{"definition":"A fixed routine."},{"definition":"The middle of the strike zone in baseball where a pitch is most easily hit."},{"definition":"A pronounced, enjoyable rhythm."},{"definition":"A shaft or excavation."},{"definition":"A racing line, a path across the racing circuit's surface that a racecar will usually track on. (Note: There may be multiple grooves on any particular circuit or segment of circuit)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut a groove or channel in; to form into channels or grooves; to furrow."},{"definition":"To perform, dance to, or enjoy rhythmic music.","example":"I was just starting to groove to the band when we had to leave."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"groove-uk","text":"/ɡɹuːv/"}]},{"word":"REVELATION","idx":9571,"count":5406421,"meanings":[{"definitions":[{"definition":"The act of revealing or disclosing."},{"definition":"Something that is revealed."},{"definition":"Something dramatically disclosed."},{"definition":"A manifestation of divine truth."},{"definition":"A great success."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"revelation-us","text":"/ɹɛvəˈleɪʃən/"}]},{"word":"PURSUIT","idx":9573,"count":5404544,"meanings":[{"definitions":[{"definition":"The act of pursuing.","example":"Unremitting pursuit of wealth doesn't bring happiness, particularly if successful."},{"definition":"A hobby or recreational activity, done regularly."},{"definition":"A discipline in track cycling where two opposing teams start on opposite sides of the track and try to catch their opponents."},{"definition":"Prosecution"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pursuit-us","text":"/pɝˈsuːt/"},{"audio":"pursuit-uk","text":"/pəˈsjuːt/"}]},{"word":"DELEGATION","idx":9574,"count":5401948,"meanings":[{"definitions":[{"definition":"An act of delegating."},{"definition":"A group of delegates used to discuss issues with an opponent."},{"definition":"A method-dispatching technique describing the lookup and inheritance rules for self-referential calls."},{"definition":"A contract whereby the original debtor substitutes a new debtor in his stead, with the creditor’s permission."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɛlɪˈɡeɪʃən/"}]},{"word":"WIRES","idx":9575,"count":5401677,"meanings":[{"definitions":[{"definition":"Metal formed into a thin, even thread, now usually by being drawn through a hole in a steel die."},{"definition":"A piece of such material; a thread or slender rod of metal, a cable."},{"definition":"A metal conductor that carries electricity."},{"definition":"A fence made of usually barbed wire."},{"definition":"A finish line of a racetrack."},{"definition":"A telecommunication wire or cable"},{"definition":"(by extension) An electric telegraph; a telegram."},{"definition":"A hidden listening device on the person of an undercover operative for the purposes of obtaining incriminating spoken evidence."},{"definition":"A deadline or critical endpoint.","example":"This election is going to go right to the wire"},{"definition":"A wire strung with beads and hung horizontally above or near the table which is used to keep score."},{"definition":"(usually in the plural) Any of the system of wires used to operate the puppets in a puppet show; hence, the network of hidden influences controlling the action of a person or organization; strings.","example":"to pull the wires for office"},{"definition":"(thieves' slang) A pickpocket who targets women."},{"definition":"A covert signal sent between people cheating in a card game."},{"definition":"A knitting needle."},{"definition":"The slender shaft of the plumage of certain birds."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten with wire, especially with reference to wine bottles, corks, or fencing.","example":"We need to wire that hole in the fence."},{"definition":"To string on a wire.","example":"wire beads"},{"definition":"To equip with wires for use with electricity.","example":"Do you know how to wire a plug?"},{"definition":"To add something into an electrical system by means of wiring; to incorporate or include something.","example":"I'll just wire your camera to the computer screen."},{"definition":"(usually passive) To fix or predetermine (someone's personality or behaviour) in a particular way.","example":"There's no use trying to get Sarah to be less excitable. That's just the way she's wired."},{"definition":"To send a message or monetary funds to another person through a telecommunications system, formerly predominantly by telegraph.","example":"The detective wired ahead, hoping that the fugitive would be caught at the railway station."},{"definition":"To make someone tense or psyched up. See also adjective wired.","example":"Coffee late at night wires me good and proper."},{"definition":"To install eavesdropping equipment.","example":"We wired the suspect's house."},{"definition":"To snare by means of a wire or wires."},{"definition":"To place (a ball) so that the wire of a wicket prevents a successful shot."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wires-us","text":"/waɪɹz/"}]},{"word":"DICTIONARIES","idx":9577,"count":5399149,"meanings":[{"definitions":[{"definition":"A reference work with a list of words from one or more languages, normally ordered alphabetically, explaining each word's meaning, and sometimes containing information on its etymology, pronunciation, usage, translations, and other data."},{"definition":"(preceded by the) A synchronic dictionary of a standardised language held to only contain words that are properly part of the language."},{"definition":"(by extension) Any work that has a list of material organized alphabetically; e.g., biographical dictionary, encyclopedic dictionary."},{"definition":"An associative array, a data structure where each value is referenced by a particular key, analogous to words and definitions in a physical dictionary."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look up in a dictionary."},{"definition":"To add to a dictionary."},{"definition":"To compile a dictionary."}],"partOfSpeech":"ve"}]},{"word":"MAILS","idx":9578,"count":5397230,"meanings":[{"definitions":[{"definition":"A bag or wallet."},{"definition":"A bag containing letters to be delivered by post."},{"definition":"The material conveyed by the postal service.","example":"Don't forget to pick up the mail on your way."},{"definition":"A stagecoach, train or ship that delivers such post."},{"definition":"The postal service or system in general.","example":"He decided to send his declaration by mail."},{"definition":"The letters, parcels, etc. delivered to a particular address or person."},{"definition":"Electronic mail, e-mail: a computer network–based service for sending, storing, and forwarding electronic messages."},{"definition":"A trunk, box, or bag, in which clothing, etc., may be carried."},{"definition":"Armour consisting of metal rings or plates linked together."},{"definition":"A contrivance of interlinked rings, for rubbing off the loose hemp on lines and white cordage."},{"definition":"Any hard protective covering of an animal, as the scales and plates of reptiles, shell of a lobster, etc."},{"definition":"A spot on a bird's feather; by extension, a spotted feather."},{"definition":"An old French coin worth half a denier."},{"definition":"A monetary payment or tribute."},{"definition":"Rent."},{"definition":"Tax."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(ditransitive) To send (a letter, parcel, etc.) through the mail."},{"definition":"(ditransitive) To send by electronic mail.","example":"Please mail me the spreadsheet by the end of the day."},{"definition":"To contact (a person) by electronic mail.","example":"I need to mail my tutor about the deadline."},{"definition":"To arm with mail."},{"definition":"To pinion."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/meɪlz/"}]},{"word":"BACKING","idx":9579,"count":5397022,"meanings":[{"definitions":[{"definition":"To go in the reverse direction.","example":"the train backed into the station;  the horse refuses to back"},{"definition":"To support.","example":"I back you all the way;  which horse are you backing in this race?"},{"definition":"(of the wind) To change direction contrary to the normal pattern; that is, to shift anticlockwise in the northern hemisphere, or clockwise in the southern hemisphere."},{"definition":"(of a square sail) To brace the yards so that the wind presses on the front of the sail, to slow the ship."},{"definition":"(of an anchor) To lay out a second, smaller anchor to provide additional holding power."},{"definition":"(of a hunting dog) To stand still behind another dog which has pointed."},{"definition":"To push or force backwards.","example":"The mugger backed her into a corner and demanded her wallet."},{"definition":"To get upon the back of; to mount."},{"definition":"To place or seat upon the back."},{"definition":"To make a back for; to furnish with a back.","example":"to back books"},{"definition":"To adjoin behind; to be at the back of."},{"definition":"To write upon the back of, possibly as an endorsement.","example":"to back a letter;  to back a note or legal document"},{"definition":"(of a justice of the peace) To sign or endorse (a warrant, issued in another county, to apprehend an offender)."},{"definition":"To row backward with (oars).","example":"to back the oars"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Support, especially financial.","example":"It's a volunteer organization that works with backing from the city and a few grants."},{"definition":"A liner or other material added behind or underneath.","example":"The cardboard backing gives the notebook a little extra stiffness."},{"definition":"A backdrop."},{"definition":"Musicians and vocalists who support the main performer."},{"definition":"The mounting of a horse or other animal."},{"definition":"The action of putting something back; a switching into reverse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Providing support for the main performer."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"backing-us","text":"/ˈbæk.ɪŋ(ɡ)/"}]},{"word":"GREENHOUSE","idx":9580,"count":5396539,"meanings":[{"definitions":[{"definition":"A building used to grow plants, particularly one with large glass windows or plastic sheeting to trap heat from sunlight even in intemperate seasons or climates."},{"definition":"The glass of a plane's cockpit."},{"definition":"A structure that shields the operating table to protect against bacteria."},{"definition":"A hot state in global climate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place (plants) in a greenhouse."},{"definition":"To nurture in order to promote growth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"greenhouse-au","text":"/ˈɡɹiːnˌhaʊs/"}]},{"word":"SLEEPS","idx":9581,"count":5396170,"meanings":[{"definitions":[{"definition":"To rest in a state of reduced consciousness.","example":"You should sleep 8 hours a day."},{"definition":"(of a spinning top or yo-yo) To spin on its axis with no other perceptible motion."},{"definition":"To cause (a spinning top or yo-yo) to spin on its axis with no other perceptible motion."},{"definition":"To accommodate in beds.","example":"This caravan can sleep four people comfortably."},{"definition":"To be slumbering in (a state).","example":"to sleep a dreamless sleep"},{"definition":"To be careless, inattentive, or unconcerned; not to be vigilant; to live thoughtlessly."},{"definition":"To be dead; to lie in the grave."},{"definition":"To be, or appear to be, in repose; to be quiet; to be unemployed, unused, or unagitated; to rest; to lie dormant.","example":"a question sleeps for the present; the law sleeps"},{"definition":"To wait for a period of time without performing any action.","example":"After a failed connection attempt, the program sleeps for 5 seconds before trying again."},{"definition":"To place into a state of hibernation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The state of reduced consciousness during which a human or animal rests in a daily rhythm.","example":"I really need some sleep."},{"definition":"An act or instance of sleeping.","example":"I’m just going to have a quick sleep."},{"definition":"(metonymically) A night.","example":"There are only three sleeps till Christmas!"},{"definition":"Rheum, crusty or gummy discharge found in the corner of the eyes after waking, whether real or a figurative objectification of sleep (in the sense of reduced consciousness).","example":"Wipe the sleep from your eyes."},{"definition":"A state of plants, usually at night, when their leaflets approach each other and the flowers close and droop, or are covered by the folded leaves."},{"definition":"The hibernation of animals."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sliːps/"}]},{"word":"TRANSPARENCY","idx":9584,"count":5393362,"meanings":[{"definitions":[{"definition":"The quality of being transparent; transparence."},{"definition":"Openness; accessibility to scrutiny."},{"definition":"A translucent film-like material with an image imprinted on it, viewable by shining light through it."},{"definition":"A transparent object."},{"definition":"Sufficient accuracy to make the compressed result perceptually indistinguishable from the uncompressed input."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-ˈpæɹənsi/"},{"text":"/tɹænsˈpæɹənsi/"}]},{"word":"DEE","idx":9585,"count":5393038,"meanings":[{"definitions":[{"definition":"The name of the Latin-script letter D."},{"definition":"Something shaped like the letter D, such as a dee lock.","example":"the pommel is furnished with dees."},{"definition":"Police detective.","example":"the dees are about."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To do.","example":"What are ye deein man!"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/diː/"}]},{"word":"ENDLESS","idx":9588,"count":5392222,"meanings":[{"definitions":[{"definition":"Having no end.","example":"endless time; endless praise"},{"definition":"Extending indefinitely.","example":"an endless line"},{"definition":"Without profitable end; fruitless; unsatisfying."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"endless-us","text":"/ˈɛndləs/"}]},{"word":"FIGURED","idx":9589,"count":5390310,"meanings":[{"definitions":[{"definition":"To calculate, to solve a mathematical problem."},{"definition":"To come to understand.","example":"I can’t figure if he’s telling the truth or lying."},{"definition":"To think, to assume, to suppose, to reckon."},{"definition":"To be reasonable.","example":"It figures that somebody like him would be upset about the situation."},{"definition":"To enter into; to be a part of."},{"definition":"To represent by a figure, as to form or mould; to make an image of, either palpable or ideal; also, to fashion into a determinate form; to shape."},{"definition":"To embellish with design; to adorn with figures."},{"definition":"To indicate by numerals."},{"definition":"To represent by a metaphor; to signify or symbolize."},{"definition":"To prefigure; to foreshow."},{"definition":"To write over or under the bass, as figures or other characters, in order to indicate the accompanying chords."},{"definition":"To embellish."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a natural material) Having a pattern considered attractive appearing on a section.","example":"Figured wood is especially sought after for its distinctive texture."},{"definition":"Adorned with a figure or figures."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɪɡəd/"}]},{"word":"ORBIT","idx":9590,"count":5389062,"meanings":[{"definitions":[{"definition":"A circular or elliptical path of one object around another object, particularly in astronomy and space travel.","example":"The Moon's orbit around the Earth takes nearly one month to complete."},{"definition":"A sphere of influence; an area of control.","example":"In the post WWII era, several eastern European countries came into the orbit of the Soviet Union."},{"definition":"The course of one's usual progression, or the extent of one's typical range.","example":"The convenience store was a heavily travelled point in her daily orbit, as she purchased both cigarettes and lottery tickets there."},{"definition":"The bony cavity containing the eyeball; the eye socket."},{"definition":"A mathematical function that describes the wave-like behavior of an electron in an atom; area of the highest probability of electron´s occurrence around the atom's nucleus."},{"definition":"A collection of points related by the evolution function of a dynamical system."},{"definition":"The subset of elements of a set X to which a given element can be moved by members of a specified group of transformations that act on X."},{"definition":"A state of increased excitement, activity, or anger.","example":"Dad went into orbit when I told him that I'd crashed the car."},{"definition":"A path for the ball on the outer edge of the playfield, usually connected so that the ball entering in one end will come out of the other."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To circle or revolve around another object.","example":"The Earth orbits the Sun."},{"definition":"To move around the general vicinity of something.","example":"The harried mother had a cloud of children orbiting her, begging for sweets."},{"definition":"To place an object into an orbit around a planet.","example":"A rocket was used to orbit the satellite."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"orbit-us","text":"/ˈɔː(ɹ)bɪt/"}]},{"word":"CURRENCIES","idx":9591,"count":5388923,"meanings":[{"definitions":[{"definition":"Money or other items used to facilitate transactions.","example":"Wampum was used as a currency by Amerindians."},{"definition":"(more specifically) Paper money."},{"definition":"The state of being current; general acceptance or recognition.","example":"The jargon’s currency."},{"definition":"Current value; general estimation; the rate at which anything is generally valued."},{"definition":"Fluency; readiness of utterance"}],"partOfSpeech":"n"}]},{"word":"BACON","idx":9593,"count":5385205,"meanings":[{"definitions":[{"definition":"Cured meat from the sides, belly or back of a pig."},{"definition":"Thin slices of the above in long strips."},{"definition":"The police or spies.","example":"Run! It's the bacon!"},{"definition":"Road rash."},{"definition":"A saucisse."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bacon-au","text":"/ˈbeɪ.kən/"}]},{"word":"SURVIVORS","idx":9594,"count":5383052,"meanings":[{"definitions":[{"definition":"One who survives, especially one who survives a traumatic experience.","example":"From this moment on, I choose to live not as a victim, but as a survivor."},{"definition":"A person who is able to endure hardship."},{"definition":"One who knew a specific decedent.","example":"She was from a large family and had many friends, so the funeral was crowded with mourning survivors."}],"partOfSpeech":"n"}]},{"word":"POSITIONING","idx":9595,"count":5382900,"meanings":[{"definitions":[{"definition":"To put into place."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of positioning; placement."}],"partOfSpeech":"n"}]},{"word":"HEATER","idx":9596,"count":5380658,"meanings":[{"definitions":[{"definition":"A device that produces and radiates heat, typically to raise the temperature of a room or building.","example":"Turn on the heater; I'm cold."},{"definition":"A person who heats something, for example in metalworking."},{"definition":"A gun.","example":"The thug pumped two rounds from his heater into her."},{"definition":"A fastball, especially one thrown at high velocity.","example":"Jones threw a heater under his chin."},{"definition":"An extended winning streak.","example":"Emmy went on a heater in Las Vegas and came back six thousand dollars richer."},{"definition":"A medieval European shield having a rounded triangle shape like a clothes iron."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"heater-us","text":"/ˈhitɚ/"}]},{"word":"COLONY","idx":9597,"count":5378572,"meanings":[{"definitions":[{"definition":"A governmental unit created on land of another country owned by colonists from a country."},{"definition":"A settlement of emigrants who move to a new place, but remain culturally tied to their place of origin"},{"definition":"Region or governmental unit created by another country and generally ruled by another country.","example":"Bermuda is a crown colony of Great Britain."},{"definition":"An apartment complex or neighborhood.","example":"Our colony is quite small, but each apartment is large."},{"definition":"A group of people with the same interests or ethnic origin concentrated in a particular geographic area","example":"The Amana Colonies in Iowa were settled by people from Germany."},{"definition":"A group of organisms of same or different species living together in close association.","example":"a colony of specialized polyps and medusoids"},{"definition":"A local group of Beaver Scouts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"colony-us","text":"/ˈkɑləniː/"}]},{"word":"CANNON","idx":9598,"count":5377826,"meanings":[{"definitions":[{"definition":"A complete assembly, consisting of an artillery tube and a breech mechanism, firing mechanism or base cap, which is a component of a gun, howitzer or mortar. It may include muzzle appendages."},{"definition":"Any similar device for shooting material out of a tube."},{"definition":"A bone of a horse's leg, between the fetlock joint and the knee or hock."},{"definition":"A cannon bit."},{"definition":"A large muzzle-loading artillery piece."},{"definition":"A carom.","example":"In English billiards, a cannon is when one's cue ball strikes the other player's cue ball and the red ball on the same shot; and it is worth two points."},{"definition":"The arm of a player that can throw well.","example":"He's got a cannon out in right."},{"definition":"A hollow cylindrical piece carried by a revolving shaft, on which it may, however, revolve independently."},{"definition":"(Chinese chess) A piece which moves horizontally and vertically like a rook but captures another piece by jumping over a different piece in the line of attack."},{"definition":"A generally accepted principle; a rule.","example":"The trial must proceed according to the canons of law."},{"definition":"A group of literary works that are generally accepted as representing a field."},{"definition":"The works of a writer that have been accepted as authentic.","example":"the entire Shakespeare canon"},{"definition":"A eucharistic prayer, particularly the Roman Canon."},{"definition":"A religious law or body of law decreed by the church.","example":"We must proceed according to canon law."},{"definition":"A catalogue of saints acknowledged and canonized in the Roman Catholic Church."},{"definition":"In monasteries, a book containing the rules of a religious order."},{"definition":"A member of a cathedral chapter; one who possesses a prebend in a cathedral or collegiate church."},{"definition":"A piece of music in which the same melody is played by different voices, but beginning at different times; a round.","example":"Pachelbel’s Canon has become very popular."},{"definition":"(Roman law) A rent or stipend payable at some regular time, generally annual, e.g., canon frumentarius"},{"definition":"Those sources, especially including literary works, which are considered part of the main continuity regarding a given fictional universe.","example":"A spin-off book series revealed the aliens to be originally from Earth, but it's not canon."},{"definition":"A rolled and filleted loin of meat; also called cannon.","example":"a canon of beef or lamb"},{"definition":"A large size of type formerly used for printing the church canons, standardized as 48-point."},{"definition":"The part of a bell by which it is suspended; the ear or shank of a bell."},{"definition":"A carom."},{"definition":"A clergy member serving a cathedral or collegiate church."},{"definition":"A canon regular, a member of any of several Roman Catholic religious orders."},{"definition":"A Near Eastern and Caucasian musical instrument related to the zither, dulcimer, or harp having either 26 strings and a single bridge, or twice that number and two bridges."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bombard with cannons."},{"definition":"To play the carom billiard shot. To strike two balls with the cue ball","example":"The white cannoned off the red onto the pink."},{"definition":"To fire something, especially spherical, rapidly."},{"definition":"To collide or strike violently, especially so as to glance off or rebound."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cannon-us","text":"/ˈkæn.ən/"}]},{"word":"CIRCUS","idx":9599,"count":5377139,"meanings":[{"definitions":[{"definition":"A traveling company of performers that may include acrobats, clowns, trained animals, and other novelty acts, that gives shows usually in a circular tent.","example":"The circus will be in town next week."},{"definition":"A round open space in a town or city where multiple streets meet.","example":"Oxford Circus in London is at the north end of Regent Street."},{"definition":"A spectacle; a noisy fuss; a chaotic and/or crowded place."},{"definition":"In the ancient Roman Empire, a building for chariot racing."},{"definition":"(World War II) A code name for bomber attacks with fighter escorts in the day time. The attacks were against short-range targets with the intention of occupying enemy fighters and keeping their fighter units in the area concerned."},{"definition":"Circuit; space; enclosure."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a circus; or to be displayed as if in a circus"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"circus-us","text":"/ˈsɝkəs/"}]},{"word":"PROMOTED","idx":9600,"count":5377031,"meanings":[{"definitions":[{"definition":"To raise (someone) to a more important, responsible, or remunerative job or rank.","example":"He promoted his clerk to office manager."},{"definition":"To advocate or urge on behalf of (something or someone); to attempt to popularize or sell by means of advertising or publicity.","example":"They promoted the abolition of daylight saving time."},{"definition":"To encourage, urge or incite."},{"definition":"(usually in passive form) To elevate to a higher league.","example":"At the end of the season, three teams are promoted to the Premier League."},{"definition":"To increase the activity of (a catalyst) by changing its surface structure."},{"definition":"To exchange (a pawn) for a queen or other piece when it reaches the eighth rank.","example":"Having crossed the chessboard, his pawn was promoted to a queen."},{"definition":"To move on to a subsequent stage of education.","example":"At the end of Primary 6 students can promote directly to the secondary section of SIS."}],"partOfSpeech":"ve"}]},{"word":"DESCENDING","idx":9605,"count":5372249,"meanings":[{"definitions":[{"definition":"To pass from a higher to a lower place; to move downwards; to come or go down in any way, for example by falling, flowing, walking, climbing etc.","example":"The rain descended, and the floods came."},{"definition":"To enter mentally; to retire."},{"definition":"(with on or upon) To make an attack, or incursion, as if from a vantage ground; to come suddenly and with violence.","example":"And on the suitors let thy wrath descend."},{"definition":"To come down to a lower, less fortunate, humbler, less virtuous, or worse, state or rank; to lower or abase oneself","example":"he descended from his high estate"},{"definition":"To pass from the more general or important to the specific or less important matters to be considered."},{"definition":"To come down, as from a source, original, or stock"},{"definition":"To be derived (from)"},{"definition":"To proceed by generation or by transmission; to happen by inheritance.","example":"A crown descends to the heir."},{"definition":"To move toward the south, or to the southward."},{"definition":"To fall in pitch; to pass from a higher to a lower tone."},{"definition":"To go down upon or along; to pass from a higher to a lower part of","example":"they descended the river in boats; to descend a ladder"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A descent.","example":"continual ascendings and descendings"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a sequence) Ordered such that each element is less than or equal to the previous element.","example":"Please arrange these numbers in a descending order."},{"definition":"That causes a sequence to follow a descending order.","example":"We used a descending sort."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"descending-uk","text":"/dɪˈsɛndɪŋ/"}]},{"word":"SPINE","idx":9607,"count":5370074,"meanings":[{"definitions":[{"definition":"The series of bones situated at the back from the head to the pelvis of a person, or from the head to the tail of an animal; backbone, vertebral column."},{"definition":"Something resembling a backbone, such as a ridge, or a long, central structure from which other structures radiate."},{"definition":"A pointed, fairly rigid protuberance or needle-like structure on an animal, shell, or plant."},{"definition":"The heartwood of trees."},{"definition":"Courage or assertiveness."},{"definition":"The stiffness of an arrow."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/spaɪn/"}]},{"word":"TROUT","idx":9608,"count":5369048,"meanings":[{"definitions":[{"definition":"Any of several species of fish in Salmonidae, closely related to salmon, and distinguished by spawning more than once.","example":"Many anglers consider trout to be the archetypical quarry."},{"definition":"An objectionable elderly woman.","example":"Look, you silly old trout, you can't keep bringing home cats! You can't afford the ones you have!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To (figuratively) slap someone with a slimy, stinky, wet trout; to admonish jocularly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"trout-us","text":"/tɹaʊt/"}]},{"word":"ENCLOSED","idx":9609,"count":5368884,"meanings":[{"definitions":[{"definition":"To surround with a wall, fence, etc.","example":"to enclose lands"},{"definition":"To insert into a container, usually an envelope or package","example":"Please enclose a stamped self-addressed envelope if you require a reply."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Contained; held within a container."},{"definition":"Fenced in or surrounded."},{"definition":"(of a division within a pipe organ surrounded by a wooden box, one or more sides of which contain slats that can be opened or closed in order to increase or decrease volume) Having closed slats."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ənˈkloʊzd/"},{"text":"/ənˈkləʊzd/"}]},{"word":"FEAT","idx":9610,"count":5368462,"meanings":[{"definitions":[{"definition":"A relatively rare or difficult accomplishment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form; to fashion."},{"definition":"To feature. I"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Dexterous in movements or service; skilful; neat; pretty."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"feat-uk","text":"/fiːt/"}]},{"word":"TEMPORARILY","idx":9611,"count":5368112,"meanings":[{"definitions":[{"definition":"For a limited period of time; not permanently."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˌtɛmpəˈɹɛɹəli/"},{"text":"/ˈtɛmp(ə)ɹəɹəli/"}]},{"word":"COOKED","idx":9613,"count":5367778,"meanings":[{"definitions":[{"definition":"To prepare (food) for eating by heating it, often by combining it with other ingredients.","example":"I'm cooking bangers and mash."},{"definition":"To prepare (unspecified) food for eating by heating it, often by combining it with other ingredients.","example":"He's in the kitchen, cooking."},{"definition":"To be cooked.","example":"The dinner is cooking on the stove."},{"definition":"To be uncomfortably hot.","example":"Look at that poor dog shut up in that car on a day like today - it must be cooking in there."},{"definition":"To execute by electric chair."},{"definition":"To hold onto (a grenade) briefly after igniting the fuse, so that it explodes almost immediately after being thrown."},{"definition":"To concoct or prepare."},{"definition":"To tamper with or alter; to cook up."},{"definition":"To play or improvise in an inspired and rhythmically exciting way. (From 1930s jive talk.)","example":"Crank up the Coltrane and start cooking!"},{"definition":"To play music vigorously.","example":"On the Wagner piece, the orchestra was cooking!"},{"definition":"To make the noise of the cuckoo."},{"definition":"To throw."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of food, that has been prepared by cooking."},{"definition":"(of an MP3 audio file) Corrupted by conversion through a text format, requiring uncooking to be properly listenable."},{"definition":"(of accounting records, intelligence) Partially or wholly fabricated, falsified."},{"definition":"Done in, exhausted, pooped."},{"definition":"Done in, defeated, hopeless."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cooked-us","text":"/kʊkt/"},{"audio":"cooked-au","text":"/kʊkt/"}]},{"word":"THRILLER","idx":9614,"count":5364843,"meanings":[{"definitions":[{"definition":"Something that thrills."},{"definition":"A suspenseful, sensational genre of story, book, play or film."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈθɹɪlɚ/"}]},{"word":"TRANSMIT","idx":9615,"count":5364052,"meanings":[{"definitions":[{"definition":"To send or convey something from one person, place or thing to another."},{"definition":"To spread or pass on something such as a disease or a signal."},{"definition":"To impart, convey or hand down something by inheritance or heredity."},{"definition":"To communicate news or information."},{"definition":"To convey energy or force through a mechanism or medium."},{"definition":"To send out a signal (as opposed to receive)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"transmit-us","text":"/tɹænsˈmɪt/"}]},{"word":"FATTY","idx":9617,"count":5363547,"meanings":[{"definitions":[{"definition":"Containing, composed of, or consisting of fat."},{"definition":"Like fat; greasy."},{"definition":"Literally or figuratively large."}],"partOfSpeech":"j"},{"definitions":[{"definition":"An obese person.","example":"It's hardly surprising, when it has to support that enormous gut! Lose some weight, fatty!"},{"definition":"A large marijuana cigar; a blunt."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfæɾ.i/"},{"text":"/ˈfæt.i/"},{"audio":"fatty-1-au"}]},{"word":"PRESSED","idx":9619,"count":5362732,"meanings":[{"definitions":[{"definition":"To exert weight or force against, to act upon with force or weight; to exert pressure upon."},{"definition":"To activate a button or key by exerting a downward or forward force on it, and then releasing it."},{"definition":"To compress, squeeze.","example":"to press fruit for the purpose of extracting the juice"},{"definition":"To clasp, hold in an embrace."},{"definition":"To reduce to a particular shape or form by pressure, especially flatten or smooth.","example":"to press a hat"},{"definition":"To flatten a selected area of fabric using an iron with an up-and-down, not sliding, motion, so as to avoid disturbing adjacent areas."},{"definition":"To drive or thrust by pressure, to force in a certain direction.","example":"to press a crowd back"},{"definition":"To weigh upon, oppress, trouble."},{"definition":"To force to a certain end or result; to urge strongly."},{"definition":"To try to force (something upon someone).","example":"to press the Bible on an audience"},{"definition":"To hasten, urge onward.","example":"to press a horse in a race"},{"definition":"To urge, beseech, entreat."},{"definition":"To lay stress upon."},{"definition":"To throng, crowd."},{"definition":"To print."},{"definition":"To force into service, particularly into naval service."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Under strain or deprivation","example":"He found himself hard pressed."},{"definition":"Recruited by a press gang"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pressed-us","text":"/pɹɛst/"}]},{"word":"FREQUENCIES","idx":9620,"count":5362618,"meanings":[{"definitions":[{"definition":"The rate of occurrence of anything; the relationship between incidence and time period.","example":"The frequency of bus service has been improved from one every 15 to one every 12 minutes."},{"definition":"The property of occurring often rather than infrequently.","example":"The FAQ addresses questions that come up with some frequency."},{"definition":"The quotient of the number of times n a periodic phenomenon occurs over the time t in which it occurs: f = n / t.","example":"Broadcasting live at a frequency of 98.3 megahertz, we’re your rock alternative!"},{"definition":"Number of times an event occurred in an experiment (absolute frequency)"}],"partOfSpeech":"n"}]},{"word":"SCANNED","idx":9621,"count":5360194,"meanings":[{"definitions":[{"definition":"To examine sequentially, carefully, or critically; to scrutinize; to behold closely.","example":"She scanned the passage carefully but could not find what she was looking for."},{"definition":"To look about for; to look over quickly.","example":"He scanned the horizon."},{"definition":"To create a digital copy of an image using a scanner.","example":"Pencil drawings don't scan very well."},{"definition":"To read with an electronic device.","example":"to scan a barcode; to scan a QR code"},{"definition":"To mount by steps; to go through with step by step."},{"definition":"To read or mark so as to show a specific meter.","example":"to scan verse"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Converted to a digital format using a scanner."},{"definition":"Seen, looked at."}],"partOfSpeech":"j"}]},{"word":"REFLECTIONS","idx":9622,"count":5359538,"meanings":[{"definitions":[{"definition":"The act of reflecting or the state of being reflected."},{"definition":"The property of a propagated wave being thrown back from a surface (such as a mirror)."},{"definition":"Something, such as an image, that is reflected.","example":"The dog barked at his own reflection in the mirror."},{"definition":"Careful thought or consideration.","example":"After careful reflection, I have decided not to vote for that proposition."},{"definition":"An implied criticism.","example":"It is a reflection on his character that he never came back to see them."},{"definition":"The process or mechanism of determining the capabilities of an object at run-time."},{"definition":"The folding of a part; a fold."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪˈflɛkʃənz/"}]},{"word":"HUNGER","idx":9623,"count":5358049,"meanings":[{"definitions":[{"definition":"A need or compelling desire for food."},{"definition":"(by extension) Any strong desire.","example":"I have a hunger to win."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be in need of food."},{"definition":"(usually with 'for' or 'after') To have a desire (for); to long; to yearn.","example":"I hungered for your love."},{"definition":"To make hungry; to famish."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hunger-us","text":"/ˈhʌŋɡɚ/"}]},{"word":"SIC","idx":9625,"count":5357059,"meanings":[{"definitions":[{"definition":"To mark with a bracketed sic."},{"definition":"To incite an attack by, especially a dog or dogs.","example":"He sicced his dog on me!"},{"definition":"To set upon; to chase; to attack."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Thus; thus written; used to indicate, for example, that text is being quoted as it is from the source."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"sic-us","text":"/sɪk/"},{"audio":"sic-uk","text":"/sɪk/"}]},{"word":"MUNICIPALITY","idx":9626,"count":5355008,"meanings":[{"definitions":[{"definition":"A district with a government that typically encloses no other governed districts; a borough, city, or incorporated town or village."},{"definition":"The governing body of such a district."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mjʊˌnɪsɪˈpælɪti/"}]},{"word":"DETECTIVE","idx":9629,"count":5353706,"meanings":[{"definitions":[{"definition":"(law enforcement) A police officer who looks for evidence as part of solving a crime; an investigator."},{"definition":"A person employed to find information not otherwise available to the public."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Employed in detecting."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈtɛktɪv/"}]},{"word":"SURGEON","idx":9630,"count":5350136,"meanings":[{"definitions":[{"definition":"One who performs surgery; a doctor who performs operations on people or animals.","example":"The surgeon refused to operate because the patient was her son."},{"definition":"A surgeonfish."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"surgeon-uk","text":"/ˈsɜːdʒən/"}]},{"word":"CEMENT","idx":9631,"count":5349862,"meanings":[{"definitions":[{"definition":"A powdered substance produced by firing (calcining) calcium carbonate (limestone) and clay that develops strong cohesive properties when mixed with water. The main ingredient of concrete."},{"definition":"The paste-like substance resulting from mixing such a powder with water, or the rock-like substance that forms when it dries."},{"definition":"Any material with strong adhesive and cohesive properties such as binding agents, glues, grout."},{"definition":"A bond of union; that which unites firmly, as persons in friendship or in society.","example":"the cement of our love"},{"definition":"The layer of bone investing the root and neck of a tooth; cementum."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To affix with cement."},{"definition":"To overlay or coat with cement.","example":"to cement a cellar floor"},{"definition":"To unite firmly or closely."},{"definition":"To make permanent."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cement-au","text":"/səˈmɛnt/"}]},{"word":"EXPERIENCING","idx":9632,"count":5347507,"meanings":[{"definitions":[{"definition":"To observe certain events; undergo a certain feeling or process; or perform certain actions that may alter one or contribute to one's knowledge, opinions, or skills."}],"partOfSpeech":"ve"}]},{"word":"FIREPLACE","idx":9633,"count":5345450,"meanings":[{"definitions":[{"definition":"An open hearth for holding a fire at the base of a chimney."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fireplace-us","text":"/ˈfaɪɹpleɪs/"}]},{"word":"ENDORSEMENT","idx":9634,"count":5343221,"meanings":[{"definitions":[{"definition":"The act or quality of endorsing","example":"Companies sometimes pay millions for product endorsement by celebrities."},{"definition":"An amendment or annotation to an insurance contract or other official document (such as a driving licence).","example":"Mr. Jones paid extra for the flood damage endorsement on his house insurance."},{"definition":"An instructor's signed acknowledgement of time practising specific flying skills.","example":"Once she obtained the endorsement of her night flying hours, Joanna was approved to take the pilot's examination."},{"definition":"(certification) Permission to carry out a specific skill or application in a field in which the practitioner already has a general licence.","example":"To transport gasoline, truckers must have a valid licence and the hazardous materials endorsement."},{"definition":"Sponsorship, in means of money, by a company, business or enterprise.","example":"After the Olympics, he was hoping to get an endorsement deal."},{"definition":"Support from an important, renowned figure of a media (celebrity, politics, sports, etc.), to get back up.","example":"I'm not sure whether an endorsement from Donald Trump will help or hurt."}],"partOfSpeech":"n"}]},{"word":"BG","idx":9635,"count":5342285,"meanings":[{"definitions":[{"definition":"One's social heritage, or previous life; what one did in the past.","example":"The lawyer had a background in computer science."},{"definition":"A part of the picture that depicts scenery to the rear or behind the main subject; context."},{"definition":"Information relevant to the current situation about past events; history."},{"definition":"A less important feature of scenery (as opposed to foreground).","example":"The photographer let us pick a background for the portrait."},{"definition":"The image or color over which a computer's desktop items are shown (e.g. icons or application windows)."},{"definition":"A type of activity on a computer that is not normally visible to the user.","example":"The antivirus program is running in the background."}],"partOfSpeech":"n"}]},{"word":"PLANNERS","idx":9636,"count":5342167,"meanings":[{"definitions":[{"definition":"One who plans.","example":"Johnny is a good planner. He starts his work in time to get it finished by the deadline."},{"definition":"A notebook or software in which one keeps reminders of items such as appointments, tasks, projects, and contacts."}],"partOfSpeech":"n"}]},{"word":"DISPUTES","idx":9637,"count":5340854,"meanings":[{"definitions":[{"definition":"An argument or disagreement, a failure to agree."},{"definition":"Verbal controversy or disagreement; altercation; debate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To contend in argument; to argue against something maintained, upheld, or claimed, by another"},{"definition":"To make a subject of disputation; to argue pro and con; to discuss","example":"Some residents disputed the proposal, saying it was based more on emotion than fact."},{"definition":"To oppose by argument or assertion; to controvert; to express dissent or opposition to; to call in question; to deny the truth or validity of","example":"to dispute assertions or arguments"},{"definition":"To strive or contend about; to contest"},{"definition":"To struggle against; to resist"}],"partOfSpeech":"ve"}]},{"word":"TEXTILES","idx":9638,"count":5340566,"meanings":[{"definitions":[{"definition":"(usually in the plural) Any material made of interlacing fibres, including carpeting and geotextiles."},{"definition":"(naturism) A non-nudist."}],"partOfSpeech":"n"}]},{"word":"MISSILE","idx":9639,"count":5339587,"meanings":[{"definitions":[{"definition":"Any object used as a weapon by being thrown or fired through the air, such as stone, arrow or bullet.","example":"The Rhodians, who used leaden bullets, were able to project their missiles twice as far as the Persian slingers, who used large stones."},{"definition":"A self-propelled projectile whose trajectory can be adjusted after it is launched.","example":"That missile is explosive enough to kill hundreds."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"missile-us","text":"/ˈmɪsaɪl/"},{"audio":"missile-uk","text":"/ˈmɪsaɪl/"}]},{"word":"INTRANET","idx":9640,"count":5335388,"meanings":[{"definitions":[{"definition":"A private computer network, typically one that uses the protocols of the Internet."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪntɹəˌnɛt/"}]},{"word":"CLOSES","idx":9641,"count":5334414,"meanings":[{"definitions":[{"definition":"An end or conclusion.","example":"We owe them our thanks for bringing the project to a successful close."},{"definition":"The manner of shutting; the union of parts; junction."},{"definition":"A grapple in wrestling."},{"definition":"The conclusion of a strain of music; cadence."},{"definition":"A double bar marking the end."},{"definition":"(travel) The time when checkin staff will no longer accept passengers for a flight."},{"definition":"(chiefly Yorkshire) An enclosed field."},{"definition":"(chiefly British) A street that ends in a dead end."},{"definition":"A very narrow alley between two buildings, often overhung by one of the buildings above the ground floor."},{"definition":"The common staircase in a tenement."},{"definition":"A cathedral close."},{"definition":"The interest which one may have in a piece of ground, even though it is not enclosed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(physical) To remove a gap."},{"definition":"(social) To finish, to terminate."},{"definition":"To come or gather around; to enclose; to encompass; to confine."},{"definition":"To have a vector sum of 0; that is, to form a closed polygon."}],"partOfSpeech":"ve"}]},{"word":"SEQ","idx":9642,"count":5333625,"meanings":[{"definitions":[{"definition":"A set of things next to each other in a set order; a series"},{"definition":"The state of being sequent or following; order of succession.","example":"Complete the listed tasks in sequence."},{"definition":"A series of musical phrases where a theme or melody is repeated, with some change each time, such as in pitch or length (example: opening of Beethoven's Fifth Symphony)."},{"definition":"A musical composition used in some Catholic Masses between the readings. The most famous sequence is the Dies Irae (Day of Wrath) formerly used in funeral services."},{"definition":"An ordered list of objects, typically indexed with natural numbers."},{"definition":"A subsequent event; a consequence or result."},{"definition":"A series of shots that depict a single action or style in a film, television show etc."},{"definition":"A meld consisting of three or more cards of successive ranks in the same suit, such as the four, five and six of hearts."},{"definition":"A logical conclusion or consequence of facts."}],"partOfSpeech":"n"}]},{"word":"PSYCHIATRY","idx":9643,"count":5333073,"meanings":[{"definitions":[{"definition":"The branch of medicine that subjectively diagnoses, treats, and studies mental disorders and behavioural conditions."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/saɪˈkaɪ.əˌtɹi/"}]},{"word":"PERSISTENT","idx":9644,"count":5332514,"meanings":[{"definitions":[{"definition":"Obstinately refusing to give up or let go.","example":"She has had a persistent cough for weeks."},{"definition":"Insistently repetitive.","example":"There was a persistent knocking on the door."},{"definition":"Indefinitely continuous.","example":"There have been persistent rumours for years."},{"definition":"Lasting past maturity without falling off.","example":"Pine cones have persistent scales."},{"definition":"Of data or a data structure: not transient or temporary, but remaining in existence after the termination of the program that creates it.","example":"Once written to a disk file, the data becomes persistent: it will still be there tomorrow when we run the next program."},{"definition":"Describing a fractal process that has a positive Brown function"},{"definition":"(stochastic processes, of a state) non-transient."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɚˈsɪstənt/"},{"text":"/pəˈsɪstənt/"}]},{"word":"ASSISTS","idx":9648,"count":5331190,"meanings":[{"definitions":[{"definition":"A helpful action or an act of giving.","example":"The foundation gave a much needed assist to the shelter."},{"definition":"The act of helping another player score points or goals","example":"He had two assists in the game."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To help.","example":"This book will assist you in getting your life in order."},{"definition":"To make a pass that leads directly towards scoring."},{"definition":"To help compensate for what is missing with the help of a medical technique or therapy."},{"definition":"To stand (at a place) or to (an opinion).","example":"A great part of the nobility assisted to his opinion."},{"definition":"To be present (at an event, occasion etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈsɪsts/"}]},{"word":"SUMMARIES","idx":9649,"count":5330797,"meanings":[{"definitions":[{"definition":"An abstract or a condensed presentation of the substance of a body of material."}],"partOfSpeech":"n"}]},{"word":"GLOW","idx":9650,"count":5329899,"meanings":[{"definitions":[{"definition":"The state of a glowing object."},{"definition":"The condition of being passionate or having warm feelings."},{"definition":"The brilliance or warmth of color in an environment or on a person (especially one's face).","example":"He had a bright red glow on his face."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give off light from heat or to emit light as if heated.","example":"The fire was still glowing after ten hours."},{"definition":"To radiate some emotional quality like light.","example":"The zealots glowed with religious fervor."},{"definition":"To gaze especially passionately at something."},{"definition":"To radiate thermal heat.","example":"After their workout, the gymnasts' faces were glowing red."},{"definition":"To shine brightly and steadily.","example":"The new baby's room glows with bright, loving colors."},{"definition":"To make hot; to flush."},{"definition":"To feel hot; to have a burning sensation, as of the skin, from friction, exercise, etc.; to burn."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"glow-us","text":"/ɡloʊ/"}]},{"word":"AUDITOR","idx":9652,"count":5328551,"meanings":[{"definitions":[{"definition":"One who audits bookkeeping accounts."},{"definition":"In many jurisdictions, an elected or appointed public official in charge of the public accounts; a comptroller."},{"definition":"One who audits an academic course; who attends the lectures but does not earn academic credit."},{"definition":"One who listens, typically as a member of an audience."},{"definition":"One trained to perform spiritual guidance procedures."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"auditor-us","text":"/ˈɔːdɪtə(ɹ)/"}]},{"word":"AQUARIUM","idx":9654,"count":5327865,"meanings":[{"definitions":[{"definition":"A tank, often made of glass, for keeping live fish or other aquatic animals."},{"definition":"A public place where live fish and other aquatic animals are exhibited."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"aquarium-us","text":"/-ɛɹiəm/"}]},{"word":"VIOLIN","idx":9655,"count":5327802,"meanings":[{"definitions":[{"definition":"A musical four-string instrument, generally played with a bow or by plucking the string, with the pitch set by pressing the strings at the appropriate place with the fingers; also any instrument of the violin family."},{"definition":"A violinist.","example":"The first violin often plays the lead melody lines in a string quartet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play on, or as if on, a violin."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"violin-us","text":"/ˌvaɪəˈlɪn/"}]},{"word":"PROPHET","idx":9656,"count":5326547,"meanings":[{"definitions":[{"definition":"Someone who speaks by divine inspiration.","example":"Muslims believe that Muhammad was the final prophet sent to mankind."},{"definition":"Someone who predicts the future; a soothsayer."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"prophet-us","text":"/ˈpɹɑf.ɪt/"}]},{"word":"BRACKET","idx":9658,"count":5321561,"meanings":[{"definitions":[{"definition":"A fixture attached to a wall to hold up a shelf."},{"definition":"Any intermediate object that connects a smaller part to a larger part, the smaller part typically projecting sideways from the larger part."},{"definition":"A short crooked timber, resembling a knee, used as a support."},{"definition":"The cheek or side of an ordnance carriage, supporting the trunnions."},{"definition":"Any of the characters \"(\", \")\", \"[\", \"]\", \"{\", \"}\", \"<\" and \">\", used in pairs to enclose parenthetic remarks, sections of mathematical expressions, etc."},{"definition":"A printed diagram of games in a tournament."},{"definition":"A prediction of the outcome of games in a tournament, used for betting purposes."},{"definition":"One of several ranges of numbers.","example":"tax bracket, age bracket"},{"definition":"A pair of values that represent the smallest and largest elements of a range."},{"definition":"In artillery, the endangered region between two shell impacts (one long and one short). The next shell fired is likely to hit accurately."},{"definition":"The small curved or angular corner formed by a serif and a stroke in a letter."},{"definition":"(land surveying, 19th century) a mark cut into a stone by land surveyors to secure a bench."},{"definition":"A liquor made of fermented ale and honey with spices."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To support by means of mechanical brackets."},{"definition":"To enclose in typographical brackets."},{"definition":"To bound on both sides, to surround, as enclosing with brackets.","example":"I tried to hit the bullseye by first bracketing it with two shots and then splitting the difference with my third, but I missed."},{"definition":"To place in the same category.","example":"Because the didn't have enough young boys for two full teams, they bracketed the seven-year olds with the eight-year olds."},{"definition":"To mark distinctly for special treatment."},{"definition":"To set aside, discount, ignore."},{"definition":"To take multiple images of the same subject, using a range of exposure settings, in order to help ensure that a satisfactory image is obtained."},{"definition":"(phenomenology) In the philosophical system of Edmund Husserl and his followers, to set aside metaphysical theories and existential questions concerning what is real in order to focus philosophical attention simply on the actual content of experience."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bracket-us","text":"/ˈbɹækɪt/"}]},{"word":"OXIDE","idx":9661,"count":5321340,"meanings":[{"definitions":[{"definition":"A binary chemical compound of oxygen with another chemical element."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"oxide-uk","text":"/ˈɒksaɪd/"}]},{"word":"OAKS","idx":9662,"count":5320404,"meanings":[{"definitions":[{"definition":"A deciduous tree with distinctive deeply lobed leaves, acorns, and notably strong wood, typically of England and northeastern North America, included in genus Quercus."},{"definition":"The wood of the oak."},{"definition":"A rich brown colour, like that of oak wood."},{"definition":"Any tree of the genus Quercus, in family Fagaceae."},{"definition":"Any tree of other genera and species of trees resembling typical oaks of genus Quercus in some ways."},{"definition":"The outer (lockable) door of a set of rooms in a college or similar institution. (Often in the phrase \"to sport one's oak\")."},{"definition":"The flavor of oak."},{"definition":"A stakes race in which entry is restricted to 3-year-old fillies."}],"partOfSpeech":"n"}]},{"word":"MAGNIFICENT","idx":9663,"count":5319310,"meanings":[{"definitions":[{"definition":"Grand, elegant or splendid in appearance."},{"definition":"Grand or noble in action."},{"definition":"Exceptional for its kind."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"magnificent-us","text":"/mæɡˈnɪfəsənt/"}]},{"word":"COLLEAGUE","idx":9665,"count":5317221,"meanings":[{"definitions":[{"definition":"A fellow member of a profession, staff, academic faculty or other organization; an associate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To unite or associate with another or with others.","example":"Young Fortinbras,/ Holding a weak supposal of our worth/...Colleagued with the dream of his advantage,/...hath not failed to pester us with message/ Importing the surrender of those lands/Lost by his father. - Hamlet (Act I, Scene 2)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"colleague-us","text":"/ˈkɑliɡ/"}]},{"word":"PROMPTLY","idx":9667,"count":5315422,"meanings":[{"definitions":[{"definition":"In prompt manner; both soon and quickly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"promptly-us","text":"/ˈpɹɑmptli/"}]},{"word":"MODEMS","idx":9668,"count":5315313,"meanings":[{"definitions":[{"definition":"A device that encodes digital computer signals into analog/analogue telephone signals and vice versa and allows computers to communicate over a phone line."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transmit by modem."}],"partOfSpeech":"ve"}]},{"word":"ADAPTATION","idx":9669,"count":5314230,"meanings":[{"definitions":[{"definition":"The process of adapting something or becoming adapted to a situation; adjustment, modification."},{"definition":"A change that is made or undergone to suit a condition or environment."},{"definition":"The process of change that an organism undergoes to be better suited to its environment."},{"definition":"An instance of an organism undergoing change, or the structure or behavior that is changed."},{"definition":"The process of adapting an artistic work from a different medium."},{"definition":"(authorship) An artistic work that has been adapted from a different medium."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌædæpˈteɪʃən/"}]},{"word":"HARMFUL","idx":9671,"count":5313786,"meanings":[{"definitions":[{"definition":"Of a kind likely to be damaging; injurious","example":"Wear a hat to protect your skin from harmful sunlight."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"harmful-us","text":"/ˈhɑɹmfl̩/"}]},{"word":"PAINTBALL","idx":9672,"count":5311691,"meanings":[{"definitions":[{"definition":"A sport where teams shoot each other with gelatin capsules filled with paint-like dye."},{"definition":"The dye-filled capsule fired in the sport of paintball."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To engage in the sport of paintball."},{"definition":"To shoot someone using a paintball gun."}],"partOfSpeech":"ve"}]},{"word":"SEXUALLY","idx":9674,"count":5310148,"meanings":[{"definitions":[{"definition":"In a sexual manner: erotically.","example":"She kissed him sexually."},{"definition":"With respect to sex (either of the two divisions of organisms).","example":"The firm discriminated sexually in its hiring and retention practices."},{"definition":"With respect to sexual intercourse.","example":"He was sexually active by the age of fifteen."},{"definition":"By means of sexual intercourse.","example":"A parrot is a sexually reproducing organism."}],"partOfSpeech":"v"}]},{"word":"ENCLOSURE","idx":9675,"count":5309730,"meanings":[{"definitions":[{"definition":"Something enclosed, i.e. inserted into a letter or similar package.","example":"There was an enclosure with the letter — a photo."},{"definition":"The act of enclosing, i.e. the insertion or inclusion of an item in a letter or package.","example":"The enclosure of a photo with your letter is appreciated."},{"definition":"An area, domain, or amount of something partially or entirely enclosed by barriers.","example":"He faced punishment for creating the fenced enclosure in a public park."},{"definition":"The act of separating and surrounding an area, domain, or amount of something with a barrier.","example":"At first, untrained horses resist enclosure."},{"definition":"(British History) The post-feudal process of subdivision of common lands for individual ownership.","example":"Strip-farming disappeared after enclosure."},{"definition":"The area of a convent, monastery, etc where access is restricted to community members."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɛnˈkloʊʒəɹ/"},{"text":"/ɪnˈkləʊʒə/"},{"text":"/ɘnˈklɐʉʒɘ/"}]},{"word":"DIVIDEND","idx":9677,"count":5305595,"meanings":[{"definitions":[{"definition":"A number or expression that is to be divided by another.","example":"In \"42 ÷ 3\" the dividend is the 42."},{"definition":"A pro rata payment of money by a company to its shareholders, usually made periodically (eg, quarterly or annually)."},{"definition":"Beneficial results from a metaphorical investment (of time, effort, etc.)","example":"His 10,000 hours of practice and recitals eventually paid dividends when he become first-chair violinist."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dividend-us","text":"/ˈdɪvɪdɛnd/"}]},{"word":"GLUCOSE","idx":9681,"count":5301959,"meanings":[{"definitions":[{"definition":"A simple monosaccharide (sugar) with a molecular formula of C6H12O6; it is a principle source of energy for cellular metabolism."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡlukoʊs/"},{"text":"/ˈɡluːkoʊz/"}]},{"word":"PHANTOM","idx":9682,"count":5301147,"meanings":[{"definitions":[{"definition":"A ghost or apparition."},{"definition":"Something apparently seen, heard, or sensed, but having no physical reality; an image that appears only in the mind; an illusion or delusion."},{"definition":"A placeholder for a pair of players when there are an odd number of pairs playing."},{"definition":"(medical imaging) A test object."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Illusive."},{"definition":"Fictitious or nonexistent.","example":"a phantom limb"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfæntəm/"}]},{"word":"NORM","idx":9683,"count":5299839,"meanings":[{"definitions":[{"definition":"That which is normal or typical.","example":"Unemployment is the norm in this part of the country."},{"definition":"A rule that is enforced by members of a community.","example":"Not eating your children is just one of those societal norms."},{"definition":"A sentence with non-descriptive meaning, such as a command, permission or prohibition."},{"definition":"A function, generally denoted v\\mapsto\\left|v\\right| or v\\mapsto\\left\\|v\\right\\|, that maps vectors to non-negative scalars and has the following properties:"},{"definition":"A high level of performance in a chess tournament, several of which are required for a player to receive a title."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To endow (a vector space, etc) with a norm."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"norm-us","text":"/nɔɹm/"}]},{"word":"PLAYBACK","idx":9684,"count":5299771,"meanings":[{"definitions":[{"definition":"The replaying of something previously recorded, especially sound or moving images."}],"partOfSpeech":"n"}]},{"word":"SUPERVISORS","idx":9685,"count":5299044,"meanings":[{"definitions":[{"definition":"A person with the official task of overseeing the work of a person or group, or of other operations and activities."},{"definition":"A person who monitors someone to make sure they comply with rules or other requirements set for them."},{"definition":"In certain states, an elected member of the governing body for a county which is called the board of supervisors."},{"definition":"A process responsible for managing other processes."}],"partOfSpeech":"n"}]},{"word":"TURTLE","idx":9687,"count":5297998,"meanings":[{"definitions":[{"definition":"Any land or marine reptile of the order Testudines, characterised by a protective shell enclosing its body. See also tortoise."},{"definition":"(specifically) A marine reptile of that order."},{"definition":"An Ancient Roman attack method, where the shields held by the soldiers hide them, not only left, right, front and back, but also from above."},{"definition":"A type of robot having a domed case (and so resembling the reptile), used in education, especially for making line drawings by means of a computer program."},{"definition":"An on-screen cursor that serves the same function as a turtle for drawing."},{"definition":"The curved plate in which the form is held in a type-revolving cylinder press."},{"definition":"A small element towards the end of a list of items to be bubble sorted, and thus tending to take a long time to be swapped into its correct position. Compare rabbit."},{"definition":"A breakdancing move consisting of a float during which the dancer's weight shifts from one hand to the other, producing rotation or a circular \"walk\"."},{"definition":"A low stand for a lamp etc."},{"definition":"A turtle dove."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flip over onto the back or top; to turn upside down."},{"definition":"To turn and swim upside down."},{"definition":"To hunt turtles, especially in the water."},{"definition":"To build up a large defense force and strike only punctually, rather than going for an offensive strategy."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"turtle-us","text":"/ˈtɝtəl/"}]},{"word":"DISTANCES","idx":9689,"count":5296572,"meanings":[{"definitions":[{"definition":"The amount of space between two points, usually geographical points, usually (but not necessarily) measured along a straight line.","example":"From Moscow, the distance is relatively short to Saint Petersburg, relatively long to Novosibirsk, but even greater to Vladivostok."},{"definition":"Length or interval of time."},{"definition":"The difference; the subjective measure between two quantities.","example":"We're narrowing the distance between the two versions of the bill.  The distance between the lowest and next gear on my bicycle is annoying."},{"definition":"Remoteness of place; a remote place."},{"definition":"Remoteness in succession or relation.","example":"the distance between a descendant and his ancestor"},{"definition":"A space marked out in the last part of a racecourse."},{"definition":"The entire amount of progress to an objective.","example":"He had promised to perform this task, but did not go the distance."},{"definition":"A withholding of intimacy; alienation; variance.","example":"The friendship did not survive the row: they kept each other at a distance."},{"definition":"The remoteness or reserve which respect requires; hence, respect; ceremoniousness."},{"definition":"The space measured back from the winning-post which a racehorse running in a heat must reach when the winner has covered the whole course, in order to run in the final heat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move away (from) someone or something.","example":"He distanced himself from the comments made by some of his colleagues."},{"definition":"To leave at a distance; to outpace, leave behind."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"distances-us"}]},{"word":"ABSORPTION","idx":9690,"count":5294724,"meanings":[{"definitions":[{"definition":"The act or process of absorbing or of being absorbed as,"},{"definition":"Entire engrossment or occupation of the mind.","example":"absorption in some employment"},{"definition":"Mental assimilation."},{"definition":"The retaining of electrical energy for a short time after it has been introduced to the dielectric."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"absorption-us","text":"/æbˈsɔɹp.ʃn̩/"}]},{"word":"TREASURES","idx":9691,"count":5293991,"meanings":[{"definitions":[{"definition":"A collection of valuable things; accumulated wealth; a stock of money, jewels, etc."},{"definition":"Anything greatly valued."},{"definition":"A term of endearment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a person or thing) To consider to be precious; to value highly.","example":"Oh, this ring is beautiful! I’ll treasure it forever."},{"definition":"To store or stow in a safe place."},{"definition":"To enrich."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"treasures-us","text":"/ˈtɹɛʒɚz/"}]},{"word":"WARNED","idx":9693,"count":5292851,"meanings":[{"definitions":[{"definition":"To make (someone) aware of (something impending); especially:"},{"definition":"To caution or admonish (someone) against unwise or unacceptable behaviour.","example":"Don't let me catch you running in the corridor again, I warn you."},{"definition":"(chiefly with \"off\", \"away\", and similar words) To advise or order to go or stay away.","example":"A sign warns trespassers off/away from the site."},{"definition":"To give warning."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"warned-us","text":"/wɔɹnd/"}]},{"word":"NEURAL","idx":9694,"count":5292673,"meanings":[{"definitions":[{"definition":"Of, or relating to the nerves, neurons or the nervous system."},{"definition":"Modelled on the arrangement of neurons in the brain."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈnɝəl/"},{"text":"/ˈnjʊəɹəl/"},{"text":"/ˈnjəɹəl/"}]},{"word":"WARE","idx":9695,"count":5292386,"meanings":[{"definitions":[{"definition":"The state of being aware; heed."},{"definition":"(usually in combination) Goods or a type of goods offered for sale or use."},{"definition":"(in the plural) See wares."},{"definition":"Pottery or metal goods.","example":"damascene ware, tole ware"},{"definition":"A style or genre of artifact."},{"definition":"Crockery."},{"definition":"Seaweed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Aware."},{"definition":"Wary; cautious."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To be ware or mindful of something."},{"definition":"To protect or guard (especially oneself); to be on guard, be wary.","example":"Ware thee."},{"definition":"To wear, or veer."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ware-1-us","text":"/wɛɚ/"}]},{"word":"FOSSIL","idx":9696,"count":5291925,"meanings":[{"definitions":[{"definition":"The mineralized remains of an animal or plant."},{"definition":"Any preserved evidence of ancient life, including shells, imprints, burrows, coprolites, and organically-produced chemicals."},{"definition":"A fossil word."},{"definition":"Anything extremely old, extinct, or outdated."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fossil-us","text":"/ˈfɑːsəl/"}]},{"word":"MIA","idx":9697,"count":5291817,"meanings":[{"definitions":[{"definition":"An ancient bluffing game played with dice."},{"definition":"Bulimia (used especially by the pro-mia movement)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mia-au"}]},{"word":"HOMETOWN","idx":9698,"count":5290705,"meanings":[{"definitions":[{"definition":"An individual’s place of birth, childhood home, or place of main residence."},{"definition":"Designating a decision or judgement that is biased, or perceived to be biased, in favour of local preference.","example":"hometown decision, hometown verdict"}],"partOfSpeech":"n"}]},{"word":"BADLY","idx":9699,"count":5290145,"meanings":[{"definitions":[{"definition":"Ill, unwell.","example":"He's never badly."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a bad manner."},{"definition":"Very much; to a great degree.","example":"I want it so badly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"badly-us","text":"/ˈbæd.li/"}]},{"word":"TRANSCRIPTS","idx":9700,"count":5288182,"meanings":[{"definitions":[{"definition":"Something which has been transcribed; a writing or composition consisting of the same words as the original; a written copy."},{"definition":"A copy of any kind; an imitation."},{"definition":"A written version of what was said orally","example":"the transcript of a trial"},{"definition":"A sequence of RNA produced by transcription"},{"definition":"An inventory of the courses taken and grades earned of a student alleged throughout a course."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write a transcript; to transcribe."}],"partOfSpeech":"ve"}]},{"word":"APOLLO","idx":9701,"count":5286526,"meanings":[{"definitions":[{"definition":"A very handsome young man."},{"definition":"Any of several papilionid butterflies of the genus Parnassius, especially Parnassius apollo of Eurasia (also known as the mountain apollo)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"apollo-us","text":"/əˈpɑloʊ/"}]},{"word":"WAN","idx":9702,"count":5285316,"meanings":[{"definitions":[{"definition":"The quality of being wan; wanness."},{"definition":"The digit or figure 1."},{"definition":"The neutral element with respect to multiplication in a ring."},{"definition":"A one-dollar bill."},{"definition":"One run scored by hitting the ball and running between the wickets; a single."},{"definition":"A joke or amusing anecdote."},{"definition":"A particularly special or compatible person or thing.","example":"I knew as soon I met him that John was the one for me and we were married within a month."},{"definition":"(leet) Used instead of ! to amplify an exclamation, parodying unskilled typists who forget to press the shift key while typing exclamation points, thus typing \"1\".","example":"2003 September 26, \"DEAL WITH IT!!!!11one!!\", in alt.games.video.nintendo.gamecube, Usenet"},{"definition":"A girl or woman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pale, sickly-looking."},{"definition":"Dim, faint."},{"definition":"Bland, uninterested.","example":"A wan expression"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To conquer, defeat."},{"definition":"To reach some destination or object, despite difficulty or toil (now usually intransitive, with preposition or locative adverb)."},{"definition":"To triumph or achieve victory in (a game, a war, etc.)."},{"definition":"To gain (a prize) by succeeding in competition or contest.","example":"to win the jackpot in a lottery;  to win a bottle of wine in a raffle"},{"definition":"To obtain (someone) by wooing; to make an ally or friend of (frequently with over)."},{"definition":"To achieve victory.","example":"Who would win in a fight between an octopus and a dolphin?"},{"definition":"To have power, coercion or control.","example":"Ever since the 2013 Boston Marathon bombing, Bostonians now run as \"One Boston.\" The terrorists did not win."},{"definition":"To obtain (something desired).","example":"The company hopes to win an order from the government worth over 5 million dollars."},{"definition":"To cause a victory for someone.","example":"The policy success should win the elections for Mr. Smith."},{"definition":"To extract (ore, coal, etc.)."},{"definition":"To dry by exposure to the wind."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wan-1-uk","text":"/wɒn/"}]},{"word":"DISAPPOINTED","idx":9703,"count":5284061,"meanings":[{"definitions":[{"definition":"To sadden or displease (someone) by underperforming, or by not delivering something promised or hoped for.","example":"His lack of respect disappointed her."},{"definition":"To deprive (someone of something expected or hoped for)."},{"definition":"To fail to meet (an expectation); to fail to fulfil (a hope)."},{"definition":"To show (an opinion, belief, etc.) to be mistaken."},{"definition":"To prevent (something planned or attempted)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Defeated of expectations or hope; experiencing disappointment; let down.","example":"After all his anticipation, the trip left him deeply disappointed."},{"definition":"Expressing or indicating disappointment.","example":"a disappointed tone / face / silence"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disappointed-us","text":"/ˌdɪsəˈpɔɪntɪd/"}]},{"word":"CONTINUALLY","idx":9705,"count":5278721,"meanings":[{"definitions":[{"definition":"In a continual manner; non-stop."},{"definition":"In regular or repeated succession; very often."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"continually-us","text":"/kənˈtɪnjuəli/"}]},{"word":"COMMUNIST","idx":9706,"count":5278277,"meanings":[{"definitions":[{"definition":"An advocate of a society based on the common ownership of property; a proponent of communism."},{"definition":"Any revolutionary or subversive radical."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, supporting, or advocating communism."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɑː.m.jə.nɪst/"},{"text":"/ˈkɒ.mjʊ.nɪst/"}]},{"word":"COLLECTIBLE","idx":9707,"count":5277927,"meanings":[{"definitions":[{"definition":"An object which someone might want to collect."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Worthy or suitable for collecting on historical/financial grounds, or for meeting a personal aesthetic.","example":"collectible stamps, collectible china, collectible Beatles memorabilia"},{"definition":"Rightfully subject to payment.","example":"a collectible bill"},{"definition":"That is likely to be paid.","example":"He's owed it to us for six months, but it doesn't look very collectible to me."}],"partOfSpeech":"j"}]},{"word":"HANDMADE","idx":9708,"count":5276538,"meanings":[{"definitions":[{"definition":"An art or craft object made by hand."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Manufactured by hand.","example":"handmade shoes"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈhændˌmeɪd/"}]},{"word":"ENTREPRENEURS","idx":9710,"count":5275312,"meanings":[{"definitions":[{"definition":"A person who organizes and operates a business venture and assumes much of the associated risk."},{"definition":"A person who organizes a risky activity of any kind and acts substantially in the manner of a business entrepreneur."},{"definition":"A person who strives for success and takes on risk by starting their own venture, service, etc."}],"partOfSpeech":"n"}]},{"word":"ROBOTS","idx":9711,"count":5274525,"meanings":[{"definitions":[{"definition":"A machine built to carry out some complex task or group of tasks by physically moving, especially one which can be programmed."},{"definition":"An intelligent mechanical being designed to look like a human or other creature, and usually made from metal."},{"definition":"A person who does not seem to have any emotions."},{"definition":"A traffic light (from earlier robot policeman)."},{"definition":"A theodolite which follows the movements of a prism and can be used by a one-man crew."},{"definition":"A style of dance popular in disco in which the dancer imitates the stiff movements of a stereotypical android robot."}],"partOfSpeech":"n"}]},{"word":"CREATIONS","idx":9713,"count":5273628,"meanings":[{"definitions":[{"definition":"Something created such as an invention or artwork.","example":"I think the manufacturer was so ashamed of its creation that it didn't put its name on it!"},{"definition":"The act of creating something.","example":"The restructure resulted in the creation of a number of shared services."},{"definition":"All which exists.","example":"Let us pray to Christ, the King of all creation."}],"partOfSpeech":"n"}]},{"word":"JADE","idx":9714,"count":5272655,"meanings":[{"definitions":[{"definition":"A semiprecious stone, either nephrite or jadeite, generally green or white in color, often used for carving figurines."},{"definition":"A bright shade of slightly bluish or greyish green, typical of polished jade stones."},{"definition":"A succulent plant, Crassula ovata."},{"definition":"A horse too old to be put to work."},{"definition":"A bad-tempered or disreputable woman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a grayish shade of green, typical of jade stones."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To tire, weary or fatigue"},{"definition":"To treat like a jade; to spurn."},{"definition":"To make ridiculous and contemptible."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jade-uk","text":"/d͡ʒeɪd/"}]},{"word":"SCOOP","idx":9715,"count":5272369,"meanings":[{"definitions":[{"definition":"Any cup- or bowl-shaped tool, usually with a handle, used to lift and move loose or soft solid material.","example":"She kept a scoop in the dog food."},{"definition":"The amount or volume of loose or solid material held by a particular scoop.","example":"I'll have one scoop of chocolate ice-cream."},{"definition":"The act of scooping, or taking with a scoop or ladle; a motion with a scoop, as in dipping or shovelling."},{"definition":"A story or fact; especially, news learned and reported before anyone else."},{"definition":"An opening in a hood/bonnet or other body panel to admit air, usually for cooling the engine."},{"definition":"The digging attachment on a front-end loader."},{"definition":"A place hollowed out; a basinlike cavity; a hollow."},{"definition":"A spoon-shaped surgical instrument, used in extracting certain substances or foreign bodies."},{"definition":"A special spinal board used by emergency medical service staff that divides laterally to scoop up patients."},{"definition":"A sweep; a stroke; a swoop."},{"definition":"The peak of a cap."},{"definition":"A hole on the playfield that catches a ball, but eventually returns it to play in one way or another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lift, move, or collect with a scoop or as though with a scoop.","example":"He used both hands to scoop water and splash it on his face."},{"definition":"To make hollow; to dig out.","example":"I tried scooping a hole in the sand with my fingers."},{"definition":"To report on something, especially something worthy of a news article, before (someone else).","example":"The paper across town scooped them on the City Hall scandal."},{"definition":"(often with \"up\") To begin a vocal note slightly below the target pitch and then to slide up to the target pitch, especially in country music."},{"definition":"To pick (someone) up","example":"You have a car. Can you come and scoop me?"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scoop-us","text":"/skuːp/"}]},{"word":"ACQUISITIONS","idx":9716,"count":5270178,"meanings":[{"definitions":[{"definition":"The act or process of acquiring.","example":"The acquisition of sports equipment can be fun in itself."},{"definition":"The thing acquired or gained; a gain.","example":"That graphite tennis racquet is quite an acquisition."},{"definition":"The process of sampling signals that measure real world physical conditions and converting these signals into digital numeric values that can be manipulated by a computer."}],"partOfSpeech":"n"}]},{"word":"FOUL","idx":9717,"count":5268620,"meanings":[{"definitions":[{"definition":"Covered with, or containing unclean matter; dirty.","example":"A ship's bottom is foul when overgrown with barnacles"},{"definition":"(of words or a way of speaking) obscene, vulgar or abusive.","example":"His foul language causes many people to believe he is uneducated."},{"definition":"Detestable, unpleasant, loathsome.","example":"He has a foul set of friends."},{"definition":"Disgusting, repulsive; causing disgust.","example":"There was a foul smell coming from the toilet."},{"definition":"Ugly; homely; poor."},{"definition":"(of the weather) Unpleasant, stormy or rainy.","example":"Some foul weather is brewing."},{"definition":"Dishonest or not conforming to the established rules and customs of a game, conflict, test, etc.","example":"Foul play is not suspected."},{"definition":"Entangled and therefore restricting free movement, not clear.","example":"We've got a foul anchor."},{"definition":"Outside of the base lines; in foul territory.","example":"Jones hit foul ball after foul ball."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A breach of the rules of a game, especially one involving inappropriate contact with an opposing player in order to gain an advantage; for example, tripping someone up in soccer, or contact of any kind in basketball."},{"definition":"A (usually accidental) contact between a bowler and the lane before the bowler has released the ball."},{"definition":"A foul ball, a ball which has been hit outside of the base lines.","example":"Jones hit a foul up over the screen."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make dirty.","example":"She's fouled her diaper."},{"definition":"To besmirch.","example":"He's fouled his reputation."},{"definition":"To clog or obstruct.","example":"The hair has fouled the drain."},{"definition":"To entangle.","example":"The kelp has fouled the prop."},{"definition":"To make contact with an opposing player in order to gain advantage.","example":"Smith fouled him hard."},{"definition":"To hit outside of the baselines.","example":"Jones fouled the ball off the facing of the upper deck."},{"definition":"To become clogged.","example":"The drain fouled."},{"definition":"To become entangled.","example":"The prop fouled on the kelp."},{"definition":"To commit a foul.","example":"Smith fouled within the first minute of the quarter."},{"definition":"To hit a ball outside of the baselines.","example":"Jones fouled for strike one."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"foul-us","text":"/faʊl/"}]},{"word":"KENO","idx":9718,"count":5268379,"meanings":[{"definitions":[{"definition":"A gambling game, a variety of the game of lotto, played with balls or knobs, numbered, and cards also numbered."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkiːnəʊ/"}]},{"word":"EARNING","idx":9720,"count":5266443,"meanings":[{"definitions":[{"definition":"To gain (success, reward, recognition) through applied effort or work.","example":"You can have the s'mores: you earned them, clearing the walkway of snow so well."},{"definition":"To receive payment for work.","example":"He earns seven million dollars a year as CEO.  My bank account is only earning one percent interest."},{"definition":"To receive payment for work.","example":"Now that you are earning, you can start paying me rent."},{"definition":"To cause (someone) to receive payment or reward.","example":"My CD earns me six percent!"},{"definition":"To achieve by being worthy of.","example":"to earn a spot in the top 20"},{"definition":"To curdle, as milk."},{"definition":"To long; to yearn."},{"definition":"To grieve."}],"partOfSpeech":"ve"}]},{"word":"MAILMAN","idx":9721,"count":5266389,"meanings":[{"definitions":[{"definition":"Someone (implied male) who delivers mail to, and/or collects mail from, residential or commercial addresses, or from public mailboxes"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmeɪl.mən/"}]},{"word":"NESTED","idx":9723,"count":5265588,"meanings":[{"definitions":[{"definition":"(of animals) To build or settle into a nest."},{"definition":"To settle into a home.","example":"We loved the new house and were nesting there in two days!"},{"definition":"To successively neatly fit inside another.","example":"I bought a set of nesting mixing bowls for my mother."},{"definition":"To place in, or as if in, a nest."},{"definition":"To place one thing neatly inside another, and both inside yet another (and so on).","example":"There would be much more room in the attic if you had nested all the empty boxes."},{"definition":"To hunt for birds' nests or their contents (usually \"go nesting\")."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Embedded."},{"definition":"Successively fitted one inside another."},{"definition":"(Of a lexical item) contained within a dictionary entry as a subordinate term of the main headword."}],"partOfSpeech":"j"}]},{"word":"BIODIVERSITY","idx":9724,"count":5265501,"meanings":[{"definitions":[{"definition":"The diversity (number and variety of species) of plant and animal life within a region."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌbaɪ.əʊˌdaɪˈvɜː(ɹ).sɪ.ti/"},{"text":"/ˌbaɪoʊdɑɪˈvɚsəti/"}]},{"word":"EXCITEMENT","idx":9725,"count":5262975,"meanings":[{"definitions":[{"definition":"The state of being excited (emotionally aroused)."},{"definition":"Something that excites."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"excitement-us","text":"/ɪkˈsaɪtmənt/"},{"audio":"excitement-uk","text":"/ɪkˈsaɪtmənt/"}]},{"word":"MOVERS","idx":9727,"count":5261231,"meanings":[{"definitions":[{"definition":"Someone who or something that moves."},{"definition":"A dancer."},{"definition":"A person employed to help people move their possessions from one residence to another."},{"definition":"Someone who proposes a motion at a meeting."}],"partOfSpeech":"n"}]},{"word":"VERBAL","idx":9728,"count":5259521,"meanings":[{"definitions":[{"definition":"(grammar) A verb form which does not function as a predicate, or a word derived from a verb. In English, infinitives, participles and gerunds are verbals."},{"definition":"A confession given to police."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To induce into fabricating a confession."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to words."},{"definition":"Concerned with the words, rather than the substance of a text."},{"definition":"Consisting of words only."},{"definition":"Expressly spoken rather than written; oral.","example":"a verbal contract"},{"definition":"(grammar) Derived from, or having the nature of a verb."},{"definition":"(grammar) Used to form a verb."},{"definition":"Capable of speech."},{"definition":"Word for word.","example":"a verbal translation"},{"definition":"Abounding with words; verbose."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"verbal-us","text":"/ˈvɝ.bəl/"}]},{"word":"BLINK","idx":9729,"count":5257629,"meanings":[{"definitions":[{"definition":"The act of very quickly closing both eyes and opening them again."},{"definition":"The time needed to close and reopen one's eyes."},{"definition":"A text formatting feature that causes text to disappear and reappear as a form of visual emphasis."},{"definition":"A glimpse or glance."},{"definition":"Gleam; glimmer; sparkle"},{"definition":"The dazzling whiteness about the horizon caused by the reflection of light from fields of ice at sea; iceblink"},{"definition":"(in the plural) Boughs cast where deer are to pass, in order to turn or check them."},{"definition":"An ability that allows teleporting, mostly for short distances"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To close and reopen both eyes quickly.","example":"The loser in the staring game is the person who blinks first."},{"definition":"To flash on and off at regular intervals.","example":"The blinking text on the screen was distracting."},{"definition":"To perform the smallest action that could solicit a response."},{"definition":"To shut out of sight; to evade; to shirk.","example":"to blink the question"},{"definition":"To trick; to deceive."},{"definition":"To turn slightly sour, or blinky, as beer, milk, etc."},{"definition":"To teleport, mostly for short distances."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"blink-uk","text":"/blɪŋk/"}]},{"word":"PRESENTLY","idx":9730,"count":5254807,"meanings":[{"definitions":[{"definition":"Immediately, at once; quickly."},{"definition":"Before long; soon."},{"definition":"At present ; now; currently."},{"definition":"With actual presence; in actuality."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"presently-us"},{"text":"/ˈpɹɛzəntli/"}]},{"word":"SEAS","idx":9731,"count":5254799,"meanings":[{"definitions":[{"definition":"A large body of salt water."},{"definition":"A lake, especially if large or if salty or brackish.","example":"The Caspian Sea, the Sea of Galilee, the Salton Sea, etc."},{"definition":"The swell of the sea; a single wave; billow."},{"definition":"(in combination) Living or used in or on the sea; of, near, or like the sea.","example":"Seaman, sea gauge, sea monster, sea horse, sea level, seaworthy, seaport, seaboard, etc."},{"definition":"Anything resembling the vastness or turbulence of the sea."},{"definition":"A constant flux of gluons splitting into quarks, which annihilate to produce further gluons."},{"definition":"A large, dark plain of rock; a mare.","example":"The Apollo 11 mission landed in the Sea of Tranquility."},{"definition":"A very large lake of liquid hydrocarbon."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"seas-us","text":"/siːz/"}]},{"word":"WORKFLOW","idx":9733,"count":5252900,"meanings":[{"definitions":[{"definition":"The rate at which a flow of work takes place"},{"definition":"A process or procedure by which tasks are completed. It may be defined by a flowchart with actors, actions, results, decisions, and action paths."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɝkfloʊ/"},{"text":"/ˈwɜːkfləʊ/"}]},{"word":"MYSTERIOUS","idx":9734,"count":5252752,"meanings":[{"definitions":[{"definition":"Of unknown origin.","example":"He received a mysterious phone call this morning."},{"definition":"Having unknown qualities.","example":"Our boss is a mysterious man who hardly ever meets with us."},{"definition":"Difficult to understand.","example":"Why he left without saying goodbye is quite mysterious."},{"definition":"Deliberately evasive or enigmatic.","example":"Stop being mysterious and just tell me what you want."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mysterious-us","text":"/məˈstɪɹi.əs/"}]},{"word":"NOVELTY","idx":9735,"count":5252481,"meanings":[{"definitions":[{"definition":"The state of being new or novel; newness."},{"definition":"A new product; an innovation."},{"definition":"A small mass-produced trinket."},{"definition":"In novelty theory, newness, density of complexification, and dynamic change as opposed to static habituation."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"novelty-us","text":"/ˈnɑvəlti/"}]},{"word":"TILES","idx":9737,"count":5251527,"meanings":[{"definitions":[{"definition":"A regularly-shaped slab of clay or other material, affixed to cover or decorate a surface, as in a roof-tile, glazed tile, stove tile, carpet tile etc."},{"definition":"A rectangular graphic.","example":"Each tile within Google Maps consists of 256 × 256 pixels."},{"definition":"Any of various flat cuboid playing pieces used in certain games, such as dominoes, Scrabble, or mahjong."},{"definition":"A stiff hat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover with tiles.","example":"The handyman tiled the kitchen."},{"definition":"To arrange in a regular pattern, with adjoining edges (applied to tile-like objects, graphics, windows in a computer interface)."},{"definition":"To optimize (a loop in program code) by means of the tiling technique."},{"definition":"To protect from the intrusion of the uninitiated.","example":"tile the door"}],"partOfSpeech":"ve"}]},{"word":"LIBRARIAN","idx":9739,"count":5250166,"meanings":[{"definitions":[{"definition":"The keeper, manager of a library."},{"definition":"One who cares for the publications, files etc. in a library, whether staff or volunteer."},{"definition":"A person who processes and organizes information."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/laɪˈbɹɛɹ.i.ən/"}]},{"word":"SUBSIDIARIES","idx":9740,"count":5250152,"meanings":[{"definitions":[{"definition":"A company owned by a parent company or a holding company, also called daughter company or sister company."},{"definition":"A subordinate theme."},{"definition":"One who aids or supplies; an assistant."}],"partOfSpeech":"n"}]},{"word":"SWITCHED","idx":9741,"count":5245466,"meanings":[{"definitions":[{"definition":"To exchange.","example":"I want to switch this red dress for a green one."},{"definition":"To change (something) to the specified state using a switch.","example":"Switch the light on."},{"definition":"To whip or hit with a switch."},{"definition":"To change places, tasks, etc.","example":"I want to switch to a different seat."},{"definition":"To get angry suddenly; to quickly or unreasonably become enraged."},{"definition":"To swing or whisk.","example":"to switch a cane"},{"definition":"To be swung or whisked.","example":"The angry cat's tail switched back and forth."},{"definition":"To trim.","example":"to switch a hedge"},{"definition":"To turn from one railway track to another; to transfer by a switch; generally with off, from, etc.","example":"to switch off a train; to switch a car from one track to another"},{"definition":"To shift to another circuit."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/swɪtʃt/"}]},{"word":"POSE","idx":9746,"count":5242405,"meanings":[{"definitions":[{"definition":"Common cold, head cold; catarrh."},{"definition":"Position, posture, arrangement (especially of the human body).","example":"Please adopt a more graceful pose for my camera."},{"definition":"Affectation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place in an attitude or fixed position, for the sake of effect.","example":"To pose a model for a picture."},{"definition":"To ask; to set (a test, quiz, riddle, etc.)."},{"definition":"To constitute (a danger, a threat, a risk, etc.)."},{"definition":"(in the phrase \"to pose as\") To falsely impersonate (another person or occupation) primarily for the purpose of accomplishing something or reaching a goal."},{"definition":"To assume or maintain a pose; to strike an attitude."},{"definition":"To behave affectedly in order to attract interest or admiration."},{"definition":"To interrogate; to question."},{"definition":"To question with a view to puzzling; to embarrass by questioning or scrutiny; to bring to a stand."},{"definition":"To ask (someone) questions; to interrogate."},{"definition":"To puzzle, non-plus, or embarrass with difficult questions."},{"definition":"To perplex or confuse (someone)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pose-us","text":"/poʊz/"}]},{"word":"FUZZY","idx":9747,"count":5241931,"meanings":[{"definitions":[{"definition":"(often in the plural) A very small piece of plush material.","example":"You've got a fuzzy on your coat."},{"definition":"Something covered with fuzz or hair, as an animal or plush toy."},{"definition":"A person, especially a college student, interested in humanities or social sciences, as opposed to one interested in mathematics, science, or engineering."},{"definition":"A soldier with the rank of private."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Covered with fuzz or a large number of tiny loose fibres like a carpet or many stuffed animals"},{"definition":"Vague or imprecise.","example":"My recollection of that event is fuzzy."},{"definition":"Not clear; unfocused.","example":"I finally threw out a large stack of fuzzy photos."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fuzzy-us","text":"/ˈfʌzi/"}]},{"word":"GRAMS","idx":9749,"count":5240826,"meanings":[{"definitions":[{"definition":"A photograph or video shared on this service."},{"definition":"A unit of mass equal to one-thousandth of a kilogram. Symbol: g"},{"definition":"Grandmother"},{"definition":"Grandmother"}],"partOfSpeech":"n"}]},{"word":"THERAPIST","idx":9750,"count":5238169,"meanings":[{"definitions":[{"definition":"Someone who provides therapy, usually professionally."}],"partOfSpeech":"n"}]},{"word":"MRNA","idx":9752,"count":5238052,"meanings":[{"definitions":[{"definition":"RNA that encodes and carries information from DNA during transcription to sites of protein synthesis to undergo translation in order to yield a protein."}],"partOfSpeech":"n"}]},{"word":"BUDGETS","idx":9753,"count":5237019,"meanings":[{"definitions":[{"definition":"The amount of money or resources earmarked for a particular institution, activity or time-frame."},{"definition":"An itemized summary of intended expenditure; usually coupled with expected revenue."},{"definition":"A wallet, purse or bag."},{"definition":"A compact collection of things."},{"definition":"A socket in which the end of a cavalry carbine rests."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To construct or draw up a budget.","example":"Budgeting is even harder in times of recession"},{"definition":"To provide funds, allow for in a budget.","example":"The PM’s pet projects are budgeted rather generously"},{"definition":"To plan for the use of in a budget.","example":"The prestigious building project is budgeted in great detail, from warf facilities to the protocollary opening."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbʌdʒɪts/"}]},{"word":"TOOLKIT","idx":9754,"count":5233016,"meanings":[{"definitions":[{"definition":"An assembly of tools."},{"definition":"A set of basic components for developing software."}],"partOfSpeech":"n"}]},{"word":"PROMISING","idx":9755,"count":5232846,"meanings":[{"definitions":[{"definition":"To commit to (some action or outcome), or to assure (a person) of such commitment; to make an oath or vow.","example":"He promised to never return to this town again."},{"definition":"To give grounds for expectation, especially of something good.","example":"The clouds promise rain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of making a promise."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Showing promise, and likely to develop in a desirable fashion.","example":"a promising young apprentice"},{"definition":"Encouraging and inspiring confidence."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpɹɑmɪsɪŋ/"},{"text":"/ˈpɹɒmɪsɪŋ/"}]},{"word":"RELAXATION","idx":9756,"count":5231884,"meanings":[{"definitions":[{"definition":"The act of relaxing or the state of being relaxed; the opposite of stress or tension; the aim of recreation and leisure activities."},{"definition":"A diminution of tone, tension, or firmness; specifically in pathology: a looseness; a diminution of the natural and healthy tone of parts.","example":"relaxation of the soft palate"},{"definition":"Remission or abatement of rigor."},{"definition":"Remission of attention or application.","example":"relaxation of efforts"},{"definition":"Unbending; recreation; a state or occupation intended to give mental or bodily relief after effort."},{"definition":"The transition of an atom or molecule from a higher energy level to a lower one."},{"definition":"The release following musical tension."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɹilækˈseɪʃən/"}]},{"word":"GOAT","idx":9757,"count":5231735,"meanings":[{"definitions":[{"definition":"A mammal, Capra aegagrus hircus, and similar species of the genus Capra."},{"definition":"A lecherous man."},{"definition":"A scapegoat."},{"definition":"A Pontiac GTO car."},{"definition":"(speech recognition) A person who is not easily understood by a speech recognition system; contrasted with sheep."},{"definition":"A fool, loser, or object of ridicule."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To allow goats to feed on."},{"definition":"To scapegoat."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"goat-us","text":"/ɡoʊt/"}]},{"word":"RENDER","idx":9758,"count":5231571,"meanings":[{"definitions":[{"definition":"Stucco or plaster applied to walls (mostly to outside masonry walls)."},{"definition":"A digital image produced by rendering a model.","example":"A low-resolution render might look blocky."},{"definition":"A surrender."},{"definition":"A return; a payment of rent."},{"definition":"An account given; a statement."},{"definition":"One who rends."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(ditransitive) To cause to become.","example":"The shot rendered her immobile."},{"definition":"To interpret, give an interpretation or rendition of.","example":"The pianist rendered the Beethoven sonata beautifully."},{"definition":"To translate into another language.","example":"to render Latin into English"},{"definition":"To pass down.","example":"render a verdict (i.e., deliver a judgment)"},{"definition":"To make over as a return.","example":"They had to render the estate."},{"definition":"To give; to give back; to deliver.","example":"render aid; render money"},{"definition":"To give up; to yield; to surrender."},{"definition":"To transform (a model) into a display on the screen or other media.","example":"rendering images"},{"definition":"To capture and turn over to another country secretly and extrajudicially."},{"definition":"To convert waste animal tissue into a usable byproduct.","example":"rendering of fat into soap"},{"definition":"To have fat drip off meat from cooking.","example":"Bacon is very fatty when raw; however, most of the fat will render during cooking."},{"definition":"To cover a wall with a layer of plaster.","example":"to render with stucco"},{"definition":"To pass; to run; said of the passage of a rope through a block, eyelet, etc.","example":"A rope renders well, that is, passes freely."},{"definition":"To yield or give way."},{"definition":"To return; to pay back; to restore."},{"definition":"To inflict, as a retribution; to requite."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"render-us","text":"/ˈɹɛn.dɚ/"}]},{"word":"CARMEN","idx":9759,"count":5230762,"meanings":[{"definitions":[{"definition":"A person who transported goods, usually with a horse and cart."}],"partOfSpeech":"n"}]},{"word":"SEN","idx":9761,"count":5230325,"meanings":[{"definitions":[{"definition":"A unit of Japanese currency, worth one hundredth of a yen."},{"definition":"A coin of this value."},{"definition":"Self","example":"\"Hear all, see all, say nowt. Ate all, sup all, pay nowt. An if ever tha does anythin for nowt, mek sure tha does it for tha sen.\""},{"definition":"A unit of length equal 20 wa, 40 meters"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sen-1-uk","text":"/sɛn/"}]},{"word":"THEREAFTER","idx":9762,"count":5229938,"meanings":[{"definitions":[{"definition":"After that, from then on; thenceforth.","example":"He left; thereafter we never met again."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˌðɛəɹˈæf.tɚ/"},{"text":"/ˌðeəɹˈæf.tə(ɹ)/"}]},{"word":"HARDWOOD","idx":9763,"count":5228441,"meanings":[{"definitions":[{"definition":"(mostly in botany and forestry) The wood from any dicotyledonous tree, without regard to its hardness.","example":"Balsa is a hardwood, but a soft hardwood."},{"definition":"(in more general use) As the preceding but limited to those that are commercial timbers, and are at least average in hardness.","example":"Ash, hickory and oak are some of the most prominent domestic hardwoods."},{"definition":"The tree or tree species that yields the preceding.","example":"This hardwood has been planted extensively throughout the hills here."},{"definition":"A joint term for the commercial timbers, without distinguishing which.","example":"You should have used hardwood for this window sill instead of this junk."},{"definition":"The sport of basketball, in particular, an indoor basketball court; so named because the floor of an indoor basketball court is normally made of hardwood."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a floor: made of interlocking hardwood boards."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈhɑɹdˌwʊd/"},{"audio":"hardwood-au"}]},{"word":"EROTICA","idx":9764,"count":5228241,"meanings":[{"definitions":[{"definition":"Erotic literature, art, decoration or other such work.","example":"There's a fine line between erotica and pornography."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪˈɹɒt.ɪkə/"}]},{"word":"TEMPORAL","idx":9765,"count":5228038,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) Anything temporal or secular; a temporality."},{"definition":"Either of the bones on the side of the skull, near the ears."},{"definition":"Any of a reptile's scales on the side of the head between the parietal and supralabial scales, and behind the postocular scales."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(also grammar) Of or relating to time."},{"definition":"Of limited time; transient; passing; not perpetual."},{"definition":"Of or relating to the material world, as opposed to spiritual."},{"definition":"Lasting a short time only."},{"definition":"Civil or political, as distinguished from ecclesiastical.","example":"temporal power; temporal courts"},{"definition":"Of the temples of the head"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"temporal-uk","text":"/ˈtɛm.pəɹ.əl/"}]},{"word":"SAIL","idx":9766,"count":5227908,"meanings":[{"definitions":[{"definition":"A piece of fabric attached to a boat and arranged such that it causes the wind to drive the boat along. The sail may be attached to the boat via a combination of mast, spars and ropes."},{"definition":"(nautical,uncountable) The concept of a sail or sails, as if a substance.","example":"Take in sail: a storm is coming."},{"definition":"The power harnessed by a sail or sails, or the use of this power for travel or transport."},{"definition":"A trip in a boat, especially a sailboat.","example":"Let's go for a sail."},{"definition":"(plural \"sail\") A sailing vessel; a vessel of any kind; a craft.","example":"Twenty sail were in sight."},{"definition":"The blade of a windmill."},{"definition":"A tower-like structure found on the dorsal (topside) surface of submarines."},{"definition":"The floating organ of siphonophores, such as the Portuguese man-of-war."},{"definition":"A sailfish.","example":"We caught three sails today."},{"definition":"An outward projection of the spine, occurring in certain dinosaurs and synapsids"},{"definition":"Anything resembling a sail, such as a wing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be impelled or driven forward by the action of wind upon sails, as a ship on water; to be impelled on a body of water by steam or other power."},{"definition":"To move through or on the water; to swim, as a fish or a waterfowl."},{"definition":"To ride in a boat, especially a sailboat."},{"definition":"To set sail; to begin a voyage.","example":"We sail for Australia tomorrow."},{"definition":"To move briskly and gracefully through the air."},{"definition":"To move briskly.","example":"The duchess sailed haughtily out of the room."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sail-us","text":"/seɪl/"}]},{"word":"FORGE","idx":9767,"count":5226805,"meanings":[{"definitions":[{"definition":"Furnace or hearth where metals are heated prior to hammering them into shape."},{"definition":"Workshop in which metals are shaped by heating and hammering them."},{"definition":"The act of beating or working iron or steel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shape a metal by heating and hammering."},{"definition":"To form or create with concerted effort.","example":"The politician's recent actions are an effort to forge a relationship with undecided voters."},{"definition":"To create a forgery of; to make a counterfeit item of; to copy or imitate unlawfully.","example":"He had to forge his ex-wife's signature.  The jury learned the documents had been forged."},{"definition":"To make falsely; to produce, as that which is untrue or not genuine; to fabricate."},{"definition":"(often as forge ahead) To move forward heavily and slowly (originally as a ship); to advance gradually but steadily; to proceed towards a goal in the face of resistance or difficulty.","example":"The party of explorers forged through the thick underbrush."},{"definition":"(sometimes as forge ahead) To advance, move or act with an abrupt increase in speed or energy.","example":"With seconds left in the race, the runner forged into first place."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"forge-uk","text":"/fɔːd͡ʒ/"}]},{"word":"COMMISSIONERS","idx":9768,"count":5225913,"meanings":[{"definitions":[{"definition":"A member of a commission."},{"definition":"Someone commissioned to perform certain duties."},{"definition":"An official in charge of a government department, especially a police force."},{"definition":"Someone who commissions something."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"commissioners-us","text":"/kəˈmɪʃənɚz/"}]},{"word":"DENSE","idx":9769,"count":5225392,"meanings":[{"definitions":[{"definition":"A thicket."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having relatively high density."},{"definition":"Compact; crowded together."},{"definition":"Thick; difficult to penetrate."},{"definition":"Opaque; allowing little light to pass through."},{"definition":"Obscure, or difficult to understand."},{"definition":"Being a subset of a topological space that approximates the space well. See Wikipedia article on dense sets for mathematical definition."},{"definition":"(of a person) Slow to comprehend; of low intelligence."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dense-us","text":"/dɛns/"}]},{"word":"BRAVE","idx":9771,"count":5221356,"meanings":[{"definitions":[{"definition":"A Native American warrior."},{"definition":"A man daring beyond discretion; a bully."},{"definition":"A challenge; a defiance; bravado."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To encounter with courage and fortitude, to defy, to provoke.","example":"After braving tricks on the high-dive, he braved a jump off the first diving platform."},{"definition":"To adorn; to make fine or showy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Strong in the face of fear; courageous."},{"definition":"Having any sort of superiority or excellence."},{"definition":"Making a fine show or display."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"brave-us","text":"/bɹeɪv/"}]},{"word":"FORWARDING","idx":9772,"count":5220845,"meanings":[{"definitions":[{"definition":"To advance, promote."},{"definition":"To send (a letter, email etc.) to a third party.","example":"I'll be glad to forward your mail to you while you're gone."},{"definition":"To assemble (a book) by sewing sections, attaching cover boards, and so on."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is forwarded."}],"partOfSpeech":"n"}]},{"word":"QT","idx":9773,"count":5218227,"meanings":[{"definitions":[{"definition":"Quality time."},{"definition":"A unit of liquid capacity equal to two pints; one-fourth (quarter) of a gallon. Equivalent to 1.136 liters in the UK and 0.946 liter (liquid quart) or 1.101 liters (dry quart) in the U.S."},{"definition":"Four successive cards of the same suit."},{"definition":"A fourth; a quarter; hence, a region of the earth."},{"definition":"The absence of sound; quietness.","example":"There was a strange quiet in the normally very lively plaza."},{"definition":"The absence of movement; stillness, tranquility"},{"definition":"A cute person or animal."},{"definition":"A clementine: a small, waxy-peeled orange hybrid cultivar that is easy to peel by hand."},{"definition":"(by extension) Any small mandarin orange variety such as a tangerine or a satsuma."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"qt-au"}]},{"word":"AWFUL","idx":9774,"count":5217370,"meanings":[{"definitions":[{"definition":"Very bad.","example":"My socks smell awful."},{"definition":"Exceedingly great; usually applied intensively.","example":"I have learnt an awful amount today."},{"definition":"Causing fear or horror; appalling, terrible."},{"definition":"Inspiring awe; filling with profound reverence or respect; profoundly impressive."},{"definition":"Struck or filled with awe."},{"definition":"Terror-stricken."},{"definition":"Worshipful; reverential; law-abiding."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Awfully; dreadfully; terribly."},{"definition":"Very, extremely.","example":"He was blubbering away something awful."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"awful-us","text":"/ˈɔfəl/"}]},{"word":"NIGHTMARE","idx":9775,"count":5217283,"meanings":[{"definitions":[{"definition":"A demon or monster, thought to plague people while they slept and cause a feeling of suffocation and terror during sleep."},{"definition":"Sleep paralysis."},{"definition":"A very bad or frightening dream.","example":"I had a nightmare that I tried to run but could neither move nor breathe."},{"definition":"Any bad, miserable, difficult or terrifying situation or experience that arouses anxiety, terror, agony or great displeasure.","example":"Cleaning up after identity theft can be a nightmare of phone calls and letters."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nightmare-us","text":"/naɪt.mɛəɹ/"}]},{"word":"AIRPLANE","idx":9776,"count":5216750,"meanings":[{"definitions":[{"definition":"A powered heavier-than-air aircraft with fixed wings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fly in an aeroplane."},{"definition":"To transport by aeroplane."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"airplane-us","text":"/ˈɛəɹˌpleɪ̯n/"}]},{"word":"REDUCTIONS","idx":9777,"count":5216648,"meanings":[{"definitions":[{"definition":"The act, process, or result of reducing."},{"definition":"The amount or rate by which something is reduced, e.g. in price.","example":"A 5% reduction in robberies"},{"definition":"A reaction in which electrons are gained and valence is reduced; often by the removal of oxygen or the addition of hydrogen."},{"definition":"The process of rapidly boiling a sauce to concentrate it."},{"definition":"The rewriting of an expression into a simpler form."},{"definition":"(computability theory) a transformation of one problem into another problem, such as mapping reduction or polynomial reduction."},{"definition":"An arrangement for a far smaller number of parties, e.g. a keyboard solo based on a full opera."},{"definition":"(phenomenology) A philosophical procedure intended to reveal the objects of consciousness as pure phenomena. (See phenomenological reduction.)"},{"definition":"A medical procedure to restore a fracture or dislocation to the correct alignment."}],"partOfSpeech":"n"}]},{"word":"IMPOSE","idx":9780,"count":5214173,"meanings":[{"definitions":[{"definition":"To establish or apply by authority.","example":"Congress imposed new tariffs."},{"definition":"To be an inconvenience (on or upon)","example":"I don't wish to impose upon you."},{"definition":"To enforce: compel to behave in a certain way","example":"Social relations impose courtesy"},{"definition":"To practice a trick or deception (on or upon)."},{"definition":"To lay on, as the hands, in the religious rites of confirmation and ordination."},{"definition":"To arrange in proper order on a table of stone or metal and lock up in a chase for printing; said of columns or pages of type, forms, etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"impose-us","text":"/ɪmˈpoʊz/"}]},{"word":"ORGANISMS","idx":9781,"count":5212542,"meanings":[{"definitions":[{"definition":"A discrete and complete living thing, such as animal, plant, fungus or microorganism."},{"definition":"(by extension) Any complex thing with properties normally associated with living things."}],"partOfSpeech":"n"}]},{"word":"SEGA","idx":9782,"count":5212241,"meanings":[{"definitions":[{"definition":"A genre of popular music mainly associated with Mauritius."}],"partOfSpeech":"n"}]},{"word":"TELESCOPE","idx":9783,"count":5211922,"meanings":[{"definitions":[{"definition":"A monocular optical instrument that magnifies distant objects, especially in astronomy."},{"definition":"Any instrument used in astronomy for observing distant objects (such as a radio telescope)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extend or contract in the manner of a telescope."},{"definition":"To slide or pass one within another, after the manner of the sections of a small telescope or spyglass."},{"definition":"To come into collision, as railway cars, in such a manner that one runs into another."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"telescope-us","text":"/ˈtɛləˌskoʊp/"}]},{"word":"VIEWERS","idx":9784,"count":5210800,"meanings":[{"definitions":[{"definition":"Someone who views a spectacle; an onlooker or spectator."},{"definition":"Someone who watches television."},{"definition":"Any optical device used to view photographic slides."},{"definition":"A program that displays the contents of a file."},{"definition":"The manager of a colliery, who directs its workings and ventilation."}],"partOfSpeech":"n"}]},{"word":"ASBESTOS","idx":9785,"count":5208835,"meanings":[{"definitions":[{"definition":"Any of several fibrous mineral forms of magnesium silicate, used for fireproofing, electrical insulation, building materials, brake linings, chemical filters, suits, fireman's gloves, etc.","example":"All types of asbestos are potentially carcinogenic when inhaled."},{"definition":"Any of asbestos-like forms of several minerals, asbestiforms"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æs.ˈbɛs.tɒs/"}]},{"word":"CDNA","idx":9787,"count":5208484,"meanings":[{"definitions":[{"definition":"Initialism of complementary DNA."},{"definition":"Initialism of copy DNA."}],"partOfSpeech":"n"}]},{"word":"ENTERS","idx":9789,"count":5207370,"meanings":[{"definitions":[{"definition":"The \"Enter\" key on a computer keyboard."},{"definition":"A stroke of the Enter key."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go or come into an enclosed or partially enclosed space.","example":"You should knock before you enter, unless you want to see me naked."},{"definition":"To cause to go (into), or to be received (into); to put in; to insert; to cause to be admitted.","example":"to enter a knife into a piece of wood;  to enter a boy at college, a horse for a race, etc."},{"definition":"To go or come into (a state or profession).","example":"My twelve-year-old son will be entering his teens next year.  She had planned to enter the legal profession."},{"definition":"To type (something) into a computer; to input.","example":"Enter your user name and password."},{"definition":"To record (something) in an account, ledger, etc."},{"definition":"To become a party to an agreement, treaty, etc."},{"definition":"To become effective; to come into effect."},{"definition":"To go into or upon, as lands, and take actual possession of them."},{"definition":"To place in regular form before the court, usually in writing; to put upon record in proper from and order.","example":"to enter a writ, appearance, rule, or judgment"},{"definition":"To make report of (a vessel or its cargo) at the custom house; to submit a statement of (imported goods), with the original invoices, to the proper customs officer for estimating the duties. See entry."},{"definition":"To file, or register with the land office, the required particulars concerning (a quantity of public land) in order to entitle a person to a right of preemption."},{"definition":"To deposit for copyright the title or description of (a book, picture, map, etc.).","example":"entered according to act of Congress"},{"definition":"To initiate; to introduce favourably."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɛntɚz/"},{"text":"/ˈɛntəz/"}]},{"word":"POD","idx":9790,"count":5206411,"meanings":[{"definitions":[{"definition":"A seed case for legumes (e.g. peas, beans, peppers); a seedpod."},{"definition":"A small vehicle, especially used in emergency situations."},{"definition":"A bag; a pouch."},{"definition":"(collective) A group of whales, dolphins, seals, porpoises or hippopotami."},{"definition":"A small section of a larger office, compartmentalised for a specific purpose."},{"definition":"A subsection of a prison, containing a number of inmates."},{"definition":"A nicotine cartridge."},{"definition":"A lie-flat business or first class seat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bear or produce pods"},{"definition":"To remove peas from their case."},{"definition":"To put into a pod or to enter a pod."},{"definition":"To swell or fill."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pod-uk","text":"/ˈpɒd/"}]},{"word":"SAVAGE","idx":9791,"count":5205858,"meanings":[{"definitions":[{"definition":"An uncivilized or feral human; a barbarian."},{"definition":"A defiant person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attack or assault someone or something ferociously or without restraint.","example":"No matter how anyone might savage me, I should stay strong."},{"definition":"To criticise vehemently.","example":"His latest film was savaged by most reviewers."},{"definition":"(of an animal) To attack with the teeth."},{"definition":"To make savage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Wild; not cultivated.","example":"a savage wilderness"},{"definition":"Barbaric; not civilized.","example":"savage manners"},{"definition":"Fierce and ferocious.","example":"a savage spirit"},{"definition":"Brutal, vicious or merciless.","example":"He gave the dog a savage kick."},{"definition":"Unpleasant or unfair."},{"definition":"Great, brilliant, amazing.","example":"Although it didn't look very good, it tasted absolutely savage."},{"definition":"Nude; naked."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"savage-us","text":"/ˈsævɪdʒ/"}]},{"word":"ADVANCEMENT","idx":9792,"count":5205341,"meanings":[{"definitions":[{"definition":"The act of advancing, ; promotion to a higher place or dignity","example":"the advancement of learning"},{"definition":"The state of being advanced"},{"definition":"An advance of money or value; payment in advance."},{"definition":"Property given, usually by a parent to a child, in advance of a future distribution."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ædˈvæns.mɛnt/"}]},{"word":"WU","idx":9793,"count":5204842,"meanings":[{"definitions":[{"definition":"A Chinese shaman."}],"partOfSpeech":"n"}]},{"word":"HARASSMENT","idx":9794,"count":5204597,"meanings":[{"definitions":[{"definition":"Persistent attacks and criticism causing worry and distress."},{"definition":"Deliberate pestering or annoying."},{"definition":"Excessive intimidation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/həˈɹæsmənt/"}]},{"word":"WILLOW","idx":9795,"count":5203465,"meanings":[{"definitions":[{"definition":"Any of various deciduous trees or shrubs in the genus Salix, in the willow family Salicaceae, found primarily on moist soils in cooler zones in the northern hemisphere."},{"definition":"The wood of these trees."},{"definition":"A cricket bat."},{"definition":"(1800s) The baseball bat."},{"definition":"A rotating spiked drum used to open and clean cotton heads."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To open and cleanse (cotton, flax, wool, etc.) by means of a willow."},{"definition":"To form a shape or move in a way similar to the long, slender branches of a willow."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"willow-us","text":"/ˈwɪloʊ/"}]},{"word":"RESUMES","idx":9796,"count":5202233,"meanings":[{"definitions":[{"definition":"To take back possession of (something)."},{"definition":"To summarise."},{"definition":"To start (something) again that has been stopped or paused from the point at which it was stopped or paused; continue, carry on.","example":"We will resume this discussion tomorrow at nine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A summary or synopsis."},{"definition":"A summary or account of education and employment experiences and qualifications, a curriculum vitae (often for presentation to a potential future employer when applying for a job)."}],"partOfSpeech":"n"}]},{"word":"BOLT","idx":9797,"count":5202005,"meanings":[{"definitions":[{"definition":"A (usually) metal fastener consisting of a cylindrical body that is threaded, with a larger head on one end. It can be inserted into an unthreaded hole up to the head, with a nut then threaded on the other end; a heavy machine screw."},{"definition":"A sliding pin or bar in a lock or latch mechanism."},{"definition":"A bar of wood or metal dropped in horizontal hooks on a door and adjoining wall or between the two sides of a double door, to prevent the door(s) from being forced open."},{"definition":"A sliding mechanism to chamber and unchamber a cartridge in a firearm."},{"definition":"A small personal-armour-piercing missile for short-range use, or (in common usage though deprecated by experts) a short arrow, intended to be shot from a crossbow or a catapult."},{"definition":"A lightning spark, i.e., a lightning bolt."},{"definition":"A sudden event, action or emotion.","example":"The problem's solution struck him like a bolt from the blue."},{"definition":"A large roll of fabric or similar material, as a bolt of cloth.","example":"24 March 1774 - Newspaper: Stamford Mercury - \"Mr. Cole, Basket-maker...has lost near 300 boults of rods\" https//www.britishnewspaperarchive.co.uk/viewer/bl/0000254/17740324/001/0001"},{"definition":"A sudden spring or start; a sudden leap aside.","example":"The horse made a bolt."},{"definition":"A sudden flight, as to escape creditors."},{"definition":"A refusal to support a nomination made by the party with which one has been connected; a breaking away from one's party."},{"definition":"An iron to fasten the legs of a prisoner; a shackle; a fetter."},{"definition":"A burst of speed or efficiency."},{"definition":"A sieve, especially a long fine sieve used in milling for bolting flour and meal; a bolter."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To connect or assemble pieces using a bolt.","example":"Bolt the vice to the bench."},{"definition":"To secure a door by locking or barring it.","example":"Bolt the door."},{"definition":"To flee, to depart, to accelerate suddenly.","example":"Seeing the snake, the horse bolted."},{"definition":"To cause to start or spring forth; to dislodge (an animal being hunted).","example":"to bolt a rabbit"},{"definition":"To strike or fall suddenly like a bolt."},{"definition":"To escape."},{"definition":"Of a plant, to grow quickly; to go to seed.","example":"Lettuce and spinach will bolt as the weather warms up."},{"definition":"To swallow food without chewing it."},{"definition":"To drink one's drink very quickly; to down a drink.","example":"Come on, everyone, bolt your drinks; I want to go to the next pub!"},{"definition":"To refuse to support a nomination made by a party or caucus with which one has been connected; to break away from a party."},{"definition":"To utter precipitately; to blurt or throw out."},{"definition":"To sift, especially through a cloth."},{"definition":"To sift the bran and germ from wheat flour.","example":"Graham flour is unbolted flour."},{"definition":"To separate, assort, refine, or purify by other means."},{"definition":"To discuss or argue privately, and for practice, as cases at law."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Suddenly; straight; unbendingly.","example":"The soldiers stood bolt upright for inspection."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"bolt-us","text":"/boʊlt/"}]},{"word":"GAGE","idx":9798,"count":5201723,"meanings":[{"definitions":[{"definition":"Something, such as a glove or other pledge, thrown down as a challenge to combat (now usually figurative)."},{"definition":"Something valuable deposited as a guarantee or pledge; security, ransom."},{"definition":"A measure; a standard of measure; an instrument to determine dimensions, distance, or capacity; a standard"},{"definition":"An act of measuring."},{"definition":"An estimate."},{"definition":"Any instrument for ascertaining or regulating the level, state, dimensions or forms of things"},{"definition":"A thickness of sheet metal or wire designated by any of several numbering schemes."},{"definition":"The distance between the rails of a railway."},{"definition":"A semi-norm; a function that assigns a non-negative size to all vectors in a vector space."},{"definition":"The number of stitches per inch, centimetre, or other unit of distance."},{"definition":"Relative positions of two or more vessels with reference to the wind.","example":"A vessel has the weather gauge of another when on the windward side of it, and the lee gauge when on the lee side of it."},{"definition":"The depth to which a vessel sinks in the water."},{"definition":"(plastering) The quantity of plaster of Paris used with common plaster to make it set more quickly."},{"definition":"That part of a shingle, slate, or tile, which is exposed to the weather, when laid; also, one course of such shingles, slates, or tiles."},{"definition":"A unit of measurement which describes how many spheres of bore diameter of a shotgun can be had from one pound of lead; 12 gauge is roughly equivalent to .75 caliber."},{"definition":"(by extension) A shotgun (synecdoche for 12 gauge shotgun, the most common chambering for combat and hunting shotguns)."},{"definition":"A tunnel-like ear piercing consisting of a hollow ring embedded in the lobe."},{"definition":"A subspecies of plum, Prunus domestica subsp. italica."},{"definition":"A quart pot."},{"definition":"A pint pot."},{"definition":"(metonymically) A drink."},{"definition":"A tobacco pipe."},{"definition":"A chamberpot."},{"definition":"A small quantity of anything."},{"definition":"Marijuana"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give or deposit as a pledge or security; to pawn."},{"definition":"To wager, to bet."},{"definition":"To bind by pledge, or security; to engage."},{"definition":"To measure or determine with a gauge; to measure the capacity of."},{"definition":"To estimate."},{"definition":"To appraise the character or ability of; to judge of."},{"definition":"To draw into equidistant gathers by running a thread through it."},{"definition":"To mix (a quantity of ordinary plaster) with a quantity of plaster of Paris."},{"definition":"To chip, hew or polish (stones, bricks, etc) to a standard size and/or shape."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gage-uk","text":"/ɡeɪd͡ʒ/"}]},{"word":"THROWING","idx":9799,"count":5200541,"meanings":[{"definitions":[{"definition":"To change place."},{"definition":"To change in state or status"},{"definition":"To move through time."},{"definition":"To be accepted."},{"definition":"In any game, to decline to play in one's turn."},{"definition":"To do or be better."},{"definition":"To take heed."},{"definition":"To hurl; to cause an object to move rapidly through the air.","example":"throw a shoe; throw a javelin; the horse threw its rider"},{"definition":"To eject or cause to fall off."},{"definition":"To move to another position or condition; to displace.","example":"throw the switch"},{"definition":"To make (a pot) by shaping clay as it turns on a wheel."},{"definition":"(of a bowler) to deliver (the ball) illegally by straightening the bowling arm during delivery."},{"definition":"To send (an error) to an exception-handling mechanism in order to interrupt normal processing.","example":"If the file is read-only, the method throws an invalid-operation exception."},{"definition":"To intentionally lose a game.","example":"The tennis player was accused of taking bribes to throw the match."},{"definition":"To confuse or mislead.","example":"The deliberate red herring threw me at first."},{"definition":"To send desperately.","example":"Their sergeant threw the troops into pitched battle."},{"definition":"To imprison.","example":"The magistrate ordered the suspect to be thrown into jail."},{"definition":"To organize an event, especially a party."},{"definition":"To roll (a die or dice)."},{"definition":"To cause a certain number on the die or dice to be shown after rolling it."},{"definition":"To discard."},{"definition":"To lift the opponent off the ground and bring him back down, especially into a position behind the thrower."},{"definition":"(said of one's voice) To change in order to give the illusion that the voice is that of someone else."},{"definition":"To show sudden emotion, especially anger."},{"definition":"To project or send forth."},{"definition":"To put on hastily; to spread carelessly."},{"definition":"To twist two or more filaments of (silk, etc.) so as to form one thread; to twist together, as singles, in a direction contrary to the twist of the singles themselves; sometimes applied to the whole class of operations by which silk is prepared for the weaver."},{"definition":"(of a team, a manager, etc.) To select (a pitcher); to assign a pitcher to a given role (such as starter or reliever)."},{"definition":"To install (a bridge)."},{"definition":"To twist or turn.","example":"a thrown nail"},{"definition":"(said of animals) To give birth to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is thrown."},{"definition":"The process of making ceramic ware on the potter's wheel"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"throwing-us","text":"/ˈθɹoʊ.ɪŋ/"}]},{"word":"EXISTED","idx":9800,"count":5200469,"meanings":[{"definitions":[{"definition":"(stative) to be; have existence; have being or reality"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"existed-us","text":"/ɪɡˈzɪstɪd/"}]},{"word":"WHORE","idx":9801,"count":5199489,"meanings":[{"definitions":[{"definition":"Any person (especially a woman) who has sexual intercourse or engages in other sexual activity for payment, especially as a means of livelihood."},{"definition":"A person who does, or offers to do, a demeaning or dishonourable activity for money or personal gain; someone who acts in a dishonourable way for personal advantage."},{"definition":"A person who is sexually promiscuous; a slut."},{"definition":"A person who is unscrupulous, especially one who compromises their principles for gain."},{"definition":"A person who will violate behavioral standards to achieve something desired."},{"definition":"A contemptible person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prostitute oneself."},{"definition":"To engage the services of a prostitute."},{"definition":"To pimp; to pander."},{"definition":"To promote shamelessly.","example":"Did you see him on that chat show, whoring his new book?"},{"definition":"To pursue false gods."},{"definition":"To pursue false goals."},{"definition":"To overuse something.","example":"BTW, that guy whuz still an asshole - camping the BFG and whoring the quad - I usually leave BFG maps but stuck around on that one and suicided quite a bit (3 times I got to about -10 frags, then came back to 0...)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hɔɹ/"},{"text":"/hɔː/"}]},{"word":"GENERATORS","idx":9802,"count":5198637,"meanings":[{"definitions":[{"definition":"One who, or that which, generates, begets, causes, or produces."},{"definition":"A piece of apparatus, equipment, etc, to convert or change energy from one form to another."}],"partOfSpeech":"n"}]},{"word":"WAGON","idx":9804,"count":5198530,"meanings":[{"definitions":[{"definition":"A four-wheeled cart for hauling loads."},{"definition":"A four-wheeled child's riding toy, pulled or steered by a long handle attached to the front."},{"definition":"An enclosed vehicle for carrying goods or people; (by extension) a lorry, a truck."},{"definition":"An enclosed vehicle used as a movable dwelling; a caravan."},{"definition":"Short for dinner wagon."},{"definition":"Short for paddy wagon."},{"definition":"A freight car on a railway."},{"definition":"Short for station wagon; (by extension) a sport utility vehicle (SUV); any car."},{"definition":"A woman of loose morals, a promiscuous woman, a slapper; (by extension) a woman regarded as obnoxious; a bitch, a cow."},{"definition":"A kind of prefix used in de Bruijn notation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To load into a wagon in preparation for transportation; to transport by means of a wagon."},{"definition":"To travel in a wagon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wagon-us","text":"/ˈwæɡən/"}]},{"word":"BARBIE","idx":9805,"count":5198277,"meanings":[{"definitions":[{"definition":"A barbecue (apparatus for grilling)."},{"definition":"A barbecue (event: cookout)."},{"definition":"A barbiturate."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"barbie-au","text":"/bɑː(ɹ)bi/"}]},{"word":"DAT","idx":9806,"count":5197825,"meanings":[{"definitions":[{"definition":"(degree) To a given extent or degree.","example":"\"The ribbon was that thin.\" \"I disagree, I say it was not that thin, it was thicker... or maybe thinner...\""},{"definition":"(degree) To a great extent or degree; very, particularly (in negative constructions).","example":"I did the run last year, and it wasn't that difficult."},{"definition":"To such an extent; so. (in positive constructions).","example":"Ooh, I was that happy I nearly kissed her."}],"partOfSpeech":"v"},{"definitions":[{"definition":"(demonstrative) The thing, person, idea, quality, event, action or time indicated or understood from context, especially if more remote geographically, temporally or mentally than one designated as \"this\", or if expressing distinction.","example":"He went home, and after that I never saw him again."},{"definition":"The known (thing); used to refer to something just said.","example":"They're getting divorced. What do you think about that?"},{"definition":"(demonstrative) The aforementioned quality or proposition; used to emphatically affirm or deny a previous statement or question.","example":"The water is so cold! — That it is."},{"definition":"(relative) (plural that) Which, who; representing a subject, direct object, indirect object, or object of a preposition.","example":"The CPR course that she took really came in handy."},{"definition":"Used in place of relative adverbs such as where or when; often omitted.","example":"the last time that [= when] I went to Europe"}],"partOfSpeech":"p"},{"definitions":[{"definition":"Introducing a clause which is the subject or object of a verb (such as one involving reported speech), or which is a complement to a previous statement.","example":"He told me that the book is a good read."},{"definition":"Introducing a subordinate clause expressing a reason or cause: because, in that.","example":"Be glad that you have enough to eat."},{"definition":"Introducing a subordinate clause that expresses an aim, purpose or goal (\"final\"), and usually contains the auxiliaries may, might or should: so, so that."},{"definition":"Introducing — especially, but not exclusively, with an antecedent like so or such — a subordinate clause expressing a result, consequence or effect.","example":"The noise was so loud that she woke up."},{"definition":"Introducing a premise or supposition for consideration: seeing as; inasmuch as; given that; as would appear from the fact that."},{"definition":"Introducing a subordinate clause modifying an adverb.","example":"How often did she visit him? — Twice that I saw."},{"definition":"Introducing an exclamation expressing a desire or wish.","example":"Oh that spring would come!"},{"definition":"Introducing an exclamation expressing a strong emotion such as sadness or surprise."}],"partOfSpeech":"c"}],"phonetics":[{"text":"/dæt/"}]},{"word":"FAVOUR","idx":9807,"count":5196953,"meanings":[{"definitions":[{"definition":"A kind or helpful deed; an instance of voluntarily assisting (someone).","example":"He did me a favor when he took the time to drive me home."},{"definition":"Goodwill; benevolent regard.","example":"She enjoyed the queen's favor."},{"definition":"A small gift; a party favor.","example":"A marriage favour is a bunch or knot of white ribbons or white flowers worn at a wedding."},{"definition":"Mildness or mitigation of punishment; lenity."},{"definition":"The object of regard; person or thing favoured."},{"definition":"Appearance; look; countenance; face."},{"definition":"Partiality; bias."},{"definition":"A letter, a written communication."},{"definition":"Anything worn publicly as a pledge of a woman's favor."},{"definition":"(in the plural) Lovelocks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look upon fondly; to prefer."},{"definition":"To encourage, conduce to"},{"definition":"To do a favor [noun sense 1] for; to show beneficence toward.","example":"Would you favor us with a poetry reading?"},{"definition":"To treat with care.","example":"Favoring your sore leg will only injure the other one."},{"definition":"(including) To resemble, to look like (another person)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"favour-us","text":"/ˈfeɪ.vɚ/"}]},{"word":"KNOCK","idx":9809,"count":5196013,"meanings":[{"definitions":[{"definition":"Sudden fatigue as a result of glycogen depletion from not having taken in enough nutrition."},{"definition":"An abrupt rapping sound, as from an impact of a hard object against wood.","example":"I heard a knock on my door."},{"definition":"A sharp impact.","example":"He took a knock on the head."},{"definition":"Criticism."},{"definition":"Preignition, a type of abnormal combustion occurring in spark ignition engines caused by self-ignition; also, the characteristic knocking sound associated with it."},{"definition":"A batsman's innings.","example":"He played a slow but sure knock of 35."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike for admittance; to rap upon, as a door."},{"definition":"To criticize verbally; to denigrate; to undervalue.","example":"Don’t knock it until you’ve tried it."},{"definition":"To kick a ball towards another player; to pass."},{"definition":"To impress forcibly or strongly; to astonish; to move to admiration or applause."},{"definition":"To bump or impact.","example":"I accidentally knocked my drink off the bar."},{"definition":"To rap one's knuckles against something, especially wood.","example":"Knock on the door and find out if they’re home."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"knock-us","text":"/nɑk/"}]},{"word":"URGE","idx":9810,"count":5195810,"meanings":[{"definitions":[{"definition":"A strong desire; an itch to do something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press; to push; to drive; to impel; to force onward."},{"definition":"To press the mind or will of; to ply with motives, arguments, persuasion, or importunity."},{"definition":"To provoke; to exasperate."},{"definition":"To press hard upon; to follow closely."},{"definition":"To present in an urgent manner; to insist upon.","example":"to urge an argument; to urge the necessity of a case"},{"definition":"To treat with forcible means; to take severe or violent measures with.","example":"to urge an ore with intense heat"},{"definition":"To press onward or forward."},{"definition":"To be pressing in argument; to insist; to persist."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"urge-us","text":"/ɝd͡ʒ/"},{"audio":"urge-uk","text":"/ɜːd͡ʒ/"}]},{"word":"GENERATES","idx":9812,"count":5193442,"meanings":[{"definitions":[{"definition":"To bring into being; give rise to.","example":"The discussion generated an uproar."},{"definition":"To produce as a result of a chemical or physical process.","example":"Adding concentrated sulphuric acid to water generates heat."},{"definition":"To procreate, beget.","example":"They generated many offspring."},{"definition":"To form a figure from a curve or solid.","example":"Rotating a circle generates a sphere."},{"definition":"To appear or occur; be generated."}],"partOfSpeech":"ve"}]},{"word":"POTATOES","idx":9813,"count":5192334,"meanings":[{"definitions":[{"definition":"The tuber of a plant, Solanum tuberosum, eaten as a starchy vegetable, particularly in the Americas and Europe; this plant."},{"definition":"A conspicuous hole in a sock or stocking"},{"definition":"A camera that takes poor-quality pictures."},{"definition":"A mentally handicapped person."},{"definition":"An underpowered computer or other device, especially when small in size."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pəˈteɪtoʊz/"},{"text":"/pəˈteɪtəʊz/"}]},{"word":"THOROUGH","idx":9814,"count":5191306,"meanings":[{"definitions":[{"definition":"A furrow between two ridges, to drain off the surface water."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Painstaking and careful not to miss or omit any detail.","example":"He is the most thorough worker I have ever seen."},{"definition":"Utter; complete; absolute."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Through."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"thorough-us","text":"/ˈθɜɹoʊ/"},{"audio":"thorough-uk","text":"/ˈθʌɹə/"}]},{"word":"REPLICATION","idx":9815,"count":5191008,"meanings":[{"definitions":[{"definition":"The process by which an object, person, place or idea may be copied mimicked or reproduced."},{"definition":"Copy; reproduction.","example":"That painting is an almost exact replication of a famous Rembrandt painting."},{"definition":"A response from the plaintiff to the defendant's plea."},{"definition":"The process of producing replicas of DNA or RNA molecules."},{"definition":"The process of frequent electronic data copying a one database in one computer or server to a database in another so that all users share the same level of information. Used to improve fault tolerance of the system."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɛplɪˈkeɪʃən/"}]},{"word":"INEXPENSIVE","idx":9816,"count":5190532,"meanings":[{"definitions":[{"definition":"Low in price"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"inexpensive-us"}]},{"word":"RECEPTORS","idx":9818,"count":5189813,"meanings":[{"definitions":[{"definition":"A protein on a cell wall that binds with specific molecules so that they can be absorbed into the cell in order to control certain functions."},{"definition":"Any specialized cell or structure that responds to sensory stimuli."}],"partOfSpeech":"n"}]},{"word":"PEERS","idx":9819,"count":5188853,"meanings":[{"definitions":[{"definition":"A look; a glance."},{"definition":"Somebody who is, or something that is, at a level or of a value equal (to that of something else)."},{"definition":"Someone who is approximately the same age (as someone else)."},{"definition":"A noble with a hereditary title, i.e., a peerage, and in times past, with certain rights and privileges not enjoyed by commoners.","example":"a peer of the realm"},{"definition":"A comrade; a companion; an associate."},{"definition":"Someone who pees, someone who urinates."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look with difficulty, or as if searching for something."},{"definition":"To come in sight; to appear."},{"definition":"To make equal in rank."},{"definition":"To carry communications traffic terminating on one's own network on an equivalency basis to and from another network, usually without charge or payment. Contrast with transit where one pays another network provider to carry one's traffic."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɪɹz/"},{"text":"/pɪəz/"}]},{"word":"OPTIMUM","idx":9821,"count":5188219,"meanings":[{"definitions":[{"definition":"The best or most favorable condition, or the greatest amount or degree possible under specific sets of comparable circumstances."}],"partOfSpeech":"n"},{"definitions":[{"definition":"The best or most advantageous; surpassing all others."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɑptɪməm/"},{"text":"/ˈɒptɪməm/"}]},{"word":"NEON","idx":9822,"count":5187838,"meanings":[{"definitions":[{"definition":"The chemical element (symbol Ne) with an atomic number of 10. The lightest of the noble gases, it is a colourless, odorless inert gas."},{"definition":"A form or sample of the element."},{"definition":"Neon signs or lights, collectively."},{"definition":"A neon tetra fish."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a color) That resembles a neon light; extremely bright; fluorescent"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"neon-us","text":"/ˈni.ɒn/"}]},{"word":"INTERVENTIONS","idx":9823,"count":5187635,"meanings":[{"definitions":[{"definition":"The action of intervening; interfering in some course of events."},{"definition":"A legal motion through which a person or entity who has not been named as a party to a case seeks to have the court order that they be made a party."},{"definition":"An orchestrated attempt to convince somebody with an addiction or other psychological problem to seek professional help and/or change their behavior."},{"definition":"An action taken or procedure performed; an operation."}],"partOfSpeech":"n"}]},{"word":"QUILT","idx":9824,"count":5187075,"meanings":[{"definitions":[{"definition":"A bed covering consisting of two layers of fabric stitched together, with insulation between, often having a decorative design.","example":"My grandmother is going to sew a quilt."},{"definition":"A roll of material with sound-absorbing properties, used in soundproofing."},{"definition":"A quilted skirt worn by women."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To construct a quilt."},{"definition":"To construct something, such as clothing, using the same technique."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"quilt-us","text":"/kwɪlt/"}]},{"word":"CREATURE","idx":9826,"count":5182781,"meanings":[{"definitions":[{"definition":"A living being; an animal or (sometimes derogatory) a human.","example":"He's a creature of habit.   insects and other creatures"},{"definition":"A created thing, whether animate or inanimate; a creation."},{"definition":"A being subservient to or dependent upon another."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"creature-us","text":"/ˈkɹiːt͡ʃəɹ/"}]},{"word":"OURS","idx":9827,"count":5182681,"meanings":[{"definitions":[{"definition":"That which belongs to us; the possessive case of we, used without a following noun."}],"partOfSpeech":"p"}],"phonetics":[{"audio":"ours-us","text":"/ɑɹz/"}]},{"word":"MOUNTS","idx":9828,"count":5182090,"meanings":[{"definitions":[{"definition":"A hill or mountain."},{"definition":"Any of seven fleshy prominences in the palm of the hand, taken to represent the influences of various heavenly bodies.","example":"the mount of Jupiter"},{"definition":"A bulwark for offence or defence; a mound."},{"definition":"A bank; a fund."},{"definition":"A green hillock in the base of a shield."},{"definition":"An animal, usually a horse, used to ride on, unlike a draught horse","example":"The rider climbed onto his mount."},{"definition":"A mounting; an object on which another object is mounted.","example":"The post is the mount on which the mailbox is installed."},{"definition":"A rider in a cavalry unit or division.","example":"The General said he has 2,000 mounts."},{"definition":"A step or block to assist in mounting a horse."},{"definition":"A signal for mounting a horse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To get upon; to ascend; to climb.","example":"to mount stairs"},{"definition":"To place oneself on (a horse, a bicycle, etc.); to bestride.","example":"The rider mounted his horse."},{"definition":"To cause to mount; to put on horseback; to furnish with animals for riding."},{"definition":"To cause (something) to rise or ascend; to drive up; to raise; to elevate; to lift up."},{"definition":"To rise on high; to go up; to be upraised or uplifted; to tower aloft; to ascend; often with up."},{"definition":"To attach (an object) to a support, backing, framework etc.","example":"to mount a mailbox on a post"},{"definition":"To attach (a drive or device) to the file system in order to make it available to the operating system."},{"definition":"(sometimes with up) To increase in quantity or intensity.","example":"The bills mounted up and the business failed.  There is mounting tension in Crimea."},{"definition":"To attain in value; to amount (to)."},{"definition":"To get on top of (an animal) to mate."},{"definition":"To have sexual intercourse with someone."},{"definition":"To begin (a campaign, military assault, etc.); to launch.","example":"The General gave the order to mount the attack."},{"definition":"To deploy (cannon) for use.","example":"to mount a cannon"},{"definition":"To prepare and arrange the scenery, furniture, etc. for use in (a play or production)."},{"definition":"To incorporate fat, especially butter, into (a dish, especially a sauce to finish it).","example":"Mount the sauce with one tablespoon of butter."}],"partOfSpeech":"ve"}]},{"word":"INTERNSHIP","idx":9830,"count":5181182,"meanings":[{"definitions":[{"definition":"A job taken by a student in order to learn a profession or trade."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"internship-us","text":"/ˈɪntɝnʃɪp/"}]},{"word":"LONE","idx":9831,"count":5180561,"meanings":[{"definitions":[{"definition":"Solitary; having no companion.","example":"a lone traveler or watcher"},{"definition":"Isolated or lonely; lacking companionship."},{"definition":"Sole; being the only one of a type."},{"definition":"Situated by itself or by oneself, with no neighbours.","example":"a lone house;  a lone isle"},{"definition":"Unfrequented by human beings; solitary."},{"definition":"Single; unmarried, or in widowhood."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lone-us","text":"/loʊn/"}]},{"word":"REFRESH","idx":9832,"count":5180203,"meanings":[{"definitions":[{"definition":"The periodic energizing required to maintain the contents of computer memory, the display luminance of a computer screen, etc."},{"definition":"The update of a display (in a web browser or similar software) to show the latest version of the data."},{"definition":"The process of modernizing something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To renew or revitalize.","example":"Sleep refreshes the body and the mind."},{"definition":"To become fresh again; to be revitalized."},{"definition":"To reload (a document, especially a webpage) and show any new changes."},{"definition":"To cause (a web browser or similar software) to refresh its display."},{"definition":"To perform the periodic energizing required to maintain the contents of computer memory, the display luminance of a computer screen, etc."},{"definition":"To take refreshment; to eat or drink."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"refresh-us","text":"/ɹɪˈfɹɛʃ/"}]},{"word":"ALUMINIUM","idx":9833,"count":5178887,"meanings":[{"definitions":[{"definition":"A light, silvery metal extracted from bauxite, and a chemical element (symbol Al) with an atomic number of 13."},{"definition":"A single atom of this element."},{"definition":"Aircraft or other machinery made partially or wholly of aluminium."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"aluminium-us","text":"/ˌæl(j)uˈmɪn.j.əm/"},{"audio":"aluminium-uk","text":"/ˌæl.(j)ʊˈmɪn.i.əm/"}]},{"word":"SNOWBOARD","idx":9834,"count":5178854,"meanings":[{"definitions":[{"definition":"A board, somewhat like a broad ski, or a very long skateboard with no wheels, used in the sport of snowboarding."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride a snowboard."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"snowboard-us","text":"/ˈsnoʊˌbɔɹd/"}]},{"word":"WEBCAST","idx":9836,"count":5177898,"meanings":[{"definitions":[{"definition":"A video and/or audio broadcast transmitted via the Internet"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make such a broadcast"}],"partOfSpeech":"ve"}]},{"word":"SUBTLE","idx":9839,"count":5175269,"meanings":[{"definitions":[{"definition":"Hard to grasp; not obvious or easily understood; barely noticeable.","example":"The difference is subtle, but you can hear it if you listen carefully."},{"definition":"(of a thing) Cleverly contrived."},{"definition":"(of a person or animal) Cunning, skillful."},{"definition":"Insidious."},{"definition":"Tenuous; rarefied; of low density or thin consistency."},{"definition":"Refined; exquisite."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"subtle-us","text":"/ˈsʌt(ə)l/"}]},{"word":"COORDINATED","idx":9840,"count":5174649,"meanings":[{"definitions":[{"definition":"To synchronize (activities).","example":"I was playing tennis for the first time, and it was difficult to coordinate."},{"definition":"To match (objects, especially clothes).","example":"The outfit you're wearing doesn't coordinate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Organized, working together, cooperating"},{"definition":"Physically graceful or skillful"},{"definition":"Having coordinate bonds"}],"partOfSpeech":"j"}]},{"word":"SHIPMENTS","idx":9842,"count":5172896,"meanings":[{"definitions":[{"definition":"A load of goods that is transported by any method (not just by ship)"},{"definition":"The act of transporting goods"}],"partOfSpeech":"n"}]},{"word":"STRIPES","idx":9844,"count":5172728,"meanings":[{"definitions":[{"definition":"A long, relatively straight region of a single colour.","example":"zebra stripes"},{"definition":"(in the plural) The badge worn by certain officers in the military or other forces."},{"definition":"Distinguishing characteristic; sign; likeness; sort.","example":"persons of the same political stripe"},{"definition":"A long, narrow mark left by striking someone with a whip or stick; a blow with a whip or stick."},{"definition":"A pattern produced by arranging the warp threads in sets of alternating colours, or in sets presenting some other contrast of appearance."},{"definition":"Any of the balls marked with stripes in the game of pool, which one player aims to pot, the other player taking the spots."},{"definition":"A portion of data distributed across several separate physical disks for the sake of redundancy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark with stripes."},{"definition":"To lash with a whip or strap."},{"definition":"To distribute data across several separate physical disks to reduce the time to read and write."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stripes-us","text":"/stɹaɪps/"}]},{"word":"FIRMWARE","idx":9845,"count":5172546,"meanings":[{"definitions":[{"definition":"Something in between hardware and software. Like software, it is created from source code, but it is closely tied to the hardware it runs on."},{"definition":"Software intended for such embedded computer applications."}],"partOfSpeech":"n"}]},{"word":"COPE","idx":9847,"count":5168827,"meanings":[{"definitions":[{"definition":"To deal effectively with something, especially if difficult.","example":"I thought I would never be able to cope with life after the amputation, but I have learned how to be happy again."},{"definition":"To cut and form a mitred joint in wood or metal."},{"definition":"To clip the beak or talons of a bird."},{"definition":"To cover (a joint or structure) with coping."},{"definition":"To form a cope or arch; to bend or arch; to bow."},{"definition":"To bargain for; to buy."},{"definition":"To exchange or barter."},{"definition":"To make return for; to requite; to repay."},{"definition":"To match oneself against; to meet; to encounter."},{"definition":"To encounter; to meet; to have to do with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A long, loose cloak worn by a priest, deacon, or bishop when presiding over a ceremony other than the Mass."},{"definition":"Any covering such as a canopy or a mantle."},{"definition":"The vault or canopy of the skies, heavens etc."},{"definition":"A covering piece on top of a wall exposed to the weather, usually made of metal, masonry, or stone, and sloped to carry off water."},{"definition":"(foundry) The top part of a sand casting mold."},{"definition":"An ancient tribute due to the lord of the soil, out of the lead mines in Derbyshire, England."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cope-uk","text":"/kəʊp/"}]},{"word":"SHEPHERD","idx":9848,"count":5167633,"meanings":[{"definitions":[{"definition":"A person who tends sheep, especially a grazing flock."},{"definition":"Someone who watches over, looks after, or guides somebody."},{"definition":"The pastor of a church; one who guides others in religion."},{"definition":"A swain; a rustic male lover."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To watch over; to guide"},{"definition":"For a player to obstruct an opponent from getting to the ball, either when a teammate has it or is going for it, or if the ball is about to bounce through the goal or out of bounds."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shepherd-us","text":"/ˈʃɛpɚd/"}]},{"word":"CRADLE","idx":9851,"count":5166543,"meanings":[{"definitions":[{"definition":"A bed or cot for a baby, oscillating on rockers or swinging on pivots."},{"definition":"The place of origin, or in which anything is nurtured or protected in the earlier period of existence.","example":"a cradle of crime"},{"definition":"Infancy, or very early life.","example":"from the cradle to the grave"},{"definition":"An implement consisting of a broad scythe for cutting grain, with a set of long fingers parallel to the scythe, designed to receive the grain, and to lay it evenly in a swath."},{"definition":"A tool used in mezzotint engraving, which, by a rocking motion, raises burrs on the surface of the plate, so preparing the ground."},{"definition":"A framework of timbers, or iron bars, moving upon ways or rollers, used to support, lift, or carry ships or other vessels, heavy guns, etc., as up an inclined plane, or across a strip of land, or in launching a ship."},{"definition":"A case for a broken or dislocated limb."},{"definition":"A frame to keep the bedclothes from contact with the sensitive parts of an injured person."},{"definition":"A machine on rockers, used in washing out auriferous earth."},{"definition":"A suspended scaffold used in shafts."},{"definition":"A ribbing for vaulted ceilings and arches intended to be covered with plaster."},{"definition":"A basket or apparatus in which, when a line has been made fast to a wrecked ship from the shore, the people are brought off from the wreck.","example":"The cradle was ill-made. One victim fell into the sea and was lost and the ensuing delay cost three more lives."},{"definition":"A rest for the receiver of a telephone, or for certain computer hardware.","example":"He slammed the handset into the cradle."},{"definition":"(contact juggling) A hand position allowing a contact ball to be held steadily on the back of the hand."},{"definition":"A mechanical device for tilting and decanting a bottle of wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To contain in or as if in a cradle."},{"definition":"To rock (a baby to sleep)."},{"definition":"To wrap protectively, to hold gently and protectively.","example":"cradling the injured man’s head in her arms"},{"definition":"To lull or quieten, as if by rocking."},{"definition":"To nurse or train in infancy."},{"definition":"To rock the lacrosse stick back and forth in order to keep the ball in the head by means of centrifugal force."},{"definition":"To cut and lay (grain) with a cradle."},{"definition":"To transport a vessel by means of a cradle."},{"definition":"To put ribs across the back of (a picture), to prevent the panels from warping."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cradle-uk","text":"/ˈkɹeɪdəl/"}]},{"word":"CHANCELLOR","idx":9852,"count":5165551,"meanings":[{"definitions":[{"definition":"A senior secretary or official with administrative or legal duties, sometimes in charge of some area of government such as finance or justice.","example":"Chancellor of the Duchy of Lancaster  Lord Chancellor"},{"definition":"The head of the government in some German-speaking countries.","example":"the Austrian Chancellor"},{"definition":"A senior record keeper of a cathedral; a senior legal officer for a bishop or diocese in charge of hearing cases involving ecclesiastical law."},{"definition":"The head of a university, sometimes purely ceremonial."},{"definition":"Short for Chancellor of the Exchequer."},{"definition":"The foreman of a jury."},{"definition":"The chief judge of a court of chancery (that is, one exercising equity jurisdiction)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-lɚ/"},{"text":"/ˈtʃɑːnslə/"},{"audio":"chancellor-au"}]},{"word":"MAMBO","idx":9853,"count":5164902,"meanings":[{"definitions":[{"definition":"A voodoo priestess (in Haiti)"},{"definition":"A Latin-American musical genre, adapted from rumba, originating from Cuba in the 1940s, or a dance or rhythm of this genre."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform this dance."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmæmbəʊ/"}]},{"word":"LIME","idx":9854,"count":5164527,"meanings":[{"definitions":[{"definition":"Any inorganic material containing calcium, usually calcium oxide (quicklime) or calcium hydroxide (slaked lime)."},{"definition":"Any gluey or adhesive substance; something which traps or captures someone; sometimes a synonym for birdlime."},{"definition":"A deciduous tree of the genus Tilia, especially Tilia × europaea; the linden tree, or its wood."},{"definition":"Any of several green citrus fruit, somewhat smaller and sharper-tasting than a lemon."},{"definition":"Any of the trees that bear limes, especially Key lime, Citrus aurantiifolia."},{"definition":"A brilliant, sometimes yellowish, green colour associated with the fruits of a lime tree."},{"definition":"A fan fiction story which contains sexual references, but stops short of full, explicit descriptions of sexual activity (coined by analogy with lemon)."},{"definition":"A leash."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat with calcium hydroxide or calcium oxide (lime)."},{"definition":"To smear with birdlime."},{"definition":"To apply limewash."},{"definition":"To hang out/socialize in an informal, relaxed environment, especially with friends, for example at a party or on the beach."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Containing lime or lime juice."},{"definition":"Having the aroma or flavor of lime."},{"definition":"Lime-green."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/laɪm/"}]},{"word":"KIRK","idx":9855,"count":5164081,"meanings":[{"definitions":[{"definition":"A church."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"kirk-us"}]},{"word":"FLOUR","idx":9856,"count":5162842,"meanings":[{"definitions":[{"definition":"Powder obtained by grinding or milling cereal grains, especially wheat, or other foodstuffs such as soybeans and potatoes, and used to bake bread, cakes, and pastry."},{"definition":"The food made by grinding and bolting cleaned wheat (not durum or red durum) until it meets specified levels of fineness, dryness and freedom from bran and germ, also containing any of certain enzymes, ascorbic acid and certain bleaching agents."},{"definition":"Powder of other material.","example":"mustard flour"},{"definition":"A colorful, conspicuous structure associated with angiosperms, frequently scented and attracting various insects, and which may or may not be used for sexual reproduction."},{"definition":"A reproductive structure in angiosperms (flowering plants), often conspicuously colourful and typically including sepals, petals, and either or both stamens and/or a pistil."},{"definition":"A plant that bears flowers, especially a plant that is small and lacks wood.","example":"We transplanted the flowers to a larger pot."},{"definition":"(usually with in) Of plants, a state of bearing blooms.","example":"The dogwoods are in flower this week."},{"definition":"(hypocoristic) The vulva, especially the labia majora."},{"definition":"The best examples or representatives of a group.","example":"We selected the flower of the applicants."},{"definition":"The best state of things; the prime.","example":"She was in the flower of her life."},{"definition":"Flour."},{"definition":"(in the plural) A substance in the form of a powder, especially when condensed from sublimation.","example":"the flowers of sulphur"},{"definition":"A figure of speech; an ornament of style."},{"definition":"Ornamental type used chiefly for borders around pages, cards, etc."},{"definition":"(in the plural) Menstrual discharges."},{"definition":"Something that flows, such as a river."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply flour to something; to cover with flour."},{"definition":"To reduce to flour."},{"definition":"To break up into fine globules of mercury in the amalgamation process."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"flour-us","text":"/ˈflaʊɚ/"}]},{"word":"CONTROVERSY","idx":9857,"count":5161175,"meanings":[{"definitions":[{"definition":"A debate or discussion of opposing opinions; (generally) strife."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"controversy-us","text":"/ˈkɑntɹəˌvɝsi/"},{"audio":"controversy-uk","text":"/kənˈtɹɒvəsi/"}]},{"word":"LEGENDARY","idx":9858,"count":5158604,"meanings":[{"definitions":[{"definition":"A collection of legends, in particular of lives of saints."},{"definition":"One who relates legends."},{"definition":"(Pokémon) A legendary Pokémon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to a legend or to legends."},{"definition":"Appearing (solely) in legends."},{"definition":"Having the splendor of a legend; fabled."},{"definition":"Having unimaginable greatness; excellent to such an extent to evoke stories"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"legendary-us"}]},{"word":"SYMPATHY","idx":9860,"count":5157330,"meanings":[{"definitions":[{"definition":"A feeling of pity or sorrow for the suffering or distress of another; compassion."},{"definition":"The ability to share the feelings of another."},{"definition":"A mutual relationship between people or things such that they are correspondingly affected by any condition."},{"definition":"Tendency towards or approval of the aims of a movement.","example":"Many people in Hollywood were blacklisted merely because they were suspected of Communist sympathies."},{"definition":"Artistic harmony, as of shape or colour in a painting."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sympathy-us","text":"/ˈsɪmpəθi/"}]},{"word":"CHOIR","idx":9861,"count":5156247,"meanings":[{"definitions":[{"definition":"Singing group; group of people who sing together; company of people who are trained to sing together.","example":"The church choir practices Thursday nights."},{"definition":"The part of a church where the choir assembles for song."},{"definition":"(Christian angelology) One of the nine ranks or orders of angels.","example":"Seraphim, Cherubim, and Thrones are three of the choirs of angels."},{"definition":"Set of strings (one per note) for a harpsichord."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sing in concert."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"choir-us","text":"/kwaɪɚ/"},{"audio":"choir-uk","text":"/kwaɪə(ɹ)/"}]},{"word":"AVOIDING","idx":9862,"count":5155816,"meanings":[{"definitions":[{"definition":"To try not to meet or communicate with (a person); to shun"},{"definition":"To keep away from; to keep clear of; to stay away from","example":"I try to avoid the company of gamblers."},{"definition":"To try not to do something or to have something happen"},{"definition":"To make empty; to clear."},{"definition":"To make void, to annul; to refute (especially a contract)."},{"definition":"To defeat or evade; to invalidate."},{"definition":"To emit or throw out; to void."},{"definition":"To leave, evacuate; to leave as empty, to withdraw or come away from."},{"definition":"To get rid of."},{"definition":"To retire; to withdraw, depart, go away."},{"definition":"To become void or vacant."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Avoidance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"avoiding-us","text":"/əˈvɔɪdɪŋ/"}]},{"word":"BEAUTIFULLY","idx":9863,"count":5155531,"meanings":[{"definitions":[{"definition":"In a beautiful manner."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"beautifully-us","text":"/ˈbjuːtɪf(ə)li/"}]},{"word":"BLOND","idx":9864,"count":5155053,"meanings":[{"definitions":[{"definition":"A pale yellowish (golden brown) color, especially said of hair color."},{"definition":"A person with this hair color."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To color or dye blond"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a bleached or pale golden (light yellowish) colour.","example":"blond ale"},{"definition":"(of a person) Having blond hair."},{"definition":"(especially of a woman) Stupid, ignorant, naive."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"blond-uk","text":"/blɒnd/"}]},{"word":"EXPECTS","idx":9865,"count":5154931,"meanings":[{"definitions":[{"definition":"To predict or believe that something will happen","example":"He never expected to be discovered."},{"definition":"To consider obligatory or required."},{"definition":"To consider reasonably due.","example":"You are expected to get the task done by the end of next week."},{"definition":"(continuous aspect only, of a woman or couple) To be pregnant, to consider a baby due."},{"definition":"To wait for; to await."},{"definition":"To wait; to stay."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"expects-us"}]},{"word":"JUMPING","idx":9867,"count":5154366,"meanings":[{"definitions":[{"definition":"To propel oneself rapidly upward, downward and/or in any horizontal direction such that momentum causes the body to become airborne.","example":"Kangaroos are known for their ability to jump high."},{"definition":"To cause oneself to leave an elevated location and fall downward.","example":"She is going to jump from the diving board."},{"definition":"To pass by a spring or leap; to overleap.","example":"to jump a stream"},{"definition":"To employ a parachute to leave an aircraft or elevated location."},{"definition":"To react to a sudden, often unexpected, stimulus (such as a sharp prick or a loud sound) by jerking the body violently.","example":"The sudden sharp sound made me jump."},{"definition":"To increase sharply, to rise, to shoot up.","example":"Share prices jumped by 10% after the company announced record profits."},{"definition":"To employ a move in certain board games where one game piece is moved from one legal position to another passing over the position of another piece.","example":"The player's knight jumped the opponent's bishop."},{"definition":"To move to a position (in a queue/line) that is further forward.","example":"I hate it when people jump the queue."},{"definition":"To attack suddenly and violently.","example":"The hoodlum jumped a woman in the alley."},{"definition":"To engage in sexual intercourse with (a person)."},{"definition":"To cause to jump.","example":"The rider jumped the horse over the fence."},{"definition":"To move the distance between two opposing subjects."},{"definition":"To increase the height of a tower crane by inserting a section at the base of the tower and jacking up everything above it."},{"definition":"To increase speed aggressively and without warning."},{"definition":"To expose to danger; to risk; to hazard."},{"definition":"(smithwork) To join by a buttweld."},{"definition":"To thicken or enlarge by endwise blows; to upset."},{"definition":"(quarrying) To bore with a jumper."},{"definition":"To coincide; to agree; to accord; to tally; followed by with."},{"definition":"To start executing code from a different location, rather than following the program counter."},{"definition":"To flee; to make one's escape."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of performing a jump."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Exuberantly active; in full swing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdʒʌmpɪŋ/"}]},{"word":"FABRICS","idx":9868,"count":5152660,"meanings":[{"definitions":[{"definition":"An edifice or building."},{"definition":"The act of constructing, construction, fabrication."},{"definition":"The structure of anything, the manner in which the parts of a thing are united; workmanship, texture, make.","example":"cloth of a beautiful fabric"},{"definition":"The framework underlying a structure.","example":"the fabric of our lives"},{"definition":"A material made of fibers, a textile or cloth.","example":"cotton fabric"},{"definition":"The appearance of crystalline grains in a rock."},{"definition":"Interconnected nodes that look like a textile fabric when diagrammed.","example":"The Internet is a fabric of computers connected by routers."}],"partOfSpeech":"n"}]},{"word":"ANTIBODIES","idx":9869,"count":5152454,"meanings":[{"definitions":[{"definition":"A protein produced by B-lymphocytes that binds to a specific antigen."}],"partOfSpeech":"n"}]}]