[{"word":"SNAPS","idx":20671,"count":1512455,"meanings":[{"definitions":[{"definition":"A quick breaking or cracking sound or the action of producing such a sound."},{"definition":"A sudden break."},{"definition":"An attempt to seize, bite, attack, or grab."},{"definition":"The act of making a snapping sound by pressing the thumb and an opposing finger of the same hand together and suddenly releasing the grip so that the finger hits against the palm."},{"definition":"A fastening device that makes a snapping sound when used."},{"definition":"A photograph; a snapshot.","example":"We took a few snaps of the old church before moving on."},{"definition":"The sudden release of something held under pressure or tension."},{"definition":"A thin circular cookie or similar baked good.","example":"a ginger snap"},{"definition":"A brief, sudden period of a certain weather; used primarily in the phrase cold snap."},{"definition":"A very short period of time (figuratively, the time taken to snap one's fingers), or a task that can be accomplished in such a period.","example":"I can fix most vacuum cleaners in a snap."},{"definition":"A snap bean such as Phaseolus vulgaris."},{"definition":"A backward pass or handoff of a football from its position on the ground that puts the ball in play; a hike."},{"definition":"(somewhat colloquial) A rivet: a scrapbooking embellishment."},{"definition":"A small meal, a snack; lunch."},{"definition":"A card game, primarily for children, in which players cry \"snap\" to claim pairs of matching cards as they are turned up."},{"definition":"A greedy fellow."},{"definition":"That which is, or may be, snapped up; something bitten off, seized, or obtained by a single quick movement; hence, a bite, morsel, or fragment; a scrap."},{"definition":"Briskness; vigour; energy; decision"},{"definition":"Any circumstance out of which money may be made or an advantage gained. used primarily in the phrase soft snap."},{"definition":"Something that is easy or effortless."},{"definition":"A snapper, or snap beetle."},{"definition":"Jounce (the fourth derivative of the position vector with respect to time), followed by crackle and pop"},{"definition":"A quick offhand shot with a firearm; a snap shot."},{"definition":"Something of no value.","example":"not worth a snap"},{"definition":"A visual message sent through the Snapchat application."},{"definition":"A crisp or pithy quality; epigrammatic point or force."},{"definition":"A tool used by riveters."},{"definition":"A tool used by glass-moulders."},{"definition":"A brief theatrical engagement."},{"definition":"An easy and profitable place or task; a sinecure."},{"definition":"A cheat or sharper."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fracture or break apart suddenly.","example":"He snapped his stick in anger."},{"definition":"To give forth or produce a sharp cracking noise; to crack.","example":"Blazing firewood snaps."},{"definition":"To attempt to seize with the teeth or bite.","example":"A dog snaps at a passenger. A fish snaps at the bait."},{"definition":"To attempt to seize with eagerness.","example":"She snapped at the chance to appear on television."},{"definition":"To speak abruptly or sharply.","example":"He snapped at me for the slightest mistake."},{"definition":"To give way abruptly and loudly."},{"definition":"To suffer a mental breakdown, usually while under tension.","example":"She should take a break before she snaps."},{"definition":"To flash or appear to flash as with light."},{"definition":"To fit or fasten together with a snapping sound."},{"definition":"To jump to a fixed position relative to another element.","example":"The floating toolbar will snap to the edge of the screen when dragged towards it."},{"definition":"To snatch with or as if with the teeth."},{"definition":"To pull apart with a snapping sound; to pop loose."},{"definition":"To say abruptly or sharply."},{"definition":"To speak to abruptly or sharply; to treat snappishly; usually with up."},{"definition":"To cause something to emit a snapping sound.","example":"to snap a fastener"},{"definition":"To close something using a snap as a fastener."},{"definition":"To snap one's fingers: to make a snapping sound, often by pressing the thumb and an opposing finger of the same hand together and suddenly releasing the grip so that the finger hits against the palm; alternatively, by bringing the index finger quickly down onto the middle finger and thumb."},{"definition":"To cause to move suddenly and smartly."},{"definition":"To take a photograph; to release a camera's shutter (which may make a snapping sound).","example":"He snapped a picture of me with my mouth open and my eyes closed."},{"definition":"To put (a football) in play by a backward pass or handoff from its position on the ground; to hike (a football).","example":"He can snap the ball to a back twenty yards behind him."},{"definition":"To misfire.","example":"The gun snapped."},{"definition":"To catch out sharply (a batsman who has just snicked a bowled ball)."}],"partOfSpeech":"ve"}]},{"word":"DEFENDS","idx":20672,"count":1512358,"meanings":[{"definitions":[{"definition":"To ward off attacks against; to fight to protect; to guard."},{"definition":"To support by words or writing; to vindicate, talk in favour of."},{"definition":"To make legal defence of; to represent (the accused)."},{"definition":"To focus one's energies and talents on preventing opponents from scoring, as opposed to focusing on scoring."},{"definition":"To attempt to retain a title, or attempt to reach the same stage in a competition as one did in the previous edition of that competition."},{"definition":"To call a raise from the big blind."},{"definition":"To ward off, repel (an attack or attacker)."},{"definition":"To prevent, to keep (from doing something)."},{"definition":"To prohibit, forbid."}],"partOfSpeech":"ve"}]},{"word":"DEPICTS","idx":20673,"count":1512323,"meanings":[{"definitions":[{"definition":"To render a representation of something, using words, sounds, images, or other means."}],"partOfSpeech":"ve"}]},{"word":"PILGRIMAGE","idx":20675,"count":1512182,"meanings":[{"definitions":[{"definition":"A journey made to a sacred place, or a religious journey.","example":"In the Muslim faith, the pilgrimage to Mecca is known as the Hajj."},{"definition":"(by extension) A visit to any site revered or associated with a meaningful event.","example":"Each year we made a pilgrimage to New York City to visit the pub where we all first met."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go on a pilgrimage."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɪlɡɹɪmɪd͡ʒ/"}]},{"word":"QUANTIFY","idx":20676,"count":1512122,"meanings":[{"definitions":[{"definition":"To assign a quantity to."},{"definition":"To determine the value of (a variable or expression)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkwɑːn.tə.faɪ/"}]},{"word":"ELEVATORS","idx":20678,"count":1512024,"meanings":[{"definitions":[{"definition":"Anything that raises or uplifts."},{"definition":"A permanent construction with a built-in platform that is lifted vertically, used to transport people and goods."},{"definition":"A silo used for storing wheat, corn or other grain (grain elevator)"},{"definition":"A control surface of an aircraft responsible for controling the pitching motion of the machine."},{"definition":"A dental instrument used to pry up (\"elevate\") teeth in difficult extractions, or depressed portions of bone."},{"definition":"Any muscle that serves to raise a part of the body, such as the leg or the eye."},{"definition":"A type of shoe having an insert lift to make the wearer appear taller."}],"partOfSpeech":"n"}]},{"word":"SUBSTITUTIONS","idx":20680,"count":1511821,"meanings":[{"definitions":[{"definition":"The act of substituting or the state of being substituted."},{"definition":"A substitute or replacement."},{"definition":"The replacement of an atom, or group of atoms, in a compound, with another."}],"partOfSpeech":"n"}]}]