[{"word":"PROMPTING","idx":26095,"count":1014238,"meanings":[{"definitions":[{"definition":"To lead (someone) toward what they should say or do.","example":"I prompted him to get a new job."},{"definition":"To show or tell an actor/person the words they should be saying, or actions they should be doing.","example":"If he forgets his words I will prompt him."},{"definition":"To initiate; to cause or lead to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of saying something to persuade, encourage, or remind someone to do or say something."}],"partOfSpeech":"n"}]},{"word":"OBJECTED","idx":26096,"count":1014217,"meanings":[{"definitions":[{"definition":"To disagree with or oppose something or someone; (especially in a Court of Law) to raise an objection.","example":"I object to the proposal to build a new airport terminal."},{"definition":"To offer in opposition as a criminal charge or by way of accusation or reproach; to adduce as an objection or adverse reason."},{"definition":"To set before or against; to bring into opposition; to oppose."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əbˈd͡ʒɛktɪd/"}]},{"word":"EQUATOR","idx":26097,"count":1014051,"meanings":[{"definitions":[{"definition":"(often “the Equator”) An imaginary great circle around the Earth, equidistant from the two poles, and dividing earth's surface into the northern and southern hemisphere."},{"definition":"A similar great circle on any sphere, especially on a celestial body, or on other reasonably symmetrical three-dimensional body."},{"definition":"The midline of any generally spherical object, such as a fruit or vegetable, that has identifiable poles.","example":"Slice the onion through the equator."},{"definition":"The celestial equator."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"equator-us","text":"/iˈkweɪ.tɚ/"},{"audio":"equator-uk","text":"/ɪˈkweɪ.tə/"}]},{"word":"UNZIP","idx":26098,"count":1014009,"meanings":[{"definitions":[{"definition":"To open something using a zipper."},{"definition":"To come open by means of a zipper."},{"definition":"To decompress (a zip file)."}],"partOfSpeech":"ve"}]},{"word":"GUILDS","idx":26099,"count":1013989,"meanings":[{"definitions":[{"definition":"A group or association mainly of tradespeople made up of merchants, craftspeople, or artisans for mutual aid, particularly in the Middle Ages."},{"definition":"A corporation."},{"definition":"A group of diverse species that share common characteristics or habits."},{"definition":"An organized group of players who regularly play together in a multiplayer game."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡɪldz/"}]},{"word":"BLATANT","idx":26100,"count":1013927,"meanings":[{"definitions":[{"definition":"Bellowing; disagreeably clamorous; sounding loudly and harshly."},{"definition":"Obvious, on show; unashamed; loudly obtrusive or offensive."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"blatant-us","text":"/ˈbleɪtənt/"}]},{"word":"FLOSS","idx":26101,"count":1013783,"meanings":[{"definitions":[{"definition":"A thread used to clean the gaps between the teeth."},{"definition":"Raw silk fibres."},{"definition":"The fibres covering a corncob etc.; the loose downy or silky material inside the husks of certain plants, such as beans."},{"definition":"Any thread-like material having parallel strands that are not spun or wound around each other.","example":"embroidery floss"},{"definition":"Spun sugar or cotton candy, especially in the phrase \"candy floss\"."},{"definition":"A body feather of an ostrich.","example":"Flosses are soft, and grey from the female and black from the male."},{"definition":"A dance move in which the dancer repeatedly swings their arms, with clenched fists, from the back of their body to the front, on each side."},{"definition":"A small stream of water."},{"definition":"Fluid glass floating on iron in the puddling furnace, produced by the vitrification of oxides and earths which are present."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clean the area between the teeth using floss."},{"definition":"To show off, especially by exhibiting one's wealth or talent."},{"definition":"To perform the floss dance move."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"floss-us","text":"/flɔs/"}]},{"word":"FAVOURED","idx":26102,"count":1013666,"meanings":[{"definitions":[{"definition":"To look upon fondly; to prefer."},{"definition":"To encourage, conduce to"},{"definition":"To do a favor [noun sense 1] for; to show beneficence toward.","example":"Would you favor us with a poetry reading?"},{"definition":"To treat with care.","example":"Favoring your sore leg will only injure the other one."},{"definition":"(including) To resemble, to look like (another person)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Treated or regarded with partiality."},{"definition":"(in combination) Having a certain appearance or physical features.","example":"ill-favoured; well-favoured; hard-favoured"},{"definition":"Wearing a favour.","example":"a white-favoured footman"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"favoured-us","text":"/ˈfeɪ.vɚd/"}]},{"word":"SARGE","idx":26103,"count":1013607,"meanings":[{"definitions":[{"definition":"Sergeant"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(pickup community) to go out and engage women in order to pick them up"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/saɹd͡ʒ/"},{"text":"/sɑːd͡ʒ/"}]},{"word":"ENDNOTE","idx":26104,"count":1013592,"meanings":[{"definitions":[{"definition":"An annotation placed at the end of a document or chapter of a document."}],"partOfSpeech":"n"}]},{"word":"RIDGES","idx":26105,"count":1013404,"meanings":[{"definitions":[{"definition":"The back of any animal; especially the upper or projecting part of the back of a quadruped."},{"definition":"Any extended protuberance; a projecting line or strip.","example":"The plough threw up ridges of earth between the furrows."},{"definition":"The line along which two sloping surfaces meet which diverge towards the ground."},{"definition":"The highest point on a roof, represented by a horizontal line where two roof areas intersect, running the length of the area."},{"definition":"(fortifications) The highest portion of the glacis proceeding from the salient angle of the covered way."},{"definition":"A chain of mountains."},{"definition":"A chain of hills."},{"definition":"A long narrow elevation on an ocean bottom."},{"definition":"An elongated region of high atmospheric pressure."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ridges-us","text":"/ˈɹɪd͡ʒɪz/"}]},{"word":"OYSTERS","idx":26107,"count":1013367,"meanings":[{"definitions":[{"definition":"Any of certain marine bivalve mollusks, especially those of the family Ostreidae (the true oysters), usually found adhering to rocks or other fixed objects in shallow water along the seacoasts, or in brackish water in the mouth of rivers."},{"definition":"The delicate morsel of dark meat contained in a small cavity of the bone on each side of the lower part of the back of a fowl."},{"definition":"A pale beige color tinted with grey or pink, like that of an oyster."},{"definition":"(by analogy) A person who keeps secrets."},{"definition":"A shoplifter."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"oysters-us"}]},{"word":"MIDWIFERY","idx":26109,"count":1013285,"meanings":[{"definitions":[{"definition":"The practice and science of being a midwife."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɪdˌwaɪfəɹi/"},{"text":"/mɪdˈwɪfəɹi/"}]},{"word":"HUFF","idx":26110,"count":1013100,"meanings":[{"definitions":[{"definition":"A heavy breath; a grunt or sigh.","example":"With a huff, he lifted the box onto the back of the truck."},{"definition":"An expression of anger, annoyance, disgust, etc."},{"definition":"One swelled with a false sense of importance or value; a boaster."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To breathe heavily.","example":"The run left him huffing and puffing."},{"definition":"To say in a huffy manner."},{"definition":"To enlarge; to swell up.","example":"Bread huffs."},{"definition":"To bluster or swell with anger, arrogance, or pride; to storm; to take offense."},{"definition":"To treat with arrogance and insolence; to chide or rebuke rudely; to bully, to hector."},{"definition":"To inhale psychoactive inhalants."},{"definition":"(draughts) To remove an opponent's piece as a forfeit for deliberately not taking a piece (often signalled by blowing on it)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"huff-us","text":"/hʌf/"}]},{"word":"PORNOS","idx":26111,"count":1013061,"meanings":[{"definitions":[{"definition":"Pornography."},{"definition":"A pornographic film.","example":"They watched a few pornos."}],"partOfSpeech":"n"}]},{"word":"PRIMATES","idx":26112,"count":1013017,"meanings":[{"definitions":[{"definition":"A mammal of the order Primates, including simians and prosimians.","example":"Primates range from lemurs to gorillas."},{"definition":"A simian anthropoid; an ape, human or monkey."},{"definition":"In the Catholic Church, a rare title conferred to or claimed by the sees of certain archbishops, or the highest-ranking bishop of a present or historical, usually political circumscription."},{"definition":"In the Orthodox Church, the presiding bishop of an ecclesiastical jurisdiction or region. Usually, the expression primate refers to the first hierarch of an autocephalous or autonomous Orthodox church. Less often, it is used to refer to the ruling bishop of an archdiocese or diocese."},{"definition":"In the Anglican Church, an archbishop, or the highest-ranking bishop of an ecclesiastic province."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɹaɪmeɪts/"}]},{"word":"GUST","idx":26113,"count":1012909,"meanings":[{"definitions":[{"definition":"A strong, abrupt rush of wind."},{"definition":"(by extension) Any rush or outburst (of water, emotion, etc.)."},{"definition":"The physiological faculty of taste."},{"definition":"Relish, enjoyment, appreciation.","example":"1942: ‘Yes, indeed,’ said Sava with solemn gust. — Rebecca West, Black Lamb and Grey Falcon (Canongate 2006, p. 1050)"},{"definition":"Intellectual taste; fancy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To blow in gusts."},{"definition":"To taste."},{"definition":"To have a relish for."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡʌst/"}]},{"word":"CATE","idx":26114,"count":1012807,"meanings":[{"definitions":[{"definition":"(in the plural) A delicacy or item of food."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/keɪt/"}]},{"word":"RECEPTACLE","idx":26116,"count":1012757,"meanings":[{"definitions":[{"definition":"A container."},{"definition":"The part of the flower stalk (peduncle or pedicel) to which the floral parts are attached; a thalamus, a torus."},{"definition":"A structure at the end of a branch of an alga containing conceptacles (reproductive organs)."},{"definition":"An organ that receives and holds a secretion."},{"definition":"A contact device installed at an outlet for the connection of an attachment plug (typically by receiving the plug's prongs) to supply portable appliances or equipment."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹi-/"},{"text":"/ɹɪˈsɛp.tə.kl̩/"},{"audio":"receptacle-au"}]},{"word":"TANGERINE","idx":26117,"count":1012609,"meanings":[{"definitions":[{"definition":"Any of several varieties of mandarin oranges."},{"definition":"A deep yellowish-orange colour, like that of a tangerine fruit."},{"definition":"A tree that produces tangerines."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a deep yellowish-orange colour."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtæn.dʒəˌɹin/"}]},{"word":"AMOXICILLIN","idx":26120,"count":1012347,"meanings":[{"definitions":[{"definition":"A moderate-spectrum, bacteriolytic beta-lactam antibiotic used to treat bacterial infections caused by susceptible microorganisms, with formula C16H19N3O5S."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˌmɑk.səˈsɪ.lɪn/"}]},{"word":"PUBERTY","idx":26122,"count":1012229,"meanings":[{"definitions":[{"definition":"A developmental phase brought about by the action of hormones as part of the maturing process. For humans, there are three in total."},{"definition":"The age at which a person is first capable of sexual reproduction."},{"definition":"The period when a plant begins to flower."}],"partOfSpeech":"n"}]},{"word":"CRAWLER","idx":26124,"count":1012165,"meanings":[{"definitions":[{"definition":"A person who is abused, physically or verbally, and returns to the abuser a supplicant."},{"definition":"A sycophant."},{"definition":"A child who is able to creep using his hands and knees but is not able to walk."},{"definition":"A crawl swimmer."},{"definition":"A tractor crawler, a motorized vehicle that uses caterpillar tracks instead of wheels."},{"definition":"A software bot that autonomously follows connected paths such as webpage links."},{"definition":"A mobile stage in the development of stationary hemipteran insects such as scale insects- generally the first instar"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"crawler-au"}]},{"word":"ANGLED","idx":26125,"count":1012136,"meanings":[{"definitions":[{"definition":"(often in the passive) To place (something) at an angle.","example":"The roof is angled at 15 degrees."},{"definition":"To change direction rapidly.","example":"The five ball angled off the nine ball but failed to reach the pocket."},{"definition":"To present or argue something in a particular way or from a particular viewpoint.","example":"How do you want to angle this when we talk to the client?"},{"definition":"(cue sports) To hamper (oneself or one's opponent) by leaving the cue ball in the jaws of a pocket such that the surround of the pocket (the \"angle\") blocks the path from cue ball to object ball."},{"definition":"To try to catch fish with a hook and line."},{"definition":"(with for) To attempt to subtly persuade someone to offer a desired thing.","example":"He must be angling for a pay rise."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Arranged so as to form an angle."},{"definition":"Forming an angle of a particular type.","example":"the right-angled corner"}],"partOfSpeech":"j"}]},{"word":"SHORTEN","idx":26127,"count":1012067,"meanings":[{"definitions":[{"definition":"To make shorter; to abbreviate."},{"definition":"To become shorter."},{"definition":"To make deficient (as to); to deprive (of)."},{"definition":"To make short or friable, as pastry, with butter, lard, etc."},{"definition":"To reduce or diminish in amount, quantity, or extent; to lessen.","example":"to shorten an allowance of food"},{"definition":"To take in the slack of (a rope)."},{"definition":"To reduce (sail) by taking it in."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shorten-uk","text":"/ˈʃɔːtən/"}]},{"word":"LONGHORNS","idx":26128,"count":1012066,"meanings":[{"definitions":[{"definition":"A breed of beef cattle, having long horns, bred in Texas and other parts of southwest United States."}],"partOfSpeech":"n"}]},{"word":"SHAWL","idx":26131,"count":1011728,"meanings":[{"definitions":[{"definition":"A square or rectangular piece of cloth worn as a covering for the head, neck, and shoulders, typically by women.","example":"She wears her shawl when it's cold outside."},{"definition":"A fold of wrinkled flesh under the lips and neck of a bloodhound, used in scenting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wrap in a shawl."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shawl-us-cot-caught%20merger"}]},{"word":"OVERRIDING","idx":26133,"count":1011434,"meanings":[{"definitions":[{"definition":"To ride across or beyond something."},{"definition":"To ride a horse too hard."},{"definition":"To counteract the normal operation of something; to countermand with orders of higher priority.","example":"The Congress promptly overrode the president's veto, passing the bill into law."},{"definition":"To define a new behaviour of a method by creating the same method of the superclass with the same name and signature."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process by which something is overridden."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Superior, of supreme importance in the case."}],"partOfSpeech":"j"}]},{"word":"SAMARITAN","idx":26134,"count":1011072,"meanings":[{"definitions":[{"definition":"A Good Samaritan"}],"partOfSpeech":"n"}]},{"word":"BENDS","idx":26135,"count":1010930,"meanings":[{"definitions":[{"definition":"A curve.","example":"There's a sharp bend in the road ahead."},{"definition":"Any of the various knots which join the ends of two lines."},{"definition":"(in the plural, underwater diving, with the) A severe condition caused by excessively quick decompression, causing bubbles of nitrogen to form in the blood; decompression sickness.","example":"A diver who stays deep for too long must ascend very slowly in order to prevent the bends."},{"definition":"One of the honourable ordinaries formed by two diagonal lines drawn from the dexter chief to the sinister base; it generally occupies a fifth part of the shield if uncharged, but if charged one third."},{"definition":"Turn; purpose; inclination; ends."},{"definition":"In the leather trade, the best quality of sole leather; a butt; sometimes, half a butt cut lengthwise."},{"definition":"Hard, indurated clay; bind."},{"definition":"(in the plural) The thickest and strongest planks in a ship's sides, more generally called wales, which have the beams, knees, and futtocks bolted to them."},{"definition":"(in the plural) The frames or ribs that form the ship's body from the keel to the top of the sides.","example":"the midship bends"},{"definition":"A glissando, or glide between one pitch and another."},{"definition":"The thickest and strongest planks in a wooden ship's side, wales."},{"definition":"A sometimes fatal condition resulting from the formation of nitrogen bubbles in the blood and tissues, because of too rapid decompression, seen especially in deep-sea divers ascending rapidly from a dive. It is characterized by severe pains in the joints and chest, skin irritation, cramps, nausea, and paralysis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause (something) to change its shape into a curve, by physical force, chemical action, or any other means.","example":"Don’t bend your knees."},{"definition":"To become curved.","example":"Look at the trees bending in the wind."},{"definition":"To cause to change direction."},{"definition":"To change direction.","example":"The road bends to the right"},{"definition":"To be inclined; to direct itself."},{"definition":"(usually with \"down\") To stoop.","example":"He bent down to pick up the pieces."},{"definition":"To bow in prayer, or in token of submission."},{"definition":"To force to submit.","example":"They bent me to their will."},{"definition":"To submit.","example":"I am bending to my desire to eat junk food."},{"definition":"To apply to a task or purpose.","example":"He bent the company's resources to gaining market share."},{"definition":"To apply oneself to a task or purpose.","example":"He bent to the goal of gaining market share."},{"definition":"To adapt or interpret to for a purpose or beneficiary."},{"definition":"To tie, as in securing a line to a cleat; to shackle a chain to an anchor; make fast.","example":"Bend the sail to the yard."},{"definition":"To smoothly change the pitch of a note.","example":"You should bend the G slightly sharp in the next measure."},{"definition":"To swing the body when rowing."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/bɛndz/"}]},{"word":"GRIMES","idx":26136,"count":1010676,"meanings":[{"definitions":[{"definition":"To begrime; to cake with dirt."}],"partOfSpeech":"ve"}]},{"word":"UNISON","idx":26138,"count":1010644,"meanings":[{"definitions":[{"definition":"(acoustics) Identical pitch between two notes or sounds; the simultaneous playing of notes of identical pitch (or separated by one or more octaves).","example":"The unison has a pitch ratio of 1:1."},{"definition":"(acoustics) A sound or note having the same pitch as another, especially when used as the base note for an interval; a unison string."},{"definition":"The state of being in harmony or agreement; harmonious agreement or togetherness, synchronisation.","example":"Everyone moved in unison, but the sudden change in weight distribution capsized the boat."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈjunɨsən/"}]},{"word":"TABULAR","idx":26139,"count":1010640,"meanings":[{"definitions":[{"definition":"Having a flat, plane surface"},{"definition":"Organized as a table or list"},{"definition":"Calculated by means of a table"},{"definition":"Tending to split into thin flat pieces, such as slate"}],"partOfSpeech":"j"}]},{"word":"ARD","idx":26140,"count":1010555,"meanings":[{"definitions":[{"definition":"A simple plough consisting of a spike dragged through the soil."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɑɹd/"},{"text":"/ɑːd/"}]},{"word":"AMIR","idx":26143,"count":1010408,"meanings":[{"definitions":[{"definition":"A prince, commander or other leader or ruler in an Islamic nation."},{"definition":"A descendant of the prophet Muhammad."}],"partOfSpeech":"n"}]},{"word":"DORMANT","idx":26144,"count":1010249,"meanings":[{"definitions":[{"definition":"A crossbeam or joist."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Inactive, sleeping, asleep, suspended.","example":"Grass goes dormant during the winter, waiting for spring before it grows again."},{"definition":"In a sleeping posture; distinguished from couchant.","example":"a lion dormant"},{"definition":"Leaning."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɔɹmənt/"},{"text":"/ˈdɔːmənt/"}]},{"word":"RESTRAINED","idx":26148,"count":1009965,"meanings":[{"definitions":[{"definition":"To control or keep in check."},{"definition":"To deprive of liberty."},{"definition":"To restrict or limit.","example":"He was restrained by the straight jacket."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Held back, limited, kept in check or under control.","example":"He greeted her for the first time in three years with a restrained embrace."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"restrained-us"},{"audio":"restrained-uk"}]},{"word":"TROPICS","idx":26149,"count":1009932,"meanings":[{"definitions":[{"definition":"The region of the Earth centred on the equator and lying between the Tropic of Cancer and the Tropic of Capricorn and characterized by a hot climate."}],"partOfSpeech":"n"}]},{"word":"CONCERTED","idx":26151,"count":1009816,"meanings":[{"definitions":[{"definition":"To plan together; to settle or adjust by conference, agreement, or consultation."},{"definition":"To plan; to devise; to arrange."},{"definition":"To act in harmony or conjunction; to form combined plans."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Performed through a concert of effort; done by agreement or in combination."},{"definition":"Having separate parts for voices and instruments"}],"partOfSpeech":"j"}]},{"word":"DONGLE","idx":26152,"count":1009813,"meanings":[{"definitions":[{"definition":"Any small device that plugs into an electronic device, typically a computer, and alters its functionality. Common examples include wireless modems, software copy protect devices, and adapters."},{"definition":"A hardware device utilized by a specific application for purposes of copy protection."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dongle-us","text":"/ˈdɑŋɡl̩/"}]},{"word":"ECUMENICAL","idx":26153,"count":1009712,"meanings":[{"definitions":[{"definition":"Pertaining to the universal Church, representing the entire Christian world; interdenominational; sometimes by extension, interreligious."},{"definition":"General, universal, worldwide."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ecumenical-us","text":"/ˌɛk.jʊˈmɛ.nɪ.kəl/"}]},{"word":"REFRIGERATED","idx":26159,"count":1009532,"meanings":[{"definitions":[{"definition":"To cool down, make cool."},{"definition":"Now specifically, to keep cool by containing within a refrigerator.","example":"Please refrigerate your uncooked meats at or below 40° Fahrenheit."}],"partOfSpeech":"ve"}]},{"word":"CROUCH","idx":26160,"count":1009495,"meanings":[{"definitions":[{"definition":"A bent or stooped position.","example":"The cat waited in a crouch, hidden behind the hedge."},{"definition":"A cross."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bend down; to stoop low; to stand close to the ground with legs bent, like an animal when waiting for prey, or someone in fear.","example":"We crouched behind the low wall until the squad of soldiers had passed by."},{"definition":"To bend servilely; to bow in reverence or humility."},{"definition":"To sign with the cross; bless."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crouch-uk","text":"/kɹaʊt͡ʃ/"}]},{"word":"PENCE","idx":26162,"count":1009358,"meanings":[{"definitions":[{"definition":"In the United Kingdom and Ireland, a copper coin worth 1/240 of a pound sterling or Irish pound before decimalisation. Abbreviation: d."},{"definition":"In the United Kingdom, a copper coin worth 1/100 of a pound sterling. Abbreviation: p."},{"definition":"In Ireland, a coin worth 1/100 of an Irish pound before the introduction of the euro. Abbreviation: p."},{"definition":"In the US and Canada, a one-cent coin, worth 1/100 of a dollar. Abbreviation: ¢."},{"definition":"In various countries, a small-denomination copper or brass coin."},{"definition":"A unit of nail size, said to be either the cost per 100 nails, or the number of nails per penny. Abbreviation: d."},{"definition":"Money in general.","example":"to turn an honest penny"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pence-uk"},{"text":"/pəns/"}]},{"word":"FORMULATING","idx":26163,"count":1009335,"meanings":[{"definitions":[{"definition":"To reduce to, or express in, a formula; to put in a clear and definite form of statement or expression."}],"partOfSpeech":"ve"}]},{"word":"LAMENTATIONS","idx":26164,"count":1009331,"meanings":[{"definitions":[{"definition":"The act of lamenting."},{"definition":"A sorrowful cry; a lament."},{"definition":"Specifically, mourning."},{"definition":"Lamentatio, (part of) a liturgical Bible text (from the book of Job) and its musical settings, usually in the plural; hence, any dirge"},{"definition":"A group of swans."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌlæm.ənˈteɪ.ʃənz/"}]},{"word":"PLACID","idx":26165,"count":1009328,"meanings":[{"definitions":[{"definition":"Calm and quiet; peaceful; tranquil","example":"a placid disposition"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"placid-us"},{"text":"/ˈplæs.ɪd/"}]},{"word":"NAPKIN","idx":26166,"count":1009290,"meanings":[{"definitions":[{"definition":"A serviette; a (usually rectangular) piece of cloth or paper used at the table for wiping the mouth and hands for cleanliness while eating."},{"definition":"A nappy (UK), a diaper (American)."},{"definition":"A small scarf worn on the head by Christian women (chiefly Roman Catholic and Eastern Orthodox) when entering a church, as a token of modesty."},{"definition":"A sanitary napkin."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnæp.kɪn/"}]},{"word":"CONTAGIOUS","idx":26168,"count":1009095,"meanings":[{"definitions":[{"definition":"(of a disease) Easily transmitted to others.","example":"The flu was so contagious that everybody in town got sick!"},{"definition":"Easily passed on to others.","example":"Wearing jeans was a contagious fad at that time."},{"definition":"(of a person) Having a disease that can be transmitted to another person.","example":"They were highly contagious, spreading bacteria to other people."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kənˈteɪdʒəs/"}]},{"word":"INACCESSIBLE","idx":26170,"count":1009035,"meanings":[{"definitions":[{"definition":"An uncountable regular cardinal number that is a limit cardinal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not able to be accessed; out of reach; inconvenient."},{"definition":"Not able to be reached; unattainable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"inaccessible-us"}]},{"word":"ADMINISTERS","idx":26172,"count":1008968,"meanings":[{"definitions":[{"definition":"To cause to ingest (a drug), either by openly offering or through deceit.","example":"We administered the medicine to our dog by mixing it in his food."},{"definition":"To apportion out, distribute."},{"definition":"To manage or supervise the conduct, performance or execution of; to govern or regulate the parameters for the conduct, performance or execution of; to work in an administrative capacity."},{"definition":"To minister (to).","example":"administering to the sick"},{"definition":"To settle, as the estate of one who dies without a will, or whose will fails of an executor."},{"definition":"To give, as an oath."},{"definition":"To give a drug to a patient, be it orally or by any other means."}],"partOfSpeech":"ve"}]},{"word":"GRADIENTS","idx":26173,"count":1008871,"meanings":[{"definitions":[{"definition":"A slope or incline."},{"definition":"A rate of inclination or declination of a slope."},{"definition":"Of a function y = f(x) or the graph of such a function, the rate of change of y with respect to x that is, the amount by which y changes for a certain (often unit) change in x equivalently, the inclination to the X axis of the tangent to the curve of the graph."},{"definition":"The rate at which a physical quantity increases or decreases relative to change in a given variable, especially distance."},{"definition":"A differential operator that maps each point of a scalar field to a vector pointed in the direction of the greatest rate of change of the scalar. Notation for a scalar field φ: ∇φ"},{"definition":"A gradual change in color. A color gradient; gradation."}],"partOfSpeech":"n"}]},{"word":"CONSPICUOUS","idx":26175,"count":1008714,"meanings":[{"definitions":[{"definition":"Obvious or easy to notice.","example":"He was conspicuous by his absence."},{"definition":"Noticeable or attracting attention, especially if unattractive.","example":"He had a conspicuous lump on his forehead."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"conspicuous-us","text":"/kənˈspɪk.ju.əs/"}]},{"word":"BARBARIAN","idx":26176,"count":1008628,"meanings":[{"definitions":[{"definition":"A non-Greek or a non-Roman."},{"definition":"An uncivilized or uncultured person, originally compared to the hellenistic Greco-Roman civilisation; often associated with fighting or other such shows of strength."},{"definition":"Someone from a developing country or backward culture."},{"definition":"A warrior, clad in fur or leather, associated with sword and sorcery stories."},{"definition":"A person destitute of culture; a Philistine."},{"definition":"A cruel, savage, brutal person; one without pity or humanity."},{"definition":"A foreigner, especially with barbaric qualities as in the above definitions."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to people, countries or customs perceived as uncivilized or inferior."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"barbarian-us","text":"/bɑɹ.ˈbɛəɹ.i.ən/"}]},{"word":"RITALIN","idx":26177,"count":1008626,"meanings":[{"definitions":[{"definition":"Methylphenidate, used to treat attention deficit hyperactivity disorder"}],"partOfSpeech":"pn"}]},{"word":"RETRIEVES","idx":26178,"count":1008622,"meanings":[{"definitions":[{"definition":"To regain or get back something.","example":"to retrieve one's character or independence; to retrieve a thrown ball"},{"definition":"To rescue (a creature)."},{"definition":"To salvage something"},{"definition":"To remedy or rectify something."},{"definition":"To remember or recall something."},{"definition":"To fetch or carry back something."},{"definition":"To fetch and bring in game.","example":"The cook doesn't care what's shot, only what's actually retrieved."},{"definition":"To fetch and bring in game systematically.","example":"Dog breeds called 'retrievers' were selected for retrieving."},{"definition":"To fetch or carry back systematically, notably as a game.","example":"Most dogs love retrieving, regardless of what object is thrown."},{"definition":"To make a difficult but successful return of the ball."},{"definition":"To remedy the evil consequence of, to repair (a loss or damage)."}],"partOfSpeech":"ve"}]},{"word":"SOAKING","idx":26179,"count":1008618,"meanings":[{"definitions":[{"definition":"To be saturated with liquid by being immersed in it.","example":"I'm going to soak in the bath for a couple of hours."},{"definition":"To immerse in liquid to the point of saturation or thorough permeation.","example":"Soak the beans overnight before cooking."},{"definition":"To penetrate or permeate by saturation.","example":"The water soaked into my shoes and gave me wet feet."},{"definition":"To allow (especially a liquid) to be absorbed; to take in, receive. (usually + up)","example":"A sponge soaks up water; the skin soaks in moisture."},{"definition":"To take money from."},{"definition":"To drink intemperately or gluttonously."},{"definition":"To heat (a metal) before shaping it."},{"definition":"To hold a kiln at a particular temperature for a given period of time.","example":"We should soak the kiln at cone 9 for half an hour."},{"definition":"To absorb; to drain."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Immersion in water; a drenching or dunking."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Extremely wet; saturated."}],"partOfSpeech":"j"}]},{"word":"FERROUS","idx":26180,"count":1008569,"meanings":[{"definitions":[{"definition":"Of or containing iron."},{"definition":"Of compounds of iron in which it has a valence or oxidation number of 2."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfɛɹəs/"}]},{"word":"REFORMING","idx":26182,"count":1008318,"meanings":[{"definitions":[{"definition":"To put into a new and improved form or condition; to restore to a former good state, or bring from bad to good; to change from worse to better","example":"1909, H. G. Wells, The History of Mr. Polly Chapter 9"},{"definition":"To return to a good state; to amend or correct one's own character or habits","example":"It is hoped that many criminals, upon being freed, will eventually reform."},{"definition":"To form again or in a new configuration.","example":"The regiment reformed after surviving the first attack."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Reformation"},{"definition":"A catalytic process, whereby short-chain molecules are combined to make larger ones; used in the petrochemical industry."}],"partOfSpeech":"n"}]},{"word":"GAR","idx":26183,"count":1008289,"meanings":[{"definitions":[{"definition":"A spear."},{"definition":"Any of several North American fish of the family Lepisosteidae that have long, narrow jaws."},{"definition":"A garfish, Belone belone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make, compel (someone to do something); to cause (something to be done)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɑɹ/"},{"text":"/ɡɑː/"}]},{"word":"INTRUSIVE","idx":26184,"count":1008177,"meanings":[{"definitions":[{"definition":"An igneous rock that is forced, while molten, into cracks or between other layers of rock"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Tending to intrude; doing that which is not welcome; interrupting or disturbing; entering without permission or welcome.","example":"Did it ever cross your mind that he might find all those questions you ask intrusive?"},{"definition":"Of rocks: forced, while in a plastic or molten state, into the cavities or between the cracks or layers of other rocks."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"intrusive-us","text":"/ɪnˈtɹuːsɪv/"}]},{"word":"THYME","idx":26185,"count":1007823,"meanings":[{"definitions":[{"definition":"Any plant of the labiate genus Thymus, such as the garden thyme, Thymus vulgaris, a warm, pungent aromatic, that is much used to give a relish to seasoning and soups."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/taɪm/"}]},{"word":"PARASITIC","idx":26186,"count":1007800,"meanings":[{"definitions":[{"definition":"A component of a circuit that does not show up in a circuit's schematic but does show up in the circuit's behavior."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to a biological or symbolic parasite."},{"definition":"Drawing upon another organism for sustenance."},{"definition":"Exploiting another for personal gain."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"parasitic-us","text":"/pɛɹ.əˈsɪt.ɪk/"}]},{"word":"ZILLION","idx":26187,"count":1007700,"meanings":[{"definitions":[{"definition":"An unspecified large number (of); a gazillion."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"zillion-uk","text":"/ˈzɪljən/"}]},{"word":"CHINO","idx":26188,"count":1007675,"meanings":[{"definitions":[{"definition":"A coarse cotton fabric commonly used to make trousers and uniforms."}],"partOfSpeech":"n"}]},{"word":"ABUSING","idx":26190,"count":1007630,"meanings":[{"definitions":[{"definition":"To put to a wrong use; to misapply; to use improperly; to misuse; to use for a wrong purpose or end; to pervert","example":"He abused his authority."},{"definition":"To injure; to maltreat; to hurt; to treat with cruelty, especially repeatedly."},{"definition":"To attack with coarse language; to insult; to revile; malign; to speak in an offensive manner to or about someone; to disparage."},{"definition":"To imbibe a drug for a purpose other than it was intended; to intentionally take more of a drug than was prescribed for recreational reasons; to take illegal drugs habitually."},{"definition":"To violate; defile; to rape."},{"definition":"Misrepresent; adulterate."},{"definition":"To deceive; to trick; to impose on; misuse the confidence of."},{"definition":"Disuse."}],"partOfSpeech":"ve"}]},{"word":"CAVEAT","idx":26191,"count":1007458,"meanings":[{"definitions":[{"definition":"A warning.","example":"There is at least one caveat in cultivation: you’ll have to stick to only one discipline, such as that according to Bhaiṣajyaguru, the Medicine Buddha."},{"definition":"A qualification or exemption.","example":"He gave his daughter some hyacinth bulbs with the caveat that she plant them in the shade."},{"definition":"A formal objection."},{"definition":"A notice requesting a postponement of a court proceeding."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To qualify a statement with a caveat or proviso."},{"definition":"To formally object to something."},{"definition":"To issue a notice requesting that proceedings be suspended."},{"definition":"To warn or caution against some event."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"caveat-us","text":"/-æt/"},{"audio":"caveat-uk","text":"/ˈkeɪ-/"}]},{"word":"GANGBANGS","idx":26192,"count":1007384,"meanings":[{"definitions":[{"definition":"Sexual intercourse involving more than two persons, especially with a high proportion of men."},{"definition":"Gang rape."},{"definition":"The act of a street gang attacking random people on the streets and/or committing gang crimes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To participate in a gangbang.","example":"We all got to gangbang the porn star."},{"definition":"To beat one or a smaller amount of people as a gang."},{"definition":"To belong to a gang; to commit criminal acts as part of a gang.","example":"It broke my heart to see him out there gangbanging."}],"partOfSpeech":"ve"}]},{"word":"RECEPTIVE","idx":26193,"count":1007362,"meanings":[{"definitions":[{"definition":"Capable of receiving something"},{"definition":"Ready to receive new ideas or concepts"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"receptive-uk","text":"/ɹɪˈsɛptɪv/"}]},{"word":"TOILETRIES","idx":26194,"count":1007260,"meanings":[{"definitions":[{"definition":"Any item used for personal hygiene or grooming."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"toiletries-us"}]},{"word":"BEDROCK","idx":26195,"count":1007239,"meanings":[{"definitions":[{"definition":"The solid rock that exists at some depth below the ground surface. Bedrock is rock \"in place\", as opposed to material that has been transported from another location by weathering and erosion."},{"definition":"A basis or foundation.","example":"If culture is the bedrock of a society, then language is the cornerstone of culture."}],"partOfSpeech":"n"}]},{"word":"CAPT","idx":26196,"count":1007164,"meanings":[{"definitions":[{"definition":"A chief or leader."},{"definition":"The person lawfully in command of a ship or other vessel.","example":"The captain is the last man to leave a sinking ship."},{"definition":"An army officer with a rank between the most senior grade of lieutenant and major."},{"definition":"A naval officer with a rank between commander and commodore."},{"definition":"A commissioned officer in the United States Navy, Coast Guard, NOAA Corps, or PHS Corps of a grade superior to a commander and junior to a rear admiral (lower half). A captain is equal in grade or rank to an Army, Marine Corps, or Air Force colonel."},{"definition":"One of the athletes on a sports team who is designated to make decisions, and is allowed to speak for his team with a referee or official."},{"definition":"The leader of a group of workers.","example":"John Henry said to the captain, \"A man ain't nothing but a man.\""},{"definition":"The head boy of a school."},{"definition":"A maître d', a headwaiter."},{"definition":"An honorific title given to a prominent person. See colonel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or seal with a cap."},{"definition":"To award a cap as a mark of distinction."},{"definition":"To lie over or on top of something."},{"definition":"To surpass or outdo."},{"definition":"To set an upper limit on something.","example":"cap wages."},{"definition":"To make something even more wonderful at the end.","example":"That really capped my day."},{"definition":"To select a player to play for a specified side."},{"definition":"To shoot (someone) with a firearm.","example":"In a school shooting, where some kid caps a bunch of other kids, where did he get the weapon? From a family member, probably their gun cabinet."},{"definition":"To select to play for the national team.","example":"Peter Shilton is the most capped English footballer."},{"definition":"To salute by uncovering the head respectfully."},{"definition":"To deprive of a cap."},{"definition":"To tell a lie."},{"definition":"To convert text to uppercase."},{"definition":"To take a screenshot or to record a copy of a video."}],"partOfSpeech":"ve"}]},{"word":"ZINES","idx":26200,"count":1006514,"meanings":[{"definitions":[{"definition":"A low-circulation, non-commercial publication of original or appropriated texts and images, especially one of minority interest."}],"partOfSpeech":"n"}]},{"word":"MUSK","idx":26203,"count":1006200,"meanings":[{"definitions":[{"definition":"A greasy secretion with a powerful odour, produced in a glandular sac of the male musk deer and used in the manufacture of perfumes."},{"definition":"A similar secretion produced by the otter and the civet."},{"definition":"A synthetic organic compound used as a substitute for the above."},{"definition":"The odour of musk."},{"definition":"The musk deer (genus Moschus)."},{"definition":"The musk plant (Mimulus moschatus)."},{"definition":"A plant of the genus Erodium (Erodium moschatum); the musky heronsbill."},{"definition":"A plant of the genus Muscari; grape hyacinth."},{"definition":"The scent of human genitalia when aroused or unwashed.","example":"I was so excited I could smell my own musk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perfume with musk."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/mʌsk/"},{"audio":"musk-au"}]},{"word":"EXECUTIONS","idx":26205,"count":1006127,"meanings":[{"definitions":[{"definition":"The act, manner or style of executing (actions, maneuvers, performances)."},{"definition":"The state of being accomplished.","example":"The mission's successful execution lifted the troops' morale."},{"definition":"The act of putting to death or being put to death as a penalty, or actions so associated."},{"definition":"The carrying into effect of a court judgment, or of a will."},{"definition":"The formal process by which a contract is made valid and put into binding effect."},{"definition":"The carrying out of an instruction, program or program segment by a computer.","example":"The entire machine slowed down during the execution of the virus checker."}],"partOfSpeech":"n"}]},{"word":"FORKLIFT","idx":26206,"count":1006085,"meanings":[{"definitions":[{"definition":"A small industrial vehicle with a power-operated fork-like pronged platform that can be raised and lowered for insertion under a load, often on pallets, to be lifted and moved"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move or stack with, or as if with, such a vehicle."}],"partOfSpeech":"ve"}]},{"word":"REFRESHED","idx":26207,"count":1005937,"meanings":[{"definitions":[{"definition":"To renew or revitalize.","example":"Sleep refreshes the body and the mind."},{"definition":"To become fresh again; to be revitalized."},{"definition":"To reload (a document, especially a webpage) and show any new changes."},{"definition":"To cause (a web browser or similar software) to refresh its display."},{"definition":"To perform the periodic energizing required to maintain the contents of computer memory, the display luminance of a computer screen, etc."},{"definition":"To take refreshment; to eat or drink."}],"partOfSpeech":"ve"}]},{"word":"GUARDING","idx":26208,"count":1005862,"meanings":[{"definitions":[{"definition":"To protect from danger; to secure against surprise, attack, or injury; to keep in safety; to defend."},{"definition":"To keep watch over, in order to prevent escape or restrain from acts of violence, or the like.","example":"Guard the prisoner."},{"definition":"To watch by way of caution or defense; to be caution; to be in a state or position of defense or safety.","example":"Careful people guard against mistakes."},{"definition":"To protect the edge of, especially with an ornamental border; hence, to face or ornament with lists, laces, etc."},{"definition":"To fasten by binding; to gird."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Tensing of the muscles, especially of the abdomen, in order to minimise the movement and agitation to the internal inflamed organs."}],"partOfSpeech":"n"}]},{"word":"REPURCHASE","idx":26209,"count":1005668,"meanings":[{"definitions":[{"definition":"The act of repurchasing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To buy back or again; to regain by purchase."}],"partOfSpeech":"ve"}]},{"word":"WINDMILL","idx":26211,"count":1005542,"meanings":[{"definitions":[{"definition":"A machine which translates linear motion of wind to rotational motion by means of adjustable vanes called sails."},{"definition":"The structure containing such machinery."},{"definition":"A child's toy consisting of vanes mounted on a stick that rotate when blown by a person or by the wind."},{"definition":"A dunk where the dunker swings his arm in a circular motion before throwing the ball through the hoop."},{"definition":"A guitar move where the strumming hand mimics a turning windmill."},{"definition":"A breakdancing move in which the dancer rolls his/her torso continuously in a circular path on the floor, across the upper chest, shoulders and back, while twirling the legs in a V shape in the air."},{"definition":"Any of various large papilionid butterflies of the genus Byasa, the wings of which resemble the vanes of a windmill."},{"definition":"The false shower."},{"definition":"An imaginary enemy, but presented as real."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rotate with a sweeping motion.","example":"She ran down the hill, windmilling her arms with glee."},{"definition":"Of a rotating part of a machine, to (become disengaged and) rotate freely.","example":"The axle broke and the wheel windmilled in place briefly before careening through the wall."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"windmill-us","text":"/ˈwɪnd.mɪl/"}]},{"word":"ORTHOPEDICS","idx":26212,"count":1005337,"meanings":[{"definitions":[{"definition":"The branch of medicine that deals with the prevention or correction of disorders of the bones and associated muscles and joints"}],"partOfSpeech":"n"}]},{"word":"LICE","idx":26214,"count":1005234,"meanings":[{"definitions":[{"definition":"A small parasitic wingless insect of the order Psocodea."},{"definition":"(not usually used in plural form) A contemptible person; one who is deceitful or causes harm."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lice-uk","text":"/laɪs/"}]},{"word":"BADGERS","idx":26218,"count":1004989,"meanings":[{"definitions":[{"definition":"Any mammal of three subfamilies, which belong to the family Mustelidae: Melinae (Eurasian badgers), Mellivorinae (ratel or honey badger), and Taxideinae (American badger)."},{"definition":"A native or resident of the American state, Wisconsin."},{"definition":"A brush made of badger hair."},{"definition":"(in the plural) A crew of desperate villains who robbed near rivers, into which they threw the bodies of those they murdered."},{"definition":"An itinerant licensed dealer in commodities used for food; a hawker; a huckster; -- formerly applied especially to one who bought grain in one place and sold it in another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pester, to annoy persistently; press.","example":"He kept badgering her about her bad habits."},{"definition":"To pass gas; to fart."}],"partOfSpeech":"ve"}]},{"word":"GARTER","idx":26220,"count":1004872,"meanings":[{"definitions":[{"definition":"A band worn around the leg to hold up a sock or stocking."},{"definition":"A bendlet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten with a garter"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɡɑːɹtɚ/"},{"text":"/ˈɡɑːtə/"}]},{"word":"APPETIZER","idx":26222,"count":1004806,"meanings":[{"definitions":[{"definition":"A small, light, and usually savory first course in a meal"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"appetizer-us"}]},{"word":"DISBURSEMENT","idx":26223,"count":1004750,"meanings":[{"definitions":[{"definition":"The act, instance, or process of disbursing."},{"definition":"Money paid out or spent."}],"partOfSpeech":"n"}]},{"word":"TELEMETRY","idx":26225,"count":1004563,"meanings":[{"definitions":[{"definition":"(applied sciences) the science, and associated technology, of the automatic recording and transmission of data from a remote source to a receiving station for analysis"}],"partOfSpeech":"n"}]},{"word":"FOOTED","idx":26226,"count":1004559,"meanings":[{"definitions":[{"definition":"To use the foot to kick (usually a ball)."},{"definition":"To pay (a bill)."},{"definition":"To tread to measure or music; to dance; to trip; to skip."},{"definition":"To walk."},{"definition":"To tread.","example":"to foot the green"},{"definition":"To set on foot; to establish; to land."},{"definition":"To renew the foot of (a stocking, etc.)."},{"definition":"To sum up, as the numbers in a column; sometimes with up.","example":"to foot (or foot up) an account"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in combination) Having a specified form or type of foot or number of feet."},{"definition":"(usually in combination) Consisting of, or having been put into, metrical feet (of a specified character or number).","example":"each six-footed line of the verse"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfʊtɪd/"}]},{"word":"DEDICATE","idx":26227,"count":1004266,"meanings":[{"definitions":[{"definition":"To set apart for a deity or for religious purposes; consecrate."},{"definition":"To set apart for a special use","example":"dedicated their money to scientific research."},{"definition":"To commit (oneself) to a particular course of thought or action","example":"dedicated ourselves to starting our own business."},{"definition":"To address or inscribe (a literary work, for example) to another as a mark of respect or affection."},{"definition":"To open (a building, for example) to public use."},{"definition":"To show to the public for the first time","example":"dedicate a monument."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Dedicated; set apart; devoted; consecrated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"dedicate-uk","text":"/ˈdɛdɪkeɪt/"}]},{"word":"RENEWING","idx":26229,"count":1004115,"meanings":[{"definitions":[{"definition":"To make (something) new again; to restore to freshness or original condition."},{"definition":"To replace (something which has broken etc.); to replenish (something which has been exhausted), to keep up a required supply of."},{"definition":"To make new spiritually; to regenerate."},{"definition":"To become new, or as new; to revive."},{"definition":"To begin again; to recommence."},{"definition":"To repeat."},{"definition":"To extend a period of loan, especially a library book that is due to be returned.","example":"I'd like to renew these three books.  Did you know that you can renew online?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A renewal."}],"partOfSpeech":"n"}]},{"word":"CONSUMABLE","idx":26231,"count":1004056,"meanings":[{"definitions":[{"definition":"A material or product that is produced for consumption.","example":"printer consumables such as toner and ink cartridges"}],"partOfSpeech":"n"},{"definitions":[{"definition":"That is consumed or depleted upon use."},{"definition":"That may be eaten."}],"partOfSpeech":"j"}]},{"word":"DEPRESSIVE","idx":26234,"count":1003641,"meanings":[{"definitions":[{"definition":"A person suffering from depression."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing depression; dispiriting."},{"definition":"Affected by depression, depressed; dispirited; melancholic."},{"definition":"Relating to or characteristic of depression."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈpɹɛsɪv/"}]},{"word":"STABILIZER","idx":26235,"count":1003521,"meanings":[{"definitions":[{"definition":"Any person or thing that brings stability."},{"definition":"Any substance added to something in order to stabilize it."},{"definition":"A gyroscopically controlled fin or similar device that prevents the excess rolling of a ship in rough seas."},{"definition":"An airfoil that stabilizes the flight of an aircraft or missile."},{"definition":"A piece of backing fabric used in embroidery."}],"partOfSpeech":"n"}]},{"word":"SKIM","idx":26236,"count":1003327,"meanings":[{"definitions":[{"definition":"A cursory reading, skipping the details."},{"definition":"Skim milk."},{"definition":"The act of skimming."},{"definition":"That which is skimmed off."},{"definition":"Theft of money from a business before the transaction has been recorded, thus avoiding detection."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pass lightly; to glide along in an even, smooth course; to glide along near the surface."},{"definition":"To pass near the surface of; to brush the surface of; to glide swiftly along the surface of."},{"definition":"To hasten along with superficial attention."},{"definition":"To put on a finishing coat of plaster."},{"definition":"To throw an object so it bounces on water (skimming stones)"},{"definition":"To ricochet"},{"definition":"To read quickly, skipping some detail","example":"I skimmed the newspaper over breakfast."},{"definition":"To scrape off; to remove (something) from a surface"},{"definition":"To clear (a liquid) from scum or substance floating or lying on it, by means of a utensil that passes just beneath the surface.","example":"to skim milk; to skim broth"},{"definition":"To clear a liquid from (scum or substance floating or lying on it), especially the cream that floats on top of fresh milk","example":"to skim cream"},{"definition":"To steal money from a business before the transaction has been recorded, thus avoiding detection."},{"definition":"To surreptitiously scan a payment card in order to obtain its information for fraudulent purposes."},{"definition":"To become coated over."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of milk) Having lowered fat content."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"skim-uk","text":"/skɪm/"}]},{"word":"TOUCHE","idx":26237,"count":1003271,"meanings":[{"definitions":[{"definition":"An acknowledgement of a hit."},{"definition":"An acknowledgement of the validity, appropriateness or superiority of an opponent's argument or statement in a discussion."}],"partOfSpeech":"i"}]},{"word":"OVARY","idx":26238,"count":1003163,"meanings":[{"definitions":[{"definition":"A female reproductive organ, often paired, that produces ova and in mammals secretes the hormones estrogen and progesterone.","example":"The male testicles are homologous to the female ovaries."},{"definition":"The lower part of a pistil or carpel that bears ovules and ripens into fruit."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈoʊvəɹi/"},{"text":"/ˈəʊvəɹi/"}]},{"word":"RUNE","idx":26239,"count":1003149,"meanings":[{"definitions":[{"definition":"A letter, or character, belonging to the written language of various ancient Germanic peoples, especially the Scandinavians and the Anglo-Saxons."},{"definition":"A Finnish or Scandinavian epic poem, or a division of one, especially a division of the Kalevala."},{"definition":"A letter or mark used as mystical or magic symbol."},{"definition":"A verse or song, especially one with mystical or mysterious overtones; a spell or an incantation."},{"definition":"A roun (secret or mystery)."},{"definition":"In the Go programming language, a Unicode code point."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rune-us","text":"/ɹuːn/"}]},{"word":"WELT","idx":26240,"count":1003072,"meanings":[{"definitions":[{"definition":"To roll; revolve"},{"definition":"To cause to have welts, to beat."},{"definition":"To install welt (a welt or welts) to reinforce."},{"definition":"To decay."},{"definition":"To become stringy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A ridge or lump on the skin, as caused by a blow; a wheal or weal."},{"definition":"(shoemaking) A strip of leather set into the seam between the outsole of a shoe and the upper, through which these parts are joined by stitching or stapling."},{"definition":"A strip of material or covered cord applied to a seam or garment edge to strengthen or cover it."},{"definition":"In steam boilers and sheet-iron work, a strip riveted upon the edges of plates that form a butt joint."},{"definition":"In carpentry, a strip of wood fastened over a flush seam or joint, or an angle, to strengthen it."},{"definition":"In machine-made stockings, a strip, or flap, of which the heel is formed."},{"definition":"A narrow border, as of an ordinary, but not extending around the ends."},{"definition":"A feature resembling a welt."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/wɛlt/"}]},{"word":"ACCRUAL","idx":26241,"count":1003020,"meanings":[{"definitions":[{"definition":"An increase; something that accumulates, especially an amount of money that periodically accumulates for a specific purpose"},{"definition":"From the creditor's viewpoint, a charge incurred in one accounting period that has not been, but is to be, paid by the end of it."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈkɹuːəl/"}]},{"word":"VEAL","idx":26242,"count":1002995,"meanings":[{"definitions":[{"definition":"The flesh of a calf (i.e. a young bovine) used for food."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"veal-us","text":"/viːl/"}]},{"word":"PERPETRATORS","idx":26243,"count":1002937,"meanings":[{"definitions":[{"definition":"One who perpetrates; especially, one who commits an offence or crime."}],"partOfSpeech":"n"}]},{"word":"CREATIVELY","idx":26244,"count":1002822,"meanings":[{"definitions":[{"definition":"In a creative manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/-ɾəv-/"},{"text":"/kɹiˈeɪtɪvli/"}]},{"word":"EMBARKED","idx":26245,"count":1002730,"meanings":[{"definitions":[{"definition":"To get on a boat or ship or (outside the USA) an aeroplane.","example":"All passengers please embark now."},{"definition":"To start, begin.","example":"Phil embarked on his journey yesterday."},{"definition":"To cause to go on board a vessel or boat; to put on shipboard."},{"definition":"To engage, enlist, or invest (as persons, money, etc.) in any affair.","example":"He embarked his fortune in trade."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɛmˈbɑɹkt/"},{"text":"/ɛmˈbɑːkt/"},{"text":"/emˈbaːkt/"}]},{"word":"QUICKEST","idx":26246,"count":1002715,"meanings":[{"definitions":[{"definition":"Moving with speed, rapidity or swiftness, or capable of doing so; rapid; fast.","example":"He's a quick runner."},{"definition":"Occurring in a short time; happening or done rapidly.","example":"That was a quick meal."},{"definition":"Lively, fast-thinking, witty, intelligent.","example":"You have to be very quick to be able to compete in ad-lib theatrics."},{"definition":"Mentally agile, alert, perceptive.","example":"My father is old but he still has a quick wit."},{"definition":"Of temper: easily aroused to anger; quick-tempered.","example":"He is wont to be rather quick of temper when tired."},{"definition":"Alive, living."},{"definition":"Pregnant, especially at the stage where the foetus's movements can be felt; figuratively, alive with some emotion or feeling."},{"definition":"Of water: flowing."},{"definition":"Burning, flammable, fiery."},{"definition":"Fresh; bracing; sharp; keen."},{"definition":"(of a vein of ore) productive; not \"dead\" or barren"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"quickest"}]},{"word":"TREMENDOUSLY","idx":26248,"count":1002541,"meanings":[{"definitions":[{"definition":"Greatly; enormously","example":"I enjoyed the performance tremendously."}],"partOfSpeech":"v"}]},{"word":"SMASHED","idx":26250,"count":1002472,"meanings":[{"definitions":[{"definition":"To break (something brittle) violently.","example":"The demolition team smashed the buildings to rubble."},{"definition":"To be destroyed by being smashed.","example":"The crockery smashed as it hit the floor."},{"definition":"To hit extremely hard.","example":"Bonds smashed the ball 467 feet, the second longest home run in the history of the park."},{"definition":"To ruin completely and suddenly.","example":"The news smashed any hopes of a reunion."},{"definition":"To defeat overwhelmingly; to gain a comprehensive success.","example":"I really smashed that English exam."},{"definition":"To deform through continuous pressure.","example":"I slowly smashed the modeling clay flat with the palm of my hand."},{"definition":"To have sexual intercourse with.","example":"Would you smash her?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Drunk.","example":"I was so smashed last night, I don’t remember how I got home!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"smashed-us","text":"/smæʃt/"}]},{"word":"OSCILLATION","idx":26253,"count":1002305,"meanings":[{"definitions":[{"definition":"The act of oscillating or the state of being oscillated"},{"definition":"A regular periodic fluctuation in value about some mean"},{"definition":"A single such cycle"},{"definition":"(of a function) defined for each point x in the domain of the function by \\inf\\left\\{\\mathrm{diam}(f(U))\\mid U\\mathrm{\\ is\\ a\\ neighborhood\\ of\\ }x\\right\\}, and describes the difference (possibly ∞) between the limit superior and limit inferior of the function near that point."}],"partOfSpeech":"n"}]},{"word":"INTERFAITH","idx":26254,"count":1002146,"meanings":[{"definitions":[{"definition":"Involving members of different religions.","example":"The interfaith service had Jews, Roman Catholics and Lutherans all in attendance."}],"partOfSpeech":"j"}]},{"word":"CAY","idx":26255,"count":1002108,"meanings":[{"definitions":[{"definition":"A small, low island largely made of sand or coral."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/keɪ/"}]},{"word":"AUTOMATA","idx":26256,"count":1002091,"meanings":[{"definitions":[{"definition":"A machine or robot designed to follow a precise sequence of instructions."},{"definition":"A person who acts like a machine or robot, often defined as having a monotonous lifestyle and lacking in emotion.","example":"Due to her strict adherence to her daily schedule, Jessica was becoming more and more convinced that she was an automaton."},{"definition":"A formal system, such as finite automaton."},{"definition":"A toy in the form of a mechanical figure."},{"definition":"The self-acting power of the muscular and nervous systems, by which movement is effected without intelligent determination."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɔːˈtɒməˌtə/"}]},{"word":"THUNDERSTORM","idx":26258,"count":1002030,"meanings":[{"definitions":[{"definition":"A storm consisting of thunder and lightning produced by a cumulonimbus, usually accompanied with heavy rain, wind, and sometimes hail; and in rarer cases sleet, freezing rain, or snow."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"thunderstorm-ca","text":"/ˈθʌn.də(ɹ)ˌstɔː(ɹ)m/"}]},{"word":"PAYERS","idx":26259,"count":1002028,"meanings":[{"definitions":[{"definition":"One who pays; specifically, the person by whom a bill or note has been, or should be, paid."},{"definition":"A swaption which gives its holder the option to enter into a swap in which they pay the fixed leg and receive the floating leg."}],"partOfSpeech":"n"}]},{"word":"GRITTY","idx":26260,"count":1001983,"meanings":[{"definitions":[{"definition":"Containing sand or grit; consisting of grit; caused by grit; full of hard particles."},{"definition":"Spirited; resolute; unyielding."},{"definition":"Intense and starkly realistic; depicting harsh reality, especially violence."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɹɪti/"}]},{"word":"RETROSPECT","idx":26261,"count":1001979,"meanings":[{"definitions":[{"definition":"Consideration of past times."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To look or refer back to; to reflect on.","example":"1800: Alexander Hamilton, Letter from Alexander Hamilton, Concerning the Public Conduct and Character of John Adams, Esq. President of the United States - To give a correct idea of the circumstances.., it may be useful to retrospect to an early period."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɹɛtɹoˌspɛkt/"}]},{"word":"JOG","idx":26263,"count":1001808,"meanings":[{"definitions":[{"definition":"An energetic trot, slower than a run, often used as a form of exercise."},{"definition":"A sudden push or nudge."},{"definition":"A flat placed perpendicularly to break up a flat surface."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To push slightly; to move or shake with a push or jerk, as to gain the attention of; to jolt.","example":"jog one's elbow"},{"definition":"To shake, stir or rouse.","example":"I tried desperately to jog my memory."},{"definition":"To walk or ride forward with a jolting pace; to move at a heavy pace, trudge; to move on or along."},{"definition":"(exercise) To move at a pace between walking and running, to run at a leisurely pace."},{"definition":"To cause to move at an energetic trot.","example":"to jog a horse"},{"definition":"To straighten stacks of paper by lightly tapping against a flat surface."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jog-us","text":"/dʒɑɡ/"}]},{"word":"HAILED","idx":26264,"count":1001750,"meanings":[{"definitions":[{"definition":"Of hail, to fall from the sky.","example":"They say it's going to hail tomorrow."},{"definition":"To send or release hail.","example":"The cloud would hail down furiously within a few minutes."},{"definition":"To pour down in rapid succession."},{"definition":"To greet; give salutation to; salute."},{"definition":"To name; to designate; to call.","example":"He was hailed as a hero."},{"definition":"To call out loudly in order to gain the attention of","example":"Hail a taxi."},{"definition":"To signal in order to initiate communication with."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hailed-us","text":"/heɪld/"}]},{"word":"MIRACULOUS","idx":26266,"count":1001639,"meanings":[{"definitions":[{"definition":"By supernatural or uncommon causes, e.g. by a god; that cannot be explained in terms of normal events."},{"definition":"Very surprising; amazing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/məˈɹækjələs/"},{"text":"/məˈɹækjʊləs/"}]},{"word":"HOUNDS","idx":26267,"count":1001615,"meanings":[{"definitions":[{"definition":"A dog, particularly a breed with a good sense of smell developed for hunting other animals."},{"definition":"Any canine animal."},{"definition":"(by extension) Someone who seeks something."},{"definition":"(by extension) A male who constantly seeks the company of desirable women."},{"definition":"A despicable person."},{"definition":"A houndfish."},{"definition":"(in the plural) Projections at the masthead, serving as a support for the trestletrees and top to rest on."},{"definition":"A side bar used to strengthen portions of the running gear of a vehicle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To persistently harass.","example":"He hounded me for weeks, but I was simply unable to pay back his loan."},{"definition":"To urge on against; to set (dogs) upon in hunting."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hounds-us","text":"/haʊndz/"}]},{"word":"TIGHTENING","idx":26268,"count":1001614,"meanings":[{"definitions":[{"definition":"To make tighter.","example":"Please tighten that screw a quarter-turn."},{"definition":"To become tighter.","example":"That joint is tightening as the wood dries."},{"definition":"To make money harder to borrow or obtain.","example":"If the government doesn't tighten the money supply, inflation is certain to be harsh."},{"definition":"To raise short-term interest rates.","example":"The Fed is expected to tighten by a quarter-point."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process of making more tight."}],"partOfSpeech":"n"}]},{"word":"DRAINING","idx":26269,"count":1001566,"meanings":[{"definitions":[{"definition":"To lose liquid.","example":"The clogged sink drained slowly."},{"definition":"To flow gradually.","example":"The water of low ground drains off."},{"definition":"To cause liquid to flow out of.","example":"Please drain the sink. It's full of dirty water."},{"definition":"To convert a perennially wet place into a dry one.","example":"They had to drain the swampy land before the parking lot could be built."},{"definition":"To deplete of energy or resources.","example":"The stress of this job is really draining me."},{"definition":"To draw off by degrees; to cause to flow gradually out or off; hence, to exhaust."},{"definition":"To filter."},{"definition":"To fall off the bottom of the playfield."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The practice of exploring drains, tunnels, or sewers."},{"definition":"The process by which something is drained or emptied."},{"definition":"(usually in the plural) The liquid drained from something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That drains."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɹeɪnɪŋ/"}]},{"word":"PAROLES","idx":26272,"count":1001366,"meanings":[{"definitions":[{"definition":"The release of a former prisoner under condition of compliance with specific terms.","example":"He was released on parole."},{"definition":"The amount of time a former prisoner spends on limited release."},{"definition":"A word of honor, especially given by a prisoner of war, to not engage in combat if released."},{"definition":"Language in use, as opposed to language as a system."},{"definition":"(immigration law) The permission for a foreigner who does not meet the technical requirements for a visa to be allowed to enter the U.S. on humanitarian grounds."},{"definition":"A watchword given only to officers of guards; distinguished from the countersign, which is given to all guards."},{"definition":"An oral declaration; see parol."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To release (a prisoner) on the understanding that s/he checks in regularly and obeys the law."}],"partOfSpeech":"ve"}]},{"word":"SENSIBILITY","idx":26273,"count":1001279,"meanings":[{"definitions":[{"definition":"The ability to sense, feel or perceive; responsiveness to sensory stimuli; sensitivity."},{"definition":"Emotional or artistic awareness; keen sensitivity to matters of feeling or creative expression."},{"definition":"Excessive emotional awareness; the fact or quality of being overemotional."},{"definition":"(in the plural) An acute awareness or feeling.","example":"I apologize if I offended your sensibilities, but that's the truth of the matter."},{"definition":"The capacity to be perceived by the senses."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌsɛnsɪˈbɪlɪti/"}]},{"word":"RAGS","idx":26275,"count":1001167,"meanings":[{"definitions":[{"definition":"(in the plural) Tattered clothes."},{"definition":"A piece of old cloth; a tattered piece of cloth; a shred, a tatter."},{"definition":"A shabby, beggarly fellow; a ragamuffin."},{"definition":"A ragged edge in metalworking."},{"definition":"A sail, or any piece of canvas."},{"definition":"A newspaper, magazine."},{"definition":"A poor, low-ranking kicker.","example":"I have ace-four on my hand. In other words, I have ace-rag."},{"definition":"A coarse kind of rock, somewhat cellular in texture; ragstone."},{"definition":"A prank or practical joke."},{"definition":"A society run by university students for the purpose of charitable fundraising."},{"definition":"An informal dance party featuring music played by African-American string bands."},{"definition":"A ragtime song, dance or piece of music."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate (a wall, etc.) by applying paint with a rag."},{"definition":"To become tattered."},{"definition":"To break (ore) into lumps for sorting."},{"definition":"To cut or dress roughly, as a grindstone."},{"definition":"To scold or tell off; to torment; to banter."},{"definition":"To drive a car or another vehicle in a hard, fast or unsympathetic manner."},{"definition":"To tease or torment, especially at a university; to bully, to haze."},{"definition":"To play or compose (a piece, melody, etc.) in syncopated time."},{"definition":"To dance to ragtime music."},{"definition":"To add syncopation (to a tune) and thereby make it appropriate for a ragtime song."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rags-us","text":"/ɹæɡz/"}]},{"word":"REBORN","idx":26276,"count":1001079,"meanings":[{"definitions":[{"definition":"A manufactured vinyl doll that has been transformed to resemble a human baby with as much realism as possible."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Revived or regenerated, especially emotionally or spiritually."},{"definition":"Reincarnated."}],"partOfSpeech":"j"}]},{"word":"PUNCHING","idx":26278,"count":1000845,"meanings":[{"definitions":[{"definition":"To strike with one's fist.","example":"If she punches me, I'm gonna break her nose."},{"definition":"(of cattle) To herd."},{"definition":"To operate (a device or system) by depressing a button, key, bar, or pedal, or by similar means."},{"definition":"To enter (information) on a device or system."},{"definition":"To hit (a ball or similar object) with less than full force.","example":"He punched a hit into shallow left field."},{"definition":"To make holes in something (rail ticket, leather belt, etc)"},{"definition":"To thrust against; to poke.","example":"to punch one with the end of a stick or the elbow"},{"definition":"To employ a punch to create a hole in or stamp or emboss a mark on something."},{"definition":"To mark a ticket."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(gerund of punch) An incident in which someone is punched"},{"definition":"The process of making holes in something (rail ticket, leather belt, etc)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpʌntʃɪŋ/"}]},{"word":"DISTINGUISHES","idx":26280,"count":1000579,"meanings":[{"definitions":[{"definition":"To recognize someone or something as different from others based on its characteristics."},{"definition":"To see someone or something clearly or distinctly."},{"definition":"To make oneself noticeably different or better from others through accomplishments.","example":"The soldier distinguished himself in combat and received a medal."},{"definition":"To make to differ."}],"partOfSpeech":"ve"}]},{"word":"TREADMILLS","idx":26281,"count":1000577,"meanings":[{"definitions":[{"definition":"A piece of indoor sporting equipment used to allow for the motions of running or walking while staying in one place."},{"definition":"A mill worked by persons treading upon steps on the periphery of a wide wheel having a horizontal axis. It is used principally as a means of prison discipline."},{"definition":"A mill worked by horses, dogs, etc., treading an endless belt."}],"partOfSpeech":"n"}]},{"word":"POI","idx":26282,"count":1000422,"meanings":[{"definitions":[{"definition":"The traditional staple food of Hawaii, made by baking and pounding the kalo (or taro) root, and reducing it to a thin paste, which is allowed to ferment."},{"definition":"A creamy Samoan dessert of ripe bananas mashed with coconut cream."},{"definition":"A small ball made of leaves and fibres, attached to a string; also, a traditional dance performed by Maori women involving the rhythmic swinging of such a ball."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɔɪ/"}]},{"word":"BEBOP","idx":26283,"count":1000401,"meanings":[{"definitions":[{"definition":"An early form of modern jazz played by small groups and featuring driving rhythms and complex, often dissonant harmonies."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To participate in bebop jazz, such as by dancing in a way associated with the genre."},{"definition":"(usually with a directional preposition) To walk in an easygoing, carefree manner."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbiːbɒp/"}]},{"word":"STREAMLINING","idx":26284,"count":1000369,"meanings":[{"definitions":[{"definition":"To design and construct the contours of a vehicle etc. so as to offer the least resistance to its flow through a fluid."},{"definition":"(by extension) To simplify or organize a process in order to increase its efficiency."},{"definition":"To modernise."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is streamlined."}],"partOfSpeech":"n"}]},{"word":"DAZZLE","idx":26285,"count":1000224,"meanings":[{"definitions":[{"definition":"A light of dazzling brilliancy."},{"definition":"Showy brilliance that may stop a person from thinking clearly."},{"definition":"A herd of zebra."},{"definition":"Dazzle camouflage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To confuse the sight of by means of excessive brightness.","example":"Dazzled by the headlights of the lorry, the deer stopped in the middle of the street."},{"definition":"To render incapable of thinking clearly; to overwhelm with showiness or brilliance.","example":"The delegates were dazzled by the originality of his arguments."},{"definition":"To be overpowered by light; to be confused by excess of brightness."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dazzle-uk","text":"/ˈdæzəl/"}]},{"word":"SEEDING","idx":26287,"count":1000093,"meanings":[{"definitions":[{"definition":"To plant or sow an area with seeds.","example":"I seeded my lawn with bluegrass."},{"definition":"To cover thinly with something scattered; to ornament with seedlike decorations."},{"definition":"To start; to provide, assign or determine the initial resources for, position of, state of.","example":"A venture capitalist seeds young companies."},{"definition":"To allocate a seeding to a competitor."},{"definition":"To leave (files) available for others to download through peer-to-peer file sharing protocols (e.g. BitTorrent)."},{"definition":"To be qualified to compete, especially in a quarter-final, semi-final or final.","example":"The tennis player seeded into the quarters."},{"definition":"To produce seed."},{"definition":"To grow to maturity."},{"definition":"To ejaculate inside the penetratee during intercourse, especially in the rectum."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(games) The arrangement of positions in a tournament."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsiːdɪŋ/"}]},{"word":"INDUSTRIALIZED","idx":26289,"count":999879,"meanings":[{"definitions":[{"definition":"(of a country) To develop industry; to become industrial."},{"definition":"(of a process) To organize along industrial lines."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having undergone industrialization"}],"partOfSpeech":"j"}]},{"word":"DANGLE","idx":26290,"count":999852,"meanings":[{"definitions":[{"definition":"An agent of one intelligence agency or group who pretends to be interested in defecting or turning to another intelligence agency or group."},{"definition":"The action of dangling; a series of complex stick tricks and fakes in order to defeat the defender in style.","example":"That was a sick dangle for a great goal!"},{"definition":"A dangling ornament or decoration."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hang loosely with the ability to swing.","example":"His feet would dangle in the water."},{"definition":"The action of performing a move or deke with the puck in order to get past a defender or goalie; perhaps because of the resemblance to dangling the puck on a string.","example":"He dangled around three players and the goalie to score."},{"definition":"To hang or trail something loosely.","example":"I like to sit on the edge and dangle my feet in the water."},{"definition":"To trail or follow around."},{"definition":"Of a patient: to be positioned with the legs hanging over the edge of the bed."},{"definition":"To position (a patient) in this way."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dangle-au","text":"/ˈdæŋ.ɡəl/"}]},{"word":"EATERS","idx":26291,"count":999793,"meanings":[{"definitions":[{"definition":"One who eats."},{"definition":"An eating apple."},{"definition":"One who performs fellatio or cunnilingus."},{"definition":"A configuration of cells that appears to consume another configuration by gradually causing it to disappear."}],"partOfSpeech":"n"}]},{"word":"BRONCO","idx":26293,"count":999773,"meanings":[{"definitions":[{"definition":"A horse of western North America that is wild or not fully broken."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɹɑŋkoʊ/"},{"text":"/ˈbɹɒŋkəʊ/"}]},{"word":"EXCEEDINGLY","idx":26294,"count":999765,"meanings":[{"definitions":[{"definition":"To a great or unusual degree, extent, etc.; extremely"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"exceedingly-us","text":"/ɪkˈsiːdɪŋli/"}]},{"word":"INAUGURATION","idx":26295,"count":999762,"meanings":[{"definitions":[{"definition":"The act of inaugurating, or inducting into office with solemnity; investiture by appropriate ceremonies."},{"definition":"The formal beginning or initiation of any movement, enterprise, event etc.","example":"The inauguration of the new bar was a success, with plenty of discounts."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnɔːɡ(j)ʊˈɹeɪʃən/"}]},{"word":"INQUIRED","idx":26296,"count":999701,"meanings":[{"definitions":[{"definition":"To ask (about something)."},{"definition":"To make an inquiry or an investigation."},{"definition":"To call; to name."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"inquired-us","text":"/ɪnˈkwaɪɹd/"}]},{"word":"REPENTANCE","idx":26297,"count":999523,"meanings":[{"definitions":[{"definition":"The condition of being penitent."},{"definition":"A feeling of regret or remorse for doing wrong or sinning."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"repentance-us","text":"/ɹɪˈpɛntəns/"}]},{"word":"CHASED","idx":26299,"count":999429,"meanings":[{"definitions":[{"definition":"To pursue."},{"definition":"To consume another beverage immediately after drinking hard liquor, typically something better tasting or less harsh such as soda or beer; to use a drink as a chaser","example":"I need something to chase this shot with."},{"definition":"To attempt to win by scoring the required number of runs in the final innings.","example":"Australia will be chasing 217 for victory on the final day."},{"definition":"To swing at a pitch outside of the strike zone, typically an outside pitch"},{"definition":"To produce enough offense to cause the pitcher to be removed","example":"The rally chased the starter."},{"definition":"To groove; indent."},{"definition":"To place piping or wiring in a groove encased within a wall or floor, or in a hidden space encased by a wall.","example":"chase the pipe"},{"definition":"To cut (the thread of a screw)."},{"definition":"To decorate (metal) by engraving or embossing."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tʃeɪst/"}]},{"word":"UNPROTECTED","idx":26300,"count":999415,"meanings":[{"definitions":[{"definition":"Not protected; lacking defence or protection; exposed."}],"partOfSpeech":"j"}]},{"word":"MERLE","idx":26301,"count":999346,"meanings":[{"definitions":[{"definition":"The Eurasian blackbird, Turdus merula."},{"definition":"Any blackbird."},{"definition":"A type of mottled colouration on dogs."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mɝl/"},{"text":"/mɜːl/"}]},{"word":"SAVORY","idx":26302,"count":999249,"meanings":[{"definitions":[{"definition":"A savory snack."},{"definition":"Any of several Mediterranean herbs, of the genus Satureja, grown as culinary flavourings."},{"definition":"The leaves of these plants used as a flavouring."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Tasty, attractive to the palate.","example":"The fine restaurant presented an array of savory dishes; each was delicious."},{"definition":"Salty and/or spicy, but not sweet.","example":"The mushrooms, meat, bread, rice, peanuts and potatoes were all good savory foods."},{"definition":"Umami, modern","example":"The savory rabbit soup contrasted well with the sweet cucumber sandwiches with jam."},{"definition":"Morally or ethically acceptable.","example":"Readers are to be warned that quotations in this chapter contain some not so savory language."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"savory-us","text":"/ˈseɪvəɹi/"}]},{"word":"INTERMEDIARIES","idx":26304,"count":999184,"meanings":[{"definitions":[{"definition":"An agent acting as a mediator between sides that may disagree."},{"definition":"An arranger of a contract or other agreement who is separate from the parties to the agreement"},{"definition":"One or several stages of an event which occurs after the start and before the end."},{"definition":"A person or organisation in an intermediate position in a supply chain of goods or services","example":"The intermediary between the manufacturer and retailer is the wholesaler"}],"partOfSpeech":"n"}]},{"word":"ROTATIONS","idx":26306,"count":998916,"meanings":[{"definitions":[{"definition":"The act of turning around a centre or an axis.","example":"The earth's rotation about its axis is responsible for its being slightly oblate rather than a sphere."},{"definition":"A single complete cycle around a centre or an axis.","example":"Earth's moon completes a rotation every twenty-seven days or so."},{"definition":"A regular variation in a sequence, such as to even-out wear, or people taking turns in a task; a duty roster.","example":"In rotation, each member of the group would be responsible for the beacon fire."},{"definition":"An operation on a metric space that is a continuous isometry and fixes at least one point.","example":"The function mapping (x,y) to (−y,x) is a rotation."},{"definition":"The set of starting pitchers of a team."},{"definition":"The step during takeoff when the pilot commands the vehicle to lift the nose wheel off the ground during the takeoff roll. (see also: V2)"},{"definition":"Repeated play on a radio station, etc.","example":"The new single enjoyed heavy rotation on MTV."}],"partOfSpeech":"n"}]},{"word":"EVACUATED","idx":26307,"count":998915,"meanings":[{"definitions":[{"definition":"To leave or withdraw from; to quit; to retire from","example":"The firefighters told us to evacuate the area as the flames approached."},{"definition":"To cause to leave or withdraw from.","example":"The firefighters decided to evacuate all the inhabitants from the street."},{"definition":"To make empty; to empty out; to remove the contents of, including to create a vacuum.","example":"The scientist evacuated the chamber before filling it with nitrogen."},{"definition":"To make empty; to deprive."},{"definition":"To remove; to eject; to void; to discharge, as the contents of a vessel, or of the bowels."},{"definition":"To make void; to nullify; to vacate.","example":"to evacuate a contract or marriage"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having had population removed, by evacuation."},{"definition":"Containing a vacuum.","example":"The evacuated flask imploded with a pop when it could no longer stand the outside air pressure."}],"partOfSpeech":"j"}]},{"word":"RECLAIMED","idx":26308,"count":998614,"meanings":[{"definitions":[{"definition":"To return land to a suitable condition for use."},{"definition":"To obtain useful products from waste; to recycle."},{"definition":"To claim something back; to repossess."},{"definition":"To return someone to a proper course of action, or correct an error; to reform."},{"definition":"To tame or domesticate a wild animal."},{"definition":"To call back from flight or disorderly action; to call to, for the purpose of subduing or quieting."},{"definition":"To cry out in opposition or contradiction; to exclaim against anything; to contradict; to take exceptions."},{"definition":"To draw back; to give way."},{"definition":"To appeal from the Lord Ordinary to the inner house of the Court of Session."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been reclaimed."}],"partOfSpeech":"j"}]},{"word":"PREFECTURE","idx":26309,"count":998543,"meanings":[{"definitions":[{"definition":"The office or position of a prefect."},{"definition":"The jurisdiction of a prefect; the region administered by a prefect, especially as a translation of certain French, Chinese, and Japanese administrative divisions."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɹiˌfɛk(t)ʃəɹ/"},{"text":"/ˈpɹiːfɛktjʊə/"}]},{"word":"ACCENTED","idx":26310,"count":998526,"meanings":[{"definitions":[{"definition":"To express the accent of vocally; to utter with accent."},{"definition":"To mark emphatically; to emphasize; to accentuate; to make prominent."},{"definition":"To mark with written accents."}],"partOfSpeech":"ve"}]},{"word":"MURINE","idx":26315,"count":997935,"meanings":[{"definitions":[{"definition":"Any murine mammal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, pertaining to, or characteristic of, the mouse, rat or (more generally) any mammal of the family Muridae."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmjʊəɹaɪn/"}]},{"word":"ENTOMOLOGY","idx":26316,"count":997894,"meanings":[{"definitions":[{"definition":"The scientific study of insects, and (informally) of other arthropods (and occasionally other invertebrates).","example":"Entomology is an important field of study within biology."}],"partOfSpeech":"n"}]},{"word":"RODENT","idx":26318,"count":997875,"meanings":[{"definitions":[{"definition":"A mammal of the order Rodentia, characterized by long incisors that grow continuously and are worn down by gnawing."},{"definition":"(bulletin board system slang, leet) A person lacking in maturity, social skills, technical competence or intelligence; lamer."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Gnawing; biting; corroding; applied to a destructive variety of cancer or ulcer."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹəʊdənt/"}]},{"word":"PARADIGMS","idx":26319,"count":997842,"meanings":[{"definitions":[{"definition":"A pattern, a way of doing something, especially a pattern of thought, a system of beliefs, a conceptual framework.","example":"Thomas Kuhn's landmark “The Structure of Scientific Revolutions” got people talking about paradigm shifts, to the point the word itself now suggests an incomplete or biased perspective."},{"definition":"An example serving as the model for such a pattern."},{"definition":"A set of all forms which contain a common element, especially the set of all inflectional forms of a word or a particular grammatical category.","example":"The paradigm of \"go\" is \"go, went, gone.\""}],"partOfSpeech":"n"}]},{"word":"RACKET","idx":26321,"count":997700,"meanings":[{"definitions":[{"definition":"A racquet: an implement with a handle connected to a round frame strung with wire, sinew, or plastic cords, and used to hit a ball, such as in tennis or a birdie in badminton."},{"definition":"A snowshoe formed of cords stretched across a long and narrow frame of light wood."},{"definition":"A broad wooden shoe or patten for a man or horse, to allow walking on marshy or soft ground."},{"definition":"A loud noise.","example":"Power tools work quickly, but they sure make a racket."},{"definition":"A fraud or swindle; an illegal scheme for profit.","example":"They had quite a racket devised to relieve customers of their money."},{"definition":"A carouse; any reckless dissipation."},{"definition":"Something taking place considered as exciting, trying, unusual, etc. or as an ordeal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike with, or as if with, a racket."},{"definition":"To make a clattering noise."},{"definition":"To be dissipated; to carouse."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"racket-au","text":"/ˈɹækɪt/"}]},{"word":"PUTTER","idx":26323,"count":997675,"meanings":[{"definitions":[{"definition":"To be active, but not excessively busy, at a task or a series of tasks."},{"definition":"To produce intermittent bursts of sound in the course of operating."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"One who puts or places."},{"definition":"A shot-putter."},{"definition":"One who pushes the small wagons in a coal mine."},{"definition":"A golf club specifically intended for a putt."},{"definition":"A person who is taking a putt or putting."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-ɾɚ/"},{"text":"/ˈpʌtə(ɹ)/"},{"audio":"putter-1-au"}]},{"word":"RECURSION","idx":26325,"count":997602,"meanings":[{"definitions":[{"definition":"The act of recurring."},{"definition":"The act of defining an object (usually a function) in terms of that object itself.","example":"n! = n × (n − 1)! (for n > 0) or 1 (for n = 0) defines the factorial function using recursion."},{"definition":"The invocation of a procedure from within itself.","example":"This function uses recursion to compute factorials."}],"partOfSpeech":"n"}]},{"word":"FLOPS","idx":26326,"count":997539,"meanings":[{"definitions":[{"definition":"Any simple operation, such as addition, multiplication or division, performed on floating point numbers using a single operation."},{"definition":"An incident of a certain type of fall; a plopping down."},{"definition":"A complete failure, especially in the entertainment industry."},{"definition":"The first three cards turned face-up by the dealer in a community card poker game."},{"definition":"A ponded package of dung, as in a cow-flop."},{"definition":"A flophouse."},{"definition":"One floating-point operation per second, a unit of measure of processor speed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fall heavily due to lack of energy.","example":"He flopped down in front of the television, exhausted from work."},{"definition":"To cause to drop heavily.","example":"The tired mule flopped its ears forward and trudged on."},{"definition":"To fail completely; not to be successful at all (of a movie, play, book, song etc.).","example":"The latest album flopped and so the studio canceled her contract."},{"definition":"To pretend to be fouled in sports, such as basketball, hockey (the same as to dive in soccer)","example":"It starts with Chris Paul, because Blake didn't really used to flop like that, you know, last year."},{"definition":"To strike about with something broad and flat, as a fish with its tail, or a bird with its wings; to rise and fall; to flap.","example":"The brim of a hat flops."},{"definition":"To have (a hand) using the community cards dealt on the flop.","example":"Both players flopped sets! Cards dealt on the flop: Q95. Player A's hole cards: 55 (making three of a kind: 555). Player B's hole cards: QQ (making three of a kind: QQQ)."},{"definition":"To stay, sleep or live in a place."}],"partOfSpeech":"ve"}]},{"word":"SICKLE","idx":26327,"count":997530,"meanings":[{"definitions":[{"definition":"An implement having a semicircular blade and short handle, used for cutting long grass and cereal crops."},{"definition":"Any of the sickle-shaped middle feathers of the domestic cock."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut with a sickle."},{"definition":"To deform (as with a red blood cell) into an abnormal crescent shape."},{"definition":"Of red blood cells: to assume an abnormal crescent shape."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Shaped like the blade of a sickle; crescent-shaped.","example":"a sickle moon"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sickle-us","text":"/ˈsɪkl̩/"},{"audio":"sickle-uk","text":"/ˈsɪkl̩/"},{"audio":"sickle-au","text":"/ˈsɪkl̩/"}]},{"word":"VIOLENTLY","idx":26328,"count":997440,"meanings":[{"definitions":[{"definition":"In a violent manner."},{"definition":"To an intense degree; extremely; strongly; intensely.","example":"I found myself violently disagreeing with him."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"violently-us","text":"/ˈvaɪ(ə)ləntli/"}]},{"word":"ATTEST","idx":26329,"count":997406,"meanings":[{"definitions":[{"definition":"To affirm to be correct, true, or genuine.","example":"When will the appraiser attest the date of the painting?"},{"definition":"To certify by signature or oath.","example":"You must attest your will in order for it to be valid."},{"definition":"To certify in an official capacity."},{"definition":"To supply or be evidence of.","example":"Her fine work attested her ability."},{"definition":"To put under oath."},{"definition":"To call to witness; to invoke."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"attest-us","text":"/əˈtɛst/"}]},{"word":"UNTOUCHED","idx":26330,"count":997170,"meanings":[{"definitions":[{"definition":"Remaining in its original, pristine state, undamaged; not altered.","example":"There are practically no untouched forests left in Europe."},{"definition":"Not eaten.","example":"He left his vegetables untouched."},{"definition":"Not influenced, affected or swayed.","example":"She was untouched by his tale of woes."},{"definition":"Not having come in contact.","example":"Our chocolates are untouched by human hands."},{"definition":"Not talked about.","example":"Politics was an untouched topic in our family."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"untouched-us","text":"/ʌnˈtʌt͡ʃt/"}]},{"word":"INITIATOR","idx":26331,"count":997169,"meanings":[{"definitions":[{"definition":"One who initiates."},{"definition":"A substance that initiates a chain reaction or polymerization."},{"definition":"A task (in a mainframe computer) that initiates multiple jobs."},{"definition":"A material whose presence in the body eventually leads to cancer."}],"partOfSpeech":"n"}]},{"word":"COMFORTING","idx":26334,"count":997036,"meanings":[{"definitions":[{"definition":"To relieve the distress or suffering of; to provide comfort to.","example":"Rob comforted Aaron because he was lost and very sad."},{"definition":"To make comfortable."},{"definition":"To make strong; to invigorate; to fortify; to corroborate."},{"definition":"To assist or help; to aid."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of giving comfort."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Giving comfort.","example":"It's comforting to know that I've always got my Mum when things go wrong."}],"partOfSpeech":"j"}]},{"word":"CREEPING","idx":26336,"count":997024,"meanings":[{"definitions":[{"definition":"To move slowly with the abdomen close to the ground."},{"definition":"Of plants, to grow across a surface rather than upwards."},{"definition":"To move slowly and quietly in a particular direction."},{"definition":"To make small gradual changes, usually in a particular direction."},{"definition":"To move in a stealthy or secret manner; to move imperceptibly or clandestinely; to steal in; to insinuate itself or oneself."},{"definition":"To slip, or to become slightly displaced."},{"definition":"To move or behave with servility or exaggerated humility; to fawn."},{"definition":"To have a sensation as of insects creeping on the skin of the body; to crawl."},{"definition":"To drag in deep water with creepers, as for recovering a submarine cable."},{"definition":"To covertly have sex (with a person other than one's primary partner); to cheat with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of something that creeps."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"creeping-us","text":"/ˈkɹiːpɪŋ/"}]},{"word":"KEROSENE","idx":26337,"count":996638,"meanings":[{"definitions":[{"definition":"A petroleum-based thin and colorless fuel","example":"The kerosene lasted all winter, so the furnace kept us always warm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɛɹəsiːn/"}]},{"word":"APPRAISED","idx":26338,"count":996617,"meanings":[{"definitions":[{"definition":"To determine the value or worth of something, particularly as a person appointed for this purpose.","example":"to appraise goods and chattels"},{"definition":"To consider comprehensively."},{"definition":"To judge the performance of someone, especially a worker.","example":"At the end of the contract, you will be appraised by your line manager."},{"definition":"To estimate; to conjecture."},{"definition":"To praise; to commend."},{"definition":"To apprise, inform."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/əˈpɹeɪzd/"}]},{"word":"RESTORATIVE","idx":26339,"count":996537,"meanings":[{"definitions":[{"definition":"Something with restoring properties."},{"definition":"An alcoholic drink, especially with tonic."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Serving to restore.","example":"After a long day working in the fields Clarence took comfort in a restorative pint of beer."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"restorative-uk","text":"/ɹɪˈstɒɹətɪv/"}]},{"word":"SUNSCREEN","idx":26342,"count":996319,"meanings":[{"definitions":[{"definition":"A cream, to be spread on the skin, containing organic compounds that absorb, and/or titanium dioxide that reflects the sun’s ultraviolet radiation."}],"partOfSpeech":"n"}]},{"word":"PEACEFULLY","idx":26345,"count":996177,"meanings":[{"definitions":[{"definition":"In a peaceful manner."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"peacefully-us","text":"/ˈpiːsfəli/"}]},{"word":"ANTIDEPRESSANTS","idx":26346,"count":996171,"meanings":[{"definitions":[{"definition":"An agent that prevents or counteracts depression."}],"partOfSpeech":"n"}]},{"word":"DECENTRALIZED","idx":26347,"count":996166,"meanings":[{"definitions":[{"definition":"To cause something to change from being concentrated at one point to being distributed across a number of points."},{"definition":"To reduce the authority of a governing body by distributing that authority among several bodies."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not centralized; having no center or several centers"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/diːˈsɛntɹəlaɪzd/"}]},{"word":"FREAKING","idx":26348,"count":996113,"meanings":[{"definitions":[{"definition":"To make greatly distressed and/or a discomposed appearance"},{"definition":"To be placed or place someone under the influence of a psychedelic drug"},{"definition":"To streak; to variegate"},{"definition":"To experience reality withdrawal, or hallucinations (nightmarish), to behave irrational or unconventional due to drug use."},{"definition":"To react extremely or irrationally, usually under distress or discomposure"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A streak or variegation in a pattern."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(minced oath) Fucking.","example":"You're getting on my freaking nerves!"},{"definition":"Freakish."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Fucking.","example":"He was so scared he freaking ran into a police station."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"freaking-au","text":"/ˈfɹiːkɪŋ/"}]},{"word":"BASSIST","idx":26351,"count":995968,"meanings":[{"definitions":[{"definition":"A musician who plays a bass instrument, especially the bass guitar."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbeɪs.ɪst/"}]},{"word":"STATURE","idx":26353,"count":995928,"meanings":[{"definitions":[{"definition":"A person or animal's natural height when standing upright."},{"definition":"Respect coming from achievement or development."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"stature-us","text":"/ˈstætʃ.ɚ/"}]},{"word":"SKATERS","idx":26354,"count":995848,"meanings":[{"definitions":[{"definition":"A person who skates."},{"definition":"A member of skateboarding subculture, characterized by dingy and baggy clothes, and often wallet chains."},{"definition":"A player who is not a goaltender."},{"definition":"Any of numerous hemipterous insects in the family Gerridae, which run rapidly over the surface of the water, as if skating."}],"partOfSpeech":"n"}]},{"word":"SENTRY","idx":26355,"count":995831,"meanings":[{"definitions":[{"definition":"A guard, particularly on duty at the entrance to a military base."},{"definition":"Sentry duty; time spent being a sentry."},{"definition":"A form of drag to be towed underwater, which on striking bottom is upset and rises to the surface."},{"definition":"A watchtower."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɛntɹɪ/"},{"text":"/ˈsɛntɹi/"}]},{"word":"ASSAULTS","idx":26357,"count":995815,"meanings":[{"definitions":[{"definition":"A violent onset or attack with physical means, for example blows, weapons, etc.","example":"to make assault upon a man, a house, or a town"},{"definition":"A violent onset or attack with moral weapons, for example words, arguments, appeals, and the like","example":"to make an assault on the prerogatives of a prince, or on the constitution of a government"},{"definition":"An attempt to commit battery: a violent attempt, or willful effort with force or violence, to do hurt to another, but without necessarily touching his person, as by lifting a fist in a threatening manner, or by striking at him and missing him."},{"definition":"The crime whose action is such an attempt."},{"definition":"An act that causes someone to apprehend imminent bodily harm."},{"definition":"The tort whose action is such an act."},{"definition":"A non-competitive combat between two fencers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attack, physically or figuratively.","example":"Loud music assaulted our ears as we entered the building."},{"definition":"To threaten or harass."}],"partOfSpeech":"ve"}]},{"word":"LUMINOSITY","idx":26358,"count":995649,"meanings":[{"definitions":[{"definition":"The state of being luminous, or a luminous object; brilliance or radiance"},{"definition":"The ratio of luminous flux to radiant flux at the same wavelength; the luminosity factor"},{"definition":"The rate at which a star radiates energy in all directions"}],"partOfSpeech":"n"}]},{"word":"VICES","idx":26362,"count":995524,"meanings":[{"definitions":[{"definition":"A bad habit.","example":"Gluttony is a vice, not a virtue."},{"definition":"Any of various crimes related (depending on jurisdiction) to prostitution, pornography, gambling, alcohol, or drugs."},{"definition":"A defect in the temper or behaviour of a horse, such as to make the animal dangerous, to injure its health, or to diminish its usefulness."},{"definition":"A mechanical screw apparatus used for clamping or holding (also spelled vise)."},{"definition":"A tool for drawing lead into cames, or flat grooved rods, for casements."},{"definition":"A grip or grasp."},{"definition":"A winding or spiral staircase."},{"definition":"One who acts in place of a superior."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vices-us"}]},{"word":"KARAT","idx":26365,"count":995377,"meanings":[{"definitions":[{"definition":"A unit of fineness or concentration of gold equalling 1/24 part of gold in an alloy."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæɹ.ət/"}]},{"word":"TOLLS","idx":26369,"count":995273,"meanings":[{"definitions":[{"definition":"Loss or damage incurred through a disaster.","example":"The war has taken its toll on the people."},{"definition":"A fee paid for some liberty or privilege, particularly for the privilege of passing over a bridge or on a highway, or for that of vending goods in a fair, market, etc."},{"definition":"A fee for using any kind of material processing service.","example":"We can handle on a toll basis your needs for spray drying, repackaging, crushing and grinding, and dry blending."},{"definition":"A tollbooth.","example":"We will be replacing some manned tolls with high-speed device readers."},{"definition":"A liberty to buy and sell within the bounds of a manor."},{"definition":"A portion of grain taken by a miller as a compensation for grinding."},{"definition":"The act or sound of tolling"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To impose a fee for the use of.","example":"Once more it is proposed to toll the East River bridges."},{"definition":"To levy a toll on (someone or something)."},{"definition":"To take as a toll."},{"definition":"To pay a toll or tallage."},{"definition":"To ring (a bell) slowly and repeatedly.","example":"Ask not for whom the bell tolls."},{"definition":"To summon by ringing a bell.","example":"The ringer tolled the workers back from the fields for vespers."},{"definition":"To announce by tolling.","example":"The bells tolled the King’s death."},{"definition":"To draw; pull; tug; drag."},{"definition":"To tear in pieces."},{"definition":"To draw; entice; invite; allure.","example":"Hou many virgins shal she tolle and drawe to þe Lord - \"Life of Our Lady\""},{"definition":"To lure with bait; tole (especially, fish and animals)."},{"definition":"To take away; to vacate; to annul."},{"definition":"To suspend.","example":"The statute of limitations defense was tolled as a result of the defendant’s wrongful conduct."}],"partOfSpeech":"ve"}]},{"word":"DEGRADING","idx":26370,"count":995221,"meanings":[{"definitions":[{"definition":"To lower in value or social position.","example":"Fred degrades himself by his behaviour."},{"definition":"To reduce in quality or purity.","example":"The DNA sample has degraded."},{"definition":"To reduce in altitude or magnitude, as hills and mountains; to wear down."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act or process of degradation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That degrades","example":"Retrieving my dropped possessions from the mud was a degrading experience."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈɡɹeɪdɪŋ(ɡ)/"}]},{"word":"POSH","idx":26371,"count":995079,"meanings":[{"definitions":[{"definition":"Fragments produced by an impact"},{"definition":"Slush"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Associated with the upper classes.","example":"She talks with a posh accent."},{"definition":"Stylish, elegant, exclusive (expensive).","example":"After the performance they went out to a very posh restaurant."},{"definition":"(usually offensive) Snobbish, materialistic, prejudiced, under the illusion that one is better than everyone else.","example":"We have a right posh git moving in next door"}],"partOfSpeech":"j"},{"definitions":[{"definition":"An exclamation expressing derision.","example":"1889: \"The czar! Posh! I slap my fingers--I snap my fingers at him.\" — Rudyard Kipling, The Man Who Was"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"posh-uk","text":"/pɒʃ/"}]},{"word":"BANGLES","idx":26372,"count":995072,"meanings":[{"definitions":[{"definition":"A rigid bracelet or anklet, especially one with no clasp."},{"definition":"The cut branch of a tree; a large, rough stick; the largest piece of wood in a bundle of twigs"}],"partOfSpeech":"n"}]},{"word":"STEREOS","idx":26373,"count":994931,"meanings":[{"definitions":[{"definition":"A system of recording or reproducing sound that uses two channels, each playing a portion of the original sound in such a way as to create the illusion of locating the sound at a particular position, each offset from the other, thereby more accurately imitating the location of the original sound when the recorded or reproduced sound is heard."},{"definition":"(by extension) Any object or device equipped with audio components that reproduces sound in stereo, such as a stereo console in the home.","example":"He liked to listen to classical music on his stereo."},{"definition":"A stereotype."}],"partOfSpeech":"n"}]},{"word":"MOH","idx":26376,"count":994751,"meanings":[{"definitions":[{"definition":"Attachment to the transient material world, which hinders the soul's search for its ultimate goal and is therefore one of the Five Evils."}],"partOfSpeech":"n"}]},{"word":"FIREMAN","idx":26378,"count":994581,"meanings":[{"definitions":[{"definition":"Someone (especially one who is male) who is skilled in the work of fighting fire."},{"definition":"A person (originally a man) who keeps the fire going underneath a steam boiler (originally, shoveling coal by hand), particularly on a railroad locomotive or steamship."},{"definition":"By extension of the above, an assistant on any locomotive, whether steam-powered or not."},{"definition":"A relief pitcher."},{"definition":"A safety inspector in coal mines."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fireman-uk","text":"/ˈfaɪəmən/"}]},{"word":"MINK","idx":26379,"count":994479,"meanings":[{"definitions":[{"definition":"(plural mink or minks) Any of various semi-aquatic, carnivorous mammals in the Mustelinae subfamily, similar to weasels, with dark fur, native to Europe and America, of which two species in different genera are extant: the American mink (Neovison vison) and the European mink (Mustela lutreola)."},{"definition":"(plural mink) The fur or pelt of a mink, used to make apparel."},{"definition":"(plural minks) An article of clothing made of mink."},{"definition":"(plural minks) An individual with poor personal hygiene; a smelly person."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mɪŋk/"},{"audio":"mink-au"}]},{"word":"SIMULATORS","idx":26380,"count":994420,"meanings":[{"definitions":[{"definition":"One who simulates or feigns."},{"definition":"A machine or system that simulates an environment (such as an aircraft cockpit), often for training purposes."}],"partOfSpeech":"n"}]},{"word":"ZORRO","idx":26382,"count":994277,"meanings":[{"definitions":[{"definition":"A South American canid of the genus Lycalopex, visually similar to (and sometimes referred to as) a fox but more closely related to a wolf."}],"partOfSpeech":"n"}]},{"word":"MANIAC","idx":26383,"count":994236,"meanings":[{"definitions":[{"definition":"An insane person, especially one who suffers from a mania."},{"definition":"A fanatic, a person with an obsession."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmeɪniˌæk/"}]},{"word":"ANTICS","idx":26385,"count":994105,"meanings":[{"definitions":[{"definition":"A grotesque representation of a figure; a gargoyle."},{"definition":"A caricature."},{"definition":"(often in plural) A ludicrous gesture or act; ridiculous behaviour; caper."},{"definition":"A grotesque performer or clown, buffoon."},{"definition":"A pose, often exaggerated, in anticipation of an action; for example, a brief squat before jumping"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perform antics, caper."},{"definition":"To make a fool of, to cause to look ridiculous."},{"definition":"To perform (an action) as an antic; to mimic ridiculously."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈæntɪks/"}]},{"word":"FORMATIVE","idx":26391,"count":993270,"meanings":[{"definitions":[{"definition":"(grammar) A language unit that has morphological function."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the formation and subsequent growth of something.","example":"My formative years were spent in an inner city."},{"definition":"Capable of forming something."},{"definition":"Capable of producing new tissue."},{"definition":"(grammar) Pertaining to the inflection of words."},{"definition":"Denoting forms of assessment used to guide learning rather than to quantify educational outcomes."}],"partOfSpeech":"j"}]},{"word":"RECOGNISING","idx":26393,"count":993218,"meanings":[{"definitions":[{"definition":"To match (something or someone which one currently perceives) to a memory of some previous encounter with the same person or thing.","example":"I recognised his face immediately."},{"definition":"To acknowledge the existence or legality of; to treat as valid or worthy of consideration.","example":"The US and a number of EU countries are expected to recognize Kosovo on Monday."},{"definition":"(or with clause) To acknowledge or consider (as being a certain thing or having a certain quality or property).","example":"I recognize that my behaviour has been unacceptable."},{"definition":"To realize or discover the nature of something; apprehend quality in."},{"definition":"To show formal appreciation of, as with an award, commendation etc.","example":"His services were recognized in a testimonial."},{"definition":"To review; to examine again."},{"definition":"To reconnoiter."},{"definition":"To have the property to bind to specific antigens."}],"partOfSpeech":"ve"}]},{"word":"INTERACTIVITY","idx":26394,"count":993207,"meanings":[{"definitions":[{"definition":"The quality of being interactive."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪntəɹækˈtɪvɪti/"}]},{"word":"CONSTRUCTORS","idx":26397,"count":993094,"meanings":[{"definitions":[{"definition":"A person who, or thing that, constructs."},{"definition":"A company or individual who builds racing vehicles. In Formula One, constructor status is strictly defined by the rules, but in other motorsports the term is merely a descriptor. Depending on the racing rules, some constructors (e.g. Cosworth) may provide vehicles to racing teams who are not themselves constructors, while others are both teams and constructors (Ducati Corse, Scuderia Ferrari)."},{"definition":"A class method that creates and initializes each instance of an object."}],"partOfSpeech":"n"}]},{"word":"WRONGLY","idx":26398,"count":992978,"meanings":[{"definitions":[{"definition":"In an unfair or immoral manner; unjustly."},{"definition":"Incorrectly; by error.","example":"I wrongly assumed that it would be an easy job."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈɹɔŋli/"},{"text":"/ˈɹɒŋli/"}]},{"word":"PHYSICISTS","idx":26404,"count":992692,"meanings":[{"definitions":[{"definition":"A person whose occupation specializes in the science of physics, especially at a professional level."},{"definition":"A believer in the theory that the fundamental phenomena of life are to be explained upon purely chemical and physical principles (opposed to vitalist)."}],"partOfSpeech":"n"}]},{"word":"MALFUNCTION","idx":26406,"count":992684,"meanings":[{"definitions":[{"definition":"Faulty functioning"},{"definition":"Failure to function"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To function improperly","example":"She told him the machine was poorly built, but they both knew that she was the one who had malfunctioned."},{"definition":"To fail to function"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"malfunction-us","text":"/ˌmælˈfʌŋk.ʃən/"}]},{"word":"FALSELY","idx":26407,"count":992639,"meanings":[{"definitions":[{"definition":"In a false manner.","example":"He protested his innocence to the end, claiming he had been falsely charged and convicted."}],"partOfSpeech":"v"}]},{"word":"ABBOT","idx":26408,"count":992552,"meanings":[{"definitions":[{"definition":"The superior or head of an abbey or monastery.","example":"The newly appointed abbot decided to take a tour of the abbey with the cardinal's emissary."},{"definition":"The pastor and/or administrator of an order, including minor and major orders starting with the minor order of porter."},{"definition":"A layman who received the abbey's revenues, after the closing of the monasteries."},{"definition":"(British slang) A brothel-owner's husband or lover."},{"definition":"(British slang) A ponce; a man employed by a prostitute to find clients, and who may also act as a bodyguard or equivalent to a bouncer."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"abbot-us","text":"/ˈæb.ət/"}]},{"word":"MAGMA","idx":26409,"count":992528,"meanings":[{"definitions":[{"definition":"The molten matter within the earth, the source of the material of lava flows, dikes of eruptive rocks, etc."},{"definition":"A basic algebraic structure consisting of a set equipped with a single binary operation."},{"definition":"Any soft doughy mass."},{"definition":"The residuum after expressing the juice from fruits."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"magma-us","text":"/ˈmæɡ.mə/"}]},{"word":"CONSUL","idx":26418,"count":991728,"meanings":[{"definitions":[{"definition":"Either of the two heads of government and state of the Roman Republic or the equivalent nominal post under the Roman and Byzantine Empires."},{"definition":"Any of the three heads of government and state of France between 1799 and 1804."},{"definition":"A count or earl."},{"definition":"A councillor, particularly:"},{"definition":"(by extension) An official residing in major foreign towns to represent and protect the interests of the merchants and citizens of his or her country."},{"definition":"A counsellor."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɑn.səl/"},{"text":"/ˈkɒn.səl/"}]},{"word":"PLAGUED","idx":26419,"count":991605,"meanings":[{"definitions":[{"definition":"To harass, pester or annoy someone persistently or incessantly."},{"definition":"To afflict with a disease or other calamity.","example":"Natural catastrophes plagued the colonists till they abandoned the pestilent marshland."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Constantly afflicted or relentlessly attacked (by someone or something)."}],"partOfSpeech":"j"}]},{"word":"PARKLAND","idx":26420,"count":991595,"meanings":[{"definitions":[{"definition":"Land suitable for use as a park."},{"definition":"A landscape characterized by a mixture of treed groves and open grasslands, akin to a Eurasian forest steppe"}],"partOfSpeech":"n"}]},{"word":"AIDING","idx":26423,"count":991529,"meanings":[{"definitions":[{"definition":"To provide support to; to further the progress of; to help; to assist."},{"definition":"To climb with the use of aids such as pitons."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who aids or assists."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈeɪ.dɪŋ/"}]},{"word":"WEREWOLF","idx":26424,"count":991528,"meanings":[{"definitions":[{"definition":"A person who is transformed or can transform into a wolf or a wolflike human, often said to transform during a full moon."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɛəɹwʊlf/"},{"text":"/ˈwɛːwʊlf/"}]},{"word":"SUCKERS","idx":26427,"count":991255,"meanings":[{"definitions":[{"definition":"A person or animal that sucks, especially a breast or udder; especially a suckling animal, young mammal before it is weaned."},{"definition":"An undesired stem growing out of the roots or lower trunk of a shrub or tree, especially from the rootstock of a grafted plant or tree."},{"definition":"(by extension) A parasite; a sponger."},{"definition":"An organ or body part that does the sucking; especially a round structure on the bodies of some insects, frogs, and octopuses that allows them to stick to surfaces."},{"definition":"A thing that works by sucking something."},{"definition":"The embolus, or bucket, of a pump; also, the valve of a pump basket."},{"definition":"A pipe through which anything is drawn."},{"definition":"A small piece of leather, usually round, having a string attached to the center, which, when saturated with water and pressed upon a stone or other body having a smooth surface, adheres, by reason of the atmospheric pressure, with such force as to enable a considerable weight to be thus lifted by the string; formerly used by children as a plaything."},{"definition":"A suction cup."},{"definition":"An animal such as the octopus and remora, which adhere to other bodies with such organs."},{"definition":"Any fish in the family Catostomidae of North America and eastern Asia, which have mouths modified into downward-pointing, suckerlike structures for feeding in bottom sediments."},{"definition":"A lollipop; a piece of candy which is sucked."},{"definition":"A hard drinker."},{"definition":"An inhabitant of Illinois."},{"definition":"A migrant lead miner working in the Driftless Area of northwest Illinois, southwest Wisconsin, and northeast Iowa, working in summer and leaving for winter, so named because of the similarity to the migratory patterns of the North American Catostomidae."},{"definition":"A person who is easily deceived, tricked or persuaded to do something; a naive person.","example":"One poor sucker had actually given her his life’s savings."},{"definition":"A person irresistibly attracted by something specified.","example":"A sucker for ghost stories."},{"definition":"(British slang) The penis."},{"definition":"Any thing or object.","example":"See if you can get that sucker working again."},{"definition":"A person."}],"partOfSpeech":"n"}]},{"word":"MIDWESTERN","idx":26428,"count":991253,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or characteristic of the Midwest."},{"definition":"Of or pertaining to any region identified as midwest","example":"Bermuda lies in the midwestern Atlantic."}],"partOfSpeech":"j"}]},{"word":"SWALLOWS","idx":26430,"count":991094,"meanings":[{"definitions":[{"definition":"A deep chasm or abyss in the earth."},{"definition":"The amount swallowed in one gulp; the act of swallowing.","example":"He took the aspirin with a single swallow of water."},{"definition":"Any of various carbohydrate-based dishes that are swallowed without much chewing."},{"definition":"A small, migratory bird of the Hirundinidae family with long, pointed, moon-shaped wings and a forked tail which feeds on the wing by catching insects."},{"definition":"The aperture in a block through which the rope reeves."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause (food, drink etc.) to pass from the mouth into the stomach; to take into the stomach through the throat."},{"definition":"To take (something) in so that it disappears; to consume, absorb."},{"definition":"To take food down into the stomach; to make the muscular contractions of the oesophagus to achieve this, often taken as a sign of nervousness or strong emotion.","example":"My throat was so sore that I was unable to swallow."},{"definition":"To accept easily or without questions; to believe, accept."},{"definition":"To engross; to appropriate; usually with up."},{"definition":"To retract; to recant.","example":"to swallow one's opinions"},{"definition":"To put up with; to bear patiently or without retaliation.","example":"to swallow an affront or insult"}],"partOfSpeech":"ve"}]},{"word":"CHARISMA","idx":26431,"count":991085,"meanings":[{"definitions":[{"definition":"Personal charm or magnetism"},{"definition":"An extraordinary power granted by the Holy Spirit"},{"definition":"The ability to influence without the use of logic."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kəˈɹɪzmə/"}]},{"word":"CHILLI","idx":26432,"count":991047,"meanings":[{"definitions":[{"definition":"The pungent, spicy fresh or dried fruit of any of several cultivated varieties of capsicum peppers, used in cooking."},{"definition":"Powdered chili pepper, used as a spice or flavouring in cooking."},{"definition":"(Indian Chinese cuisine) a spicy stew of chicken or paneer, capsicum and onion, eaten as an appetizer."},{"definition":"A dish made with chili peppers and other ingredients, such as beans and beef."},{"definition":"(Cincinnati) Cincinnati chili."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈt͡ʃɪli/"}]},{"word":"SUSPENSIONS","idx":26434,"count":990957,"meanings":[{"definitions":[{"definition":"The act of suspending, or the state of being suspended.","example":"suspension from a hook"},{"definition":"A temporary or conditional delay, interruption or discontinuation."},{"definition":"The state of a solid or substance produced when its particles are mixed with, but not dissolved in, a fluid, and are capable of separation by straining."},{"definition":"The act of keeping a person who is listening in doubt and expectation of what is to follow."},{"definition":"The temporary barring of a person from a workplace, society, etc. pending investigation into alleged misconduct."},{"definition":"The process of barring a student from school grounds as a form of punishment (particularly out-of-school suspension).","example":"suspension from school as a disciplinary measure"},{"definition":"The act of or discord produced by prolonging one or more tones of a chord into the chord which follows, thus producing a momentary discord, suspending the concord which the ear expects."},{"definition":"A stay or postponement of the execution of a sentence, usually by letters of suspension granted on application to the Lord Ordinary."},{"definition":"A topological space derived from another by taking the product of the original space with an interval and collapsing each end of the product to a point."},{"definition":"A function derived, in a standard way, from another, such that the instant function's domain and codomain are suspensions of the original function's."},{"definition":"The system of springs and shock absorbers connected to the wheels in an automobile, which allows the vehicle to move smoothly with reduced shock to its occupants."}],"partOfSpeech":"n"}]},{"word":"PATRONAGE","idx":26435,"count":990921,"meanings":[{"definitions":[{"definition":"The act of providing approval and support; backing; championship.","example":"His vigorous patronage of the conservatives got him in trouble with progressives."},{"definition":"Customers collectively; clientele; business.","example":"The restaurant had an upper-class patronage."},{"definition":"A communication that indicates lack of respect by patronizing the recipient; condescension; disdain."},{"definition":"Granting favours or giving contracts or making appointments to office in return for political support."},{"definition":"Guardianship, as of a saint; tutelary care."},{"definition":"The right of nomination to political office."},{"definition":"The right of presentation to church or ecclesiastical benefice; advowson."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To support by being a patron of."},{"definition":"To be a regular customer or client of; to patronize"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpeɪtɹənɪd͡ʒ/"}]},{"word":"CANOES","idx":26437,"count":990691,"meanings":[{"definitions":[{"definition":"A small long and narrow boat, propelled by one or more people (depending on the size of canoe), using single-bladed paddles. The paddlers face in the direction of travel, in either a seated position, or kneeling on the bottom of the boat. Canoes are open on top, and pointed at both ends."},{"definition":"An oversize, usually older, luxury car."},{"definition":"Any of the deflectors positioned around a roulette wheel, shaped like upside-down boats."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride or paddle a canoe."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"canoes-us","text":"/kəˈnuːz/"}]},{"word":"MATILDA","idx":26438,"count":990513,"meanings":[{"definitions":[{"definition":"A bundle of possessions, often tied up in a sack; a swag."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/məˈtɪldə/"}]},{"word":"FODDER","idx":26439,"count":990472,"meanings":[{"definitions":[{"definition":"Food for animals; that which is fed to cattle, horses, and sheep, such as hay, cornstalks, vegetables, etc."},{"definition":"A load: various English units of weight or volume based upon standardized cartloads of certain commodities, generally around 1000 kg."},{"definition":"(drafting) Tracing paper."},{"definition":"Stuff; material; something that serves as inspiration or encouragement, especially for satire or humour."},{"definition":"(cryptic crosswords) The text to be operated on (anagrammed, etc.) within a clue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feed animals (with fodder)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fodder-us","text":"/ˈfɑdɚ/"}]},{"word":"IMPETUS","idx":26440,"count":990419,"meanings":[{"definitions":[{"definition":"Something that impels; a stimulating factor.","example":"The outbreak of World War II in 1939 gave a new impetus to receiver development."},{"definition":"A force, either internal or external, that impels; an impulse."},{"definition":"The force or energy associated with a moving body; a stimulus."},{"definition":"An activity in response to a stimulus."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"impetus-us","text":"/ˈɪm.pə.təs/"}]},{"word":"PEELED","idx":26441,"count":990363,"meanings":[{"definitions":[{"definition":"To remove the skin or outer covering of.","example":"I sat by my sister's bed, peeling oranges for her."},{"definition":"To remove something from the outer or top layer of.","example":"I peeled (the skin from) a banana and ate it hungrily."},{"definition":"To become detached, come away, especially in flakes or strips; to shed skin in such a way.","example":"I had been out in the sun too long, and my nose was starting to peel."},{"definition":"To remove one's clothing.","example":"The children peeled by the side of the lake and jumped in."},{"definition":"To move, separate (off or away).","example":"The scrum-half peeled off and made for the touchlines."},{"definition":"To play a peel shot."},{"definition":"To send through a hoop (of a ball other than one's own)."},{"definition":"To plunder; to pillage, rob."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"With the outermost layer or skin removed.","example":"He stirred the campfire stew with a peeled stick, so the bark wouldn't get in it."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/piːld/"}]},{"word":"MALNUTRITION","idx":26443,"count":990258,"meanings":[{"definitions":[{"definition":"A lack of adequate nourishment."}],"partOfSpeech":"n"}]},{"word":"INBRED","idx":26447,"count":990075,"meanings":[{"definitions":[{"definition":"An inbred individual.","example":"Since you all marry your cousins I bet you're a bunch of inbreds."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Bred within; innate."},{"definition":"Having an ancestry characterized by inbreeding."},{"definition":"Describing a strain produced through successive generations of inbreeding resulting in a population of genetically identical individuals which are homozygous at all genetic loci."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To breed or reproduce with those that are related."},{"definition":"To breed with those that share common traits or qualities."},{"definition":"To produce or generate within."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɪnˌbɹɛd/"}]},{"word":"INTERCULTURAL","idx":26448,"count":989822,"meanings":[{"definitions":[{"definition":"Of, relating to, or between different cultures"}],"partOfSpeech":"j"}]},{"word":"SKATEBOARDS","idx":26449,"count":989714,"meanings":[{"definitions":[{"definition":"A narrow, wooden or plastic platform mounted on pairs of wheels, on which one stands and propels oneself by pushing along the ground with one foot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a skateboard."}],"partOfSpeech":"ve"}]},{"word":"MAINBOARD","idx":26450,"count":989663,"meanings":[{"definitions":[{"definition":"Motherboard"}],"partOfSpeech":"n"}]},{"word":"WHINING","idx":26452,"count":989593,"meanings":[{"definitions":[{"definition":"A long-drawn, high-pitched complaining cry or sound"},{"definition":"A complaint or criticism"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To utter a high-pitched cry."},{"definition":"To make a sound resembling such a cry.","example":"The jet engines whined at take off."},{"definition":"To complain or protest with a whine or as if with a whine."},{"definition":"To move with a whining sound.","example":"The jet whined into the air."},{"definition":"To utter with the sound of a whine.","example":"Kelly Queen was whining that the boss made him put on his tie."}],"partOfSpeech":"ve"}]},{"word":"FUNCTIONALLY","idx":26453,"count":989559,"meanings":[{"definitions":[{"definition":"In a functional manner."}],"partOfSpeech":"v"}]},{"word":"RABIES","idx":26454,"count":989553,"meanings":[{"definitions":[{"definition":"An infectious disease caused by species of Lyssavirus that causes acute encephalitis in warm-blooded animals and people, characterised by abnormal behaviour such as biting, excitement, aggressiveness, and dementia, followed by paralysis and death."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹeɪ.biz/"}]},{"word":"CATALYSTS","idx":26455,"count":989486,"meanings":[{"definitions":[{"definition":"A substance that increases the rate of a chemical reaction without being consumed in the process."},{"definition":"Someone or something that encourages progress or change.","example":"Economic development and integration are working as a catalyst for peace."},{"definition":"An inciting incident that sets the successive conflict into motion."},{"definition":"A catalytic converter."}],"partOfSpeech":"n"}]},{"word":"ARSON","idx":26457,"count":989351,"meanings":[{"definitions":[{"definition":"The crime of deliberately starting a fire with intent to cause damage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To illegally set fire to; to burn down in a criminal manner"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɑɹsən/"},{"text":"/ˈɑːsən/"}]},{"word":"READABILITY","idx":26458,"count":989322,"meanings":[{"definitions":[{"definition":"The property of being capable of being read; legibility."},{"definition":"The property of being easy or engaging to read.","example":"The book had a clever plot, but lacked readability."}],"partOfSpeech":"n"}]},{"word":"CAPPUCCINO","idx":26462,"count":989068,"meanings":[{"definitions":[{"definition":"An Italian coffee-based beverage made from espresso and milk that has been steamed and/or frothed."},{"definition":"A cup of this beverage."},{"definition":"Any of various similar drinks."},{"definition":"Capuchin or the color, especially cappuccino brown."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌkæpəˈtʃinoʊ/"},{"text":"/ˌkæpəˈtʃiːnəʊ/"}]},{"word":"MODULUS","idx":26463,"count":988969,"meanings":[{"definitions":[{"definition":"The base with respect to which a congruence is computed."},{"definition":"The absolute value of a complex number."},{"definition":"A coefficient that expresses how much of a certain property is possessed by a certain substance."},{"definition":"An operator placed between two numbers, to get the remainder of the division of those numbers."}],"partOfSpeech":"n"}]},{"word":"CUISINES","idx":26465,"count":988926,"meanings":[{"definitions":[{"definition":"A characteristic style of preparing food, often associated with a place of origin.","example":"French cuisine is considered to be one of the world's most refined and elegant styles of cooking."},{"definition":"A kitchen or cooking department."},{"definition":"The art of cooking, generally."}],"partOfSpeech":"n"}]},{"word":"TAPESTRIES","idx":26466,"count":988787,"meanings":[{"definitions":[{"definition":"A heavy woven cloth, often with decorative pictorial designs, normally hung on walls."},{"definition":"(by extension) Anything with variegated or complex details."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To decorate with tapestry, or as if with a tapestry."}],"partOfSpeech":"ve"}]},{"word":"TRANSATLANTIC","idx":26467,"count":988757,"meanings":[{"definitions":[{"definition":"On, spanning or crossing, or from the other side of the Atlantic Ocean."}],"partOfSpeech":"j"}]},{"word":"BOOSTED","idx":26470,"count":988320,"meanings":[{"definitions":[{"definition":"To lift or push from behind (one who is endeavoring to climb); to push up."},{"definition":"(by extension) To help or encourage (something) to increase or improve; to assist in overcoming obstacles.","example":"This campaign will boost your chances of winning the election."},{"definition":"To steal."},{"definition":"To jump-start a vehicle by using cables to connect the battery in a running vehicle to the battery in a vehicle that won't start."},{"definition":"To give a booster shot to."},{"definition":"To amplify; to signal boost."}],"partOfSpeech":"ve"}]},{"word":"SPRAYED","idx":26471,"count":988292,"meanings":[{"definitions":[{"definition":"To project a liquid in a dispersive manner toward something.","example":"The firemen sprayed the house."},{"definition":"To project in a dispersive manner.","example":"Spray some ointment on that scratch."},{"definition":"To project many small items dispersively."},{"definition":"To urinate in order to mark territory."},{"definition":"To allocate blocks of memory from (a heap, etc.), and fill them with the same byte sequence, hoping to establish that sequence in a certain predetermined location as part of an exploit.","example":"to spray the heap of a target process"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Chapped with cold"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/spɹeɪd/"}]},{"word":"GEARING","idx":26473,"count":988275,"meanings":[{"definitions":[{"definition":"To provide with gearing; to fit with gears in order to achieve a desired gear ratio."},{"definition":"To be in, or come into, gear."},{"definition":"To dress; to put gear on; to harness."},{"definition":"(usually with to or toward(s)) To design or devise (something) so as to be suitable (for a particular type of person or a particular purpose).","example":"They have geared the hotel mainly at tourists."},{"definition":"To borrow money in order to invest it in assets."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The ratio of a system of gears.","example":"The 4×4 could climb well, as it had relatively low gearing."},{"definition":"Harness; working implements."},{"definition":"A train of toothed wheels and pinions."}],"partOfSpeech":"n"}]},{"word":"GLUTATHIONE","idx":26474,"count":988253,"meanings":[{"definitions":[{"definition":"A tripeptide formed from glutamic acid, cysteine and glycine, that is active in many biological redox reactions"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɡluːtəˈθaɪəʊn/"}]},{"word":"FREEING","idx":26475,"count":988180,"meanings":[{"definitions":[{"definition":"To make free; set at liberty; release."},{"definition":"To rid of something that confines or oppresses."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of making something free; liberation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɹiːɪŋ/"}]},{"word":"REDRESS","idx":26477,"count":988120,"meanings":[{"definitions":[{"definition":"The act of redressing; a making right; amendment; correction; reformation."},{"definition":"A setting right, as of injury, oppression, or wrong, such as the redress of grievances; hence, indemnification; relief; remedy; reparation."},{"definition":"One who, or that which, gives relief; a redresser."},{"definition":"The redecoration of a previously existing film set so that it can double for another set."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put in order again; to set right; to revise."},{"definition":"To set right (a wrong); to repair, (an injury); to make amends for; to remedy; to relieve from."},{"definition":"To make amends or compensation to; to relieve of anything unjust or oppressive; to bestow relief upon."},{"definition":"To put upright again; to restore."},{"definition":"To dress again."},{"definition":"To redecorate a previously existing film set so that it can double for another set."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"redress-1-us","text":"/ɹiˈdɹɛs/"}]},{"word":"ADOPTIONS","idx":26478,"count":988101,"meanings":[{"definitions":[{"definition":"The act of adopting."},{"definition":"The state of being adopted; the acceptance of a child of other parents as if he or she were one's own child.","example":"A Chinese baby girl was given away for adoption."},{"definition":"Admission to an institution, for example a hospital, clinic, mental asylum.","example":"the adoption of people into hospitals or monasteries"},{"definition":"The choosing and making that to be one's own which originally was not so; acceptance","example":"the adoption of opinions"},{"definition":"Transfer between an old system to another (usually better) system.","example":"Our company is considering the adoption of a four-day week."},{"definition":"An act of divine grace by which the redeemed in Christ are admitted to the privileges of the sons of God."},{"definition":"Ten consecutive wins against an opponent."}],"partOfSpeech":"n"}]},{"word":"SETTLES","idx":26479,"count":988013,"meanings":[{"definitions":[{"definition":"To conclude or resolve (something):"},{"definition":"To place or arrange in(to) a desired (especially: calm) state, or make final disposition of (something).","example":"to settle her estate"},{"definition":"To become calm, quiet, or orderly; to stop being agitated.","example":"the weather settled;  wait until the crowd settles before speaking"},{"definition":"To establish or become established in a steady position:"},{"definition":"To fix one's residence in a place; to establish a dwelling place, home, or colony. (Compare settle down.)","example":"the Saxons who settled in Britain"},{"definition":"To move (people) to (a land or territory), so as to colonize it; to cause (people) to take residence in (a place)."},{"definition":"To sink, or cause (something, or impurities within it) to sink down, especially so as to become clear or compact."},{"definition":"To make a jointure for a spouse."},{"definition":"(of an animal) To make or become pregnant."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A seat of any kind."},{"definition":"A long bench with a high back and arms, often with chest or storage space underneath."},{"definition":"A place made lower than the rest; a wide step or platform lower than some other part. (Compare a depression.)"}],"partOfSpeech":"n"}]},{"word":"TWEAKING","idx":26480,"count":987952,"meanings":[{"definitions":[{"definition":"To pinch and pull with a sudden jerk and twist; to twitch.","example":"to tweak the nose."},{"definition":"To adjust slightly; to fine-tune.","example":"If we tweak the colors towards blue, it will look more natural."},{"definition":"To twit or tease."},{"definition":"To abuse methamphetamines, especially crystal meth."},{"definition":"To exhibit symptoms of methamphetamine abuse, such as extreme nervousness, compulsiveness, erratic motion, excitability; possibly a blend of twitch and freak."},{"definition":"To exhibit extreme nervousness, evasiveness when confronted by law enforcement or other authority (e.g., customs agents, border patrol, teacher, etc.), mimicking methamphetamine abuse symptoms."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A tweak; a minor modification."}],"partOfSpeech":"n"}]},{"word":"ANGINA","idx":26481,"count":987931,"meanings":[{"definitions":[{"definition":"An inflammatory infection of the throat, particularly quinsy."},{"definition":"Short for angina pectoris."},{"definition":"A chest pain or shortness of breath occurring with lesser degrees of arterial blockage."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ænˈdʒaɪ.nə/"}]},{"word":"GEEKY","idx":26482,"count":987806,"meanings":[{"definitions":[{"definition":"Resembling or characteristic of a geek.","example":"2004, Buddy Holly is a slightly more contentious inclusion, even if he did live fast, die young and leave a geeky-looking corpse. — Fiona Shepherd in Return of the Sun King, The Scotsman, 2 July 2004"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡiːki/"}]},{"word":"COUPLER","idx":26484,"count":987783,"meanings":[{"definitions":[{"definition":"Someone who couples things together, especially someone whose job it is to couple railway carriages."},{"definition":"Anything that serves to couple things together; but especially a device that couples railway carriages."},{"definition":"A device that connects two keyboards of an organ together so that they play together."},{"definition":"A device used to convert electronic information into audible sound signals for transmission over telephone lines."},{"definition":"An electrical device used to transfer energy from one electric device to another, especially without a physical connection."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkʌplə/"}]},{"word":"SEAMAN","idx":26487,"count":987637,"meanings":[{"definitions":[{"definition":"A mariner or sailor, one who mans a ship. Opposed to landman or landsman."},{"definition":"A person of the lowest rank in the Navy, below able seaman."},{"definition":"An enlisted rate in the United States Navy and United States Coast Guard, ranking below petty officer third class and above seaman apprentice."},{"definition":"A merman; the male of the mermaid."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"seaman-us","text":"/ˈsiːmən/"}]},{"word":"SKULLS","idx":26489,"count":987461,"meanings":[{"definitions":[{"definition":"(collective) A group of fish or a group of marine mammals such as porpoises, dolphins, or whales.","example":"The divers encountered a huge school of mackerel."},{"definition":"A multitude."},{"definition":"The main bones of the head considered as a unit; including the cranium, facial bones, and mandible."},{"definition":"A symbol for death; death's-head"},{"definition":"The mind or brain."},{"definition":"A crust formed on the ladle, etc. by the partial cooling of molten metal."},{"definition":"The crown of the headpiece in armour."},{"definition":"A shallow bow-handled basket."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit in the head with a fist, a weapon, or a thrown object."},{"definition":"To strike the top of (the ball)."}],"partOfSpeech":"ve"}]},{"word":"CAYENNE","idx":26491,"count":987401,"meanings":[{"definitions":[{"definition":"Cayenne pepper.","example":"His barbeque sauce could use a hint of cayenne to heat it up a bit."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kaɪˈɛn/"}]},{"word":"MINIMIZES","idx":26492,"count":987331,"meanings":[{"definitions":[{"definition":"To make (something) as small or as insignificant as possible."},{"definition":"To remove (a window) from the main display area, collapsing it to an icon or caption.","example":"I didn't close anything, but I minimized all the windows so I could see the desktop."},{"definition":"To treat (someone) slightingly."}],"partOfSpeech":"ve"}]},{"word":"BALBOA","idx":26494,"count":987133,"meanings":[{"definitions":[{"definition":"The currency of Panama, divided into 100 centésimos"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bælˈbəʊə/"}]},{"word":"TREATISE","idx":26496,"count":987068,"meanings":[{"definitions":[{"definition":"A formal, usually lengthy, systematic discourse on some subject."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"treatise-us","text":"/ˈtɹiːtɪs/"}]},{"word":"DEFEATS","idx":26497,"count":987066,"meanings":[{"definitions":[{"definition":"To overcome in battle or contest.","example":"Wellington defeated Napoleon at Waterloo."},{"definition":"To reduce, to nothing, the strength of."},{"definition":"To nullify"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or instance of being defeated, of being overcome or vanquished; a loss.","example":"Licking their wounds after a temporary defeat, they planned their next move."},{"definition":"The act or instance of defeating, of overcoming, vanquishing.","example":"The inscription records her defeat of the country's enemies in a costly war."},{"definition":"Frustration (by prevention of success), stymieing; nullification."},{"definition":"Destruction, ruin."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"defeats-us"}]},{"word":"TESTIMONIES","idx":26498,"count":987000,"meanings":[{"definitions":[{"definition":"Statements made by a witness in court."},{"definition":"An account of first-hand experience."},{"definition":"In a church service, a personal account, such as of one's conversion."},{"definition":"Witness; evidence; proof of some fact."}],"partOfSpeech":"n"}]},{"word":"WAINWRIGHT","idx":26499,"count":986625,"meanings":[{"definitions":[{"definition":"A person who builds and repairs wagons"}],"partOfSpeech":"n"}]},{"word":"KALI","idx":26503,"count":986520,"meanings":[{"definitions":[{"definition":"The prickly glasswort (Kali turgida, formerly Salsola kali)."},{"definition":"Traditional Philippine stick fighting, a martial art."}],"partOfSpeech":"n"}]},{"word":"ITCH","idx":26506,"count":986466,"meanings":[{"definitions":[{"definition":"A sensation felt on an area of the skin that causes a person or animal to want to scratch."},{"definition":"A constant teasing desire or want."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feel itchy; to feel a need to be scratched."},{"definition":"To have a constant, teasing urge; to feel strongly motivated; to want or desire something.","example":"He started learning to drive and he has been itching for opportunities to practice ever since."},{"definition":"To cause to feel an itch."},{"definition":"To scratch or rub so as to relieve an itch."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"itch-us","text":"/ɪt͡ʃ/"}]},{"word":"WITHDRAWING","idx":26508,"count":986264,"meanings":[{"definitions":[{"definition":"To pull (something) back, aside, or away."},{"definition":"To stop talking to, or interacting with, other people and start thinking thoughts that are not related to what is happening around."},{"definition":"To take back (a comment, etc); retract.","example":"to withdraw false charges"},{"definition":"To remove, to stop providing (one's support, etc); to take out of service."},{"definition":"To extract (money from an account)."},{"definition":"To retreat."},{"definition":"To be in withdrawal from an addictive drug etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Withdrawal"}],"partOfSpeech":"n"}]},{"word":"SOLICITED","idx":26509,"count":986212,"meanings":[{"definitions":[{"definition":"To persistently endeavor to obtain an object, or bring about an event.","example":"to solicit alms, or a favour"},{"definition":"To woo; to court."},{"definition":"To persuade or incite one to commit some act, especially illegal or sexual behavior.","example":"If you want to lose your virginity, you should try to solicit some fine looking women."},{"definition":"To offer to perform sexual activity, especially when for a payment.","example":"My girlfriend tried to solicit me for sex, but I was tired."},{"definition":"To make a petition."},{"definition":"To disturb or trouble; to harass."},{"definition":"To urge the claims of; to plead; to act as solicitor for or with reference to."},{"definition":"To disturb; to disquiet."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/səˈlɪsɪtɪd/"}]},{"word":"CHIPPING","idx":26516,"count":985825,"meanings":[{"definitions":[{"definition":"To chop or cut into small pieces.","example":"The workers chipped the dead branches into mulch."},{"definition":"To break small pieces from.","example":"Be careful not to chip the paint."},{"definition":"To play a shot hitting the ball predominantly upwards rather than forwards. In association football specifically, when the shot is a shot on goal, the opposing goalkeeper may be the direct object of the verb, rather than the ball."},{"definition":"To upgrade an engine management system, usually to increase power."},{"definition":"To become chipped.","example":"This varnish chips easily."},{"definition":"(often with \"in\") To ante (up)."},{"definition":"To fit (an animal) with a microchip."},{"definition":"(often with \"in\") to contribute.","example":"Everyone needs to chip in £1 for George's leaving collection"},{"definition":"(also, to chip at) To make fun of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A fragment broken off a larger material."},{"definition":"The act of breaking something into small fragments, or of removing fragments from pottery etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtʃɪpɪŋ/"}]},{"word":"MONTAGE","idx":26517,"count":985815,"meanings":[{"definitions":[{"definition":"A composite work, particularly an artwork, created by assembling or putting together other elements such as pieces of music, pictures, texts, videos, etc."},{"definition":"The art or process of doing this."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To combine into, or depict as, a montage."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"montage-us","text":"/mɑnˈtɑʒ/"}]},{"word":"BRILLIANTLY","idx":26518,"count":985811,"meanings":[{"definitions":[{"definition":"In a brilliant manner; with brilliance."}],"partOfSpeech":"v"}]},{"word":"BIASES","idx":26523,"count":985643,"meanings":[{"definitions":[{"definition":"Inclination towards something; predisposition, partiality, prejudice, preference, predilection."},{"definition":"The diagonal line between warp and weft in a woven fabric."},{"definition":"A wedge-shaped piece of cloth taken out of a garment (such as the waist of a dress) to diminish its circumference."},{"definition":"A voltage or current applied to an electronic device, such as a transistor electrode, to move its operating point to a desired part of its transfer function."},{"definition":"The difference between the expectation of the sample estimator and the true population value, which reduces the representativeness of the estimator by systematically distorting it."},{"definition":"In the games of crown green bowls and lawn bowls: a weight added to one side of a bowl so that as it rolls, it will follow a curved rather than a straight path; the oblique line followed by such a bowl; the lopsided shape or structure of such a bowl. In lawn bowls, the curved course is caused only by the shape of the bowl. The use of weights is prohibited."},{"definition":"A person's favourite member of a K-pop band."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place bias upon; to influence.","example":"Our prejudices bias our views."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"biases-us","text":"/ˈbaɪəsɪz/"}]},{"word":"DILL","idx":26526,"count":985517,"meanings":[{"definitions":[{"definition":"Anethum graveolens (the type species of the genus Anethum), a herb, the seeds of which are moderately warming, pungent, and aromatic, formerly used as a soothing medicine for children; also known as dillseed."},{"definition":"A cucumber pickled with dill flavoring"},{"definition":"A fool."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook or flavor with dill"},{"definition":"To still; to assuage; to calm; to soothe, as one in pain."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dill-uk","text":"/dɪɫ/"}]},{"word":"SPRAWL","idx":26527,"count":985396,"meanings":[{"definitions":[{"definition":"An ungainly sprawling posture."},{"definition":"A straggling, haphazard growth, especially of housing on the edge of a city."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sit with the limbs spread out."},{"definition":"To spread out in a disorderly fashion; to straggle."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/spɹɔːl/"}]},{"word":"REOPEN","idx":26528,"count":985259,"meanings":[{"definitions":[{"definition":"To open (something) again."},{"definition":"To open again."}],"partOfSpeech":"ve"}]},{"word":"ALFREDO","idx":26531,"count":985191,"meanings":[{"definitions":[{"definition":"(noun adjunct) The sauce made from butter and Parmesan cheese used in dishes such as fettuccine Alfredo, or any dish of this type."}],"partOfSpeech":"n"}]},{"word":"HAUNT","idx":26532,"count":985188,"meanings":[{"definitions":[{"definition":"A place at which one is regularly found; a habitation or hangout.","example":"I went back the town I used to live and visited all my old haunts."},{"definition":"A ghost."},{"definition":"A feeding place for animals."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To inhabit, or visit frequently (most often used in reference to ghosts).","example":"A couple of ghosts haunt the old, burnt-down house."},{"definition":"To make uneasy, restless.","example":"The memory of his past failures haunted him."},{"definition":"To stalk, to follow","example":"The policeman haunted him, following him everywhere."},{"definition":"To live habitually; to stay, to remain."},{"definition":"To accustom; habituate; make accustomed to."},{"definition":"To practise; to devote oneself to."},{"definition":"To persist in staying or visiting."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"haunt-uk","text":"/hænt/"}]},{"word":"HEDGING","idx":26533,"count":985167,"meanings":[{"definitions":[{"definition":"To enclose with a hedge or hedges.","example":"to hedge a field or garden"},{"definition":"To obstruct or surround."},{"definition":"To offset the risk associated with."},{"definition":"To avoid verbal commitment.","example":"He carefully hedged his statements with weasel words."},{"definition":"To construct or repair a hedge."},{"definition":"To reduce one's exposure to risk."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who hedges (in various senses)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɛdʒɪŋ/"}]},{"word":"ERASED","idx":26534,"count":985056,"meanings":[{"definitions":[{"definition":"To remove markings or information","example":"I erased that note because it was wrong."},{"definition":"To obliterate information from (a storage medium), such as to clear or (with magnetic storage) to demagnetize.","example":"I'm going to erase this tape."},{"definition":"To obliterate (information) from a storage medium, such as to clear or to overwrite.","example":"I'm going to erase those files."},{"definition":"To remove a runner from the bases via a double play or pick off play","example":"Jones was erased by a 6-4-3 double play."},{"definition":"To be erased (have markings removed, have information removed or be cleared of information).","example":"The chalkboard erased easily."},{"definition":"To disregard (a group, an orientation, etc.); to prevent from having an active role in society."},{"definition":"To kill; assassinate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having the appearance of being forcibly torn off, with parts left jagged or uneven."}],"partOfSpeech":"j"}]},{"word":"INSULATING","idx":26535,"count":985043,"meanings":[{"definitions":[{"definition":"To separate, detach, or isolate."},{"definition":"To separate a body or material from others, e.g. by non-conductors to prevent the transfer of electricity, heat, etc.","example":"Ceramic can be used to insulate power lines."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That insulates."}],"partOfSpeech":"j"}]},{"word":"RESISTING","idx":26538,"count":984906,"meanings":[{"definitions":[{"definition":"To attempt to counter the actions or effects of."},{"definition":"To withstand the actions of."},{"definition":"To oppose."},{"definition":"To be distasteful to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Resistance"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"resisting-us"}]},{"word":"CONGREGATIONAL","idx":26539,"count":984849,"meanings":[{"definitions":[{"definition":"Of or pertaining to a congregation"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kɑŋɡɹəˈɡeɪʃənəl/"},{"text":"/kɒŋɡɹəˈɡeɪʃənəl/"}]},{"word":"WATERFOWL","idx":26541,"count":984798,"meanings":[{"definitions":[{"definition":"Any of the birds, such as ducks, geese and swans, that spend most of their non-flying time on water; especially those of the family Anatidae."}],"partOfSpeech":"n"}]},{"word":"ANTIQUITIES","idx":26542,"count":984774,"meanings":[{"definitions":[{"definition":"Ancient times; faraway history; former ages","example":"Cicero was an eloquent orator of antiquity."},{"definition":"The people of ancient times.","example":"That such pillars were raised by Seth all antiquity has avowed. —Sir W. Raleigh."},{"definition":"An old gentleman.","example":"You are a shrewd antiquity, neighbor Clench. —B. Jonson."},{"definition":"(history) The historical period preceding the Middle Ages (c. 500-1500), primarily relating to European history."},{"definition":"(often constructed as an uncountable plural) A relic or monument of ancient times, such as a coin, a statue, etc.; an ancient institution."},{"definition":"The state of being ancient or of ancient lineage."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ænˈtɪk.wɪ.tiːz/"}]},{"word":"MONSIEUR","idx":26544,"count":984688,"meanings":[{"definitions":[{"definition":"A man, especially a French gentleman."}],"partOfSpeech":"n"}]}]