[{"word":"UPRIGHT","idx":11670,"count":3954150,"meanings":[{"definitions":[{"definition":"Any vertical part of a structure, especially one of the goal posts in sports."},{"definition":"A word clued by the successive initial, middle, or final letters of the cross-lights in a double acrostic or triple acrostic."},{"definition":"An upright piano."},{"definition":"Short for upright vacuum cleaner."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To set upright or stand back up (something that has fallen)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Vertical; erect.","example":"I was standing upright, waiting for my orders."},{"definition":"Greater in height than breadth."},{"definition":"Of good morals; practicing ethical values."},{"definition":"(of a golf club) Having the head approximately at a right angle with the shaft."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In or into an upright position"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"upright-us","text":"/ˈʌpɹaɪt/"}]},{"word":"BREAKFASTS","idx":11671,"count":3951058,"meanings":[{"definitions":[{"definition":"The first meal of the day, usually eaten in the morning.","example":"You should put more protein in her breakfast so she will grow."},{"definition":"(by extension) A meal consisting of food normally eaten in the morning, which may typically include eggs, sausages, toast, bacon, etc.","example":"We serve breakfast all day."},{"definition":"The celebratory meal served after a wedding (and occasionally after other solemnities e.g. a funeral)."},{"definition":"(largely obsolete outside religion) A meal eaten after a period of (now often religious) fasting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat the morning meal."},{"definition":"To serve breakfast to."}],"partOfSpeech":"ve"}]},{"word":"INSPECTORS","idx":11672,"count":3950723,"meanings":[{"definitions":[{"definition":"A person employed to inspect something."},{"definition":"(law enforcement) A police officer ranking below superintendent."}],"partOfSpeech":"n"}]},{"word":"EMERGENCIES","idx":11673,"count":3950644,"meanings":[{"definitions":[{"definition":"A situation which poses an immediate risk and which requires urgent attention.","example":"Cardiac arrest is an emergency and if you find someone in cardiac arrest you should call 999 immediately."},{"definition":"The department of a hospital that treats emergencies."},{"definition":"An individual brought in at short notice to replace a member of staff, a player in a sporting team, etc."},{"definition":"The quality of being emergent; sudden or unexpected appearance; an unforeseen occurrence."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/iˈmɝ.dʒən.siz/"},{"text":"/iˈmɜː.dʒən.siːz/"}]},{"word":"REUSE","idx":11674,"count":3950428,"meanings":[{"definitions":[{"definition":"The act of salvaging or in some manner restoring a discarded item to yield something usable."},{"definition":"The act of using again, or in another place.","example":"Code reuse can save programmers a lot of typing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use again something that is considered past its usefulness (usually for something else).","example":"The students reused empty plastic bottles in their science experiment."},{"definition":"To use again, or in another place."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"reuse-us","text":"/ɹiːˈjuːs/"}]},{"word":"SIGHTSEEING","idx":11676,"count":3949130,"meanings":[{"definitions":[{"definition":"To go sightseeing; to visit places of interest in a city, town or geographical area."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The activity of going out looking at things; tourism.","example":"Sightseeing is a frequent reason to visit San Francisco."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sightseeing-us"}]},{"word":"SHOCKED","idx":11677,"count":3948680,"meanings":[{"definitions":[{"definition":"To cause to be emotionally shocked, to cause (someone) to feel surprised and upset.","example":"The disaster shocked the world."},{"definition":"To give an electric shock to."},{"definition":"To meet with a shock; to collide in a violent encounter."},{"definition":"To collect, or make up, into a shock or shocks; to stook.","example":"to shock rye"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Surprised, startled, confused, or taken aback."},{"definition":"Suffering from shock.","example":"Patient is shocked."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shocked-us"},{"text":"/ʃɒkt/"}]},{"word":"THERAPIES","idx":11678,"count":3948634,"meanings":[{"definitions":[{"definition":"Attempted remediation of a health problem following a diagnosis, usually synonymous with treatment."},{"definition":"Healing power or quality."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat with a therapy."},{"definition":"To undergo a therapy."}],"partOfSpeech":"ve"}]},{"word":"ALCOHOLIC","idx":11679,"count":3947219,"meanings":[{"definitions":[{"definition":"A person addicted to alcohol."},{"definition":"One who abuses alcohol."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to alcohol."},{"definition":"Having more than a trace amount of alcohol in its contents.","example":"He ordered an alcoholic beverage."},{"definition":"Of, pertaining to, or affected by alcoholism."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"alcoholic-us","text":"/ˌælkəˈhɔlɪk/"}]},{"word":"BAKERY","idx":11680,"count":3947064,"meanings":[{"definitions":[{"definition":"A shop in which bread (and often other baked goods such as cakes) is baked and/or sold."},{"definition":"The trade of a baker."},{"definition":"The actual goods produced in a bakery such as doughnuts, long johns, bismarcks, sugar and glazed twisters, cinnamon rolls, eclairs, etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bakery-us","text":"/ˈbeɪ.kə.ɹi/"}]},{"word":"LIEUTENANT","idx":11681,"count":3946806,"meanings":[{"definitions":[{"definition":"The lowest Junior Commissioned Officer rank(s) in many military forces, often Army and Marines."},{"definition":"A person who manages or executes the plans and directives of another, more senior person - i.e. a manager to his director."},{"definition":"The second-in-command (2IC) of a group."}],"partOfSpeech":"n"},{"definitions":[{"definition":"A military grade that is junior to the grade the adjective modifies: lieutenant colonel, lieutenant general, lieutenant commander."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lieutenant-us","text":"/l(j)uˈtɛnənt/"},{"audio":"lieutenant-uk","text":"/ləˈtɛnənt/"},{"audio":"lieutenant-ca","text":"/l(j)uˈtɛnənt/"},{"audio":"lieutenant-au","text":"/ləˈtɛnənt/"}]},{"word":"ORCHID","idx":11682,"count":3946535,"meanings":[{"definitions":[{"definition":"A plant of the orchid family (Orchidaceae), bearing unusually-shaped flowers of beautiful colours."},{"definition":"A light bluish-red, violet-red or purple colour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(colour) having a light purple colour."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɔɹ.kɪd/"},{"text":"/ˈɔː.kɪd/"}]},{"word":"HISTORIES","idx":11683,"count":3943244,"meanings":[{"definitions":[{"definition":"The aggregate of past events.","example":"History repeats itself if we don’t learn from its mistakes."},{"definition":"The branch of knowledge that studies the past; the assessment of notable events.","example":"He teaches history at the university.   History will not look kindly on these tyrants.   He dreams of an invention that will make history."},{"definition":"A set of events involving an entity.","example":"What is your medical history?   The family's history includes events best forgotten."},{"definition":"A record or narrative description of past events.","example":"I really enjoyed Shakespeare's tragedies more than his histories."},{"definition":"A list of past and continuing medical conditions of an individual or family.","example":"A personal medical history is required for the insurance policy.   He has a history of cancer in his family."},{"definition":"A record of previous user events, especially of visited web pages in a browser.","example":"I visited a great site yesterday but forgot the URL. Luckily, I didn't clear my history."},{"definition":"Something that no longer exists or is no longer relevant.","example":"I told him that if he doesn't get his act together, he's history."},{"definition":"Shared experience or interaction.","example":"He has had a lot of history with the police."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To narrate or record."}],"partOfSpeech":"ve"}]},{"word":"LOSES","idx":11684,"count":3942953,"meanings":[{"definitions":[{"definition":"To cause (something) to cease to be in one's possession or capability due to unfortunate or unknown circumstances, events or reasons.","example":"He lost his hearing in the explosion."},{"definition":"To wander from; to miss, so as not to be able to find; to go astray from.","example":"I lost my way in the forest."},{"definition":"To fail to win (a game, competition, trial, etc).","example":"We lost the football match."},{"definition":"To be unable to follow or trace (somebody or something) any longer.","example":"Mission control lost the satellite as its signal died down."},{"definition":"To cause (somebody) to be unable to follow or trace one any longer.","example":"We managed to lose our pursuers in the forest."},{"definition":"To cease exhibiting; to overcome (a behavior or emotion)."},{"definition":"To shed, remove, discard, or eliminate.","example":"When we get into the building, please lose the hat."},{"definition":"Of a clock, to run slower than expected.","example":"It's already 5:30? My watch must have lost a few minutes."},{"definition":"(ditransitive) To cause (someone) the loss of something; to deprive of."},{"definition":"To fail to catch with the mind or senses; to miss.","example":"I lost a part of what he said."},{"definition":"To cause to part with; to deprive of."}],"partOfSpeech":"ve"}]},{"word":"WIDGET","idx":11685,"count":3942410,"meanings":[{"definitions":[{"definition":"A placeholder name for an unnamed, unspecified, or hypothetical manufactured good or product.","example":"Suppose we have a widget factory that produces 100 units per year..."},{"definition":"Portable code that can be easily installed and executed by an end user."},{"definition":"A floating device inside a beer can, meant to create foam when opened."},{"definition":"A small scraping tool consisting of a blade and a handle, commonly used to remove paint from glass and other smooth surfaces."},{"definition":"Any one of the components of a computer application's graphical user interface, such as a Cancel button or text input box that a user interacts with."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"widget-us"}]},{"word":"VARIABILITY","idx":11688,"count":3941754,"meanings":[{"definitions":[{"definition":"The state or characteristic of being variable."},{"definition":"The degree to which a thing is variable. In data or statistics this is often a measurement of distance from the mean or a description of data range."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌvæɹ.i.ə.ˈbɪl.ə.ti (ɪ.ti)/"}]},{"word":"SUEDE","idx":11690,"count":3941313,"meanings":[{"definitions":[{"definition":"A type of soft leather, made from calfskin, with a brushed texture to resemble fabric, often used to make boots, clothing and fashion accessories."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make (leather) into suede."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made of suede"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"suede-us","text":"/sweɪd/"}]},{"word":"OBSERVATORY","idx":11691,"count":3940254,"meanings":[{"definitions":[{"definition":"A place where stars, planets and other celestial bodies are observed, usually through a telescope; also place for observing meteorological or other natural phenomena."},{"definition":"A lookout (vantage point with a view of the surrounding area)"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"observatory-us","text":"/əbˈzəɹvətɔɹi/"}]},{"word":"SODA","idx":11692,"count":3940026,"meanings":[{"definitions":[{"definition":"Sodium bicarbonate (usually baking soda)."},{"definition":"Sodium carbonate (usually washing soda)."},{"definition":"Sodium in chemical combination."},{"definition":"Carbonated water (water impregnated with pressurised carbon dioxide, originally made with sodium bicarbonate)."},{"definition":"(especially in the northeast) Any carbonated (usually sweet) soft drink."},{"definition":"(especially in the northeast) A glass, bottle or can of this drink."},{"definition":"The first card in the dealing box in the game of faro, which is discarded to leave 51 cards in play."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsoʊdə/"},{"text":"/ˈsəʊdə/"}]},{"word":"WAITED","idx":11693,"count":3938627,"meanings":[{"definitions":[{"definition":"To delay movement or action until the arrival or occurrence of; to await. (Now generally superseded by “wait for”.)"},{"definition":"To delay movement or action until some event or time; to remain neglected or in readiness.","example":"Wait here until your car arrives."},{"definition":"To wait tables; to serve customers in a restaurant or other eating establishment.","example":"She used to wait down at the Dew Drop Inn."},{"definition":"To attend on; to accompany; especially, to attend with ceremony or respect."},{"definition":"To attend as a consequence; to follow upon; to accompany."},{"definition":"To defer or postpone (especially a meal).","example":"to wait dinner"},{"definition":"To remain chaste while one's lover is unavailable."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"waited-us","text":"/ˈweɪ.tɪd/"}]},{"word":"PREVENTIVE","idx":11694,"count":3938407,"meanings":[{"definitions":[{"definition":"A thing that prevents, hinders, or acts as an obstacle to."},{"definition":"A thing that slows the development of an illness."},{"definition":"A contraceptive, especially a condom."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Preventing, hindering, or acting as an obstacle to."},{"definition":"Carried out to deter military aggression."},{"definition":"Slowing the development of an illness; prophylactic."},{"definition":"Going before; preceding."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹɪˈvɛntɪv/"}]},{"word":"PEACH","idx":11695,"count":3938068,"meanings":[{"definitions":[{"definition":"A tree (Prunus persica), native to China and now widely cultivated throughout temperate regions, having pink flowers and edible fruit."},{"definition":"The soft juicy stone fruit of the peach tree, having yellow flesh, downy, red-tinted yellow skin, and a deeply sculptured pit or stone containing a single seed."},{"definition":"A light moderate to strong yellowish pink to light orange color."},{"definition":"A particularly admirable or pleasing person or thing."},{"definition":"A particular rock found in tin mines, sometimes associated with chlorite."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the color peach."},{"definition":"Particularly pleasing or agreeable."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To inform on someone; turn informer."},{"definition":"To inform against."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"peach-us","text":"/piːt͡ʃ/"}]},{"word":"CALCULUS","idx":11696,"count":3937205,"meanings":[{"definitions":[{"definition":"Calculation; computation."},{"definition":"Any formal system in which symbolic expressions are manipulated according to fixed rules.","example":"lambda calculus"},{"definition":"(often definite, the calculus) Differential calculus and integral calculus considered as a single subject; analysis."},{"definition":"A stony concretion that forms in a bodily organ.","example":"renal calculus ( = kidney stone)"},{"definition":"Deposits of calcium phosphate salts on teeth."},{"definition":"A decision-making method, especially one appropriate for a specialised realm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæl.kjə.ləs/"},{"text":"/ˈkæl.kjʊ.ləs/"}]},{"word":"SELECTOR","idx":11698,"count":3933869,"meanings":[{"definitions":[{"definition":"Someone or something which selects or chooses."},{"definition":"An administrator responsible for selecting which players will play for a side."},{"definition":"A matching expression in a stylesheet determining which elements in the markup are affected by a style."},{"definition":"A pointer to a structure describing a segment of memory."},{"definition":"A text string transmitted to a Gopher server, identifying the resource to be retrieved."},{"definition":"A disc jockey."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"selector-au"}]},{"word":"GOP","idx":11699,"count":3933372,"meanings":[{"definitions":[{"definition":"A particular subculture (term) in Russia, Eastern Europe, former Soviet republics, and other Slavic countries to refer to young men or women that are usually a part of lower social class (generally working class) that live in Russian suburban areas; thug."}],"partOfSpeech":"n"}]},{"word":"BREATHE","idx":11700,"count":3933278,"meanings":[{"definitions":[{"definition":"To draw air into (inhale), and expel air from (exhale), the lungs in order to extract oxygen and excrete waste gases."},{"definition":"To take in needed gases and expel waste gases in a similar way.","example":"Fish have gills so they can breathe underwater."},{"definition":"To inhale (a gas) to sustain life.","example":"While life as we know it depends on oxygen, scientists have speculated that alien life forms might breathe chlorine or methane."},{"definition":"To live.","example":"I will not allow it, as long as I still breathe."},{"definition":"To draw something into the lungs.","example":"Try not to breathe too much smoke."},{"definition":"To expel air from the lungs, exhale.","example":"If you breathe on a mirror, it will fog up."},{"definition":"To exhale or expel (something) in the manner of breath.","example":"The flowers breathed a heady perfume."},{"definition":"To give an impression of, to exude.","example":"The decor positively breathes classical elegance."},{"definition":"To whisper quietly.","example":"He breathed the words into her ear, but she understood them all."},{"definition":"To pass like breath; noiselessly or gently; to emanate; to blow gently.","example":"The wind breathes through the trees."},{"definition":"To exchange gases with the environment.","example":"Garments made of certain new materials breathe well and keep the skin relatively dry during exercise."},{"definition":"To rest; to stop and catch one's breath."},{"definition":"To stop, to give (a horse) an opportunity to catch its breath.","example":"At higher altitudes you need to breathe your horse more often."},{"definition":"To exercise; to tire by brisk exercise."},{"definition":"To passionately devote much of one's life to (an activity, etc.).","example":"Do you like hiking?  Are you kidding? I breathe hiking."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"breathe-us","text":"/bɹið/"}]},{"word":"DIAPER","idx":11701,"count":3933145,"meanings":[{"definitions":[{"definition":"A textile fabric having a diamond-shaped pattern formed by alternating directions of thread."},{"definition":"A towel or napkin made from such fabric."},{"definition":"An absorbent garment worn by a baby, by a young child not yet toilet trained, or by an adult who is incontinent; a nappy."},{"definition":"The diamond pattern associated with diaper textiles."},{"definition":"Surface decoration of any sort which consists of the constant repetition of one or more simple figures or units of design evenly spaced."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put diapers on someone.","example":"Diapering a baby is something you have to learn fast."},{"definition":"To draw flowers or figures, as upon cloth."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"diaper-us","text":"/ˈdaɪ(ə)pɚ/"}]},{"word":"HOTWIRE","idx":11703,"count":3932603,"meanings":[{"definitions":[{"definition":"To start an automobile engine by bypassing the ignition key wiring"},{"definition":"To steal a vehicle by bypassing the ignition key's security"}],"partOfSpeech":"ve"}]},{"word":"SMILING","idx":11705,"count":3931929,"meanings":[{"definitions":[{"definition":"To have (a smile) on one's face.","example":"I don't know what he's smiling about."},{"definition":"To express by smiling.","example":"to smile consent, or a welcome"},{"definition":"To express amusement, pleasure, or love and kindness."},{"definition":"To look cheerful and joyous; to have an appearance suited to excite joy.","example":"The sun smiled down from a clear summer sky."},{"definition":"To be propitious or favourable; to countenance.","example":"The gods smiled on his labours."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to smile.","example":"Smiling takes fewer muscles than frowning."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That smiles or has a smile.","example":"smiling children"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"smiling-us","text":"/ˈsmaɪlɪŋ/"}]},{"word":"OUNCES","idx":11706,"count":3931022,"meanings":[{"definitions":[{"definition":"An avoirdupois ounce, weighing 1/16 of an avoirdupois pound, or 28.3495 grams."},{"definition":"A troy ounce, weighing 1/12 of a troy pound, or 480 grains, or 31.1035 grams."},{"definition":"A US fluid ounce, with a volume of 1/16 of a US pint, 1.8047 cubic inches or 29.5735 millilitres."},{"definition":"A British imperial fluid ounce, with a volume of 1/20 of an imperial pint, 1.7339 cubic inches or 28.4131 millilitres."},{"definition":"A little bit.","example":"He didn't feel even an ounce of regret for his actions."},{"definition":"A large wild feline, such as a lynx or cougar."},{"definition":"Now specifically, the snow leopard, Uncia uncia."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈaʊnsəz/"}]},{"word":"ECONOMICALLY","idx":11708,"count":3929872,"meanings":[{"definitions":[{"definition":"(manner) In an economical manner; not wastefully; not extravagantly"},{"definition":"(domain) From the perspective of economics or an economy."},{"definition":"According to divine economy."}],"partOfSpeech":"v"}]},{"word":"UNCUT","idx":11709,"count":3929056,"meanings":[{"definitions":[{"definition":"Not cut."},{"definition":"(of a gemstone) Not cut or ground to the desired shape."},{"definition":"(of a book) Not having the page edges trimmed."},{"definition":"(of a play, film etc) Not edited or abridged by a censor."},{"definition":"Not circumcised."}],"partOfSpeech":"j"}]},{"word":"INTACT","idx":11710,"count":3928069,"meanings":[{"definitions":[{"definition":"Left complete or whole; not touched, defiled, sullied or otherwise damaged","example":"I packed my belongings carefully so that they would survive the move intact."},{"definition":"Of animals, not castrated: an intact bull."},{"definition":"Uncircumcised; commonly used to describe a penis with a foreskin in intactivism.","example":"The opposite of a circumcised penis is an intact penis."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"intact-us","text":"/ɪnˈtækt/"}]},{"word":"NOTING","idx":11711,"count":3925386,"meanings":[{"definitions":[{"definition":"To notice with care; to observe; to remark; to heed.","example":"If you look to the left, you can note the old cathedral."},{"definition":"To record in writing; to make a memorandum of.","example":"We noted his speech."},{"definition":"To denote; to designate.","example":"The modular multiplicative inverse of x may be noted x-1."},{"definition":"To annotate."},{"definition":"To set down in musical characters."},{"definition":"To record on the back of (a bill, draft, etc.) a refusal of acceptance, as the ground of a protest, which is done officially by a notary."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not any thing; no thing."},{"definition":"An absence of anything, including empty space, brightness, darkness, matter, or a vacuum."}],"partOfSpeech":"p"},{"definitions":[{"definition":"A note; a written remark."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"noting-us"}]},{"word":"SHIFTING","idx":11712,"count":3925159,"meanings":[{"definitions":[{"definition":"(sometimes figurative) To move from one place to another; to redistribute.","example":"We'll have to shift these boxes to the downtown office."},{"definition":"To change in form or character; swap."},{"definition":"To change position.","example":"His political stance shifted daily."},{"definition":"To change residence; to leave and live elsewhere.","example":"We are shifting to America next month."},{"definition":"To change (clothes, especially underwear)."},{"definition":"To change (someone's) clothes; sometimes specifically, to change underwear."},{"definition":"To change gears (in a car).","example":"I crested the hill and shifted into fifth."},{"definition":"(typewriters) To move the keys of a typewriter over in order to type capital letters and special characters."},{"definition":"(computer keyboards) To switch to a character entry mode for capital letters and special characters."},{"definition":"To manipulate a binary number by moving all of its digits left or right; compare rotate.","example":"Shifting 1001 to the left yields 10010; shifting it right yields 100."},{"definition":"To remove the first value from an array."},{"definition":"To dispose of.","example":"How can I shift a grass stain?"},{"definition":"To hurry.","example":"If you shift, you might make the 2:19."},{"definition":"To engage in sexual petting."},{"definition":"To resort to expedients for accomplishing a purpose; to contrive; to manage."},{"definition":"To practice indirect or evasive methods."},{"definition":"In violin-playing, to move the left hand from its original position next to the nut."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A shift or change; a shifting movement."},{"definition":"The phenomenon by which two or more constituents appearing on the same side of their common head exchange positions to obtain non-canonical order."}],"partOfSpeech":"n"}]},{"word":"SAMURAI","idx":11713,"count":3924698,"meanings":[{"definitions":[{"definition":"In feudal Japan, a soldier who served a daimyo."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"samurai-us","text":"/ˈsæməˌɹaɪ/"}]},{"word":"SUBTOTAL","idx":11716,"count":3923296,"meanings":[{"definitions":[{"definition":"The total for a part of a list of numbers being summed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To calculate a subtotal."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Less than total; partial."}],"partOfSpeech":"j"}]},{"word":"COEFFICIENTS","idx":11717,"count":3922786,"meanings":[{"definitions":[{"definition":"A constant by which an algebraic term is multiplied."},{"definition":"A number, value or item that serves as a measure of some property or characteristic."}],"partOfSpeech":"n"}]},{"word":"DUPLEX","idx":11718,"count":3922761,"meanings":[{"definitions":[{"definition":"A house made up of two dwelling units."},{"definition":"A cancellation combining a numerical cancellation with a second mark showing time, date, and place of posting."},{"definition":"A throwing motion where two balls are thrown with one hand at the same time."},{"definition":"A double-stranded polynucleotide."},{"definition":"A system of multiple thrust faults bounded above and below by a roof thrust and floor thrust."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make duplex."},{"definition":"To make into a duplex."},{"definition":"(juggling) To make a series of duplex throws."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Double, made up of two parts."},{"definition":"Bidirectional (in two directions).","example":"duplex telegraphy"},{"definition":"Having horizons with contrasting textures."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈduplɛks/"}]},{"word":"IVY","idx":11719,"count":3922494,"meanings":[{"definitions":[{"definition":"Any of several woody, climbing or trailing evergreen plants of the genus Hedera."},{"definition":"Any similar plant of any genus."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ivy-us","text":"/ˈaɪvi/"}]},{"word":"DELEGATE","idx":11721,"count":3921156,"meanings":[{"definitions":[{"definition":"A person authorized to act as representative for another; a deputy"},{"definition":"A representative at a conference, etc."},{"definition":"An appointed representative in some legislative bodies"},{"definition":"A type of variable storing a reference to a method with a particular signature, analogous to a function pointer"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To authorize someone to be a delegate"},{"definition":"To commit a task to someone, especially a subordinate"},{"definition":"(of a subdomain) to give away authority over a subdomain; to allow someone else to create sub-subdomains of a subdomain of one's own"}],"partOfSpeech":"ve"}]},{"word":"LIGHTLY","idx":11722,"count":3921147,"meanings":[{"definitions":[{"definition":"In a light manner.","example":"As a teacher, I don't take rudeness in class lightly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"lightly-us","text":"/ˈlaɪtli/"}]},{"word":"NEGOTIATED","idx":11723,"count":3920525,"meanings":[{"definitions":[{"definition":"To confer with others in order to come to terms or reach an agreement."},{"definition":"To arrange or settle something by mutual agreement.","example":"The client and server computers must first negotiate a network protocol to be used."},{"definition":"To succeed in coping with, or getting over something.","example":"Although the car was quite rickety, he could negotiate the curves very well."},{"definition":"To transfer to another person with all the rights of the original holder; to pass, as a bill."},{"definition":"To transact business; to carry on trade."},{"definition":"To intrigue; to scheme."}],"partOfSpeech":"ve"}]},{"word":"CONGESTION","idx":11727,"count":3917609,"meanings":[{"definitions":[{"definition":"The hindrance or blockage of the passage of something, for example a fluid, mixture, traffic, people, etc. (due to an excess of this or due to a partial or complete obstruction), resulting in overfilling or overcrowding."},{"definition":"An excess or accumulation of something"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-ˈd͡ʒɛʃ.d͡ʒən/"},{"text":"/kʊnˈd͡ʒɛʃ.d͡ʒən/"}]},{"word":"RUNNERS","idx":11728,"count":3917217,"meanings":[{"definitions":[{"definition":"Act or instance of running, of moving rapidly using the feet.","example":"I just got back from my morning run."},{"definition":"Act or instance of hurrying (to or from a place) (not necessarily by foot); dash or errand, trip.","example":"I need to make a run to the store."},{"definition":"A pleasure trip.","example":"Let's go for a run in the car."},{"definition":"Flight, instance or period of fleeing."},{"definition":"Migration (of fish)."},{"definition":"A group of fish that migrate, or ascend a river for the purpose of spawning."},{"definition":"A path taken by literal movement or figuratively"},{"definition":"An enclosure for an animal; a track or path along which something can travel.","example":"He set up a rabbit run."},{"definition":"Rural landholding for farming, usually for running sheep, and operated by a runholder."},{"definition":"State of being current; currency; popularity."},{"definition":"Continuous or sequential"},{"definition":"A flow of liquid; a leak.","example":"The constant run of water from the faucet annoys me."},{"definition":"(West Virginia) A small creek or part thereof. (Compare Southern US branch and New York and New England brook.)","example":"The military campaign near that creek was known as \"The battle of Bull Run\"."},{"definition":"A quick pace, faster than a walk.","example":"He broke into a run."},{"definition":"A sudden series of demands on a bank or other financial institution, especially characterised by great withdrawals.","example":"Financial insecurity led to a run on the banks, as customers feared for the security of their savings."},{"definition":"Any sudden large demand for something.","example":"There was a run on Christmas presents."},{"definition":"Various horizontal dimensions or surfaces"},{"definition":"A standard or unexceptional group or category.","example":"He stood out from the usual run of applicants."},{"definition":"In sports"},{"definition":"A line of knit stitches that have unravelled, particularly in a nylon stocking.","example":"I have a run in my stocking."},{"definition":"The stern of the underwater body of a ship from where it begins to curve upward and inward."},{"definition":"The horizontal distance to which a drift may be carried, either by licence of the proprietor of a mine or by the nature of the formation; also, the direction which a vein of ore or other substance takes."},{"definition":"A pair or set of millstones."},{"definition":"(usually in the phrase 'do a runner') A quick escape away from a scene.","example":"He did a runner after robbing the drugstore."},{"definition":"A deserter."},{"definition":"A type of soft-soled shoe originally intended for runners."},{"definition":"Part of a shoe that is stitched to the bottom of the upper so it can be glued to the sole."},{"definition":"A part of an apparatus that moves quickly.","example":"After the cycle completes, the runner travels back quickly to be in place for the next cycle."},{"definition":"A mechanical part intended to guide or aid something else to move (using wheels or sliding)."},{"definition":"An automobile; a working or driveable automobile.","example":"Is that old Mercedes on the forecourt a runner? / No, it has no gearbox."},{"definition":"A strip of fabric used to decorate or protect a table or dressing table.","example":"The red runner makes the table so festive."},{"definition":"A long, narrow carpet for a high traffic area such as a hall or stairs.","example":"How about we put down a clear runner in the front hall."},{"definition":"A part of a cigarette that is burning unevenly."},{"definition":"A long stolon sent out by a plant (such as strawberry), in order to root new plantlets, or a plant that propagates by using such runners."},{"definition":"A short sling with a carabiner on either end, used to link the climbing rope to a bolt or other protection such as a nut or friend."},{"definition":"A competitor in a poker tournament."},{"definition":"A restaurant employee responsible for taking food from the kitchens to the tables."},{"definition":"A leaping food fish (Elagatis pinnulatis) of Florida and the West Indies; the skipjack, shoemaker, or yellowtail."},{"definition":"(sports slang) An employee of a sports agent who tries to recruit possible player clients for the agent."},{"definition":"A rope to increase the power of a tackle."},{"definition":"A speedrunner."},{"definition":"An idea or plan that has potential to be adopted or put into operation.","example":"This idea isn't a runner. Let's not waste any more time on it."},{"definition":"Running shoes, sneakers, trainers"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"runners-au"}]},{"word":"STOVE","idx":11729,"count":3914849,"meanings":[{"definitions":[{"definition":"A heater, a closed apparatus to burn fuel for the warming of a room."},{"definition":"A device for heating food, (UK) a cooker."},{"definition":"A hothouse (heated greenhouse)."},{"definition":"A house or room artificially warmed or heated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To heat or dry, as in a stove.","example":"to stove feathers"},{"definition":"To keep warm, in a house or room, by artificial heat.","example":"to stove orange trees"},{"definition":"To fit or furnish with staves or rundles."},{"definition":"(usually with 'in') To break in the staves of; to break a hole in; to burst.","example":"to stave in a cask"},{"definition":"(with 'off') To push, or keep off, as with a staff."},{"definition":"(usually with 'off') To delay by force or craft; to drive away.","example":"We ate grass in an attempt to stave off our hunger."},{"definition":"(rare or archaic) To burst in pieces by striking against something."},{"definition":"To walk or move rapidly."},{"definition":"To suffer, or cause to be lost by breaking the cask."},{"definition":"To render impervious or solid by driving with a calking iron.","example":"to stave lead, or the joints of pipes into which lead has been run"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stove-us","text":"/stoʊv/"}]},{"word":"ACCIDENTAL","idx":11732,"count":3914021,"meanings":[{"definitions":[{"definition":"A property which is not essential; a nonessential; anything happening accidentally."},{"definition":"Those fortuitous effects produced by luminous rays falling on certain objects so that some parts stand forth in abnormal brightness and other parts are cast into a deep shadow."},{"definition":"A sharp, flat, or natural, occurring not at the commencement of a piece of music as the signature, but before a particular note."},{"definition":"Part of a text that has a mainly structural purpose, such as spelling, punctuation or capitalization."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not essential; incidental, secondary."},{"definition":"Nonessential to something's inherent nature (especially in Aristotelian thought)."},{"definition":"Adjusted by one or two semitones, in temporary departure from the key signature."},{"definition":"Occurring sometimes, by chance; occasional."},{"definition":"Happening by chance, or unexpectedly; taking place not according to the usual course of things; by accident, unintentional."},{"definition":"Being a double point with two distinct tangent planes in 4-dimensional projective space."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"accidental-us","text":"/ˌæk.sɪ.ˈdɛn.tl̩/"}]},{"word":"TALENTS","idx":11733,"count":3913506,"meanings":[{"definitions":[{"definition":"A marked natural ability or skill.","example":"He has a real talent for drawing."},{"definition":"A unit of weight and money used in ancient times in Greece, the Roman Empire, and the Middle East."},{"definition":"A desire or inclination for something."},{"definition":"People of talent, viewed collectively; a talented person.","example":"The director searched their talent pool to fill the new opening."},{"definition":"The men or (especially) women of a place or area, judged by their attractiveness.","example":"Not much talent in this bar tonight—let's hit the clubs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"talents-us","text":"/ˈtælənts/"}]},{"word":"REFUGE","idx":11735,"count":3910887,"meanings":[{"definitions":[{"definition":"A state of safety, protection or shelter."},{"definition":"A place providing safety, protection or shelter."},{"definition":"Something or someone turned to for safety or assistance; a recourse or resort."},{"definition":"An expedient to secure protection or defence."},{"definition":"A refuge island."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To return to a place of shelter."},{"definition":"To shelter; to protect."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"refuge-us","text":"/ˈɹɛfjuːdʒ/"},{"audio":"refuge-uk","text":"/ˈɹɛfjuːdʒ/"}]},{"word":"NUTRIENT","idx":11738,"count":3910296,"meanings":[{"definitions":[{"definition":"A source of nourishment, such as food, that can be metabolized by an organism to give energy and build tissue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Providing nourishment."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈnuː.tɹi.ənt/"},{"text":"/ˈnjuː.tɹi.ənt/"}]},{"word":"UNDERWAY","idx":11741,"count":3909347,"meanings":[{"definitions":[{"definition":"A road, track, path, or street for going under another way or obstacle."},{"definition":"An underground passage, tunnel."},{"definition":"A voyage, especially underwater."}],"partOfSpeech":"n"},{"definitions":[{"definition":"In motion, in progress; being done or carried out; on a journey."}],"partOfSpeech":"v"}]},{"word":"CARVED","idx":11742,"count":3908746,"meanings":[{"definitions":[{"definition":"To cut."},{"definition":"To cut meat in order to serve it.","example":"You carve the roast and I'll serve the vegetables."},{"definition":"To shape to sculptural effect; to produce (a work) by cutting, or to cut (a material) into a finished work.","example":"to carve a name into a tree"},{"definition":"To perform a series of turns without pivoting, so that the tip and tail of the snowboard take the same path."},{"definition":"To take or make, as by cutting; to provide."},{"definition":"To lay out; to contrive; to design; to plan."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of an object, made by carving.","example":"a carved ivory statue of the Virgin Mary"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"carved-us","text":"/kɑɹvd/"}]},{"word":"ARK","idx":11743,"count":3908616,"meanings":[{"definitions":[{"definition":"A large box with a flat lid."},{"definition":"Noah's Ark: the ship built by Noah to save his family and a collection of animals from the deluge."},{"definition":"Something affording protection; safety, shelter, refuge"},{"definition":"A spacious type of boat with a flat bottom."},{"definition":"The Ark of the Covenant."},{"definition":"A decorated cabinet at the front of a synagogue, in which Torah scrolls are kept."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ark-us","text":"/ɑɹk/"}]},{"word":"FREAK","idx":11744,"count":3908219,"meanings":[{"definitions":[{"definition":"A sudden change of mind"},{"definition":"Someone or something that is markedly unusual or unpredictable.","example":"a freak genius"},{"definition":"A hippie."},{"definition":"A drug addict."},{"definition":"(of a person) A nonconformist, especially in appearance, social behavior, sexual orientation, gender identity, and/or business practices; an oddball, especially in physiology (i.e., \"circus freak\"); unique, sometimes in a displeasing way."},{"definition":"A person whose physique has grown far beyond the normal limits of muscular development; often a bodybuilder weighing more than 120 kilos (260 pounds)."},{"definition":"An enthusiast, or person who has an obsession with, or extreme knowledge of, something.","example":"Bob's a real video-game freak. He owns every games console of the last ten years."},{"definition":"(sometimes affectionate) A very sexually perverse individual.","example":"She's a freak in the sack!"},{"definition":"A streak of colour; variegation."},{"definition":"A man, particularly a bold, strong, vigorous man."},{"definition":"A fellow; a petulant young man."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make greatly distressed and/or a discomposed appearance"},{"definition":"To be placed or place someone under the influence of a psychedelic drug"},{"definition":"To streak; to variegate"},{"definition":"To experience reality withdrawal, or hallucinations (nightmarish), to behave irrational or unconventional due to drug use."},{"definition":"To react extremely or irrationally, usually under distress or discomposure"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Strange, weird, unexpected"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"freak-1-uk","text":"/fɹiːk/"}]},{"word":"OBSTACLES","idx":11745,"count":3908106,"meanings":[{"definitions":[{"definition":"Something that impedes, stands in the way of, or holds up progress","example":"A big obstacle to understanding the manual was that it had been poorly translated from the Japanese."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"obstacles-us"}]},{"word":"GOVT","idx":11746,"count":3907100,"meanings":[{"definitions":[{"definition":"The body with the power to make and/or enforce laws to control a country, land area, people or organization."},{"definition":"(grammar) The relationship between a word and its dependents."},{"definition":"The state and its administration viewed as the ruling political power.","example":"If the citizens must follow the law, then the government must follow the constitution."},{"definition":"The management or control of a system."},{"definition":"The tenure of a chief of state."}],"partOfSpeech":"n"}]},{"word":"PREFERABLY","idx":11748,"count":3906858,"meanings":[{"definitions":[{"definition":"In preference; by choice; in a preferable manner."}],"partOfSpeech":"v"}]},{"word":"BLUFF","idx":11749,"count":3906671,"meanings":[{"definitions":[{"definition":"An act of bluffing; a false expression of the strength of one's position in order to intimidate; braggadocio.","example":"That is only bluff, or a bluff."},{"definition":"An attempt to represent oneself as holding a stronger hand than one actually does.","example":"John's bet was a bluff: he bet without even so much as a pair."},{"definition":"The card game poker."},{"definition":"One who bluffs; a bluffer."},{"definition":"An excuse."},{"definition":"A high, steep bank, for example by a river or the sea, or beside a ravine or plain; a cliff with a broad face."},{"definition":"A small wood or stand of trees, typically poplar or willow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a bluff; to give the impression that one's hand is stronger than it is.","example":"John bluffed by betting without even a pair."},{"definition":"(by analogy) To frighten or deter with a false show of strength or confidence; to give a false impression of strength or temerity in order to intimidate and gain some advantage.","example":"The government claims it will call an election if this bill does not pass. Is it truly ready to do so, or is it bluffing?"},{"definition":"To take advantage by bluffing.","example":"We bluffed our way past the guards."},{"definition":"To fluff, puff or swell up."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a broad, flattened front.","example":"the bluff bows of a ship"},{"definition":"Rising steeply with a flat or rounded front."},{"definition":"Surly; churlish; gruff; rough."},{"definition":"Roughly frank and hearty in one's manners.","example":"a bluff answer"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/blʌf/"},{"audio":"bluff-au"}]},{"word":"EXCERPTS","idx":11750,"count":3906085,"meanings":[{"definitions":[{"definition":"A clip, snippet, passage or extract from a larger work such as a news article, a film, or a literary composition."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To select or copy sample material (excerpts) from a work."}],"partOfSpeech":"ve"}]},{"word":"JASPER","idx":11751,"count":3905781,"meanings":[{"definitions":[{"definition":"Any bright-coloured kind of chalcedony apart from cornelian."},{"definition":"An opaque, impure variety of quartz, of red, yellow, and other dull colors, breaking conchoidally with a smooth surface."},{"definition":"Jasperware pottery."},{"definition":"A wasp."},{"definition":"A person, a guy, especially seen as naïve or simple."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"jasper-us"},{"text":"/ˈdʒæspə/"}]},{"word":"FORMATTED","idx":11752,"count":3905739,"meanings":[{"definitions":[{"definition":"To create or edit the layout of a document."},{"definition":"Change a document so it will fit onto a different type of page."},{"definition":"To prepare a mass storage medium for initial use, erasing any existing data in the process.","example":"I lost weeks of work when I inadvertently formatted my hard drive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been given a definite format"},{"definition":"(of a storage medium) That has been physically arranged to be in a state ready for the storage of data"}],"partOfSpeech":"j"}]},{"word":"NEWBORN","idx":11754,"count":3905331,"meanings":[{"definitions":[{"definition":"A recently born baby."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Recently born."},{"definition":"Born anew, reborn."}],"partOfSpeech":"j"}]},{"word":"SADLY","idx":11755,"count":3905175,"meanings":[{"definitions":[{"definition":"In a sad manner; sorrowfully.","example":"“Only when we climb up can we see it,” he said sadly."},{"definition":"Unfortunately, sad to say.","example":"If you think you’re getting out of this place alive, you are sadly mistaken, my friend."},{"definition":"Very much (of a desire etc.); dearly; urgently."},{"definition":"Deeply, completely."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"sadly-us"},{"text":"/ˈsadli/"}]},{"word":"LAUGHED","idx":11756,"count":3904519,"meanings":[{"definitions":[{"definition":"To show mirth, satisfaction, or derision, by peculiar movement of the muscles of the face, particularly of the mouth, causing a lighting up of the face and eyes, and usually accompanied by the emission of explosive or chuckling sounds from the chest and throat; to indulge in laughter.","example":"There were many laughing children running on the school grounds."},{"definition":"To be or appear cheerful, pleasant, mirthful, lively, or brilliant; to sparkle; to sport."},{"definition":"(followed by \"at\") To make an object of laughter or ridicule; to make fun of; to deride; to mock.","example":"Don't laugh at my new hat, man!"},{"definition":"To affect or influence by means of laughter or ridicule."},{"definition":"To express by, or utter with, laughter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"laughed-us","text":"/læft/"}]},{"word":"AVAIL","idx":11758,"count":3902711,"meanings":[{"definitions":[{"definition":"Effect in achieving a goal or aim; purpose, use (now usually in negative constructions).","example":"I tried fixing it, to no avail.  Labor, without economy, is of little avail."},{"definition":"Proceeds; profits from business transactions."},{"definition":"An advertising slot or package."},{"definition":"A press avail.","example":"While holding an avail yesterday, the candidate lashed out at critics."},{"definition":"Non-binding notice of availability for work."},{"definition":"A readily available stock of oil."},{"definition":"Benefit; value, profit; advantage toward success."},{"definition":"Effort; striving."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To turn to the advantage of.","example":"I availed myself of the opportunity."},{"definition":"To be of service to.","example":"Artifices will not avail the sinner in the day of judgment."},{"definition":"To promote; to assist."},{"definition":"To be of use or advantage; to answer or serve the purpose; to have strength, force, or efficacy sufficient to accomplish the object.","example":"Medicines will not avail to halt the disease."},{"definition":"To provide; to make available."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"avail-us","text":"/əˈveɪl/"},{"audio":"avail-au","text":"/əˈveɪl/"}]},{"word":"REGULATE","idx":11760,"count":3900971,"meanings":[{"definitions":[{"definition":"To dictate policy."},{"definition":"To control or direct according to rule, principle, or law."},{"definition":"To adjust to a particular specification or requirement: regulate temperature."},{"definition":"To adjust (a mechanism) for accurate and proper functioning.","example":"to regulate a watch, i.e. adjust its rate of running so that it will keep approximately standard time"},{"definition":"To put or maintain in order.","example":"to regulate one's eating habits"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"regulate-us","text":"/ˈɹɛɡjəleɪt/"}]},{"word":"ORCHARD","idx":11761,"count":3900891,"meanings":[{"definitions":[{"definition":"A garden or an area of land for the cultivation of fruit or nut trees."},{"definition":"The trees themselves cultivated in such an area."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"orchard-us","text":"/ˈɔɹ.tʃɚd/"}]},{"word":"INHIBITORS","idx":11762,"count":3900774,"meanings":[{"definitions":[{"definition":"One who or that which inhibits.","example":"I found daily meditation to be a useful inhibitor of negative thoughts."},{"definition":"Any substance capable of stopping or slowing a specific chemical reaction."},{"definition":"Any substance capable of stopping or slowing a specific biological process"}],"partOfSpeech":"n"}]},{"word":"MYTHOLOGY","idx":11764,"count":3899588,"meanings":[{"definitions":[{"definition":"The collection of myths of a people, concerning the origin of the people, history, deities, ancestors and heroes."},{"definition":"A similar body of myths concerning an event, person or institution."},{"definition":"Pervasive elements of a fictional universe that resemble a mythological universe."},{"definition":"The systematic collection and study of myths."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mythology-us","text":"/mɪˈθɑlədʒi/"}]},{"word":"PRESTIGIOUS","idx":11765,"count":3899516,"meanings":[{"definitions":[{"definition":"Of high prestige.","example":"She has a prestigious job with an international organization."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹə-/"}]},{"word":"DEPLOY","idx":11766,"count":3898491,"meanings":[{"definitions":[{"definition":"Deployment"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prepare and arrange (usually military unit or units) for use.","example":"\"Deploy two units of infantry along the enemy's flank,\" the general ordered."},{"definition":"To unfold, open, or otherwise become ready for use.","example":"He waited tensely for his parachute to deploy."},{"definition":"To install, test and implement a computer system or application.","example":"The process for the deployment scenario includes: building a master installation of the operating system, creating its image and deploying the image onto a destination computer."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪˈplɔɪ/"}]},{"word":"TROUSERS","idx":11767,"count":3897524,"meanings":[{"definitions":[{"definition":"An article of clothing that covers the part of the body between the waist and the ankles or knees, and is divided into a separate part for each leg.","example":"The trousers need to be shortened."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"trousers-us","text":"/ˈtɹaʊzɚz/"},{"audio":"trousers-uk","text":"/ˈtɹaʊzəz/"}]},{"word":"GAMEPLAY","idx":11768,"count":3897452,"meanings":[{"definitions":[{"definition":"The totality of player experiences during a game, such as the gaming environment and the competitive interaction with other players; often with reference to a video game."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡeɪmˌpleɪ/"}]},{"word":"HATCH","idx":11769,"count":3896261,"meanings":[{"definitions":[{"definition":"A horizontal door in a floor or ceiling."},{"definition":"A trapdoor."},{"definition":"An opening in a wall at window height for the purpose of serving food or other items. A pass through.","example":"The cook passed the dishes through the serving hatch."},{"definition":"A small door in large mechanical structures and vehicles such as aircraft and spacecraft often provided for access for maintenance."},{"definition":"An opening through the deck of a ship or submarine"},{"definition":"A gullet."},{"definition":"A frame or weir in a river, for catching fish."},{"definition":"A floodgate; a sluice gate."},{"definition":"A bedstead."},{"definition":"An opening into, or in search of, a mine."},{"definition":"The act of hatching."},{"definition":"Development; disclosure; discovery."},{"definition":"(poultry) A group of birds that emerged from eggs at a specified time.","example":"These pullets are from an April hatch."},{"definition":"(often as mayfly hatch) The phenomenon, lasting 1–2 days, of large clouds of mayflies appearing in one location to mate, having reached maturity."},{"definition":"A birth, the birth records (in the newspaper) — compare the phrase \"hatched, matched, and dispatched.\""}],"partOfSpeech":"n"},{"definitions":[{"definition":"To close with a hatch or hatches."},{"definition":"(of young animals) To emerge from an egg."},{"definition":"(of eggs) To break open when a young animal emerges from it."},{"definition":"To incubate eggs; to cause to hatch."},{"definition":"To devise."},{"definition":"To shade an area of (a drawing, diagram, etc.) with fine parallel lines, or with lines which cross each other (cross-hatch)."},{"definition":"To cross; to spot; to stain; to steep."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hatch-au","text":"/hætʃ/"}]},{"word":"REPLACES","idx":11770,"count":3895316,"meanings":[{"definitions":[{"definition":"To restore to a former place, position, condition, etc.; to put back","example":"When you've finished using the telephone, please replace the handset."},{"definition":"To refund; to repay; to pay back","example":"You can take what you need from the petty cash, but you must replace it tomorrow morning."},{"definition":"To supply or substitute an equivalent for","example":"I replaced my car with a newer model."},{"definition":"To take over the position or role from."},{"definition":"To take the place of; to be used instead of","example":"This security pass replaces the one you were given earlier."},{"definition":"To demolish (a building) and build an updated form of that building in its place."},{"definition":"To place again."},{"definition":"To put in a new or different place."}],"partOfSpeech":"ve"}]},{"word":"TOMB","idx":11771,"count":3894685,"meanings":[{"definitions":[{"definition":"A small building (or \"vault\") for the remains of the dead, with walls, a roof, and (if it is to be used for more than one corpse) a door. It may be partly or wholly in the ground (except for its entrance) in a cemetery, or it may be inside a church proper or in its crypt. Single tombs may be permanently sealed; those for families (or other groups) have doors for access whenever needed."},{"definition":"A pit in which the dead body of a human being is deposited; a grave."},{"definition":"One who keeps secrets."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bury."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tomb-us","text":"/tum/"}]},{"word":"STEIN","idx":11773,"count":3893544,"meanings":[{"definitions":[{"definition":"A beer mug, usually made of ceramic or glass."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"stein-uk","text":"/staɪn/"}]},{"word":"SHORTAGE","idx":11774,"count":3892878,"meanings":[{"definitions":[{"definition":"A lack or deficiency; an insufficient amount."}],"partOfSpeech":"n"}]},{"word":"PRIVILEGED","idx":11775,"count":3890670,"meanings":[{"definitions":[{"definition":"To grant some particular right or exemption to; to invest with a peculiar right or immunity; to authorize","example":"to privilege representatives from arrest"},{"definition":"To bring or put into a condition of privilege or exemption from evil or danger; to exempt; to deliver."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having special privileges."},{"definition":"Not subject to legal discovery due to a protected status."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"privileged-us","text":"/ˈpɹɪv(ɪ)lɪdʒd/"}]},{"word":"SPILL","idx":11776,"count":3890646,"meanings":[{"definitions":[{"definition":"A mess of something that has been dropped."},{"definition":"A fall or stumble.","example":"The bruise is from a bad spill he had last week."},{"definition":"A small stick or piece of paper used to light a candle, cigarette etc by the transfer of a flame from a fire."},{"definition":"A slender piece of anything."},{"definition":"One of the thick laths or poles driven horizontally ahead of the main timbering in advancing a level in loose ground."},{"definition":"(sound recording) The situation where sound is picked up by a microphone from a source other than that which is intended."},{"definition":"A small sum of money."},{"definition":"(Australian politics) A declaration that the leadership of a parliamentary party is vacant, and open for re-election. Short form of leadership spill."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drop something so that it spreads out or makes a mess; to accidentally pour.","example":"I spilled some sticky juice on the kitchen floor."},{"definition":"To spread out or fall out, as above.","example":"Some sticky juice spilled onto the kitchen floor."},{"definition":"To drop something that was intended to be caught."},{"definition":"To mar; to damage; to destroy by misuse; to waste."},{"definition":"To be destroyed, ruined, or wasted; to come to ruin; to perish; to waste."},{"definition":"To cause to flow out and be lost or wasted; to shed."},{"definition":"To cover or decorate with slender pieces of wood, metal, ivory, etc.; to inlay."},{"definition":"To relieve a sail from the pressure of the wind, so that it can be more easily reefed or furled, or to lessen the strain."},{"definition":"(Australian politics) To open the leadership of a parliamentary party for re-election."},{"definition":"To reveal information to an uninformed party.","example":"He spilled his guts out to his new psychologist."},{"definition":"(of a knot). To come undone."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spill-us","text":"/spɪl/"},{"audio":"spill-au","text":"/spɪl/"}]},{"word":"GOODNESS","idx":11777,"count":3890474,"meanings":[{"definitions":[{"definition":"The state or characteristic of being good."},{"definition":"The good, nutritional, healthy part or content of something."},{"definition":"God.","example":"Thank goodness that the war is over!"},{"definition":"The moral qualities which constitute Christian excellence; moral virtue."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"goodness-us","text":"/ˈɡʊdnəs/"}]},{"word":"DRIFT","idx":11778,"count":3889505,"meanings":[{"definitions":[{"definition":"(physical) Movement; that which moves or is moved."},{"definition":"The act or motion of drifting; the force which impels or drives; an overpowering influence or impulse."},{"definition":"A place (a ford) along a river where the water is shallow enough to permit crossing to the opposite side."},{"definition":"The tendency of an act, argument, course of conduct, or the like; object aimed at or intended; intention; hence, also, import or meaning of a sentence or discourse; aim."},{"definition":"The horizontal thrust or pressure of an arch or vault upon the abutments."},{"definition":"(handiwork) A tool."},{"definition":"A deviation from the line of fire, peculiar to oblong projectiles."},{"definition":"Minor deviation of audio or video playback from its correct speed."},{"definition":"The situation where a performer gradually and unintentionally moves from their proper location within the scene."},{"definition":"A passage driven or cut between shaft and shaft; a driftway; a small subterranean gallery; an adit or tunnel."},{"definition":"Movement."},{"definition":"A sideways movement of the ball through the air, when bowled by a spin bowler."},{"definition":"Slow, cumulative change.","example":"genetic drift"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move slowly, especially pushed by currents of water, air, etc.","example":"The balloon was drifting in the breeze."},{"definition":"To move haphazardly without any destination.","example":"He drifted from town to town, never settling down."},{"definition":"To deviate gently from the intended direction of travel.","example":"This car tends to drift left at high speeds."},{"definition":"To drive or carry, as currents do a floating body."},{"definition":"To drive into heaps.","example":"A current of wind drifts snow or sand"},{"definition":"To accumulate in heaps by the force of wind; to be driven into heaps.","example":"Snow or sand drifts."},{"definition":"To make a drift; to examine a vein or ledge for the purpose of ascertaining the presence of metals or ores; to follow a vein; to prospect."},{"definition":"To enlarge or shape, as a hole, with a drift."},{"definition":"To oversteer a vehicle, causing loss of traction, while maintaining control from entry to exit of a corner. See Drifting (motorsport)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"drift-us","text":"/dɹɪft/"},{"audio":"drift-au","text":"/dɹɪft/"}]},{"word":"EXTRACTS","idx":11779,"count":3889330,"meanings":[{"definitions":[{"definition":"Something that is extracted or drawn out."},{"definition":"A portion of a book or document, incorporated distinctly in another work; a citation; a quotation.","example":"I used an extract of Hemingway's book to demonstrate culture shock."},{"definition":"A decoction, solution, or infusion made by drawing out from any substance that which gives it its essential and characteristic virtue","example":"extract of beef"},{"definition":"Any substance extracted is such a way, and characteristic of that from which it is obtained","example":"quinine is the most important extract of Peruvian bark."},{"definition":"A solid preparation obtained by evaporating a solution of a drug, etc., or the fresh juice of a plant (distinguished from an abstract)."},{"definition":"A peculiar principle (fundamental essence) once erroneously supposed to form the basis of all vegetable extracts."},{"definition":"Ancestry; descent."},{"definition":"A draft or copy of writing; a certified copy of the proceedings in an action and the judgment therein, with an order for execution."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To draw out; to pull out; to remove forcibly from a fixed position, as by traction or suction, etc.","example":"to extract a tooth from its socket, a stump from the earth, or a splinter from the finger"},{"definition":"To withdraw by expression, distillation, or other mechanical or chemical process. Compare abstract (transitive verb).","example":"to extract an essential oil from a plant"},{"definition":"To take by selection; to choose out; to cite or quote, as a passage from a book."},{"definition":"To select parts of a whole","example":"We need to try to extract the positives from the defeat."},{"definition":"To determine (a root of a number).","example":"Please extract the cube root of 27."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"extracts-us"}]},{"word":"PROFESSIONS","idx":11780,"count":3888846,"meanings":[{"definitions":[{"definition":"A declaration of belief, faith or one's opinion, whether genuine or pretended.","example":"Despite his continued professions of innocence, the court eventually sentenced him to five years."},{"definition":"An occupation, trade, craft, or activity in which one has a professed expertise in a particular area; a job, especially one requiring a high level of skill or training.","example":"My father was a barrister by profession."},{"definition":"The practitioners of such an occupation collectively.","example":"His conduct is against the established practices of the legal profession."},{"definition":"A promise or vow made on entering a religious order.","example":"She died only a few years after her profession."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"professions-us"}]},{"word":"EXPLORED","idx":11781,"count":3887481,"meanings":[{"definitions":[{"definition":"To seek for something or after someone."},{"definition":"To examine or investigate something systematically.","example":"The committee has been exploring alternative solutions to the problem at hand."},{"definition":"To travel somewhere in search of discovery.","example":"It was around that time that the expedition began exploring the Arctic Circle."},{"definition":"To examine diagnostically."},{"definition":"To (seek) experience first hand.","example":"It is normal for a boy of this age to be exploring his sexuality."},{"definition":"To be engaged exploring in any of the above senses.","example":"He was too busy exploring to notice his son needed his guidance."},{"definition":"To wander without any particular aim or purpose.","example":"The boys explored all around till cold and hunger drove them back to the campfire one by one."},{"definition":"To seek sexual variety, to sow one's wild oats."}],"partOfSpeech":"ve"}]},{"word":"AUTISM","idx":11782,"count":3886220,"meanings":[{"definitions":[{"definition":"A pervasive neurological disorder that is observable in early childhood and persists throughout the lifespan, characterised by atypical communication, language development, eye contact, and sensory experiences."},{"definition":"(now medically obsolete) A diagnosis involving a pathological tendency to engage in self-centered fantasy thinking, historically considered a symptom of insanity and/or schizophrenia."},{"definition":"(4chan) Abnormal and unhealthy focus or persistence, and unhealthy hatred of opposition or criticism."},{"definition":"The range of conditions classified as pervasive developmental disorders, generally held to include autistic disorder, Asperger syndrome, and pervasive developmental disorder - not otherwise specified (PDD-NOS). Also includes childhood disintegrative disorder and Rett syndrome."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"autism-uk","text":"/ˈɔːtɪzəm/"}]},{"word":"MYSTERIES","idx":11783,"count":3885698,"meanings":[{"definitions":[{"definition":"A number of secret societies or cults"},{"definition":"Something secret or unexplainable; an unknown.","example":"The truth behind the events remains a mystery."},{"definition":"Someone or something with an obscure or puzzling nature.","example":"That man is a mystery."},{"definition":"A secret or mystical meaning."},{"definition":"A religious truth not understandable by the application of human reason alone (without divine aid)."},{"definition":"(obsolete outside Eastern Orthodoxy) A sacrament."},{"definition":"(chiefly in plural) A secret religious celebration, admission to which was usually through initiation.","example":"the Eleusinian mysteries"},{"definition":"A particular event or series of events in the life of Christ.","example":"The second decade of the Rosary concerns the Sorrowful mysteries, such as the crucifixion and the crowning with thorns."},{"definition":"A craft, art or trade; specifically a guild of craftsmen."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɪst(ə)ɹiz/"}]},{"word":"FULLER","idx":11784,"count":3885291,"meanings":[{"definitions":[{"definition":"Containing the maximum possible amount that can fit in the space available.","example":"The jugs were full to the point of overflowing."},{"definition":"Complete; with nothing omitted.","example":"Our book gives full treatment to the subject of angling."},{"definition":"Total, entire.","example":"She had tattoos the full length of her arms.   He was prosecuted to the full extent of the law."},{"definition":"Having eaten to satisfaction, having a \"full\" stomach; replete.","example":"\"I'm full,\" he said, pushing back from the table."},{"definition":"(with of) Replete, abounding with.","example":"I prefer my pizzas full of toppings."},{"definition":"(of physical features) Plump, round.","example":"full lips; a full face; a full figure"},{"definition":"Of a garment, of a size that is ample, wide, or having ample folds or pleats to be comfortable.","example":"a full pleated skirt;   She needed her full clothing during her pregnancy."},{"definition":"Having depth and body; rich.","example":"a full singing voice"},{"definition":"Having the mind filled with ideas; stocked with knowledge; stored with information."},{"definition":"Having the attention, thoughts, etc., absorbed in any matter, and the feelings more or less excited by it.","example":"She's full of her latest project."},{"definition":"Filled with emotions."},{"definition":"Impregnated; made pregnant."},{"definition":"(postnominal) Said of the three cards of the same rank in a full house.","example":"I'll beat him with my kings full! = three kings and two unspecified cards of the same rank."},{"definition":"Drunk, intoxicated."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A person who fulls cloth."},{"definition":"A convex, rounded or grooved tool, used by blacksmiths for shaping metal."},{"definition":"A groove made by such a tool (in the blade of a sword etc.)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a groove or channel in, by a fuller or set hammer.","example":"to fuller a bayonet"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fuller-us"},{"text":"/ˈfʊlə(ɹ)/"}]},{"word":"TAXPAYERS","idx":11785,"count":3884940,"meanings":[{"definitions":[{"definition":"A person who is subject to, liable for, or pays tax as opposed to a nontaxpayer who is neither the subject nor the object of revenue laws."},{"definition":"All of the people, collectively, in a population who pay tax (especially used in the context of the government financing something using the tax revenue).","example":"1945: I got into the bus full of taxpayers who were giving some money to a taxpayer who had on his taxpayer's stomach a little box which allowed the other taxpayers to continue their taxpayers' journeys. I noticed in this bus a taxpayer with a long taxpayer's neck and whose taxpayer's head bore a taxpayer's felt hat encircled by a plait the like of which no taxpayer ever wore before. Suddenly the said taxpayer peremptorily addressed a nearby taxpayer, complaining bitterly that he was purposely treading on his taxpayer's toes every time other taxpayers got on or off the taxpayers' bus. Then the angry taxpayer went and sat down in a seat for taxpayers which another taxpayer had just vacated. — Raymond Queneau, 'from Polyptotes' in Exercises in Style, 1945 (Eng. 1958)"}],"partOfSpeech":"n"}]},{"word":"BOMBING","idx":11787,"count":3884875,"meanings":[{"definitions":[{"definition":"To attack using one or more bombs; to bombard."},{"definition":"To fail dismally."},{"definition":"To jump into water in a squatting position, with the arms wrapped around the legs."},{"definition":"To sound; to boom; to make a humming or buzzing sound."},{"definition":"To cover an area in many graffiti tags."},{"definition":"To add an excessive amount of chlorine to a pool when it has not been maintained properly."},{"definition":"To make oneself drunk."},{"definition":"(especially with along, down, up etc.) To move at high speed.","example":"I was bombing down the road on my motorbike."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of dropping bombs from the air."},{"definition":"The action of placing and detonating bombs."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɒmɪŋ/"}]},{"word":"DECREASES","idx":11788,"count":3884211,"meanings":[{"definitions":[{"definition":"An amount by which a quantity is decreased.","example":"One research team has recorded Baishui’s decrease at about 27 meters per year over the last 10 years."},{"definition":"A reduction in the number of stitches, usually accomplished by suspending the stitch to be decreased from another existing stitch or by knitting it together with another stitch. See Decrease (knitting)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a quantity, to become smaller."},{"definition":"To make (a quantity) smaller."}],"partOfSpeech":"ve"}]},{"word":"METRICS","idx":11790,"count":3883192,"meanings":[{"definitions":[{"definition":"A measure for something; a means of deriving a quantitative measurement or approximation for otherwise qualitative phenomena (especially used in engineering).","example":"How to measure marketing? Use these key metrics for measuring marketing effectiveness."},{"definition":"A function for the measurement of the \"distance\" between two points in some metric space: it is a real-valued function d(x,y) between points x and y satisfying the following properties: (1) \"non-negativity\": d(x,y) \\ge 0 , (2) \"identity of indiscernibles\": d(x,y) = 0 \\mbox{ iff } x=y , (2) \"symmetry\": d(x,y) = d(y,x) , and (3) \"triangle inequality\": d(x,y) \\le d(x,z) + d(z,y) ."},{"definition":"A metric tensor."},{"definition":"The system of measurements developed in France in the 1790s and now used worldwide."},{"definition":"The modern version of that system, Systeme Internationale d'Unites (International System of Units), or SI system of measurements that is based on the base units of the meter/metre, the kilogram, the second, the ampere, the kelvin, the mole, and the candela."},{"definition":"Any variant of that system, that was not codified as SI, such as cgs."},{"definition":"The study of metrical verse."},{"definition":"The statistical analysis of data sets or big data."},{"definition":"The theory of measurement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(aerospace, systems engineering) To measure or analyse statistical data concerning the quality or effectiveness of a process.","example":"Customer satisfaction was metricked by the marketing department."}],"partOfSpeech":"ve"}]},{"word":"CRISP","idx":11792,"count":3880385,"meanings":[{"definitions":[{"definition":"A thin slice of fried potato eaten as a snack."},{"definition":"A baked dessert made with fruit and crumb topping"},{"definition":"Anything baked or fried and eaten as a snack","example":"kale crisps"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make crisp.","example":"to crisp bacon by frying it"},{"definition":"To become crisp.","example":"to put celery into ice water to crisp"},{"definition":"To cause to curl or wrinkle (of the leaves or petals of plants, for example); to form into ringlets or tight curls (of hair)."},{"definition":"To become curled."},{"definition":"To cause to undulate irregularly (of water); to cause to ripple."},{"definition":"To undulate or ripple."},{"definition":"To wrinkle, contort or tense (a part of one's body)."},{"definition":"To become contorted or tensed (of a part of the body)."},{"definition":"To interweave (of the branches of trees)."},{"definition":"To make a sharp or harsh sound."},{"definition":"To colour (something with highlights); to add small amounts of colour to (something)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of something seen or heard) Sharp, clearly defined.","example":"This new television set has a very crisp image."},{"definition":"Brittle; friable; in a condition to break with a short, sharp fracture.","example":"The crisp snow crunched underfoot."},{"definition":"Possessing a certain degree of firmness and freshness."},{"definition":"(of weather, air etc.) Dry and cold."},{"definition":"(of movement, action etc.) Quick and accurate."},{"definition":"(of talk, text, etc.) Brief and to the point.","example":"An expert, given a certain query, will often come up with a crisp answer: “yes” or “no”."},{"definition":"(of wine) having a refreshing amount of acidity; having less acidity than green wine, but more than a flabby one."},{"definition":"Lively; sparking; effervescing."},{"definition":"Curling in stiff curls or ringlets.","example":"crisp hair"},{"definition":"Curled by the ripple of water."},{"definition":"Not using fuzzy logic; based on a binary distinction between true and false."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"crisp-us","text":"/kɹɪsp/"}]},{"word":"INABILITY","idx":11793,"count":3880337,"meanings":[{"definitions":[{"definition":"Lack of the ability to do something; incapability."},{"definition":"Lack of the option to do something; powerlessness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"inability-us","text":"/ˌɪnəˈbɪlɪti/"}]},{"word":"COR","idx":11794,"count":3879006,"meanings":[{"definitions":[{"definition":"Expression of surprise.","example":"Cor blimey!"}],"partOfSpeech":"i"},{"definitions":[{"definition":"Various former units of volume, particularly:"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cor-uk","text":"/kɔː/"}]},{"word":"GOO","idx":11795,"count":3878783,"meanings":[{"definitions":[{"definition":"Any semi-solid or liquid substance; especially one that is sticky, gummy or slippery; frequently of vague or unknown composition, slime or a bodily fluid.","example":"I stepped in some goo and had a terrible time getting the sticky stuff off my shoes."},{"definition":"Excessive, showy sentimentality."},{"definition":"An example of baby talk.","example":"The infant's goos and gahs were endearing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply goo to something.","example":"They gooed their hair with some fragrant styling product."},{"definition":"To produce baby talk.","example":"The baby gooed while daddy made sappy faces at it."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"goo-us","text":"/ɡuː/"}]},{"word":"CORONARY","idx":11796,"count":3878267,"meanings":[{"definitions":[{"definition":"Any of the coronary vessels; a coronary artery or coronary vein."},{"definition":"A small bone in the foot of a horse."},{"definition":"Thrombosis of a coronary artery, that is, a blockage, caused by a blood clot, of the blood flow in a coronary artery of the heart, leading to myocardial infarction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to a crown or garland."},{"definition":"Encircling something (like a crown), especially with regard to the arteries or veins of the heart."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"coronary-uk","text":"/ˈkɒɹən(ə)ɹi/"}]},{"word":"MEDIATED","idx":11798,"count":3877793,"meanings":[{"definitions":[{"definition":"To resolve differences, or to bring about a settlement, between conflicting parties."},{"definition":"To intervene between conflicting parties in order to resolve differences or bring about a settlement."},{"definition":"To divide into two equal parts."},{"definition":"To act as an intermediary causal or communicative agent; to convey."},{"definition":"To act as a spiritualistic medium."}],"partOfSpeech":"ve"}]},{"word":"PROM","idx":11799,"count":3877689,"meanings":[{"definitions":[{"definition":"A promenade concert"},{"definition":"(abbreviation) promenade"},{"definition":"A formal ball held at a high school or college on special occasions, e.g. near the end of the academic year"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"prom-uk","text":"/pɹɒm/"}]},{"word":"SCANS","idx":11800,"count":3877627,"meanings":[{"definitions":[{"definition":"Close investigation."},{"definition":"An instance of scanning.","example":"The operators vacated the room during the scan."},{"definition":"The result or output of a scanning process.","example":"The doctors looked at the scans and made a diagnosis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To examine sequentially, carefully, or critically; to scrutinize; to behold closely.","example":"She scanned the passage carefully but could not find what she was looking for."},{"definition":"To look about for; to look over quickly.","example":"He scanned the horizon."},{"definition":"To create a digital copy of an image using a scanner.","example":"Pencil drawings don't scan very well."},{"definition":"To read with an electronic device.","example":"to scan a barcode; to scan a QR code"},{"definition":"To mount by steps; to go through with step by step."},{"definition":"To read or mark so as to show a specific meter.","example":"to scan verse"}],"partOfSpeech":"ve"}]},{"word":"KEEPER","idx":11801,"count":3877357,"meanings":[{"definitions":[{"definition":"One who keeps something.","example":"Finders keepers; losers weepers]."},{"definition":"A person or thing worth keeping."},{"definition":"A person charged with guarding or caring for, storing, or maintaining something; a custodian, a guard; sometimes a gamekeeper."},{"definition":"The player charged with guarding a goal or wicket. Short form of goalkeeper, wicketkeeper."},{"definition":"A part of a mechanism that catches or retains another part, for example the part of a door lock that fits in the frame and receives the bolt."},{"definition":"An offensive play in which the quarterback runs toward the goal with the ball after it is snapped."},{"definition":"One who remains or keeps in a place or position."},{"definition":"A fruit or vegetable that keeps for some time without spoiling."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"keeper-us","text":"/ˈkiːpɚ/"}]},{"word":"REINFORCED","idx":11802,"count":3877044,"meanings":[{"definitions":[{"definition":"To strengthen, especially by addition or augmentation.","example":"He reinforced the handle with a metal rod and a bit of tape."},{"definition":"To emphasize or review.","example":"The right homework will reinforce and complement the lesson!"},{"definition":"To encourage (a behavior or idea) through repeated stimulus.","example":"Advertising for fast food can reinforce unhealthy dietary tendencies."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been or containing reinforcement"}],"partOfSpeech":"j"}]},{"word":"SPELLS","idx":11804,"count":3875038,"meanings":[{"definitions":[{"definition":"Words or a formula supposed to have magical powers.","example":"He cast a spell to cure warts."},{"definition":"A magical effect or influence induced by an incantation or formula.","example":"under a spell"},{"definition":"Speech, discourse."},{"definition":"A shift (of work); a set of workers responsible for a specific turn of labour."},{"definition":"A definite period (of work or other activity)."},{"definition":"An indefinite period of time (usually with a qualifier); by extension, a relatively short distance."},{"definition":"A period of rest; time off."},{"definition":"A period of illness, or sudden interval of bad spirits, disease etc."},{"definition":"An uninterrupted series of alternate overs bowled by a single bowler."},{"definition":"A splinter, usually of wood; a spelk."},{"definition":"The wooden bat in the game of trap ball, or knurr and spell."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put under the influence of a spell; to affect by a spell; to bewitch; to fascinate; to charm."},{"definition":"To read (something) as though letter by letter; to peruse slowly or with effort."},{"definition":"(sometimes with “out”) To write or say the letters that form a word or part of a word."},{"definition":"To be able to write or say the letters that form words.","example":"I find it difficult to spell because I'm dyslexic."},{"definition":"Of letters: to compose (a word).","example":"The letters “a”, “n” and “d” spell “and”."},{"definition":"(with “out”) To clarify; to explain in detail.","example":"Please spell it out for me."},{"definition":"To indicate that (some event) will occur.","example":"This spells trouble."},{"definition":"To constitute; to measure."},{"definition":"To speak, to declaim."},{"definition":"To tell; to relate; to teach."},{"definition":"To work in place of (someone).","example":"to spell the helmsman"},{"definition":"To rest (someone or something), to give someone or something a rest or break.","example":"They spelled the horses and rested in the shade of some trees near a brook."},{"definition":"To rest from work for a time."}],"partOfSpeech":"ve"}]},{"word":"SPECIFYING","idx":11805,"count":3874863,"meanings":[{"definitions":[{"definition":"The act or process of stating or describing something clearly and exactly."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To state explicitly, or in detail, or as a condition."},{"definition":"To include in a specification."},{"definition":"To bring about a specific result."},{"definition":"To speak explicitly or in detail (often used with of)."}],"partOfSpeech":"ve"}]},{"word":"VAGINAL","idx":11806,"count":3873132,"meanings":[{"definitions":[{"definition":"Of, relating to, or affecting the vagina.","example":"You may have a vaginal birth, C-section or surrogacy; it's up to you."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈvædʒɪnəl/"},{"text":"/vəˈdʒaɪnəl/"}]},{"word":"INEVITABLE","idx":11809,"count":3872819,"meanings":[{"definitions":[{"definition":"Something that is predictable, necessary, or cannot be avoided."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Impossible to avoid or prevent.","example":"We were going so fast that the collision was inevitable."},{"definition":"Predictable, or always happening.","example":"My outburst met with the inevitable punishment."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"inevitable-us","text":"/ɪnˈɛvɪtəbəl/"}]},{"word":"ETIQUETTE","idx":11810,"count":3872794,"meanings":[{"definitions":[{"definition":"The forms required by a good upbringing, or prescribed by authority, to be observed in social or official life; observance of the proprieties of rank and occasion; conventional decorum; ceremonial code of polite society."},{"definition":"The customary behavior of members of a profession, business, law, or sports team towards each other."},{"definition":"A label used to indicate that a letter is to be sent by airmail."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛtɪkɪt/"}]},{"word":"ROOKIE","idx":11811,"count":3870767,"meanings":[{"definitions":[{"definition":"An inexperienced recruit, especially in the police or armed forces."},{"definition":"A novice."},{"definition":"An athlete either new to the sport or to a team or in his first year of professional competition, especially said of baseball, basketball, hockey and American football players."},{"definition":"A type of firecracker, used by farmers to scare rooks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Non-professional; amateur","example":"The game was going well until I made that rookie mistake."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rookie-uk","text":"/ˈɹʊki/"}]},{"word":"ENVIRON","idx":11812,"count":3870498,"meanings":[{"definitions":[{"definition":"(especially in plural) A surrounding area"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To surround; to encircle."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɛnˈvaɪ.ɹən/"}]},{"word":"NIC","idx":11813,"count":3869264,"meanings":[{"definitions":[{"definition":"Nicotine","example":"I prefer vaping with nic-free juice."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nic-au"}]},{"word":"THEATRICAL","idx":11814,"count":3867947,"meanings":[{"definitions":[{"definition":"A stage performance, especially one by amateurs."},{"definition":"A commercially produced film to be shown in movie theaters."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to the theatre."},{"definition":"Fake and exaggerated."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/θiˈæt.ɹɪ.kəl/"}]},{"word":"COLOURED","idx":11815,"count":3867584,"meanings":[{"definitions":[{"definition":"To give something color.","example":"We could color the walls red."},{"definition":"To apply colors to the areas within the boundaries of a line drawing using colored markers or crayons.","example":"My kindergartener loves to color."},{"definition":"(of a person or their face) To become red through increased blood flow.","example":"Her face colored as she realized her mistake."},{"definition":"To affect without completely changing.","example":"That interpretation certainly colors my perception of the book."},{"definition":"To attribute a quality to; to portray (as).","example":"Color me confused."},{"definition":"To assign colors to the vertices of a graph (or the regions of a map) so that no two vertices connected by an edge (regions sharing a border) have the same color.","example":"Can this graph be 2-colored?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A colored person."},{"definition":"(laundry) A colored article of clothing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having a color.","example":"Wash colored items separately from whites and darks to prevent the colors from bleeding."},{"definition":"Having a particular color or kind of color.","example":"The room was red, with a dark-colored rug."},{"definition":"Having prominent colors; colorful.","example":"The singer wore a colored shirt."},{"definition":"Influenced pervasively but subtly.","example":"My opinions are colored by my upbringing."},{"definition":"Of skin color other than white; in particular, black."},{"definition":"Of neither black nor white skin color.","example":"Most of the colored community speaks Afrikaans, whereas languages like Xhosa or Venda are typically spoken by blacks and English is spoken mostly by whites."},{"definition":"Designated for use by colored people (in either the US or South African sense).","example":"a colored drinking fountain"}],"partOfSpeech":"j"}]},{"word":"BIRTHS","idx":11816,"count":3867031,"meanings":[{"definitions":[{"definition":"The process of childbearing; the beginning of life."},{"definition":"An instance of childbirth.","example":"Intersex babies account for roughly one per cent of all births."},{"definition":"A beginning or start; a point of origin.","example":"the birth of an empire"},{"definition":"The circumstances of one's background, ancestry, or upbringing.","example":"He was of noble birth, but fortune had not favored him."},{"definition":"That which is born."}],"partOfSpeech":"n"}]},{"word":"CUBS","idx":11818,"count":3863171,"meanings":[{"definitions":[{"definition":"A person who is unsophisticated or of a lower class background but achieving a high salary, who spends money on flashy or trashy items to fulfil their aspirations of higher social status. The stereotype includes having speech and mannerisms that are considered to denote poor education and uncultured upbringing, which is reflected in their bad taste possessions and lifestyles."},{"definition":"A young fox."},{"definition":"(by extension) The young of certain other animals, including the bear, wolf, lion and tiger."},{"definition":"A child, especially an awkward, rude, ill-mannered boy."},{"definition":"A young man who seeks relationships with older women, or \"cougars\"."},{"definition":"A stall for cattle."},{"definition":"A cupboard."},{"definition":"A young, inexperienced reporter employed by a newspaper or magazine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give birth to cubs"},{"definition":"To hunt fox cubs"},{"definition":"To shut up or confine."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kʌbz/"}]},{"word":"INTERDISCIPLINARY","idx":11819,"count":3862597,"meanings":[{"definitions":[{"definition":"Of or pertaining to multiple distinct academic disciplines or fields of study.","example":"This journal is interdisciplinary: it has articles on everything from biology to electrical engineering."},{"definition":"Of or pertaining to a linkage between multiple distinct academic disciplines or fields of study.","example":"The interdisciplinary co-operation at this university is very impressive."}],"partOfSpeech":"j"}]},{"word":"WHEELER","idx":11820,"count":3862107,"meanings":[{"definitions":[{"definition":"A wheelwright, a wheelmaker."},{"definition":"Someone who operates a wheel."},{"definition":"A wheelhorse (horse near wheel of carriage)."},{"definition":"(used in combination with a preceding whole number) A vehicle having the specified number of wheels."}],"partOfSpeech":"n"}]},{"word":"RITUAL","idx":11821,"count":3861920,"meanings":[{"definitions":[{"definition":"Rite; a repeated set of actions","example":"They carried out the ritual carefully."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Related to a rite or repeated set of actions.","example":"They performed the ritual lighting of the candles."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ritual-us","text":"/ˈɹɪ.tʃu.əl/"}]},{"word":"PULP","idx":11824,"count":3860989,"meanings":[{"definitions":[{"definition":"A soft, moist, shapeless mass or matter."},{"definition":"A magazine or book containing lurid subject matter and characteristically printed on rough, unfinished paper."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make or be made into pulp."},{"definition":"To beat to a pulp."},{"definition":"To deprive of pulp; to separate the pulp from."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or pertaining to pulp magazines; in the style of a pulp magazine or the material printed within such a publication."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pulp-au","text":"/pʌlp/"}]},{"word":"ONSET","idx":11825,"count":3858839,"meanings":[{"definitions":[{"definition":"An attack; an assault especially of an army."},{"definition":"The initial phase of a disease or condition, in which symptoms first become apparent.","example":"the onset of schizophrenia"},{"definition":"The initial portion of a syllable, preceding the syllable nucleus."},{"definition":"(acoustics) The beginning of a musical note or other sound, in which the amplitude rises from zero to an initial peak."},{"definition":"A setting about; a beginning.","example":"the onset of puberty"},{"definition":"Anything added, such as an ornament or as a useful appendage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To assault; to set upon."},{"definition":"To set about; to begin."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"onset-uk","text":"/ˈɒnˌsɛt/"}]},{"word":"INTERPRETER","idx":11826,"count":3858537,"meanings":[{"definitions":[{"definition":"One who conveys what a user of one language is saying or signing, in real time or shortly after that person has finished communicating, to a user of a different language. (Contrasted with a translator.)","example":"A Japanese man who is tried before a German court is assisted by an interpreter in making oral statements."},{"definition":"One who explains something, such as an art exhibit. One who does heritage interpretation."},{"definition":"A program that executes another program written in a high-level language by reading the instructions in real time rather than by compiling it in advance.","example":"Programs written in the BASIC language are usually run through an interpreter, though some can be compiled."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈtɝpɹɪtɚ/"},{"text":"/ɪnˈtɜːpɹɪtə/"}]},{"word":"ENZYMES","idx":11827,"count":3858286,"meanings":[{"definitions":[{"definition":"A globular protein that catalyses a biological chemical reaction."},{"definition":"Leavened bread, as opposed to azyme"}],"partOfSpeech":"n"}]},{"word":"SPECIMENS","idx":11828,"count":3857576,"meanings":[{"definitions":[{"definition":"An individual instance that represents a class; an example.","example":"early specimens of the art of Picasso"},{"definition":"A sample, especially one used for diagnostic analysis."},{"definition":"(often preceded with “fine”) An eligible man."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈspɛsɪmɪnz/"}]},{"word":"INITIATION","idx":11829,"count":3855916,"meanings":[{"definitions":[{"definition":"The act of initiating, or the process of being initiated or introduced","example":"initiation into a society"},{"definition":"The form or ceremony by which a person is introduced into any society; mode of entrance into an organized body; especially, the rite of admission into a secret society or order."},{"definition":"The first step of transcription or of transduction."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪ.nɪ.ʃi.ˈeɪ.ʃən/"}]},{"word":"ANALYTICS","idx":11830,"count":3855886,"meanings":[{"definitions":[{"definition":"The principles governing any of various forms of analysis."},{"definition":"Discovery, interpretation, and communication of meaningful patterns in data."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ænəˈlɪtɪks/"}]},{"word":"ASSAY","idx":11831,"count":3855224,"meanings":[{"definitions":[{"definition":"Trial, attempt."},{"definition":"Examination and determination; test."},{"definition":"The qualitative or quantitative chemical analysis of something."},{"definition":"Trial by danger or by affliction; adventure; risk; hardship; state of being tried."},{"definition":"Tested purity or value."},{"definition":"The act or process of ascertaining the proportion of a particular metal in an ore or alloy; especially, the determination of the proportion of gold or silver in bullion or coin."},{"definition":"The alloy or metal to be assayed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attempt (something)."},{"definition":"To try, attempt (to do something)."},{"definition":"To analyze or estimate the composition or value of (a metal, ore etc.)."},{"definition":"To test the abilities of (someone) in combat; to fight."},{"definition":"To affect."},{"definition":"To try tasting, as food or drink."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"assay-uk","text":"/əˈseɪ/"}]},{"word":"JACUZZI","idx":11832,"count":3855111,"meanings":[{"definitions":[{"definition":"A hot tub or whirlpool bath with underwater jets that massage the body."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To equip with a jacuzzi.","example":"The suite was jacuzzied."},{"definition":"To use a jacuzzi.","example":"They jacuzzied after a late dinner."},{"definition":"To treat with a jacuzzi.","example":"He jacuzzied his sore muscles."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dʒəˈkuːzi/"}]},{"word":"RECONCILIATION","idx":11833,"count":3854902,"meanings":[{"definitions":[{"definition":"The reestablishment of friendly relations; conciliation or rapprochement.","example":"He longed for reconciliation with his estranged father, but too many painful memories kept him from making contact again."},{"definition":"The end of estrangement between a human and God as a result of the process of atonement."},{"definition":"A Roman Catholic sacrament involving contrition, confession, punishment and absolution; penance."},{"definition":"Process of matching, comparing and agreeing figures from accounting records against those presented on a bank statement, including list of explainable differences."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɹɛkənˌsɪliˈeɪʃən/"}]},{"word":"POTS","idx":11834,"count":3854743,"meanings":[{"definitions":[{"definition":"A flat-bottomed vessel (usually metal) used for cooking food."},{"definition":"Various similar open-topped vessels, particularly"},{"definition":"Pothole, sinkhole, vertical cave e.g. Rowten Pot"},{"definition":"Ruin or deterioration.","example":"After his arrest, his prospects went to pot."},{"definition":"An iron hat with a broad brim worn as a helmet."},{"definition":"A pot-shaped non-conducting (usually ceramic) stand that supports an electrified rail while insulating it from the ground."},{"definition":"The money available to be won in a hand of poker or a round of other games of chance; any sum of money being used as an enticement."},{"definition":"A favorite: a heavily-backed horse."},{"definition":"A plaster cast."},{"definition":"Marijuana"},{"definition":"A simple electromechanical device used to control resistance or voltage (often to adjust sound volume) in an electronic device by rotating or sliding when manipulated by a human thumb, screwdriver, etc."},{"definition":"A large, swollen, or protruding abdomen; a paunch."},{"definition":"A potbelly stove."},{"definition":"A Vietnamese Pot-bellied pig."},{"definition":"A small portion or dose of a liquid which is medicinal, poisonous, or magical.","example":"He hoped to win the princess's heart by mixing the love potion the witch gave him into her drink."},{"definition":"A large quantity.","example":"We’re going to make pots of money selling my invention!"},{"definition":"A shot taken at an easy or random target."},{"definition":"Criticism of an easy target; a cheap shot."},{"definition":"An old size of paper, 12.5 × 15 inches.","example":"pott paper"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put (something) into a pot.","example":"to pot a plant"},{"definition":"To preserve by bottling or canning.","example":"potted meat"},{"definition":"To cause a ball to fall into a pocket."},{"definition":"To be capable of being potted.","example":"The black ball doesn't pot; the red is in the way."},{"definition":"To shoot with a firearm."},{"definition":"To take a pot shot, or haphazard shot, with a firearm."},{"definition":"To secure; gain; win; bag."},{"definition":"To send someone to gaol, expeditiously."},{"definition":"To tipple; to drink."},{"definition":"To drain (e.g. sugar of the molasses) in a perforated cask."},{"definition":"To seat a person, usually a young child, on a potty or toilet, typically during toilet teaching."},{"definition":"To apply a plaster cast to a broken limb."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pɑts/"},{"text":"/pɒts/"}]},{"word":"RECOGNIZING","idx":11836,"count":3853300,"meanings":[{"definitions":[{"definition":"To match (something or someone which one currently perceives) to a memory of some previous encounter with the same person or thing.","example":"I recognised his face immediately."},{"definition":"To acknowledge the existence or legality of; to treat as valid or worthy of consideration.","example":"The US and a number of EU countries are expected to recognize Kosovo on Monday."},{"definition":"(or with clause) To acknowledge or consider (as being a certain thing or having a certain quality or property).","example":"I recognize that my behaviour has been unacceptable."},{"definition":"To realize or discover the nature of something; apprehend quality in."},{"definition":"To show formal appreciation of, as with an award, commendation etc.","example":"His services were recognized in a testimonial."},{"definition":"To review; to examine again."},{"definition":"To reconnoiter."},{"definition":"To have the property to bind to specific antigens."},{"definition":"To cognize again"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"recognizing-us"}]},{"word":"PARSER","idx":11837,"count":3853138,"meanings":[{"definitions":[{"definition":"A computer program that parses."},{"definition":"One who parses."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"parser-uk","text":"/ˈpɑː(ɹ).sə/"}]},{"word":"SLAM","idx":11840,"count":3851407,"meanings":[{"definitions":[{"definition":"A sudden impact or blow."},{"definition":"The shock and noise produced by violently closing a door or other object."},{"definition":"A slam dunk."},{"definition":"An insult.","example":"I don't mean this as a slam, but you can be really impatient sometimes."},{"definition":"The yellow iron silicate produced in alum works as a waste product."},{"definition":"A poetry slam."},{"definition":"A slambook."},{"definition":"The refuse of alum works."},{"definition":"A subgenre of death metal with elements of hardcore punk focusing on midtempo rhythms, breakdowns and palm-muted riffs"},{"definition":"A type of card game, also called ruff and honours."},{"definition":"A card game, played all at once without separate turns, in which players attempt to get rid of their cards as quickly as possible according to certain rules."},{"definition":"Losing or winning all the tricks in a game."},{"definition":"A bid of six (small slam) or seven (grand slam) in a suit or no trump."},{"definition":"Winning all (or all but one) of the available, major or specified events in a given year or sports season."},{"definition":"A shambling fellow."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shut with sudden force so as to produce a shock and noise.","example":"Don't slam the door!"},{"definition":"To put in or on a particular place with force and loud noise. (Often followed by a preposition such as down, against or into.)","example":"Don't slam that trunk down on the pavement!"},{"definition":"To strike forcefully with some implement."},{"definition":"To strike against suddenly and heavily.","example":"The boat slammed into the bank and we were almost thrown into the river."},{"definition":"To speak badly of; to criticize forcefully.","example":"Critics slammed the new film, calling it violent and meaningless."},{"definition":"To dunk forcefully, to slam dunk."},{"definition":"To make a slam bid."},{"definition":"To defeat (opponents at cards) by winning all the tricks of a deal or a hand."},{"definition":"To change providers (e.g. of domain registration or telephone carrier) for a customer without clear (if any) consent."},{"definition":"To drink off, to drink quickly."},{"definition":"To compete in a poetry slam."},{"definition":"To inject intravenously; shoot up."},{"definition":"To defeat by winning all the tricks of a deal or a hand."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/slæm/"},{"audio":"slam-au"}]},{"word":"RESPECTS","idx":11842,"count":3850738,"meanings":[{"definitions":[{"definition":"An attitude of consideration or high regard","example":"He is an intellectual giant, and I have great respect for him."},{"definition":"Good opinion, honor, or admiration"},{"definition":"(always plural) Polite greetings, often offered as condolences after a death.","example":"The mourners paid their last respects to the deceased poet."},{"definition":"A particular aspect, feature or detail of something","example":"This year's model is superior to last year's in several respects."},{"definition":"Good will; favor"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have respect for.","example":"She is an intellectual giant, and I respect her greatly."},{"definition":"To have regard for something, to observe a custom, practice, rule or right.","example":"I respect your right to hold that belief, although I think it is nonsense."},{"definition":"To abide by an agreement.","example":"They failed to respect the treaty they had signed, and invaded."},{"definition":"To take notice of; to regard as worthy of special consideration; to heed."},{"definition":"(dated except in \"respecting\") To relate to; to be concerned with."},{"definition":"To regard; to consider; to deem."},{"definition":"To look toward; to face."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"respects-us","text":"/ɹɪˈspɛkts/"}]},{"word":"TENTS","idx":11843,"count":3850460,"meanings":[{"definitions":[{"definition":"A pavilion or portable lodge consisting of skins, canvas, or some strong cloth, stretched and sustained by poles, used for sheltering people from the weather.","example":"We were camping in a three-man tent."},{"definition":"The representation of a tent used as a bearing."},{"definition":"A portable pulpit set up outside to accommodate worshippers who cannot fit into a church."},{"definition":"A trouser tent; a piece of fabric, etc. protruding outward like a tent."},{"definition":"Attention; regard, care."},{"definition":"Intention; design."},{"definition":"A roll of lint or linen, or a conical or cylindrical piece of sponge or other absorbent, used chiefly to dilate a natural canal, to keep open the orifice of a wound, or to absorb discharges."},{"definition":"A probe for searching a wound."},{"definition":"A kind of wine of a deep red color, chiefly from Galicia or Malaga in Spain; called also tent wine, and tinta."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go camping.","example":"We’ll be tented at the campground this weekend."},{"definition":"To prop up aluminum foil in an inverted \"V\" (reminiscent of a pop-up tent) over food to reduce splatter, before putting it in the oven."},{"definition":"To form into a tent-like shape.","example":"The sheet tented over his midsection."},{"definition":"To attend to; to heed"},{"definition":"To guard; to hinder."},{"definition":"(sometimes figurative) To probe or to search with a tent; to keep open with a tent.","example":"to tent a wound"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tents-us","text":"/tɛnts/"}]},{"word":"PLAQUE","idx":11844,"count":3850381,"meanings":[{"definitions":[{"definition":"Any flat, thin piece of clay, ivory, metal, etc., used for ornament, or for painting pictures upon, as a dish, plate, slab, etc., hung upon a wall; also, a smaller decoration worn by a person, such as a brooch."},{"definition":"A piece of flat metal with writing on it, attached to a building, monument, or other structure to remind people of a person or an event."},{"definition":"A small card representing an amount of money, used for betting in casinos; a sort of gaming chip."},{"definition":"A clearing in a bacterial lawn caused by a virus."},{"definition":"In the Hornbostel–Sachs classification system: any flat, thin musical instrument.","example":"blown plaques  concussion plaques"},{"definition":"A broad patch of abnormal tissue distinguishable from surrounding tissue, especially a broad papule on the skin."},{"definition":"An abnormal accumulation of material in or on an organ of the body, often associated with disease.","example":"amyloid plaque  pleural plaque  senile plaque"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"plaque-us","text":"/plæk/"},{"audio":"plaque-au","text":"/plaːk/"}]},{"word":"ACCOUNTED","idx":11845,"count":3850232,"meanings":[{"definitions":[{"definition":"To provide explanation."},{"definition":"To count."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"accounted-us","text":"/əˈkaʊntɪd/"}]},{"word":"DEPOSITED","idx":11846,"count":3849839,"meanings":[{"definitions":[{"definition":"To lay down; to place; to put.","example":"A crocodile deposits her eggs in the sand."},{"definition":"To lay up or away for safekeeping; to put up; to store.","example":"to deposit goods in a warehouse"},{"definition":"To entrust one's assets to the care of another. Sometimes done as collateral."},{"definition":"To put money or funds into an account."},{"definition":"To lay aside; to rid oneself of."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪˈpɑzɪtɪd/"},{"text":"/dɪˈpɒzɪtɪd/"}]},{"word":"LOWE","idx":11847,"count":3849640,"meanings":[{"definitions":[{"definition":"A flame; fire; blaze."}],"partOfSpeech":"n"}]},{"word":"BEAVERS","idx":11848,"count":3848670,"meanings":[{"definitions":[{"definition":"A semiaquatic rodent of the genus Castor, having a wide, flat tail and webbed feet."},{"definition":"A hat, of various shapes, made from a felted beaver fur (or later of silk), fashionable in Europe between 1550 and 1850."},{"definition":"The pubic hair and/or vulva of a woman."},{"definition":"The fur of the beaver."},{"definition":"Beaver cloth, a heavy felted woollen cloth, used chiefly for making overcoats."},{"definition":"A brown colour, like that of a beaver (also called beaver brown)."},{"definition":"A man who wears a beard."},{"definition":"A portion of plate armour to protect the lower face and the neck, typically in two parts, called upper bevor and lower bevor."}],"partOfSpeech":"n"}]},{"word":"CRIB","idx":11849,"count":3847659,"meanings":[{"definitions":[{"definition":"A baby’s bed with high, often slatted, often moveable sides, suitable for a child who has outgrown a cradle or bassinet."},{"definition":"A bed for a child older than a baby."},{"definition":"A small sleeping berth in a packet ship or other small vessel"},{"definition":"A wicker basket; compare Moses basket."},{"definition":"A manger, a feeding trough for animals elevated off the earth or floor, especially one for fodder such as hay."},{"definition":"The baby Jesus and the manger in a creche or nativity scene, consisting of statues of Mary, Joseph and various other characters such as the magi."},{"definition":"A bin for drying or storing grain, as with a corn crib."},{"definition":"A small room or covered structure, especially one of rough construction, used for storage or penning animals."},{"definition":"A confined space, as with a cage or office-cubicle"},{"definition":"A job, a position; (British), an appointment."},{"definition":"A hovel, a roughly constructed building best suited to the shelter of animals but used for human habitation."},{"definition":"One’s residence, or where one normally hangs out. A house or dwelling place."},{"definition":"A boxy structure traditionally built of heavy wooden timbers, to support an existing structure from below, as with a mineshaft or a building being raised off its foundation in preparation for being moved; see cribbing."},{"definition":"(usually in the plural) A collection of quotes or references for use in speaking, for assembling a written document, or as an aid to a project of some sort; a crib sheet."},{"definition":"A minor theft, extortion or embezzlement, with or without criminal intent."},{"definition":"The card game cribbage."},{"definition":"The cards discarded by players and used by the dealer."},{"definition":"A known piece of information corresponding to a section of encrypted text, that is then used to work out the remaining sections."},{"definition":"A small holiday home, often near a beach and of simple construction."},{"definition":"A packed lunch taken to work."},{"definition":"A small raft made of timber."},{"definition":"(thieves' cant) The stomach."},{"definition":"A cheat sheet or past test used by students; crib sheet."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place or confine in a crib."},{"definition":"To shut up or confine in a narrow habitation; to cage; to cramp."},{"definition":"To collect one or more passages and/or references for use in a speech, written document or as an aid for some task; to create a crib sheet.","example":"I cribbed the recipe from the Food Network site, but made a few changes of my own."},{"definition":"To plagiarize; to copy; to cheat."},{"definition":"To install timber supports, as with cribbing."},{"definition":"To steal or embezzle, to cheat out of."},{"definition":"(Indian English) To complain, to grumble"},{"definition":"To crowd together, or to be confined, as if in a crib or in narrow accommodations."},{"definition":"(of a horse) To seize the manger or other solid object with the teeth and draw in wind."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crib-us","text":"/kɹɪb/"},{"audio":"crib-au","text":"/kɹɪb/"}]},{"word":"STYLING","idx":11850,"count":3847444,"meanings":[{"definitions":[{"definition":"To design, fashion, make, or arrange in a certain way or form (style)"},{"definition":"To call or give a name or title to."},{"definition":"To create for, or give to, someone a style, fashion, or image, particularly one which is regarded as attractive, tasteful, or trendy."},{"definition":"To act in a way which seeks to show that one possesses style."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Any form of decoration or stylistic approach."}],"partOfSpeech":"n"}]},{"word":"SNACK","idx":11851,"count":3847152,"meanings":[{"definitions":[{"definition":"A light meal."},{"definition":"An item of food eaten between meals."},{"definition":"A very sexy and attractive person."},{"definition":"A share; a part or portion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat a light meal."},{"definition":"To eat between meals."},{"definition":"To snatch."},{"definition":"To bite."},{"definition":"To share."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"snack-uk","text":"/snæk/"}]},{"word":"DEFENDING","idx":11852,"count":3846898,"meanings":[{"definitions":[{"definition":"To ward off attacks against; to fight to protect; to guard."},{"definition":"To support by words or writing; to vindicate, talk in favour of."},{"definition":"To make legal defence of; to represent (the accused)."},{"definition":"To focus one's energies and talents on preventing opponents from scoring, as opposed to focusing on scoring."},{"definition":"To attempt to retain a title, or attempt to reach the same stage in a competition as one did in the previous edition of that competition."},{"definition":"To call a raise from the big blind."},{"definition":"To ward off, repel (an attack or attacker)."},{"definition":"To prevent, to keep (from doing something)."},{"definition":"To prohibit, forbid."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dəˈfɛndɪŋ/"}]},{"word":"PULLS","idx":11853,"count":3846669,"meanings":[{"definitions":[{"definition":"An act of pulling (applying force)","example":"He gave the hair a sharp pull and it came out."},{"definition":"An attractive force which causes motion towards the source","example":"She took a pull on her cigarette."},{"definition":"Any device meant to be pulled, as a lever, knob, handle, or rope","example":"a zipper pull"},{"definition":"Something in one's favour in a comparison or a contest; an advantage; means of influencing.","example":"In weights the favourite had the pull."},{"definition":"Appeal or attraction (e.g. of a movie star)"},{"definition":"The situation where a client sends out a request for data from a server, as in server pull, pull technology"},{"definition":"A journey made by rowing"},{"definition":"A contest; a struggle.","example":"va wrestling pull}}"},{"definition":"Loss or violence suffered."},{"definition":"The act of drinking; a mouthful or swig of a drink.","example":"to take a pull at a mug of beer"},{"definition":"A kind of stroke by which a leg ball is sent to the off side, or an off ball to the side."},{"definition":"A mishit shot which travels in a straight line and (for a right-handed player) left of the intended path."},{"definition":"A single impression from a handpress."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply a force to (an object) so that it comes toward the person or thing applying the force.","example":"When I give the signal, pull the rope."},{"definition":"To gather with the hand, or by drawing toward oneself; to pluck.","example":"pull a finch"},{"definition":"To attract or net; to pull in."},{"definition":"To persuade (someone) to have sex with one.","example":"He's pulled that bird over there."},{"definition":"To remove (something), especially from public circulation or availability.","example":"Each day, they pulled the old bread and set out fresh loaves."},{"definition":"To retrieve or generate for use.","example":"I'll have to pull a part number for that."},{"definition":"To do or perform.","example":"He regularly pulls 12-hour days, sometimes 14."},{"definition":"(with 'a' and the name of a person, place, event, etc.) To copy or emulate the actions or behaviour that is associated with the person or thing mentioned.","example":"He pulled an Elvis and got really fat."},{"definition":"To toss a frisbee with the intention of launching the disc across the length of a field."},{"definition":"To row."},{"definition":"To achieve by rowing on a rowing machine.","example":"I pulled a personal best on the erg yesterday."},{"definition":"To draw apart; to tear; to rend."},{"definition":"To strain (a muscle, tendon, ligament, etc.)."},{"definition":"To draw (a hostile non-player character) into combat, or toward or away from some location or target."},{"definition":"To score a certain number of points in a sport.","example":"How many points did you pull today, Albert?"},{"definition":"To hold back, and so prevent from winning.","example":"The favourite was pulled."},{"definition":"To take or make (a proof or impression); so called because hand presses were worked by pulling a lever."},{"definition":"To strike the ball in a particular manner. (See noun sense.)"},{"definition":"To draw beer from a pump, keg, or other source.","example":"Let's stop at Finnigan's. The barman pulls a good pint."},{"definition":"(rail transportation, of a railroad car) To pull out from a yard or station; to leave."},{"definition":"To pluck or pick (flowers, fruit etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pʊlz/"}]},{"word":"AUTONOMOUS","idx":11854,"count":3845886,"meanings":[{"definitions":[{"definition":"Self-governing. Intelligent, sentient, self-aware, thinking, feeling, governing independently."},{"definition":"Acting on one's own or independently; of a child, acting without being governed by parental or guardian rules."},{"definition":"(Celtic linguistics, of a verb form) Used with no subject, indicating an unknown or unspecified agent; used in similar situations as the passive in English (the difference being that the theme in the English passive construction is the subject, while in the Celtic autonomous construction the theme is the object and there is no subject)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"autonomous-us","text":"/ɔˈtɑnəməs/"}]},{"word":"GRANTING","idx":11856,"count":3845218,"meanings":[{"definitions":[{"definition":"(ditransitive) to give (permission or wish)","example":"He was granted permission to attend the meeting."},{"definition":"(ditransitive) To bestow or confer, with or without compensation, particularly in answer to prayer or request; to give."},{"definition":"To agree with (someone) on (something); to accept (something) for the sake of argument; to admit to (someone) that (something) is true."},{"definition":"To assent; to consent."}],"partOfSpeech":"ve"}]},{"word":"MOTORING","idx":11857,"count":3844960,"meanings":[{"definitions":[{"definition":"To make a journey by motor vehicle; to drive.","example":"On Saturday we motored down to Plymouth."},{"definition":"To move at a brisk pace.","example":"Sales were slow at first, but now things are really motoring."},{"definition":"To leave.","example":"I gotta motor."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of driving a car."}],"partOfSpeech":"n"}]},{"word":"APPROPRIATION","idx":11858,"count":3844753,"meanings":[{"definitions":[{"definition":"An act or instance of appropriating."},{"definition":"That which is appropriated."},{"definition":"Public funds set aside for a specific purpose."},{"definition":"The use of borrowed elements in the creation of a new work."},{"definition":"The assimilation of concepts into a governing framework."},{"definition":"In church law, the making over of a benefice to an owner who receives the tithes, but is bound to appoint a vicar for the spiritual service of the parish."},{"definition":"In constitutional law, the principle that supplies granted by parliament are only to be expended for particular objects specified by itself."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˌpɹoʊpɹiˈeɪʃən/"}]},{"word":"RANDOMLY","idx":11859,"count":3844381,"meanings":[{"definitions":[{"definition":"In a random manner."},{"definition":"By random access; at any point at a given time; not sequentially."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈɹændm̩li/"}]},{"word":"CONDENSED","idx":11860,"count":3843832,"meanings":[{"definitions":[{"definition":"To concentrate toward the essence by making more close, compact, or dense, thereby decreasing size or volume.","example":"An abridged dictionary can be further condensed to pocket size."},{"definition":"To transform from a gaseous state into a liquid state via condensation."},{"definition":"To be transformed from a gaseous state into a liquid state.","example":"Water condenses on the window on cold days because of the warm air inside."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Highly concentrated, or packed into a small space.","example":"a condensed typeface"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"condensed-us"}]},{"word":"PHILIPPINE","idx":11861,"count":3843510,"meanings":[{"definitions":[{"definition":"Of or pertaining to the Philippines."}],"partOfSpeech":"j"}]},{"word":"THEOLOGICAL","idx":11862,"count":3842954,"meanings":[{"definitions":[{"definition":"Of or relating to theology."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/θi.əˈlɑd͡ʒɪkl/"},{"text":"/θɪəˈlɒd͡ʒɪkl/"}]},{"word":"QUIETLY","idx":11863,"count":3842577,"meanings":[{"definitions":[{"definition":"In a quiet manner."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"quietly-us","text":"/ˈkwaɪ.ɪt.li/"}]},{"word":"SEMICONDUCTORS","idx":11864,"count":3842193,"meanings":[{"definitions":[{"definition":"A substance with electrical properties intermediate between a good conductor and a good insulator."}],"partOfSpeech":"n"}]},{"word":"SCENERY","idx":11865,"count":3842099,"meanings":[{"definitions":[{"definition":"View, natural features, landscape."},{"definition":"Stage backdrops, property and other items on a stage that give the impression of the location of the scene."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"scenery-us","text":"/ˈsiːnəɹi/"}]},{"word":"COCA","idx":11866,"count":3841473,"meanings":[{"definitions":[{"definition":"Any of the four cultivated plants which belong to the family Erythroxylaceae, native to western South America."},{"definition":"The dried leaf of one of these plants, the South American shrub (Erythroxylum coca), widely cultivated in Andean countries, which is the source of cocaine."},{"definition":"A pastry typically made and consumed in the Spanish Mediterranean coast."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkoʊkə/"},{"text":"/ˈkəʊkə/"}]},{"word":"MENTALLY","idx":11870,"count":3838946,"meanings":[{"definitions":[{"definition":"In a mental manner; an idea thought out in one's mind, as opposed to an idea spoken orally."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"mentally-us","text":"/ˈmɛntəli/"}]},{"word":"HOROSCOPES","idx":11871,"count":3838456,"meanings":[{"definitions":[{"definition":"The position of the planets and stars at the moment of someone's birth; a diagram of such positions."},{"definition":"An astrological forecast of a person's future based on such information."}],"partOfSpeech":"n"}]},{"word":"DRYING","idx":11872,"count":3837655,"meanings":[{"definitions":[{"definition":"To lose moisture.","example":"The clothes dried on the line."},{"definition":"To remove moisture from.","example":"Devin dried her eyes with a handkerchief."},{"definition":"To be thirsty."},{"definition":"To exhaust; to cause to run dry."},{"definition":"For an actor to forget his or her lines while performing."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of drying."},{"definition":"A method of food preservation by removing water."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɹaɪ.ɪŋ/"}]},{"word":"ASSEMBLIES","idx":11873,"count":3837220,"meanings":[{"definitions":[{"definition":"A set of pieces that work together in unison as a mechanism or device.","example":"In order to change the bearing, you must first remove the gearbox assembly."},{"definition":"The act of putting together a set of pieces, fragments, or elements.","example":"assembly line"},{"definition":"A congregation of people in one place for a purpose.","example":"freedom of assembly"},{"definition":"A legislative body."},{"definition":"A beat of the drum or sound of the bugle as a signal to troops to assemble."},{"definition":"In Microsoft .NET, a building block of an application, similar to a DLL, but containing both executable code and information normally found in a DLL's type library. The type library information in an assembly, called a manifest, describes public functions, data, classes, and version information."},{"definition":"A programming language in which the source code of programs is composed of mnemonic instructions, each of which corresponds directly to a machine instruction for a particular processor.","example":"A skilled programmer can write very fast code in assembly language."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"assemblies-us"}]},{"word":"NOUN","idx":11874,"count":3837137,"meanings":[{"definitions":[{"definition":"(grammar, narrow sense) A word that can be used to refer to a person, animal, place, thing, phenomenon, substance, quality, or idea; one of the basic parts of speech in many languages, including English."},{"definition":"(grammar, now rare, broad sense) Either a word that can be used to refer to a person, animal, place, thing, phenomenon, substance, quality or idea, or a word that modifies or describes a previous word or its referent; a substantive or adjective, sometimes also including other parts of speech such as numeral or pronoun."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To convert a word to a noun."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/naʊn/"}]},{"word":"SILICONE","idx":11876,"count":3835328,"meanings":[{"definitions":[{"definition":"Any of a class of inert, semi-inorganic polymeric compounds (polysiloxanes), that have a wide range of thermal stability and extreme water repellence, used in a very wide range of industrial applications, and in prosthetic replacements for body parts."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɪlɪkəʊn/"}]},{"word":"COLLATERAL","idx":11877,"count":3835146,"meanings":[{"definitions":[{"definition":"A security or guarantee (usually an asset) pledged for the repayment of a loan if one cannot procure enough funds to repay."},{"definition":"(genealogy) A collateral (not linear) family member."},{"definition":"A branch of a bodily part or system of organs.","example":"Besides the arteries blood streams through numerous veins we call collaterals."},{"definition":"Printed materials or content of electronic media used to enhance sales of products (short form of collateral material)."},{"definition":"A thinner blood vessel providing an alternate route to blood flow in case the main vessel becomes occluded."},{"definition":"A contemporary or rival."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Parallel, along the same vein, side by side."},{"definition":"Corresponding; accompanying, concomitant."},{"definition":"Being aside from the main subject, target, or goal.","example":"Although not a direct cause, the border skirmish was certainly a collateral incitement for the war."},{"definition":"(genealogy) Of an indirect ancestral relationship, as opposed to lineal descendency.","example":"Uncles, aunts, cousins, nephews and nieces are collateral relatives."},{"definition":"Relating to a collateral in the sense of an obligation or security."},{"definition":"Expensive to the extent of being paid through a loan."},{"definition":"Coming or directed along the side.","example":"collateral pressure"},{"definition":"Acting in an indirect way."},{"definition":"(of a vascular bundle) Having the phloem and xylem adjacent."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"collateral-uk","text":"/kəˈlætəɹəl/"}]},{"word":"LEARNER","idx":11879,"count":3834055,"meanings":[{"definitions":[{"definition":"One who is learning.","example":"She’s still a learner, so she’s prone to making mistakes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"learner-uk","text":"/ˈlɜɹnəɹ/"}]},{"word":"WELCOMES","idx":11880,"count":3832970,"meanings":[{"definitions":[{"definition":"The act of greeting someone’s arrival, especially by saying \"Welcome!\"; reception."},{"definition":"The utterance of such a greeting."},{"definition":"Kind reception of a guest or newcomer.","example":"We entered the house and found a ready welcome."},{"definition":"The state of being a welcome guest."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To affirm or greet the arrival of someone, especially by saying \"Welcome!\"."},{"definition":"To accept something willingly or gladly.","example":"We welcome suggestions for improvement."}],"partOfSpeech":"ve"}]},{"word":"SWALLOW","idx":11882,"count":3832303,"meanings":[{"definitions":[{"definition":"A deep chasm or abyss in the earth."},{"definition":"The amount swallowed in one gulp; the act of swallowing.","example":"He took the aspirin with a single swallow of water."},{"definition":"Any of various carbohydrate-based dishes that are swallowed without much chewing."},{"definition":"A small, migratory bird of the Hirundinidae family with long, pointed, moon-shaped wings and a forked tail which feeds on the wing by catching insects."},{"definition":"The aperture in a block through which the rope reeves."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause (food, drink etc.) to pass from the mouth into the stomach; to take into the stomach through the throat."},{"definition":"To take (something) in so that it disappears; to consume, absorb."},{"definition":"To take food down into the stomach; to make the muscular contractions of the oesophagus to achieve this, often taken as a sign of nervousness or strong emotion.","example":"My throat was so sore that I was unable to swallow."},{"definition":"To accept easily or without questions; to believe, accept."},{"definition":"To engross; to appropriate; usually with up."},{"definition":"To retract; to recant.","example":"to swallow one's opinions"},{"definition":"To put up with; to bear patiently or without retaliation.","example":"to swallow an affront or insult"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"swallow-us","text":"/ˈswɑloʊ/"}]},{"word":"TARA","idx":11883,"count":3831476,"meanings":[{"definitions":[{"definition":"Goodbye; equivalent to the more geographically widespread ta ta","example":"2004: Metro in This is London (website of London Evening Standard), Jolie says ta-ra to Lara - Pssst...Actress Angelina Jolie's days as Tomb Raider action hero Lara Croft are over."}],"partOfSpeech":"i"}],"phonetics":[{"text":"/tæˈɹɑː/"}]},{"word":"TRANSPLANT","idx":11884,"count":3830833,"meanings":[{"definitions":[{"definition":"An act of uprooting and moving (something)."},{"definition":"Anything that is transplanted."},{"definition":"An operation in which tissue or an organ is transplanted."},{"definition":"A transplanted organ or tissue."},{"definition":"Someone who is not native to their area of residence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To uproot (a growing plant), and plant it in another place."},{"definition":"To remove (something) and establish its residence in another place; to resettle or relocate."},{"definition":"To transfer (tissue or an organ) from one body to another, or from one part of a body to another."}],"partOfSpeech":"ve"}]},{"word":"SCOREBOARD","idx":11885,"count":3830219,"meanings":[{"definitions":[{"definition":"A large board that displays the score in a game or contest."},{"definition":"A similar board that also displays each batsman's score, and many statistics and pieces of information."},{"definition":"(by extension) A listing of various similar entities along with their properties, such as status or rank."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"scoreboard-au"}]},{"word":"PROLIFERATION","idx":11886,"count":3829964,"meanings":[{"definitions":[{"definition":"The process by which an organism produces others of its kind; breeding, propagation, procreation, reproduction."},{"definition":"The act of increasing or rising; augmentation, amplification, enlargement, escalation, aggrandizement."},{"definition":"The result of building up; buildup, accretion."},{"definition":"The spread of biochemical, nuclear and other weapons of mass destruction to countries not originally involved in developing them."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɹəˌlɪfəˈɹeɪʃən/"}]},{"word":"SQUID","idx":11888,"count":3828491,"meanings":[{"definitions":[{"definition":"Any of several carnivorous marine cephalopod mollusks, of the order Teuthida, having a mantle, eight arms, and a pair of tentacles"},{"definition":"A fishhook with a piece of bright lead, bone, or other substance fastened on its shank to imitate a squid."},{"definition":"(mildly) A sailor in the Navy."},{"definition":"A quid; one pound sterling.","example":"Can you lend me five squid? I feel like a bacon sarnie."},{"definition":"A motorcyclist, especially a sport biker, characterized by reckless riding and lack of protective gear."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish with the kind of hook called a squid."},{"definition":"(parachuting) To cause squidding (an improper, partial, parachute inflation, that results in the sides of the parachute folding in on the center, and pulsating back and forth)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"squid-us","text":"/skwɪd/"}]},{"word":"MARINES","idx":11889,"count":3828140,"meanings":[{"definitions":[{"definition":"A soldier, normally a member of a marine corps, trained to serve on board or from a ship","example":"He was a marine in World War II."},{"definition":"Capitalised in the plural A marine corps.","example":"He fought with the Marines in World War II."},{"definition":"A painting representing some marine subject."},{"definition":"A military organization of marines, soldiers who are trained and equipped to fight on or from ships."}],"partOfSpeech":"n"}]},{"word":"LIGHTHOUSE","idx":11891,"count":3826413,"meanings":[{"definitions":[{"definition":"A tower or other structure exhibiting a light or lights to warn or guide sailors."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lighthouse-us","text":"/ˈlaɪthaʊs/"}]},{"word":"PROVES","idx":11892,"count":3826270,"meanings":[{"definitions":[{"definition":"To proofread."},{"definition":"To make resistant, especially to water."},{"definition":"To allow yeast-containing dough to rise."},{"definition":"To test the activeness of yeast."},{"definition":"To demonstrate that something is true or viable; to give proof for.","example":"I will prove that my method is more effective than yours."},{"definition":"To turn out; to manifest.","example":"It proved to be a cold day."},{"definition":"To turn out to be.","example":"Have an exit strategy should your calculations prove incorrect."},{"definition":"To put to the test, to make trial of.","example":"The exception proves the rule."},{"definition":"To ascertain or establish the genuineness or validity of; to verify.","example":"to prove a will"},{"definition":"To experience."},{"definition":"To take a trial impression of; to take a proof of.","example":"to prove a page"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of dough proofing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"proves-us","text":"/pɹuːvz/"}]},{"word":"TRILOGY","idx":11894,"count":3825206,"meanings":[{"definitions":[{"definition":"A set of three works of art that are connected, and that can be seen either as a single work or as three individual works. They are commonly found in literature, film, or video games."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"trilogy-us","text":"/ˈtɹɪlədʒi/"}]},{"word":"CRAB","idx":11895,"count":3824989,"meanings":[{"definitions":[{"definition":"A crustacean of the infraorder Brachyura, having five pairs of legs, the foremost of which are in the form of claws, and a carapace."},{"definition":"The meat of this crustacean, served as food; crabmeat"},{"definition":"A bad-tempered person."},{"definition":"(in plural crabs) An infestation of pubic lice (Pthirus pubis).","example":"Although crabs themselves are an easily treated inconvenience, the patient and his partner(s) clearly run major STD risks."},{"definition":"A playing card with the rank of three."},{"definition":"A position in rowing where the oar is pushed under the rigger by the force of the water."},{"definition":"A defect in an outwardly normal object that may render it inconvenient and troublesome to use."},{"definition":"An unsold book that is returned to the publisher."},{"definition":"The crab apple or wild apple."},{"definition":"The tree bearing crab apples, which has a dogbane-like bitter bark with medical use."},{"definition":"A cudgel made of the wood of the crab tree; a crabstick."},{"definition":"A movable winch or windlass with powerful gearing, used with derricks, etc."},{"definition":"A form of windlass, or geared capstan, for hauling ships into dock, etc."},{"definition":"A machine used in ropewalks to stretch the yarn."},{"definition":"A claw for anchoring a portable machine."},{"definition":"The tree species Carapa guianensis, native to South America."},{"definition":"Short for carabiner."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for crabs."},{"definition":"To ruin."},{"definition":"To complain."},{"definition":"To drift or move sideways or to leeward (by analogy with the movement of a crab)."},{"definition":"To navigate (an aircraft, e.g. a glider) sideways against an air current in order to maintain a straight-line course."},{"definition":"To move (a camera) sideways."},{"definition":"(World War I), to fly slightly off the straight-line course towards an enemy aircraft, as the machine guns on early aircraft did not allow firing through the propeller disk."},{"definition":"To back out of something."},{"definition":"(obsolete) To irritate, make surly or sour"},{"definition":"To be ill-tempered; to complain or find fault."},{"definition":"(British dialect) To cudgel or beat, as with a crabstick"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crab-us","text":"/kɹæb/"}]},{"word":"BRIGHTNESS","idx":11897,"count":3822314,"meanings":[{"definitions":[{"definition":"The quality of being bright."},{"definition":"The perceived luminance of an object."},{"definition":"Intelligence, cleverness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"brightness-us","text":"/ˈbɹaɪtnəs/"}]},{"word":"CONSUMED","idx":11900,"count":3820896,"meanings":[{"definitions":[{"definition":"To use up.","example":"The power plant consumes 30 tons of coal per hour."},{"definition":"To eat.","example":"Baby birds consume their own weight in food each day."},{"definition":"To completely occupy the thoughts or attention of.","example":"Desire consumed him."},{"definition":"To destroy completely.","example":"The building was consumed by fire."},{"definition":"To waste away slowly."},{"definition":"To trade money for good or services as an individual.","example":"If you consume this product while in Japan, you may be subject to consumption tax."},{"definition":"To absorb information, especially through the mass media.","example":"The Internet has changed the way we consume news."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Construed with with Full of, exuding (also figuratively).","example":"She was consumed with hatred."}],"partOfSpeech":"j"}]},{"word":"MAXIM","idx":11901,"count":3820484,"meanings":[{"definitions":[{"definition":"A self-evident axiom or premise; a pithy expression of a general principle or rule."},{"definition":"A precept; a succinct statement or observation of a rule of conduct or moral teaching."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"maxim-us","text":"/ˈmæk.səm/"}]},{"word":"HIKE","idx":11902,"count":3820168,"meanings":[{"definitions":[{"definition":"A long walk."},{"definition":"An abrupt increase.","example":"The tenants were not happy with the rent hike."},{"definition":"The snap of the ball to start a play."},{"definition":"A sharp upward tug to raise something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take a long walk for pleasure or exercise.","example":"Don't forget to bring the map when we go hiking tomorrow."},{"definition":"To unfairly or suddenly raise a price."},{"definition":"To snap the ball to start a play."},{"definition":"To lean out to the windward side of a sailboat in order to counterbalance the effects of the wind on the sails."},{"definition":"To pull up or tug upwards sharply.","example":"She hiked her skirt up."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hike-us","text":"/haɪk/"}]},{"word":"BORE","idx":11903,"count":3819820,"meanings":[{"definitions":[{"definition":"A hole drilled or milled through something, or (by extension) its diameter.","example":"the bore of a cannon"},{"definition":"The tunnel inside of a gun's barrel through which the bullet travels when fired, or (by extension) its diameter."},{"definition":"A tool, such as an auger, for making a hole by boring."},{"definition":"A capped well drilled to tap artesian water. The place where the well exists."},{"definition":"One who inspires boredom or lack of interest; an uninteresting person."},{"definition":"Something dull or uninteresting"},{"definition":"Calibre; importance."},{"definition":"A sudden and rapid flow of tide occuring in certain rivers and estuaries which rolls up as a wave."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To inspire boredom in somebody."},{"definition":"To make a hole through something."},{"definition":"To make a hole with, or as if with, a boring instrument; to cut a circular hole by the rotary motion of a tool.","example":"An insect bores into a tree."},{"definition":"To form or enlarge (something) by means of a boring instrument or apparatus.","example":"to bore a steam cylinder or a gun barrel; to bore a hole"},{"definition":"To make (a passage) by laborious effort, as in boring; to force a narrow and difficult passage through.","example":"to bore one's way through a crowd"},{"definition":"To be pierced or penetrated by an instrument that cuts as it turns.","example":"This timber does not bore well."},{"definition":"To push forward in a certain direction with laborious effort."},{"definition":"(of a horse) To shoot out the nose or toss it in the air."},{"definition":"To fool; to trick."},{"definition":"To carry or convey, literally or figuratively.","example":"Judging from the look on his face, he wasn't bearing good news."},{"definition":"To support, sustain, or endure."},{"definition":"To support, keep up, or maintain."},{"definition":"To press or impinge upon."},{"definition":"To produce, yield, give birth to."},{"definition":"(originally nautical) To be, or head, in a specific direction or azimuth (from somewhere).","example":"By my readings, we're bearing due south, so we should turn about ten degrees east."},{"definition":"To gain or win."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bore-us","text":"/bɔɹ/"}]},{"word":"DEPRECIATION","idx":11905,"count":3818913,"meanings":[{"definitions":[{"definition":"The state of being depreciated; disparagement."},{"definition":"The decline in value of assets."},{"definition":"The measurement of the decline in value of assets. Not to be confused with impairment, which is the measurement of the unplanned, extraordinary decline in value of assets."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˌpɹiːʃɪˈeɪʃən/"}]},{"word":"TECHNICALLY","idx":11907,"count":3818321,"meanings":[{"definitions":[{"definition":"Based on precise facts.","example":"Technically he was Canadian, but everyone assumed he was American."},{"definition":"Having or using the skills or talent required for a certain job or profession.","example":"Although she is technically gifted, her piano playing lacks passion."},{"definition":"According to the current state of technology.","example":"For now, it is technically impossible to have a manned flight to Mercury."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"technically-uk","text":"/ˈtɛknɪkli/"}]},{"word":"ARS","idx":11908,"count":3818073,"meanings":[{"definitions":[{"definition":"The name of the Latin-script letter R.","example":"All the ars in the inscription."}],"partOfSpeech":"n"}]},{"word":"PHARMACIST","idx":11909,"count":3816817,"meanings":[{"definitions":[{"definition":"A professional who dispenses prescription drugs in a hospital or retail pharmacy."},{"definition":"(academic) One who studies pharmacy."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɑɹməsɪst/"}]},{"word":"ENJOYMENT","idx":11911,"count":3816406,"meanings":[{"definitions":[{"definition":"The condition of enjoying anything.","example":"Few activities better the enjoyment of a hearty meal eaten in good company."},{"definition":"An enjoyable state of mind."},{"definition":"An activity that gives pleasure."},{"definition":"The exercise of a legal right."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"enjoyment-us","text":"/ɛnˈdʒɔɪmənt/"}]},{"word":"COWS","idx":11913,"count":3816319,"meanings":[{"definitions":[{"definition":"(properly) An adult female of the species Bos taurus, especially one that has calved."},{"definition":"(formerly inexact but now common) Any member of the species Bos taurus regardless of sex or age, including bulls and calves."},{"definition":"Beef: the meat of cattle as food."},{"definition":"Any bovines or bovids generally, including yaks, buffalo, etc."},{"definition":"A female member of other large species of mammal, including the bovines, moose, whales, seals, hippos, rhinos, manatees, and elephants."},{"definition":"A woman considered unpleasant in some way, particularly one considered nasty, stupid, fat, lazy, or difficult."},{"definition":"A chock: a wedge or brake used to stop a machine or car."},{"definition":"A chimney cowl."},{"definition":"A plant or herb with edible roots, in the genus Lomatium, used in traditional Native American foods and medicines."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(chiefly in the passive voice) To intimidate; to daunt the spirits or courage of.","example":"Con artists are not cowed by the law."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kaʊz/"}]},{"word":"DELIVERIES","idx":11915,"count":3815714,"meanings":[{"definitions":[{"definition":"The act of conveying something.","example":"The delivery was completed by four."},{"definition":"The item which has been conveyed.","example":"Your delivery is on the table."},{"definition":"The act of giving birth","example":"The delivery was painful."},{"definition":"A pitching motion.","example":"His delivery has a catch in it."},{"definition":"A thrown pitch.","example":"Here is the delivery; ... strike three!"},{"definition":"The manner of speaking.","example":"The actor's delivery was flawless."},{"definition":"The administration of a drug.","example":"Drug delivery system."},{"definition":"A ball bowled."},{"definition":"The process of throwing a stone."},{"definition":"Process of introducing foreign DNA into host cells."}],"partOfSpeech":"n"}]},{"word":"RECRUITERS","idx":11916,"count":3814660,"meanings":[{"definitions":[{"definition":"Agent noun of recruit; one who recruits, particularly one employed to recruit others.","example":"The army recruiter promised that I'd see the world and learn useful skills if I enlisted."}],"partOfSpeech":"n"}]},{"word":"CORRESPOND","idx":11918,"count":3814384,"meanings":[{"definitions":[{"definition":"(constructed with to) To be equivalent or similar in character, quantity, quality, origin, structure, function etc."},{"definition":"(constructed with with) to exchange messages, especially by postal letter, over a period of time.","example":"I've been corresponding with my German pen pal for three years."},{"definition":"To have sex with."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"correspond-us","text":"/ˌkɑɹəˈspɑnd/"}]},{"word":"SLATE","idx":11919,"count":3813904,"meanings":[{"definitions":[{"definition":"A fine-grained homogeneous sedimentary rock composed of clay or volcanic ash which has been metamorphosed so that it cleaves easily into thin layers."},{"definition":"The bluish-grey colour of most slate."},{"definition":"A chalkboard, sheet of slate for writing on with chalk or with a thin rod of slate (a slate pencil) formerly commonly used by both students and teachers in schools"},{"definition":"A roofing-tile made of slate."},{"definition":"A record of money owed.","example":"Put it on my slate – I’ll pay you next week."},{"definition":"A list of affiliated candidates for an election.","example":"Roy Disney led the alternative slate of directors for the stockholder vote."},{"definition":"An artificial material resembling slate and used for the same purposes."},{"definition":"A thin plate of any material; a flake."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having the bluish-grey/gray colour of slate."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To cover with slate.","example":"The old church ledgers show that the roof was slated in 1775."},{"definition":"To criticise harshly.","example":"The play was slated by the critics."},{"definition":"To schedule.","example":"The election was slated for November 2nd."},{"definition":"To anticipate or strongly expect.","example":"The next version of our software is slated to be the best release ever."},{"definition":"To set a dog upon (a person)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slate-uk","text":"/sleɪt/"}]},{"word":"CONFINED","idx":11921,"count":3813370,"meanings":[{"definitions":[{"definition":"To restrict; to keep within bounds; to shut or keep in a limited space or area."},{"definition":"To have a common boundary; to border; to lie contiguous; to touch; followed by on or with."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not free to move."},{"definition":"Limited; narrow; restricted."},{"definition":"In childbed."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"confined-us","text":"/kənˈfaɪnd/"}]},{"word":"SCREAMING","idx":11922,"count":3812764,"meanings":[{"definitions":[{"definition":"To cry out with a shrill voice; to utter a sudden, sharp outcry, or shrill, loud cry, as in fright or extreme pain; to shriek; to screech."},{"definition":"To move quickly; to race.","example":"He almost hit a pole, the way he came screaming down the hill."},{"definition":"To be very indicative of; clearly having the characteristics of.","example":"Do you know what screams \"I'm obnoxious\"? People who feel the need to comment on every little thing they notice."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A scream."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Loud, sharp, and piercing to the ear."},{"definition":"Obvious; distinct."},{"definition":"Effeminate, flamboyant or otherwise obviously gay.","example":"Did you see that guy at the bar? Screaming!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"screaming-au"}]},{"word":"INHABITANTS","idx":11923,"count":3812535,"meanings":[{"definitions":[{"definition":"Someone or thing who lives in a place."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"inhabitants-us","text":"/ɪnˈhæbɪtənts/"}]},{"word":"STRAIGHTFORWARD","idx":11924,"count":3812325,"meanings":[{"definitions":[{"definition":"Proceeding in a straight course or manner; not deviating."},{"definition":"Easy, simple, without difficulty"},{"definition":"Direct; honest; frank"}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a straightforward manner; straightforwards; straightforwardly."}],"partOfSpeech":"v"}]},{"word":"DELIGHTED","idx":11925,"count":3812221,"meanings":[{"definitions":[{"definition":"To give delight to; to affect with great pleasure; to please highly.","example":"A beautiful landscape delights the eye."},{"definition":"To have or take great pleasure."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Greatly pleased."},{"definition":"Filled with wonder and delight."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"delighted-us"},{"text":"/dɪˈlaɪtəd/"}]},{"word":"PEEL","idx":11928,"count":3810917,"meanings":[{"definitions":[{"definition":"(usually uncountable) The skin or outer layer of a fruit, vegetable, etc."},{"definition":"The action of peeling away from a formation."},{"definition":"A cosmetic preparation designed to remove dead skin or to exfoliate."},{"definition":"A stake."},{"definition":"A fence made of stakes; a stockade."},{"definition":"A small tower, fort, or castle; a keep."},{"definition":"A shovel or similar instrument, now especially a pole with a flat disc at the end used for removing pizza or loaves of bread from a baker's oven."},{"definition":"A T-shaped implement used by printers and bookbinders for hanging wet sheets of paper on lines or poles to dry."},{"definition":"The blade of an oar."},{"definition":"An equal or match; a draw."},{"definition":"A takeout which removes a stone from play as well as the delivered stone."},{"definition":"A small salmon; a grilse; a sewin."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the skin or outer covering of.","example":"I sat by my sister's bed, peeling oranges for her."},{"definition":"To remove something from the outer or top layer of.","example":"I peeled (the skin from) a banana and ate it hungrily."},{"definition":"To become detached, come away, especially in flakes or strips; to shed skin in such a way.","example":"I had been out in the sun too long, and my nose was starting to peel."},{"definition":"To remove one's clothing.","example":"The children peeled by the side of the lake and jumped in."},{"definition":"To move, separate (off or away).","example":"The scrum-half peeled off and made for the touchlines."},{"definition":"To play a peel shot."},{"definition":"To send through a hoop (of a ball other than one's own)."},{"definition":"To plunder; to pillage, rob."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"peel-au","text":"/piːl/"}]},{"word":"SIMULTANEOUS","idx":11932,"count":3808657,"meanings":[{"definitions":[{"definition":"Happening at the same moment."},{"definition":"(of a set of equations) To be solved for the same values of variables."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"simultaneous-us","text":"/ˌsaɪ̯m.əlˈteɪ̯n.i.əs/"}]},{"word":"MONOPOLY","idx":11933,"count":3808505,"meanings":[{"definitions":[{"definition":"A situation, by legal privilege or other agreement, in which solely one party (company, cartel etc.) exclusively provides a particular product or service, dominating that market and generally exerting powerful control over it."},{"definition":"An exclusive control over the trade or production of a commodity or service through exclusive possession.","example":"A land monopoly renders its holder(s) nearly almighty in an agricultural society."},{"definition":"The privilege granting the exclusive right to exert such control.","example":"Granting monopolies in concession constitutes a market-conform alternative to taxation for the state, while the crown sometimes bestowed a monopoly as an outrageous gift."},{"definition":"(metonymy) The market thus controlled."},{"definition":"(metonymy) The holder (person, company or other) of such market domination in one of the above manners."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"monopoly-us","text":"/məˈnɑpəˌli/"}]},{"word":"PNG","idx":11934,"count":3806867,"meanings":[{"definitions":[{"definition":"A raster image file format, designed to succeed static GIF (GIF 87a)."},{"definition":"A person who is not welcome, especially a diplomat in a foreign country."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɪŋ/"}]},{"word":"PORNOGRAPHY","idx":11935,"count":3806856,"meanings":[{"definitions":[{"definition":"The explicit literary or visual depiction of sexual subject matter; any display of material of an erotic nature."},{"definition":"(by extension) The depiction of (non-sexual) subject matter so that it elicits feelings analogous to erotic pleasure; any such depiction."},{"definition":"(usually humorous) The graphic, detailed, often gratuitous depiction of something."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɔɹˈnɑ.ɡɹə.fi/"},{"text":"/pɔː(ɹ)ˈnɒɡ.ɹə.fi/"},{"audio":"pornography-au"}]},{"word":"DEBRIS","idx":11936,"count":3806697,"meanings":[{"definitions":[{"definition":"Rubble, wreckage, scattered remains of something destroyed."},{"definition":"Litter and discarded refuse."},{"definition":"The ruins of a broken-down structure."},{"definition":"Large rock fragments left by a melting glacier etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"debris-us","text":"/dəˈbɹiː/"}]},{"word":"INTENTIONS","idx":11938,"count":3806436,"meanings":[{"definitions":[{"definition":"The goal or purpose behind a specific action or set of actions.","example":"It’s easy to promise anything when you have no intention of fulfilling any of it."},{"definition":"Tension; straining, stretching."},{"definition":"A stretching or bending of the mind toward an object or a purpose (an intent); closeness of application; fixedness of attention; earnestness."},{"definition":"The object toward which the thoughts are directed; end; aim."},{"definition":"Any mental apprehension of an object."},{"definition":"The process of the healing of a wound."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"intentions-us","text":"/ɪnˈtɛnʃənz/"}]},{"word":"ROBOTICS","idx":11939,"count":3806007,"meanings":[{"definitions":[{"definition":"The science and technology of robots, their design, manufacture, and application"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹoʊˈbɑt.ɪks/"},{"text":"/ɹəʊˈbɒt.ɪks/"}]},{"word":"PAGAN","idx":11940,"count":3805644,"meanings":[{"definitions":[{"definition":"A person not adhering to a main world religion; a follower of a pantheistic or nature-worshipping religion.","example":"This community has a surprising number of pagans."},{"definition":"(by extension) An uncivilized or unsocialized person."},{"definition":"(by extension) An unruly, badly educated child."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to, characteristic of religions that differ from main world religions.","example":"Many converted societies transformed their pagan deities into saints."},{"definition":"(by extension) Savage, immoral, uncivilized, wild."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pagan-us","text":"/ˈpeɪɡən/"}]},{"word":"CHOPPED","idx":11941,"count":3804704,"meanings":[{"definitions":[{"definition":"To cut into pieces with short, vigorous cutting motions.","example":"chop wood; chop an onion"},{"definition":"To sever with an axe or similar implement.","example":"Chop off his head."},{"definition":"To give a downward cutting blow or movement, typically with the side of the hand."},{"definition":"To hit the ball downward so that it takes a high bounce."},{"definition":"To divide the pot (or tournament prize) between two or more players."},{"definition":"To make a quick, heavy stroke or a series of strokes, with or as with an ax."},{"definition":"To do something suddenly with an unexpected motion; to catch or attempt to seize."},{"definition":"To interrupt; with in or out."},{"definition":"(Perl) To remove the final character from (a text string)."},{"definition":"To exchange, to barter; to swap."},{"definition":"To chap or crack."},{"definition":"To vary or shift suddenly.","example":"The wind chops about."},{"definition":"To twist words."},{"definition":"To converse, discuss, or speak with another."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Cut or diced into small pieces."},{"definition":"(chiefly of meat) Ground, having been processed by grinding."},{"definition":"Having a vehicle's height reduced by horizontal trimming of the roofline."},{"definition":"High on drugs."},{"definition":"Fired from a job or cut from a team or training program; having got the chop."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"chopped-us","text":"/t͡ʃɑpt/"}]},{"word":"WIDOW","idx":11942,"count":3804620,"meanings":[{"definitions":[{"definition":"A woman whose spouse has died (and who has not remarried); feminine of widower."},{"definition":"A person whose spouse has died (and who has not remarried)."},{"definition":"(in combination) A woman whose husband is often away pursuing a sport, etc."},{"definition":"An additional hand of cards dealt face down in some card games, to be used by the highest bidder."},{"definition":"A single line of type that ends a paragraph, carried over to the next page or column."},{"definition":"A venomous spider, of the genus Latrodectus."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a widow or widower of someone; to cause the death of the spouse of."},{"definition":"To strip of anything valued."},{"definition":"To endow with a widow's right."},{"definition":"To be widow to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"widow-us","text":"/ˈwɪ.doʊ/"}]},{"word":"CONTEXTS","idx":11943,"count":3804487,"meanings":[{"definitions":[{"definition":"The surroundings, circumstances, environment, background or settings that determine, specify, or clarify the meaning of an event or other occurrence.","example":"In what context did your attack on him happen? - We had a pretty tense relationship at the time, and when he insulted me I snapped."},{"definition":"The text in which a word or passage appears and which helps ascertain its meaning.","example":"Without any context, I can't tell you if the \"dish\" refers to the food, or the thing you eat it on."},{"definition":"The surroundings and environment in which an artifact is found and which may provide important clues about the artifact's function and/or cultural meaning."},{"definition":"The trama or flesh of a mushroom."},{"definition":"For a formula: a finite set of variables, which set contains all the free variables in the given formula."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To knit or bind together; to unite closely."}],"partOfSpeech":"ve"}]},{"word":"SAC","idx":11944,"count":3803083,"meanings":[{"definitions":[{"definition":"A bag or pouch inside a plant or animal that typically contains a fluid."},{"definition":"(games) A sacrifice.","example":"Kasparov's queen sac early in the game gained him a positional advantage against Kramnik."},{"definition":"The privilege, formerly enjoyed by the lord of a manor, of holding courts, trying causes, and imposing fines."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(games) To sacrifice.","example":"I kept saccing monsters at the altar until I was rewarded with a new weapon."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sæk/"}]},{"word":"PEG","idx":11945,"count":3802883,"meanings":[{"definitions":[{"definition":"A cylindrical wooden or metal object used to fasten or as a bearing between objects."},{"definition":"Measurement between the pegs: after killing an animal hunters used the distance between a peg near the animal's nose and one near the end of its tail to measure its body length."},{"definition":"A protrusion used to hang things on.","example":"Hang your coat on the peg and come in."},{"definition":"A support; a reason; a pretext.","example":"a peg to hang a claim upon"},{"definition":"A peg moved on a crib board to keep score."},{"definition":"A fixed exchange rate, where a currency's value is matched to the value of another currency or measure such as gold"},{"definition":"A small quantity of a strong alcoholic beverage."},{"definition":"A place formally allotted for fishing"},{"definition":"A leg or foot."},{"definition":"One of the pins of a musical instrument, on which the strings are strained."},{"definition":"A step; a degree."},{"definition":"Short for clothes peg."},{"definition":"A topic of interest, such as an ongoing event or an anniversary, around which various features can be developed."},{"definition":"A stump."},{"definition":"The penetration of one's (male) partner in the anus using a dildo.","example":"Get your strap-on out and give me a nice peg!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fasten using a peg.","example":"Let's peg the rug to the floor."},{"definition":"To affix or pin.","example":"I found a tack and pegged your picture to the bulletin board."},{"definition":"To fix a value or price.","example":"China's currency is no longer pegged to the American dollar."},{"definition":"To narrow the cuff openings of a pair of pants so that the legs take on a peg shape."},{"definition":"To throw."},{"definition":"To indicate or ascribe an attribute to. (Assumed to originate from the use of pegs or pins as markers on a bulletin board or a list.)","example":"He's been pegged as a suspect."},{"definition":"To move one's pegs to indicate points scored; to score with a peg.","example":"She pegged twelve points."},{"definition":"To reach or exceed the maximum value on (a scale or gauge).","example":"We pegged the speedometer across the flats."},{"definition":"(typically in heterosexual contexts) To engage in anal sex by penetrating (one's male partner) with a dildo."},{"definition":"To keep working hard at something; to peg away."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"peg-us","text":"/pɛɡ/"}]},{"word":"SLEEVES","idx":11948,"count":3801642,"meanings":[{"definitions":[{"definition":"The part of a garment that covers the arm."},{"definition":"A (usually tubular) covering or lining to protect a piece of machinery etc."},{"definition":"A protective jacket or case, especially for a record, containing art and information about the contents; also the analogous leaflet found in a packaged CD."},{"definition":"A tattoo covering the whole arm."},{"definition":"A narrow channel of water."},{"definition":"Sleave; untwisted thread."},{"definition":"A serving of beer measuring between 14 and 16 ounces."},{"definition":"A long, cylindrical plastic bag of cookies or crackers."},{"definition":"A double tube of copper into which the ends of bare wires are pushed so that when the tube is twisted an electrical connection is made. The joint thus made is called a McIntire joint."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fit a sleeve to"},{"definition":"(magic tricks) To hide something up one's sleeve."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sliːvz/"}]},{"word":"TROUBLED","idx":11949,"count":3801498,"meanings":[{"definitions":[{"definition":"To disturb, stir up, agitate (a medium, especially water)."},{"definition":"To mentally distress; to cause (someone) to be anxious or perplexed.","example":"What she said about narcissism is troubling me."},{"definition":"In weaker sense: to bother or inconvenience.","example":"I will not trouble you to deliver the letter."},{"definition":"To take pains to do something.","example":"I won't trouble to post the letter today; I can do it tomorrow."},{"definition":"To worry; to be anxious."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Anxious, worried, careworn."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"troubled-us","text":"/ˈtɹʌbl̩d/"}]},{"word":"FOOTNOTE","idx":11950,"count":3800501,"meanings":[{"definitions":[{"definition":"A short piece of text, often numbered, placed at the bottom of a printed page, that adds a comment, citation, reference etc, to a designated part of the main text.","example":"consult the footnotes for more details"},{"definition":"(by extension) An event of lesser importance than some larger event to which it is related.","example":"a mere footnote in history"},{"definition":"A qualification to the import of something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add footnotes to a text."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfʊtˌnoʊt/"},{"text":"/ˈfʊtˌnəʊt/"}]},{"word":"VIBRANT","idx":11951,"count":3800268,"meanings":[{"definitions":[{"definition":"Pulsing with energy or activity.","example":"He has a vibrant personality."},{"definition":"Lively and vigorous."},{"definition":"Vibrating, resonant or resounding."},{"definition":"(of a colour) Bright."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈvaɪbɹənt/"}]},{"word":"EVOLVING","idx":11952,"count":3799789,"meanings":[{"definitions":[{"definition":"To move in regular procession through a system."},{"definition":"To change; transform."},{"definition":"To come into being; develop."},{"definition":"Of a population, to change genetic composition over successive generations through the process of evolution."},{"definition":"To give off (gas, such as oxygen or carbon dioxide during a reaction).","example":"to evolve odours"},{"definition":"To cause something to change or transform."}],"partOfSpeech":"ve"}]},{"word":"SWEATER","idx":11953,"count":3798820,"meanings":[{"definitions":[{"definition":"A knitted jacket or jersey, usually of thick wool, worn by athletes before or after exercise."},{"definition":"A similar garment worn for warmth."},{"definition":"One who sweats (produces sweat)."},{"definition":"One who or that which causes to sweat."},{"definition":"A diaphoretic remedy."},{"definition":"A middleman who subcontracted piece work in the tailoring trade."},{"definition":"One who sweats coins, i.e. removes small portions by shaking them."},{"definition":"A London street ruffian in Queen Anne's time who prodded weak passengers with his sword-point."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dress in a sweater."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sweater-us","text":"/-ɾɚ/"}]},{"word":"APPROXIMATION","idx":11954,"count":3798341,"meanings":[{"definitions":[{"definition":"The act, process or result of approximating."},{"definition":"An imprecise solution or result that is adequate for a defined purpose."},{"definition":"The act of bringing together the edges of tissue to be sutured."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˌpɹɑksɪˈmeɪʃn/"},{"text":"/əˌpɹɒksɪˈmeɪʃn/"}]},{"word":"SKIES","idx":11955,"count":3796788,"meanings":[{"definitions":[{"definition":"The atmosphere above a given point, especially as visible from the ground during the day.","example":"That year, a meteor fell from the sky."},{"definition":"The part of the sky which can be seen from a specific place or at a specific time; its condition, climate etc.","example":"I lay back under a warm Texas sky."},{"definition":"Heaven.","example":"This mortal has incurred the wrath of the skies."},{"definition":"(theoretical physics) The set of all lightlike lines (or directions) passing through a given point in space-time."},{"definition":"In an art gallery, the upper rows of pictures that cannot easily be seen."},{"definition":"A cloud."},{"definition":"A vibrant light blue colour, like that of the sky on a fine day."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit, kick or throw (a ball) extremely high."},{"definition":"To clear (a hurdle, high jump bar, etc.) by a large margin."},{"definition":"To hang (a picture on exhibition) near the top of a wall, where it cannot be well seen."},{"definition":"To drink something from a container without one's lips touching the container."},{"definition":"To move on skis"},{"definition":"To travel over (a slope etc.) on skis; to travel on skis at (a place), (especially as a sport)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"skies-1-us","text":"/skaɪz/"}]},{"word":"BURNERS","idx":11958,"count":3795089,"meanings":[{"definitions":[{"definition":"A participant in the Burning Man festival."},{"definition":"Someone or something which burns."},{"definition":"An element on a kitchen stove that generates localized heat for cooking."},{"definition":"A device that generates localized heat for experiments; a Bunsen burner."},{"definition":"A device that burns fuel; e.g. a diesel engine; a hot-air balloon's propulsion system."},{"definition":"A device for burning refuse; an incinerator."},{"definition":"A device that allows data or music to be stored on a CDR or CD-ROM."},{"definition":"Short for burner phone; a mobile phone used for only a short time and then thrown away so that the owner cannot be traced."},{"definition":"An app that creates temporary phone numbers for a user."},{"definition":"An elaborate piece of graffiti."},{"definition":"A pyrotechnic tear gas canister."},{"definition":"A gun."}],"partOfSpeech":"n"}]},{"word":"KICKS","idx":11961,"count":3792491,"meanings":[{"definitions":[{"definition":"A hit or strike with the leg, foot or knee.","example":"A kick to the knee."},{"definition":"The action of swinging a foot or leg.","example":"The ballerina did a high kick and a leap."},{"definition":"Something that tickles the fancy; something fun or amusing.","example":"I finally saw the show. What a kick!"},{"definition":"The removal of a person from an online activity."},{"definition":"Any bucking motion of an object that lacks legs or feet.","example":"The car had a nasty kick the whole way."},{"definition":"Piquancy."},{"definition":"A stimulation provided by an intoxicating substance."},{"definition":"A pass played by kicking with the foot."},{"definition":"The distance traveled by kicking the ball.","example":"a long kick up the field."},{"definition":"A recoil of a gun."},{"definition":"Pocket."},{"definition":"An increase in speed in the final part of a running race."},{"definition":"One who kicks."},{"definition":"One who takes kicks."},{"definition":"The kicking strap."},{"definition":"An outboard motor."},{"definition":"An unexpected situation, detail or circumstance, often unpleasant.","example":"John wants to climb the wall, but the kicker is that it is thirty feet tall."},{"definition":"An enticement for investors, e.g. warranty added to the investment contract."},{"definition":"An unpaired card which is part of a pair, two pair, or three of a kind poker hand.","example":"Jill's hand was two pair, aces and sevens, with a king kicker."},{"definition":"Small text above a headline that indicates the topic of the story."},{"definition":"The last one or two paragraphs of a story."},{"definition":"A lighthearted or humorous item used to round off a news broadcast."},{"definition":"A device that periodically displaces a newspaper from the print production line, to aid in gathering the newspapers into fixed-size bundles."},{"definition":"A launch ramp."},{"definition":"The fermenting mass of fruit that is the basis of pruno, or \"prison wine\"."},{"definition":"A relaxed party."},{"definition":"A backlight positioned at an angle."},{"definition":"A particular type of Texan who is associated with country/western attire, attitudes and/or philosophy."},{"definition":"Pleasures, thrills."},{"definition":"Shoes."},{"definition":"An introduction; something that leads into the beginning of something.","example":"After the long lead-in, the climax of the story was a disappointment."},{"definition":"A region of data at the beginning of a compact disc, holding the table of contents."},{"definition":"A short phrase that begins the caption of a photograph."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike or hit with the foot or other extremity of the leg.","example":"Did you kick your brother?"},{"definition":"To make a sharp jerking movement of the leg, as to strike something.","example":"He enjoyed the simple pleasure of watching the kickline kick."},{"definition":"To direct to a particular place by a blow with the foot or leg.","example":"Kick the ball into the goal."},{"definition":"(with \"off\" or \"out\") To eject summarily."},{"definition":"To forcibly remove a participant from an online activity.","example":"He was kicked by ChanServ for flooding."},{"definition":"To overcome (a bothersome or difficult issue or obstacle); to free oneself of (a problem).","example":"I still smoke, but they keep telling me to kick the habit."},{"definition":"To move or push suddenly and violently.","example":"He was kicked sideways by the force of the blast."},{"definition":"(of a firearm) To recoil; to push by recoiling."},{"definition":"To attack (a piece) in order to force it to move."},{"definition":"To accelerate quickly with a few pedal strokes in an effort to break away from other riders.","example":"Contador kicks again to try to rid himself of Rasmussen."},{"definition":"To show opposition or resistance."},{"definition":"To work a press by impact of the foot on a treadle."},{"definition":"To die."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɪks/"}]},{"word":"DISAPPEARED","idx":11962,"count":3791611,"meanings":[{"definitions":[{"definition":"To vanish."},{"definition":"To make vanish; especially, to abduct and murder surreptitiously for political reasons."},{"definition":"To go away; to become lost."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(often of a political dissident) Caused to disappear."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disappeared-us","text":"/dɪsəˈpɪɹd/"}]},{"word":"CANOE","idx":11963,"count":3790795,"meanings":[{"definitions":[{"definition":"A small long and narrow boat, propelled by one or more people (depending on the size of canoe), using single-bladed paddles. The paddlers face in the direction of travel, in either a seated position, or kneeling on the bottom of the boat. Canoes are open on top, and pointed at both ends."},{"definition":"An oversize, usually older, luxury car."},{"definition":"Any of the deflectors positioned around a roulette wheel, shaped like upside-down boats."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride or paddle a canoe."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"canoe-us","text":"/kəˈnuː/"}]},{"word":"SOVEREIGN","idx":11965,"count":3790205,"meanings":[{"definitions":[{"definition":"A monarch; the ruler of a country."},{"definition":"One who is not a subject to a ruler or nation."},{"definition":"A gold coin of the United Kingdom, with a nominal value of one pound sterling but in practice used as a bullion coin."},{"definition":"A very large champagne bottle with the capacity of about 25 liters, equivalent to 33⅓ standard bottles."},{"definition":"Any butterfly of the tribe Nymphalini, or genus Basilarchia, as the ursula and the viceroy."},{"definition":"A large, garish ring; a sovereign ring."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rule over as a sovereign."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Exercising power of rule.","example":"sovereign nation"},{"definition":"Exceptional in quality.","example":"Her voice was her sovereign talent."},{"definition":"Extremely potent or effective (of a medicine, remedy etc.)."},{"definition":"Having supreme, ultimate power."},{"definition":"Princely; royal."},{"definition":"Predominant; greatest; utmost; paramount."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sovereign-us","text":"/ˈsɑv(ə)ɹɪn/"}]},{"word":"REMINDS","idx":11966,"count":3789917,"meanings":[{"definitions":[{"definition":"To cause one to experience a memory (of someone or something); to bring to the notice or consideration (of a person)."}],"partOfSpeech":"ve"}]},{"word":"ORGANISM","idx":11967,"count":3789385,"meanings":[{"definitions":[{"definition":"A discrete and complete living thing, such as animal, plant, fungus or microorganism."},{"definition":"(by extension) Any complex thing with properties normally associated with living things."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"organism-us","text":"/ˈɔɹ.ɡən.ɪ.zəm/"}]},{"word":"CORRUPT","idx":11968,"count":3788784,"meanings":[{"definitions":[{"definition":"To make corrupt; to change from good to bad; to draw away from the right path; to deprave; to pervert."},{"definition":"To become putrid, tainted, or otherwise impure; to putrefy; to rot."},{"definition":"To debase or make impure by alterations or additions; to falsify.","example":"to corrupt a book"},{"definition":"To waste, spoil, or consume; to make worthless."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In a depraved state; debased; perverted; morally degenerate; weak in morals.","example":"The government here is corrupt, so we'll emigrate to escape them."},{"definition":"Abounding in errors; not genuine or correct; in an invalid state.","example":"It turned out that the program was corrupt - that's why it wouldn't open."},{"definition":"In a putrid state; spoiled; tainted; vitiated; unsound."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"corrupt-us","text":"/kəˈɹʌpt/"}]},{"word":"VIOLATED","idx":11969,"count":3786834,"meanings":[{"definitions":[{"definition":"To break or disregard (a rule or convention).","example":"Accessing unauthorized files violates security protocol."},{"definition":"To rape."},{"definition":"To cite (a person) for a parole violation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a rule or law) Having been broken or ignored, especially in a flagrant manner."},{"definition":"(by extension) Abused, harmed or sexually victimized."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈvaɪəˌleɪtɪd/"}]},{"word":"CORRESPONDENT","idx":11970,"count":3786622,"meanings":[{"definitions":[{"definition":"Someone who or something which corresponds."},{"definition":"Someone who communicates with another person, or a publication, by writing."},{"definition":"A journalist who sends reports back to a newspaper or radio or television station from a distant or overseas location."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Corresponding; suitable; adapted; congruous."},{"definition":"(with to or with) Conforming; obedient."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"correspondent-us","text":"/ˌkɔɹɪˈspɑndənt/"}]},{"word":"DROUGHT","idx":11971,"count":3786273,"meanings":[{"definitions":[{"definition":"A period of unusually low rainfall, longer and more severe than a dry spell."},{"definition":"(by extension) A longer than expected term without success, particularly in sport."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"drought-uk","text":"/dɹaʊt/"}]},{"word":"BAKE","idx":11972,"count":3785783,"meanings":[{"definitions":[{"definition":"The act of cooking food by baking."},{"definition":"Any of various baked dishes resembling casserole."},{"definition":"A social event at which food (such as seafood) is baked, or at which baked food is served."},{"definition":"(Barbadian, sometimes US and UK) A small, flat (or ball-shaped) cake of dough eaten in Barbados and sometimes elsewhere, similar in appearance and ingredients to a pancake but fried (or in some places sometimes roasted)."},{"definition":"Any item that is baked."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(with person as subject) To cook (something) in an oven.","example":"I baked a delicious cherry pie."},{"definition":"(with baked thing as subject) To be cooked in an oven.","example":"The cake baked at 350°F."},{"definition":"To be warmed to drying and hardening.","example":"The clay baked in the sun."},{"definition":"To dry by heat.","example":"They baked the electrical parts lightly to remove moisture."},{"definition":"To be hot.","example":"I'm baking after that workout in the gym."},{"definition":"To cause to be hot."},{"definition":"To smoke marijuana."},{"definition":"To harden by cold."},{"definition":"To fix (lighting, reflections, etc.) as part of the texture of an object to improve rendering performance."},{"definition":"(with \"in\" or \"into\") To incorporate into something greater."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bake-us","text":"/beɪk/"}]},{"word":"HURRICANES","idx":11973,"count":3785008,"meanings":[{"definitions":[{"definition":"A severe tropical cyclone in the North Atlantic Ocean, Caribbean Sea, Gulf of Mexico, or in the eastern North Pacific off the west coast of Mexico, with winds of 119 km/h (74 miles per hour) or greater accompanied by rain, lightning, and thunder that sometimes moves into temperate latitudes."},{"definition":"A wind scale for quite strong wind, stronger than a storm"},{"definition":"(aerial freestyle skiing) \"full—triple-full—full\" – an acrobatic maneuver consisting of three flips and five twists, with one twist on the first flip, three twists on the second flip, one twist on the third flip"}],"partOfSpeech":"n"}]},{"word":"SYMPTOM","idx":11975,"count":3784339,"meanings":[{"definitions":[{"definition":"A perceived change in some function, sensation or appearance of a person that indicates a disease or disorder, such as fever, headache or rash."},{"definition":"A signal; anything that indicates, or is characteristic of, the presence of something else, especially of something undesirable."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɪm(p)təm/"}]},{"word":"LAUGHTER","idx":11976,"count":3783649,"meanings":[{"definitions":[{"definition":"The sound of laughing, produced by air so expelled; any similar sound.","example":"Their loud laughter betrayed their presence."},{"definition":"A movement (usually involuntary) of the muscles of the laughing face, particularly of the lips, and of the whole body, with a peculiar expression of the eyes, indicating merriment, satisfaction or derision, and usually attended by a sonorous and interrupted expulsion of air from the lungs."},{"definition":"A reason for merriment."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"laughter-us","text":"/ˈlæftɚ/"}]},{"word":"FORECLOSURES","idx":11977,"count":3783227,"meanings":[{"definitions":[{"definition":"The proceeding, by a creditor, to regain property or other collateral following a default on mortgage payments"},{"definition":"The absence of a symbolic father for a fatherless child, as a cause for psychosis."}],"partOfSpeech":"n"}]},{"word":"PROPAGATION","idx":11978,"count":3783126,"meanings":[{"definitions":[{"definition":"The multiplication or natural increase in a population"},{"definition":"The dissemination of something to a larger area or greater number"},{"definition":"The act of propagating, especially the movement of a wave"},{"definition":"The elongation part of transcription"},{"definition":"Winning new converts"},{"definition":"Some degree of success in the spread of propaganda"}],"partOfSpeech":"n"}]},{"word":"AUDITS","idx":11979,"count":3782927,"meanings":[{"definitions":[{"definition":"A judicial examination."},{"definition":"An examination in general."},{"definition":"An independent review and examination of records and activities to assess the adequacy of system controls, to ensure compliance with established policies and operational procedures, and to recommend necessary changes in controls, policies, or procedures","example":"National Assembly audit"},{"definition":"The result of such an examination, or an account as adjusted by auditors; final account."},{"definition":"Spiritual counseling, which forms the core of Dianetics."},{"definition":"A general receptacle or receiver."},{"definition":"An audience; a hearing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To examine and adjust (e.g. an account).","example":"to audit the accounts of a treasure, or of parties who have a suit depending in court"},{"definition":"To conduct an independent review and examination of system records and activities in order to test the adequacy and effectiveness of data security and data integrity procedures, to ensure compliance with established policy and operational procedures, and to recommend any necessary changes"},{"definition":"To counsel spiritually."},{"definition":"To attend an academic class on a not-for-academic-credit basis."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɔː.dɪts/"}]},{"word":"IGNORANCE","idx":11980,"count":3782654,"meanings":[{"definitions":[{"definition":"The condition of being uninformed or uneducated. Lack of knowledge or information."},{"definition":"(in the plural) Sins committed through ignorance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ignorance-us","text":"/ˈɪɡnəɹəns/"}]},{"word":"PESTICIDES","idx":11981,"count":3782034,"meanings":[{"definitions":[{"definition":"Anything, especially a synthetic substance but also any substance (e.g. sulfur), or virus, bacterium, or other organism, which kills or suppresses the activities of pests."}],"partOfSpeech":"n"}]},{"word":"EXPLOSIVE","idx":11982,"count":3781976,"meanings":[{"definitions":[{"definition":"Any explosive substance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"With the capability to, or likely to, explode.","example":"an explosive device"},{"definition":"Having the character of an explosion.","example":"an explosive fire"},{"definition":"Shocking; startling.","example":"an explosive accusation"},{"definition":"Easily driven to anger, usually with reference to a person.","example":"He has an explosive personality."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"explosive-au"}]},{"word":"INVENTOR","idx":11983,"count":3780161,"meanings":[{"definitions":[{"definition":"One who invents, either as a hobby or as an occupation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈvɛntɚ/"},{"text":"/ɪnˈvɛntə/"}]},{"word":"SCALING","idx":11984,"count":3780114,"meanings":[{"definitions":[{"definition":"To change the size of something whilst maintaining proportion; especially to change a process in order to produce much larger amounts of the final product.","example":"We should scale that up by a factor of 10."},{"definition":"To climb to the top of.","example":"Hilary and Norgay were the first known to have scaled Everest."},{"definition":"To tolerate significant increases in throughput or other potentially limiting factors.","example":"That architecture won't scale to real-world environments."},{"definition":"To weigh, measure or grade according to a scale or system."},{"definition":"To remove the scales of.","example":"Please scale that fish for dinner."},{"definition":"To become scaly; to produce or develop scales.","example":"The dry weather is making my skin scale."},{"definition":"To strip or clear of scale; to descale.","example":"to scale the inside of a boiler"},{"definition":"To take off in thin layers or scales, as tartar from the teeth; to pare off, as a surface."},{"definition":"To separate and come off in thin layers or laminae.","example":"Some sandstone scales by exposure."},{"definition":"To scatter; to spread."},{"definition":"To clean, as the inside of a cannon, by the explosion of a small quantity of powder."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The removing of the scales of fish."},{"definition":"The formation of a layer of scale on a surface."},{"definition":"The removal of a layer of scale from a surface."},{"definition":"The measurement of dimensions using a scale."},{"definition":"The process of adjusting raw measurement data to fit an expected distribution, such fitting examination results to a normal distribution."},{"definition":"The expression of the terms of an equation using powers of nondimensional quantities."},{"definition":"The process of adjusting sights to a ship's guns."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈskeɪlɪŋ/"}]},{"word":"JUICY","idx":11985,"count":3778910,"meanings":[{"definitions":[{"definition":"Having lots of juice.","example":"a juicy peach"},{"definition":"(of a story, etc.) Exciting; titillating.","example":"I do not keep up with all the latest juicy rumors."},{"definition":"(of a blow, strike, etc.) Strong, painful."},{"definition":"Voluptuous, curvy, thick."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"juicy-us","text":"/ˈdʒusi/"}]},{"word":"FAVE","idx":11986,"count":3778307,"meanings":[{"definitions":[{"definition":"Favorite (US) or favourite (UK)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Favorite (US) or favourite (UK)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Favorite (US) or favourite (UK)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/feɪv/"}]},{"word":"RESIDUES","idx":11987,"count":3777772,"meanings":[{"definitions":[{"definition":"Whatever remains after something else has been removed."},{"definition":"The substance that remains after evaporation, distillation, filtration or any similar process."},{"definition":"A molecule that is released from a polymer after bonds between neighbouring monomers are broken, such as an amino acid in a polypeptide chain."},{"definition":"Whatever property or effects are left in an estate after payment of all debts, other charges and deduction of what is specifically bequeathed by the testator."},{"definition":"A form of complex number, proportional to the contour integral of a meromorphic function along a path enclosing one of its singularities."}],"partOfSpeech":"n"}]},{"word":"MOODY","idx":11989,"count":3776452,"meanings":[{"definitions":[{"definition":"Given to sudden or frequent changes of mind; temperamental."},{"definition":"Sulky or depressed."},{"definition":"Dour, gloomy or brooding."},{"definition":"Dodgy or stolen."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"moody-au","text":"/ˈmuːdi/"}]},{"word":"FASHIONED","idx":11991,"count":3776151,"meanings":[{"definitions":[{"definition":"To make, build or construct, especially in a crude or improvised way."},{"definition":"To make in a standard manner; to work."},{"definition":"To fit, adapt, or accommodate to."},{"definition":"To forge or counterfeit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in combination) Having a specified fashion or style"},{"definition":"In style; fashionable."},{"definition":"Well designed or put together."}],"partOfSpeech":"j"}]},{"word":"GRAINS","idx":11992,"count":3772543,"meanings":[{"definitions":[{"definition":"Pigeons' dung used in tanning. See grainer."},{"definition":"The harvested seeds of various grass food crops eg: wheat, corn, barley.","example":"We stored a thousand tons of grain for the winter."},{"definition":"Similar seeds from any food crop, e.g., buckwheat, amaranth, quinoa."},{"definition":"A single seed of grass food crops.","example":"a grain of wheat"},{"definition":"The crops from which grain is harvested.","example":"The fields were planted with grain."},{"definition":"A linear texture of a material or surface.","example":"Cut along the grain of the wood."},{"definition":"A single particle of a substance.","example":"a grain of salt"},{"definition":"A very small unit of weight, in England equal to 1/480 of an ounce troy, 0.0648 grams or, to be more exact, 64.79891 milligrams (0.002285714 avoirdupois ounce). A carat grain or pearl grain is 1/4 carat or 50 milligrams. The old French grain was 1/9216 livre or 53.11 milligrams, and in the mesures usuelles permitted from 1812 to 1839, with the livre redefined as 500 grams, it was 54.25 milligrams."},{"definition":"A former unit of gold purity, also known as carat grain, equal to 1/4 \"carat\" (karat)."},{"definition":"(materials) A region within a material having a single crystal structure or direction."},{"definition":"A reddish dye made from the coccus insect, or kermes; hence, a red color of any tint or hue, as crimson, scarlet, etc.; sometimes used by the poets as equivalent to Tyrian purple."},{"definition":"The hair side of a piece of leather, or the marking on that side."},{"definition":"(in the plural) The remains of grain, etc., after brewing or distillation; hence, any residuum. Also called draff."},{"definition":"A rounded prominence on the back of a sepal, as in the common dock."},{"definition":"Temper; natural disposition; inclination."},{"definition":"(videography) Visual texture in processed photographic film due to the presence of small particles of a metallic silver, or dye clouds, developed from silver halide that have received enough photons."},{"definition":"A branch of a tree; a stalk or stem of a plant."},{"definition":"A tine, prong, or fork."},{"definition":"(founding) A thin piece of metal, used in a mould to steady a core."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To feed grain to."},{"definition":"To make granular; to form into grains."},{"definition":"To form grains, or to assume a granular form, as the result of crystallization; to granulate."},{"definition":"To texture a surface in imitation of the grain of a substance such as wood."},{"definition":"(tanning) To remove the hair or fat from a skin."},{"definition":"(tanning) To soften leather."},{"definition":"To yield fruit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"grains-us","text":"/ɡɹeɪnz/"}]},{"word":"VICINITY","idx":11993,"count":3772417,"meanings":[{"definitions":[{"definition":"Proximity; the state of being near.","example":"There was a crackling sound in the vicinity of my right ear."},{"definition":"Neighbourhood; nearby region; surrounding area.","example":"There is a hurricane in the vicinity of the Bahamas."},{"definition":"Approximate size or amount.","example":"I weigh in the vicinity of 80kg."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/vəˈsɪnəti/"}]},{"word":"THYROID","idx":11994,"count":3772023,"meanings":[{"definitions":[{"definition":"The thyroid gland."},{"definition":"The thyroid cartilage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or being the thyroid gland."},{"definition":"Of, relating to, or being the chief cartilage of the larynx.","example":"thyroid cartilage"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈθaɪ̯ɹɔɪ̯d/"}]},{"word":"PURIFICATION","idx":11995,"count":3769668,"meanings":[{"definitions":[{"definition":"The act or process of purifying; the removal of impurities."},{"definition":"A religious act or rite in which a defiled person is made clean or free from sin."},{"definition":"The pouring of wine into the chalice to rinse it after communion, the wine being then drunk by the priest."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"purification-uk","text":"/ˌpjʊəɹɪfɪˈkeɪʃən/"}]},{"word":"HEAL","idx":11996,"count":3769650,"meanings":[{"definitions":[{"definition":"A spell or ability that restores hit points or removes a status ailment."},{"definition":"Health"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make better from a disease, wound, etc.; to revive or cure.","example":"This bandage will heal your cut."},{"definition":"To become better or healthy again.","example":"Bandages allow cuts to heal."},{"definition":"To reconcile, as a breach or difference; to make whole; to free from guilt.","example":"to heal dissensions"},{"definition":"To make better from a disease, wound, etc.; to revive or cure.","example":"This bandage will heal your cut."},{"definition":"To become better or healthy again.","example":"Bandages allow cuts to heal."},{"definition":"To reconcile, as a breach or difference; to make whole; to free from guilt.","example":"to heal dissensions"},{"definition":"To hide, conceal, and keep secret, especially for a secret society (such as the masons)."},{"definition":"(now especially in the phrase \"hele in\") To cover or conceal (a seedling, plant, roots, etc)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"heal-us","text":"/hiːl/"}]},{"word":"SOUTHEASTERN","idx":11998,"count":3769283,"meanings":[{"definitions":[{"definition":"Of or pertaining to the southeast.","example":"The southeastern part of the country is the most affluent."}],"partOfSpeech":"j"}]},{"word":"WIZARDS","idx":11999,"count":3769098,"meanings":[{"definitions":[{"definition":"Someone, usually male, who uses (or has skill with) magic, mystic items, and magical and mystical practices."},{"definition":"One who is especially skilled or unusually talented in a particular field.","example":"He was a financial wizard, capable of predicting the movements of the stock markets."},{"definition":"A computer program or script used to simplify complex operations, often for an inexperienced user.","example":"Use the \"Add Network Connection\" wizard to connect to a network in a series of simple steps."},{"definition":"One of the administrators of a multi-user dungeon."},{"definition":"A wise man; a sage."},{"definition":"An adult virgin over the age of 30."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To practice wizardry."},{"definition":"To conjure."}],"partOfSpeech":"ve"}]},{"word":"HOROSCOPE","idx":12000,"count":3768650,"meanings":[{"definitions":[{"definition":"The position of the planets and stars at the moment of someone's birth; a diagram of such positions."},{"definition":"An astrological forecast of a person's future based on such information."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɔ.ɹəˌskoʊp/"},{"text":"/ˈhɒ.ɹə.skəʊp/"}]},{"word":"INVASIVE","idx":12001,"count":3768581,"meanings":[{"definitions":[{"definition":"An invasive organism, as, a plant or animal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That invades a foreign country using military force."},{"definition":"Relating to military aggression generally."},{"definition":"(of a plant or animal) That grows in environments which do not harbor natural enemies, often to the detriment of native species or of food or garden flora and fauna.","example":"an invasive species"},{"definition":"(of a carcinoma etc) That invades healthy tissue; (of a procedure) in which part of the body is entered"},{"definition":"Intrusive on one's privacy."},{"definition":"Coming from outside; originating externally."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"invasive-uk","text":"/ɪnˈveɪsɪv/"}]},{"word":"PROSPERITY","idx":12002,"count":3768263,"meanings":[{"definitions":[{"definition":"The condition of being prosperous, of having good fortune"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"prosperity-us","text":"/pɹɑˈspɛɹ.ɪ.ti/"}]},{"word":"RAINFALL","idx":12003,"count":3767281,"meanings":[{"definitions":[{"definition":"The amount of rain that falls on a single occasion"},{"definition":"The occurrence of liquid precipitation, the fall of rain."}],"partOfSpeech":"n"}]},{"word":"HARDBACK","idx":12005,"count":3764986,"meanings":[{"definitions":[{"definition":"A book with a solid binding."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a book) Having a solid binding."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hardback-us"}]},{"word":"MUM","idx":12006,"count":3764100,"meanings":[{"definitions":[{"definition":"Mother."},{"definition":"Ma'am; a term of respect for an older woman."},{"definition":"A chrysanthemum."},{"definition":"Silence"},{"definition":"A sort of strong beer, originally made in Brunswick, Germany."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act in a pantomime or dumb show."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Silent."},{"definition":"Secret."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Stop speaking!, stop talking!, hush!"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"mum-us","text":"/mʌm/"},{"audio":"mum-au","text":"/mʌm/"}]},{"word":"LAUNCHING","idx":12007,"count":3764017,"meanings":[{"definitions":[{"definition":"To throw (a projectile such as a lance, dart or ball); to hurl; to propel with force."},{"definition":"To pierce with, or as with, a lance."},{"definition":"To cause (a vessel) to move or slide from the land or a larger vessel into the water; to set afloat.","example":"The navy launched another ship."},{"definition":"To cause (a rocket, balloon, etc., or the payload thereof) to begin its flight upward from the ground.","example":"NASA launched several unmanned rockets before launching any of the Mercury astronauts."},{"definition":"To send out; to start (someone) on a mission or project; to give a start to (something); to put in operation","example":"Our business launched a new project."},{"definition":"To start (a program or feature); to execute or bring into operation.","example":"Double-click an icon to launch the associated application."},{"definition":"To release; to put onto the market for sale"},{"definition":"Of a ship, rocket, balloon, etc.: to depart on a voyage; to take off."},{"definition":"(often with out) To move with force and swiftness like a sliding from the stocks into the water; to plunge; to begin.","example":"to launch into an argument or discussion"},{"definition":"(of a program) To start to operate.","example":"After clicking the icon, the application will launch."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is launched; a launch.","example":"The launching of the Titanic."}],"partOfSpeech":"n"}]},{"word":"PEDAL","idx":12010,"count":3763705,"meanings":[{"definitions":[{"definition":"A lever operated by one's foot that is used to control or power a machine or mechanism, such as a bicycle or piano","example":"A piano usually has two or three pedals."},{"definition":"A foot or footlike part."},{"definition":"An effects unit, especially one designed to be activated by being stepped on."},{"definition":"(equestrian) A stirrup."},{"definition":"The ranks of pipes played from the pedal-board of an organ.","example":"A small organ commonly has only one or two ranks on the pedal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To operate a pedal attached to a wheel in a continuous circular motion.","example":"to pedal one's loom"},{"definition":"To operate a bicycle.","example":"He was out of breath from pedalling up the steep hill."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to the foot."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pedal-uk"}]},{"word":"INCONSISTENT","idx":12011,"count":3763083,"meanings":[{"definitions":[{"definition":"Not consistent:"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɪnkənˈsɪstənt/"}]},{"word":"PLANTATION","idx":12012,"count":3762904,"meanings":[{"definitions":[{"definition":"A large farm; estate or area of land designated for agricultural growth. Often includes housing for the owner and workers."},{"definition":"An area where trees are planted for commercial purposes."},{"definition":"The importation of large numbers of workers and soldiers to displace the local population, such as in medieval Ireland and in the Americas; colonization."},{"definition":"A colony established thus."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"plantation-us","text":"/plænˈteɪʃən/"}]},{"word":"STORING","idx":12013,"count":3762383,"meanings":[{"definitions":[{"definition":"To keep (something) while not in use, generally in a place meant for that purpose.","example":"I'll store these books in the attic."},{"definition":"To write (something) into memory or registers.","example":"This operation stores the result on the stack."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An amount stored."}],"partOfSpeech":"n"}]},{"word":"TOTE","idx":12015,"count":3761953,"meanings":[{"definitions":[{"definition":"A tote bag."},{"definition":"A heavy burden."},{"definition":"(logistics) A kind of plastic box used for transporting goods."},{"definition":"A pari-mutuel machine; a totalizator."},{"definition":"Pari-mutuel betting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To carry or bear.","example":"to tote a child over a stream"},{"definition":"To add up; to calculate a total."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/toʊt/"},{"text":"/təʊt/"}]},{"word":"JUMPED","idx":12016,"count":3761906,"meanings":[{"definitions":[{"definition":"To propel oneself rapidly upward, downward and/or in any horizontal direction such that momentum causes the body to become airborne.","example":"Kangaroos are known for their ability to jump high."},{"definition":"To cause oneself to leave an elevated location and fall downward.","example":"She is going to jump from the diving board."},{"definition":"To pass by a spring or leap; to overleap.","example":"to jump a stream"},{"definition":"To employ a parachute to leave an aircraft or elevated location."},{"definition":"To react to a sudden, often unexpected, stimulus (such as a sharp prick or a loud sound) by jerking the body violently.","example":"The sudden sharp sound made me jump."},{"definition":"To increase sharply, to rise, to shoot up.","example":"Share prices jumped by 10% after the company announced record profits."},{"definition":"To employ a move in certain board games where one game piece is moved from one legal position to another passing over the position of another piece.","example":"The player's knight jumped the opponent's bishop."},{"definition":"To move to a position (in a queue/line) that is further forward.","example":"I hate it when people jump the queue."},{"definition":"To attack suddenly and violently.","example":"The hoodlum jumped a woman in the alley."},{"definition":"To engage in sexual intercourse with (a person)."},{"definition":"To cause to jump.","example":"The rider jumped the horse over the fence."},{"definition":"To move the distance between two opposing subjects."},{"definition":"To increase the height of a tower crane by inserting a section at the base of the tower and jacking up everything above it."},{"definition":"To increase speed aggressively and without warning."},{"definition":"To expose to danger; to risk; to hazard."},{"definition":"(smithwork) To join by a buttweld."},{"definition":"To thicken or enlarge by endwise blows; to upset."},{"definition":"(quarrying) To bore with a jumper."},{"definition":"To coincide; to agree; to accord; to tally; followed by with."},{"definition":"To start executing code from a different location, rather than following the program counter."},{"definition":"To flee; to make one's escape."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jumped-us","text":"/dʒʌmpt/"}]},{"word":"SEEMINGLY","idx":12017,"count":3761438,"meanings":[{"definitions":[{"definition":"As it appears; apparently."},{"definition":"In a seemly manner; decorously; with propriety."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"seemingly-us","text":"/ˈsiːmɪŋli/"}]},{"word":"TUNED","idx":12018,"count":3761208,"meanings":[{"definitions":[{"definition":"To adjust (a musical instrument) so that it produces the correct pitches.","example":"to tune a piano or a violin"},{"definition":"To adjust or modify (esp. a mechanical or electrical device) so that it functions optimally.","example":"Tune your mind, and anything becomes possible."},{"definition":"To adjust the frequency on a radio or TV set, so as to receive the desired channel.","example":"Tune to Channel 6 for all your favourite daytime shows."},{"definition":"(e.g. of senses or faculties) To adapt to or direct towards a particular target.","example":"My ears were tuned to the sounds of the forest."},{"definition":"To make more precise, intense, or effective; to put into a proper state or disposition."},{"definition":"To attune; to adapt in style of music; to make harmonious."},{"definition":"To give a certain tone or character to."},{"definition":"To sing with melody or harmony."},{"definition":"To cheek; to be impudent towards.","example":"Are you tuning me?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Adjusted in pitch or resonance.","example":"The tuned wind chimes sounded almost like they were playing a melody."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/tjuːnd/"}]},{"word":"PASSIONATE","idx":12020,"count":3759453,"meanings":[{"definitions":[{"definition":"A passionate individual."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fill with passion, or with another given emotion."},{"definition":"To express with great emotion."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Given to strong feeling, sometimes romantic, sexual, or both."},{"definition":"Fired with intense feeling."},{"definition":"Suffering; sorrowful."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"passionate-us","text":"/ˈpæʃənət/"}]},{"word":"STAPLES","idx":12022,"count":3759213,"meanings":[{"definitions":[{"definition":"A town containing merchants who have exclusive right, under royal authority, to purchase or produce certain goods for export; also, the body of such merchants seen as a group."},{"definition":"(by extension) Place of supply; source."},{"definition":"The principal commodity produced in a town or region."},{"definition":"A basic or essential supply.","example":"Rice is a staple in the diet of many cultures."},{"definition":"A recurring topic or character."},{"definition":"Short fiber, as of cotton, sheep’s wool, or the like, which can be spun into yarn or thread."},{"definition":"Unmanufactured material; raw material."},{"definition":"A wire fastener used to secure stacks of paper by penetrating all the sheets and curling around."},{"definition":"A wire fastener used to secure something else by penetrating and curling.","example":"Can you believe they use staples to hold cars together these days?"},{"definition":"A U-shaped metal fastener, used to attach fence wire or other material to posts or structures.","example":"The rancher used staples to attach the barbed wire to the fence-posts."},{"definition":"One of a set of U-shaped metal rods hammered into a structure, such as a piling or wharf, which serve as a ladder.","example":"Fortunately, there were staples in the quay wall, and she was able to climb out of the water."},{"definition":"A shaft, smaller and shorter than the principal one, joining different levels."},{"definition":"A small pit."},{"definition":"A district granted to an abbey."},{"definition":"A post; prop; support"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sort according to its staple.","example":"to staple cotton"},{"definition":"To secure with a staple."}],"partOfSpeech":"ve"}]},{"word":"BACKWARD","idx":12025,"count":3758544,"meanings":[{"definitions":[{"definition":"The state behind or past."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of motion) In the direction towards the back.","example":"They left without a backward glance."},{"definition":"(of motion) In the direction reverse of normal.","example":"The occasional backward movement of planets is evidence they revolve around the sun."},{"definition":"Reluctant or unable to advance."},{"definition":"Of a culture: undeveloped or unsophisticated."},{"definition":"Outdated."},{"definition":"On that part of the field behind the batsman's popping crease."},{"definition":"Further behind the batsman's popping crease than something else."},{"definition":"Unwilling; averse; reluctant."},{"definition":"Slow to apprehend; having difficulties in learning.","example":"a backward child"},{"definition":"Late or behindhand.","example":"a backward season"},{"definition":"Already past or gone; bygone."}],"partOfSpeech":"j"},{"definitions":[{"definition":"(of motion) In the direction towards the back; backwards","example":"to throw the arms backward"},{"definition":"Toward, or in, past time or events; ago."},{"definition":"By way of reflection; reflexively."},{"definition":"From a better to a worse state, as from honor to shame, from religion to sin."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈbækwɚd/"},{"text":"/ˈbæk.wə(ɹ)d/"},{"audio":"backward-au"}]},{"word":"SOUR","idx":12026,"count":3757799,"meanings":[{"definitions":[{"definition":"The sensation of a sour taste."},{"definition":"A drink made with whiskey, lemon or lime juice and sugar."},{"definition":"(by extension) Any cocktail containing lemon or lime juice."},{"definition":"A sour or acid substance; whatever produces a painful effect."},{"definition":"The acidic solution used in souring fabric."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make sour.","example":"Too much lemon juice will sour the recipe."},{"definition":"To become sour."},{"definition":"To spoil or mar; to make disenchanted."},{"definition":"To become disenchanted.","example":"We broke up after our relationship soured."},{"definition":"To make (soil) cold and unproductive."},{"definition":"To macerate (lime) and render it fit for plaster or mortar."},{"definition":"To process (fabric) after bleaching, using hydrochloric acid or sulphuric acid to wash out the lime."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having an acidic, sharp or tangy taste.","example":"Lemons have a sour taste."},{"definition":"Made rancid by fermentation, etc.","example":"Don't drink that milk; it's turned sour."},{"definition":"Tasting or smelling rancid.","example":"His sour breath makes it unpleasing to talk to him."},{"definition":"(of a person's character) Peevish or bad-tempered.","example":"He gave me a sour look."},{"definition":"(of soil) Excessively acidic and thus infertile.","example":"a sour marsh"},{"definition":"(of petroleum) Containing excess sulfur.","example":"sour gas smells like rotten eggs"},{"definition":"Unfortunate or unfavorable."},{"definition":"Off-pitch, out of tune."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sour-us","text":"/ˈsaʊ(ə)ɹ/"}]},{"word":"RENAME","idx":12028,"count":3757535,"meanings":[{"definitions":[{"definition":"An instance of renaming."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a new name to."}],"partOfSpeech":"ve"}]},{"word":"MARKUP","idx":12030,"count":3757429,"meanings":[{"definitions":[{"definition":"The notation that is used to indicate the meaning of the elements in an electronic document, or to dictate how text should be displayed."},{"definition":"The percentage or amount by which a seller hikes up his buy-in price when determining his selling price.","example":"You don’t make much money selling gas because the markup is so low."},{"definition":"An increase in price.","example":"There will be a markup on those products next week; better buy them now."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"markup-us"},{"text":"/ˈmɑː(ɹ)k.ʌp/"}]},{"word":"COMBUSTION","idx":12031,"count":3757231,"meanings":[{"definitions":[{"definition":"The act or process of burning."},{"definition":"A process where two chemicals are combined to produce heat."},{"definition":"A process wherein a fuel is combined with oxygen, usually at high temperature, releasing heat."},{"definition":"Violent agitation, tumult."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"combustion-us","text":"/kəmˈbʌs.tʃən/"}]},{"word":"BREAKTHROUGH","idx":12032,"count":3757116,"meanings":[{"definitions":[{"definition":"An advance through and past enemy lines."},{"definition":"Any major progress; such as a great innovation or discovery that overcomes a significant obstacle.","example":"Albert Einstein is credited with making some of the greatest breakthroughs in modern physics."},{"definition":"The penetration of the opposition defence"},{"definition":"The penetration of a separating wall or the remaining distance to an adjacent hollow (a crosscut in mining) or between two parts of a tunnel build from both ends; knockthrough."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Characterized by major progress or overcoming some obstacle.","example":"a breakthrough technological advance"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"breakthrough-us","text":"/ˈbɹeɪkθɹuː/"}]},{"word":"SCRAP","idx":12033,"count":3757085,"meanings":[{"definitions":[{"definition":"A (small) piece; a fragment; a detached, incomplete portion.","example":"I found a scrap of cloth to patch the hole."},{"definition":"(usually in the plural) Leftover food.","example":"Give the scraps to the dogs and watch them fight."},{"definition":"The crisp substance that remains after drying out animal fat.","example":"pork scraps"},{"definition":"Discarded objects (especially metal) that may be dismantled to recover their constituent materials, junk.","example":"That car isn't good for anything but scrap."},{"definition":"(in the plural) A piece of deep-fried batter left over from frying fish, sometimes sold with chips."},{"definition":"A Hispanic criminal, especially a Mexican or one affiliated with the Norte gang."},{"definition":"A snare for catching birds."},{"definition":"A fight, tussle, skirmish.","example":"We got in a little scrap over who should pay the bill."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To discard."},{"definition":"(of a project or plan) To stop working on indefinitely."},{"definition":"To scrapbook; to create scrapbooks."},{"definition":"To dispose of at a scrapyard."},{"definition":"To make into scrap."},{"definition":"To fight"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scrap-us","text":"/skɹæp/"}]},{"word":"ADMINISTER","idx":12035,"count":3754648,"meanings":[{"definitions":[{"definition":"To cause to ingest (a drug), either by openly offering or through deceit.","example":"We administered the medicine to our dog by mixing it in his food."},{"definition":"To apportion out, distribute."},{"definition":"To manage or supervise the conduct, performance or execution of; to govern or regulate the parameters for the conduct, performance or execution of; to work in an administrative capacity."},{"definition":"To minister (to).","example":"administering to the sick"},{"definition":"To settle, as the estate of one who dies without a will, or whose will fails of an executor."},{"definition":"To give, as an oath."},{"definition":"To give a drug to a patient, be it orally or by any other means."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"administer-us","text":"/ədˈmɪnɪstɚ/"}]},{"word":"BILATERAL","idx":12036,"count":3754545,"meanings":[{"definitions":[{"definition":"A meeting between two people or groups."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having two sides."},{"definition":"Involving both sides equally."},{"definition":"(of an agreement) Binding on both of the two parties involved."},{"definition":"Having bilateral symmetry."},{"definition":"Involving descent or ascent regardless of sex and side of the family."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/baɪˈlætəɹəl/"}]},{"word":"BLONDES","idx":12038,"count":3753451,"meanings":[{"definitions":[{"definition":"A pale yellowish (golden brown) color, especially said of hair color."},{"definition":"A person with this hair color."}],"partOfSpeech":"n"}]},{"word":"BENEFICIARIES","idx":12039,"count":3753008,"meanings":[{"definitions":[{"definition":"One who benefits or receives an advantage.","example":"You are the lucky beneficiary of this special offer."},{"definition":"One who benefits from the distribution, especially of an estate.","example":"If any beneficiary does not survive the Settlor for a period of 30 days then the Trustee shall distribute that beneficiary’s share to the surviving beneficiaries by right of representation."},{"definition":"One who benefits from the payout of an insurance policy."}],"partOfSpeech":"n"}]},{"word":"DISPOSABLE","idx":12040,"count":3752005,"meanings":[{"definitions":[{"definition":"Any object that is designed to be disposed of rather than refilled or repaired."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That can be disposed of."},{"definition":"That is designed to be discarded rather than reused, refilled or repaired.","example":"Rather than purchase an expensive razor he bought a packet of cheap disposable ones."},{"definition":"Available to be used."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪsˈpoʊzəbl̩/"},{"text":"/dɪsˈpəʊzəbl̩/"}]},{"word":"SOCK","idx":12042,"count":3748769,"meanings":[{"definitions":[{"definition":"A knitted or woven covering for the foot."},{"definition":"A shoe worn by Greco-Roman comedy actors."},{"definition":"A color pattern (usually white) on a cat's or dog's lower leg that is different from the color pattern on the rest of the animal."},{"definition":"(WMF jargon) A sock puppet."},{"definition":"A gun sock."},{"definition":"A violent blow; a punch."},{"definition":"A ploughshare."},{"definition":"An opening into which a plug or other connecting part is designed to fit (e.g. a light bulb socket)."},{"definition":"A hollow into a bone which a part fits, such as an eye, or another bone, in the case of a joint."},{"definition":"One endpoint of a two-way communication link, used for interprocess communication across a network."},{"definition":"One endpoint of a two-way named pipe on Unix and Unix-like systems, used for interprocess communication."},{"definition":"A hollow tool for grasping and lifting tools dropped in a well-boring."},{"definition":"The hollow of a candlestick."},{"definition":"A steel apparatus attached to a saddle to protect the thighs and legs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit or strike violently; to deliver a blow to."},{"definition":"To throw."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Extremely successful."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sock-us","text":"/sɑk/"}]},{"word":"GENTLEMEN","idx":12043,"count":3748634,"meanings":[{"definitions":[{"definition":"A man of gentle but not noble birth, particularly a man of means (originally ownership of property) who does not work for a living but has no official status in a peerage; an armiferous man ranking below a knight.","example":"Being a gentleman, Robert was entitled to shove other commoners into the gongpit but he still had to jump out of the way of the knights to avoid the same fate himself."},{"definition":"Any well-bred, well-mannered, or charming man."},{"definition":"An effeminate or oversophisticated man.","example":"Well, la-di-da, aren't you just a proper gentleman?"},{"definition":"(polite term of address) Any man.","example":"Please escort this gentleman to the gentlemen's room."},{"definition":"(usually historical, sometimes derogatory) An amateur or dabbler in any field, particularly those of independent means."},{"definition":"An amateur player, particularly one whose wealth permits him to forego payment."},{"definition":"Possessive case of gentlemen: belonging to some or all gentlemen."},{"definition":"A lavatory intended for use by men, often including urinals in addition to toilets."},{"definition":"Other rooms intended for use by men, as waiting rooms, dressing rooms, locker rooms, etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gentlemen-us","text":"/ˈdʒɛɾ̃.əl.mən/"}]},{"word":"COPIER","idx":12044,"count":3747909,"meanings":[{"definitions":[{"definition":"A machine that copies graphical material; a duplicator."},{"definition":"A person who copies documents."},{"definition":"A program or process that copies.","example":"a file copier; a disk copier"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɑpiɚ/"},{"text":"/ˈkɒpɪə/"}]},{"word":"TERRA","idx":12046,"count":3747696,"meanings":[{"definitions":[{"definition":"(astrogeology) A rough upland or mountainous region of the Moon with a relatively high albedo."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛɹə/"}]},{"word":"LITERAL","idx":12047,"count":3747449,"meanings":[{"definitions":[{"definition":"(epigraphy) A misprint (or occasionally a scribal error) that affects a letter."},{"definition":"A value, as opposed to an identifier, written into the source code of a computer program."},{"definition":"A propositional variable or the negation of a propositional variable. Wp"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Exactly as stated; read or understood without additional interpretation; according to the letter or verbal expression; real; not figurative or metaphorical.","example":"The literal translation is “hands full of bananas” but it means empty-handed."},{"definition":"Following the letter or exact words; not free; not taking liberties.","example":"A literal reading of the law would prohibit it, but that is clearly not the intent."},{"definition":"Consisting of, or expressed by, letters.","example":"a literal equation"},{"definition":"(of a person) Giving a strict or literal construction; unimaginative; matter-of-fact."},{"definition":"Used non-literally as an intensifier; see literally for usage notes.","example":"Telemarketers are the literal worst."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"literal-uk","text":"/ˈlɪt(ə)ɹəl/"}]},{"word":"QUESTIONED","idx":12048,"count":3747297,"meanings":[{"definitions":[{"definition":"To ask questions about; to interrogate; to enquire for information."},{"definition":"To raise doubts about; have doubts about."},{"definition":"To argue; to converse; to dispute."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"questioned-us","text":"/ˈkwɛst͡ʃənd/"}]},{"word":"GUIDING","idx":12049,"count":3747104,"meanings":[{"definitions":[{"definition":"To serve as a guide for someone or something; to lead or direct in a way; to conduct in a course or path."},{"definition":"To steer or navigate, especially a ship or as a pilot."},{"definition":"To exert control or influence over someone or something."},{"definition":"To supervise the education or training of someone."},{"definition":"To act as a guide."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Guidance."},{"definition":"Girl Guiding."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"guiding-us","text":"/ˈɡaɪdɪŋ/"}]},{"word":"CHARCOAL","idx":12050,"count":3745478,"meanings":[{"definitions":[{"definition":"Impure carbon obtained by destructive distillation of wood or other organic matter, that is to say, heating it in the absence of oxygen."},{"definition":"A stick of black carbon material used for drawing."},{"definition":"A drawing made with charcoal."},{"definition":"A very dark gray colour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To draw with charcoal."},{"definition":"To cook over charcoal."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a dark gray colour."},{"definition":"Made of charcoal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"charcoal-us","text":"/ˈtʃɑɹ.koʊl/"}]},{"word":"VAPOR","idx":12052,"count":3744912,"meanings":[{"definitions":[{"definition":"Cloudy diffused matter such as mist, steam or fumes suspended in the air."},{"definition":"The gaseous state of a substance that is normally a solid or liquid."},{"definition":"Something insubstantial, fleeting, or transitory; unreal fancy; vain imagination; idle talk; boasting."},{"definition":"Any medicinal agent designed for administration in the form of inhaled vapour."},{"definition":"(in the plural) Hypochondria; melancholy; the blues; hysteria, or other nervous disorder."},{"definition":"Wind; flatulence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To become vapor; to be emitted or circulated as vapor."},{"definition":"To turn into vapor.","example":"to vapor away a heated fluid"},{"definition":"To emit vapor or fumes."},{"definition":"To use insubstantial language; to boast or bluster."},{"definition":"To give (someone) the vapors; to depress, to bore."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vapor-us","text":"/ˈveɪpɚ/"}]},{"word":"BEWARE","idx":12053,"count":3744629,"meanings":[{"definitions":[{"definition":"(defective) To use caution, pay attention to (used both with and without of)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"beware-us","text":"/biˈwɛə(ɹ)/"}]},{"word":"ALOUD","idx":12054,"count":3743858,"meanings":[{"definitions":[{"definition":"Spoken out loud."}],"partOfSpeech":"j"},{"definitions":[{"definition":"With a loud voice, or great noise; loudly; audibly.","example":"Try speaking aloud rather than whispering."},{"definition":"Audibly, as opposed to silently/quietly.","example":"speaking aloud rather than thinking thoughts privately"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"aloud-us","text":"/əˈlaʊd/"}]},{"word":"GLORIOUS","idx":12055,"count":3743383,"meanings":[{"definitions":[{"definition":"Exhibiting attributes, qualities, or acts that are worthy of or receive glory.","example":"glorious deeds"},{"definition":"Excellent, wonderful"},{"definition":"Bright or shining;"},{"definition":"Eager for glory or distinction"},{"definition":"Ecstatic; hilarious; elated with drink."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"glorious-us","text":"/ˈɡlɔɹ.i.əs/"}]},{"word":"OVERLAP","idx":12057,"count":3743117,"meanings":[{"definitions":[{"definition":"Something that overlaps or is overlapped"},{"definition":"A situation in the game where an attacking line has more players in it than the defensive line coming to meet it. The attacking side may exploit the overlap by using their superior numbers to break the opposition's defensive line. If attackers outnumber defenders by more than one player this is often termed a two man overlap or three man overlap, etc. If the attacking side fails to break through usually due to poor execution, they are said to waste an overlap."},{"definition":"The payment of a spouse's or other dependant's annuity benefits concurrently with the member's benefits, on death of the member during the guarantee period."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extend over and partly cover something.","example":"The mouse-mat overlapped the edge of the desk."},{"definition":"To have an area, range, character or function in common.","example":"The two maps overlapped at the east and west edges."},{"definition":"Of sets: to have some elements in common.","example":"The set (all men) overlaps the set (vegetarians)."},{"definition":"To have some similar nucleotide sequences."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"overlap-uk","text":"/ˈəʊvəˌlæp/"}]},{"word":"HANDSOME","idx":12058,"count":3742080,"meanings":[{"definitions":[{"definition":"To render handsome."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of people, things, etc) Having a good appearance; good-looking.","example":"a handsome garment, house, tree, or horse"},{"definition":"Good, appealing, appropriate."},{"definition":"Generous or noble in character.","example":"Handsome is as handsome does."},{"definition":"Ample; moderately large.","example":"a handsome salary"},{"definition":"(said of things and people) Dexterous; skillful."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"handsome-us","text":"/ˈhæn.səm/"},{"audio":"handsome-uk","text":"/ˈhæn.səm/"}]},{"word":"DEFAULTS","idx":12059,"count":3742075,"meanings":[{"definitions":[{"definition":"The condition of failing to meet an obligation.","example":"He failed to make payments on time and is now in default."},{"definition":"The original software programming settings as set by the factory"},{"definition":"A loss incurred by failing to compete.","example":"The team's three losses include one default."},{"definition":"A selection made in the absence of an alternative.","example":"The man became the leader of the group as a default."},{"definition":"A value used when none has been given; a tentative value or standard that is presumed.","example":"If you don't specify a number of items, the default is 1."},{"definition":"The failure of a defendant to appear and answer a summons and complaint."},{"definition":"A failing or failure; omission of that which ought to be done; neglect to do what duty or law requires.","example":"This evil has happened through the governor's default."},{"definition":"Lack; absence."},{"definition":"Fault; offence; wrong act."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fail to meet an obligation.","example":"If you do not make your payments, you will default on your loan."},{"definition":"To lose a competition by failing to compete.","example":"If you refuse to wear a proper uniform, you will not be allowed to compete and will default this match."},{"definition":"To assume a value when none was given; to presume a tentative value or standard.","example":"If you don't specify a number of items, it defaults to 1."},{"definition":"To fail to appear and answer a summons and complaint."}],"partOfSpeech":"ve"}]},{"word":"FORECLOSURE","idx":12060,"count":3741402,"meanings":[{"definitions":[{"definition":"The proceeding, by a creditor, to regain property or other collateral following a default on mortgage payments"},{"definition":"The absence of a symbolic father for a fatherless child, as a cause for psychosis."}],"partOfSpeech":"n"}]},{"word":"CLARIFICATION","idx":12061,"count":3741132,"meanings":[{"definitions":[{"definition":"The act of clarifying; the act or process of making clear or transparent by freeing visible impurities; particularly, the clearing or fining of liquid substances from feculent matter by the separation of the insoluble particles which prevent the liquid from being transparent.","example":"The clarification of wine."},{"definition":"The act of freeing from obscurities.","example":"Your ideas deserve clarification."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌklæɹɪfɪˈkeɪʃən/"}]},{"word":"GROUNDED","idx":12062,"count":3739928,"meanings":[{"definitions":[{"definition":"To connect (an electrical conductor or device) to a ground."},{"definition":"To punish, especially a child or teenager, by forcing him/her to stay at home and/or give up certain privileges.","example":"Eric, you are grounded until further notice for lying to us about where you were last night!"},{"definition":"To forbid (an aircraft or pilot) to fly.","example":"Because of the bad weather, all flights were grounded."},{"definition":"To give a basic education in a particular subject; to instruct in elements or first principles.","example":"Jim was grounded in maths."},{"definition":"To hit a ground ball. Compare fly (verb(regular)) and line (verb)."},{"definition":"To place something on the ground."},{"definition":"To run aground; to strike the bottom and remain fixed.","example":"The ship grounded on the bar."},{"definition":"To found; to fix or set, as on a foundation, reason, or principle; to furnish a ground for; to fix firmly."},{"definition":"To cover with a ground, as a copper plate for etching, or as paper or other materials with a uniform tint as a preparation for ornament."},{"definition":"To improve or focus the mental or emotional state of.","example":"I ground myself with meditation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of an airman) Not allowed to fly."},{"definition":"(of a person, predicative) Confined to stay inside, typically by a parent, as a punishment."},{"definition":"(of a person) Mature, sensible with well-considered priorities."},{"definition":"Of or pertaining to an electrical conductor which is connected to earth; earthed."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɹaʊndɪd/"}]},{"word":"BAIL","idx":12063,"count":3739601,"meanings":[{"definitions":[{"definition":"Security, usually a sum of money, exchanged for the release of an arrested person as a guarantee of that person's appearance for trial."},{"definition":"Release from imprisonment on payment of such money."},{"definition":"The person providing such payment."},{"definition":"A bucket or scoop used for removing water from a boat etc."},{"definition":"A person who bails water out of a boat."},{"definition":"Custody; keeping."},{"definition":"A hoop, ring or handle (especially of a kettle or bucket)."},{"definition":"A stall for a cow (or other animal) (usually tethered with a semi-circular hoop)."},{"definition":"A hinged bar as a restraint for animals, or on a typewriter."},{"definition":"A frame to restrain a cow during milking or feeding."},{"definition":"A hoop, ring, or other object used to connect a pendant to a necklace."},{"definition":"One of the two wooden crosspieces that rest on top of the stumps to form a wicket."},{"definition":"(furniture) Normally curved handle suspended between sockets as a drawer pull. This may also be on a kettle or pail."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To secure the release of an arrested person by providing bail."},{"definition":"To release a person under such guarantee."},{"definition":"To hand over personal property to be held temporarily by another as a bailment.","example":"to bail cloth to a tailor to be made into a garment; to bail goods to a carrier"},{"definition":"To remove (water) from a boat by scooping it out.","example":"to bail water out of a boat"},{"definition":"To remove water from (a boat) by scooping it out.","example":"to bail a boat"},{"definition":"To set free; to deliver; to release."},{"definition":"To exit quickly.","example":"With his engine in flames, the pilot had no choice but to bail."},{"definition":"To fail to meet a commitment."},{"definition":"To secure the head of a cow during milking."},{"definition":"To confine."},{"definition":"To secure (a cow) by placing its head in a bail for milking."},{"definition":"To keep (a traveller) detained in order to rob them; to corner (a wild animal); loosely, to detain, hold up. (Usually with up.)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bail-us","text":"/beɪ̯l/"},{"audio":"bail-au","text":"/beɪ̯l/"}]},{"word":"GOOSE","idx":12064,"count":3739382,"meanings":[{"definitions":[{"definition":"Any of various grazing waterfowl of the family Anatidae, which have feathers and webbed feet and are capable of flying, swimming, and walking on land, and which are bigger than ducks.","example":"There is a flock of geese on the pond."},{"definition":"A female goose (sense 1)."},{"definition":"The flesh of the goose used as food."},{"definition":"A silly person."},{"definition":"A tailor's iron, heated in live coals or embers, used to press fabrics."},{"definition":"A young woman or girlfriend."},{"definition":"An old English board game in which players moved counters along a board, earning a double move when they reached the picture of a goose."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sharply poke or pinch someone's buttocks. Derived from a goose's inclination to bite at a retreating intruder's hindquarters."},{"definition":"To stimulate, to spur."},{"definition":"To gently accelerate an automobile or machine, or give repeated small taps on the accelerator."},{"definition":"(UK slang) Of private-hire taxi drivers, to pick up a passenger who has not pre-booked a cab. This is unauthorised under UK licensing conditions."},{"definition":"To hiss (a performer) off the stage."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"goose-us","text":"/ˈɡuːs/"},{"audio":"goose-uk","text":"/ˈɡuːs/"}]},{"word":"ESPRESSO","idx":12065,"count":3739029,"meanings":[{"definitions":[{"definition":"A concentrated coffee beverage brewed by forcing hot water under high pressure through finely ground coffee."},{"definition":"A drink that includes espresso as an ingredient."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"espresso-uk","text":"/ɛˈspɹɛsəʊ/"}]},{"word":"JUDGEMENT","idx":12067,"count":3736635,"meanings":[{"definitions":[{"definition":"The act of judging."},{"definition":"The power or faculty of performing such operations; especially, when unqualified, the faculty of judging or deciding rightly, justly, or wisely","example":"a man of judgment"},{"definition":"The conclusion or result of judging; an opinion; a decision."},{"definition":"The act of determining, as in courts of law, what is conformable to law and justice; also, the determination, decision, or sentence of a court, or of a judge."},{"definition":"The final award; the last sentence."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dʒʌdʒmənt/"}]},{"word":"CRUISER","idx":12068,"count":3735652,"meanings":[{"definitions":[{"definition":"One who attends cruises."},{"definition":"A kind of bicycle that usually combines balloon tires, an upright seating posture, a single-speed drivetrain, and straightforward steel construction with expressive styling."},{"definition":"(in the days of sail) A frigate or other vessel, detached from the fleet, to cruise independently in search of the enemy or its merchant ships."},{"definition":"A class of fast warships of medium tonnage, having a long cruising range but less armour and firepower than a battleship."},{"definition":"A miniature aircraft carrier carrying VTOL aircraft."},{"definition":"A passenger ship used for pleasure voyages, where the voyage itself and the ship's amenities are considered an essential part of the experience; also cruise ship."},{"definition":"Any of several yachts designed for cruising."},{"definition":"(law enforcement) A police patrol vehicle."},{"definition":"Any of various nymphalid butterflies of the genus Vindula."},{"definition":"Someone who cruises bars and neighborhoods looking for \"action\"."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹuzɚ/"}]},{"word":"GIFTED","idx":12071,"count":3733747,"meanings":[{"definitions":[{"definition":"To give as a gift or donation."},{"definition":"To give away, to concede easily."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Endowed with special, in particular intellectual, abilities.","example":"a gifted artist"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɪftɪd/"}]},{"word":"ESTEEM","idx":12072,"count":3733585,"meanings":[{"definitions":[{"definition":"Favourable regard.","example":"We hold her in high esteem."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To set a high value on; to regard with respect or reverence."},{"definition":"To regard something as valuable; to prize."},{"definition":"To look upon something in a particular way.","example":"Mary is an esteemed member of the community."},{"definition":"To judge; to estimate; to appraise","example":"The Earth, which I esteem unable to reflect the rays of the Sun."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"esteem-us","text":"[ɛsˈtiːm]"}]},{"word":"CASCADE","idx":12073,"count":3732995,"meanings":[{"definitions":[{"definition":"A waterfall or series of small waterfalls."},{"definition":"A stream or sequence of a thing or things occurring as if falling like a cascade."},{"definition":"A series of electrical (or other types of) components, the output of any one being connected to the input of the next; See also daisy chain"},{"definition":"A pattern typically performed with an odd number of props, where each prop is caught by the opposite hand."},{"definition":"A sequence of absurd short messages posted to a newsgroup by different authors, each one responding to the most recent message and quoting the entire sequence to that point (with ever-increasing indentation)."},{"definition":"A hairpiece for women consisting of curled locks or a bun attached to a firm base, used to create the illusion of fuller hair."},{"definition":"A series of reactions in which the product of one becomes a reactant in the next"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fall as a waterfall or series of small waterfalls."},{"definition":"To arrange in a stepped series like a waterfall."},{"definition":"To occur as a causal sequence."},{"definition":"To vomit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cascade-au","text":"/kæsˈkeɪd/"}]},{"word":"ENDORSE","idx":12074,"count":3732894,"meanings":[{"definitions":[{"definition":"A diminutive of the pale, usually appearing in pairs on either side of a pale."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To support, to back, to give one's approval to, especially officially or by signature."},{"definition":"To write one's signature on the back of a cheque, or other negotiable instrument, when transferring it to a third party, or cashing it."},{"definition":"To give an endorsement."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"endorse-uk","text":"/ɪnˈdɔːs/"}]},{"word":"STROKES","idx":12075,"count":3732810,"meanings":[{"definitions":[{"definition":"An act of stroking (moving one's hand over a surface).","example":"She gave the cat a stroke."},{"definition":"A blow or hit.","example":"a stroke on the chin"},{"definition":"A single movement with a tool."},{"definition":"One of a series of beats or movements against a resisting medium, by means of which movement through or upon it is accomplished.","example":"the stroke of a bird's wing in flying, or of an oar in rowing"},{"definition":"A powerful or sudden effort by which something is done, produced, or accomplished; also, something done or accomplished by such an effort.","example":"a stroke of genius; a stroke of business; a master stroke of policy"},{"definition":"A line drawn with a pen or other writing implement, particularly:"},{"definition":"A streak made with a brush."},{"definition":"The time when a clock strikes.","example":"on the stroke of midnight"},{"definition":"A style, a single movement within a style.","example":"butterfly stroke"},{"definition":"The loss of brain function arising when the blood supply to the brain is suddenly interrupted."},{"definition":"A sudden attack of any disease, especially when fatal; any sudden, severe affliction or calamity.","example":"a stroke of apoplexy; the stroke of death"},{"definition":"The oar nearest the stern of a boat, by which the other oars are guided."},{"definition":"The rower who is nearest the stern of the boat."},{"definition":"Backstage influence."},{"definition":"A point awarded to a player in case of interference or obstruction by the opponent."},{"definition":"An individual discharge of lightning.","example":"A flash of lightning may be made up of several strokes. If they are separated by enough time for the eye to distinguish them, the lightning will appear to flicker."},{"definition":"The result or effect of a striking; injury or affliction; soreness."},{"definition":"An addition or amendment to a written composition; a touch.","example":"to give some finishing strokes to an essay"},{"definition":"A throb or beat, as of the heart."},{"definition":"Power; influence."},{"definition":"Appetite."},{"definition":"In transactional analysis, a (generally positive) reaction to a person, fulfilling their needs or desires."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move one's hand or an object (such as a broom) along (a surface) in one direction."},{"definition":"To hit the ball with the bat in a flowing motion."},{"definition":"To give a finely fluted surface to."},{"definition":"To row the stroke oar of.","example":"to stroke a boat"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"strokes-uk","text":"/stɹəʊks/"}]},{"word":"HEN","idx":12077,"count":3732543,"meanings":[{"definitions":[{"definition":"A female chicken (Gallus gallus), particularly a sexually mature one kept for its eggs."},{"definition":"A female of other bird species, particularly a sexually mature female fowl."},{"definition":"A female fish (especially a salmon or trout) or crustacean."},{"definition":"A woman, particularly"},{"definition":"A hen night."},{"definition":"An affectionate term of address used to women or girls.","example":"Don't cry, hen. Everything will be all right."},{"definition":"A henlike person of either sex."},{"definition":"The hard clam (Mercenaria mercenaria), a bivalve shellfish."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To behave in an overprotective or extremely nurturing manner (towards)."},{"definition":"To throw."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Hence."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"hen-us","text":"/hɛn/"}]},{"word":"HOMEOWNER","idx":12078,"count":3732354,"meanings":[{"definitions":[{"definition":"Someone who owns a house"},{"definition":"Someone who does not have title to a house, but has possession and is paying for it by instalments"}],"partOfSpeech":"n"}]},{"word":"ANCESTRY","idx":12079,"count":3731719,"meanings":[{"definitions":[{"definition":"Condition as to ancestors; ancestral lineage; hence, birth or honorable descent.","example":"Title and ancestry render a good man more illustrious, but an ill one more contemptible. -Addison."},{"definition":"A series of ancestors or progenitors; lineage, or those who compose the line of natural descent."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈæn.sɛs.tɹi/"}]},{"word":"DOLPHINS","idx":12081,"count":3731075,"meanings":[{"definitions":[{"definition":"A carnivorous aquatic mammal in one of several families of order Cetacea, famed for its intelligence and occasional willingness to approach humans."},{"definition":"A fish, the mahi-mahi or dorado, Coryphaena hippurus, with a dorsal fin that runs the length of the body, also known for iridescent coloration."},{"definition":"A depiction of a fish, with a broad indented fin, usually embowed."},{"definition":"The dauphin, eldest son of the kings of France."},{"definition":"(history) A mass of iron or lead hung from the yardarm, in readiness to be dropped through the deck and the hull of an enemy's vessel to sink it."},{"definition":"A kind of wreath or strap of plaited cordage."},{"definition":"A spar or buoy held by an anchor and furnished with a ring to which ships may fasten their cables."},{"definition":"A mooring post on a wharf or beach."},{"definition":"A permanent fender around a heavy boat just below the gunwale."},{"definition":"One of the handles above the trunnions by which a gun was lifted."},{"definition":"A man-made semi submerged maritime structure, usually installed to provide a fixed structure for temporary mooring, to prevent ships from drifting to shallow water or to serve as base for navigational aids."}],"partOfSpeech":"n"}]},{"word":"ADOPTING","idx":12082,"count":3730959,"meanings":[{"definitions":[{"definition":"To take by choice into relationship (a child, heir, friend, citizen, etc.)"},{"definition":"To take or receive as one's own what is not so naturally.","example":"He adopted a new look in order to fit in with his new workmates."},{"definition":"To select and take or approve.","example":"These resolutions were adopted."},{"definition":"To win ten consecutive games against an opponent"}],"partOfSpeech":"ve"}]},{"word":"LANDED","idx":12083,"count":3730816,"meanings":[{"definitions":[{"definition":"To descend to a surface, especially from the air.","example":"The plane is about to land."},{"definition":"To alight, to descend from a vehicle."},{"definition":"To come into rest."},{"definition":"To arrive at land, especially a shore, or a dock, from a body of water."},{"definition":"To bring to land.","example":"It can be tricky to land a helicopter."},{"definition":"To acquire; to secure."},{"definition":"To deliver."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In possession of land.","example":"landed gentry"},{"definition":"Consisting of land, especially with a single owner.","example":"a landed estate"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"landed-us","text":"/ˈlændɪd/"}]},{"word":"NUCLEUS","idx":12084,"count":3730601,"meanings":[{"definitions":[{"definition":"The core, central part of something, around which other elements are assembled."},{"definition":"An initial part or version that will receive additions.","example":"This collection will form the nucleus of a new library."},{"definition":"The massive, positively charged central part of an atom, made up of protons and neutrons."},{"definition":"A large membrane-enclosed organelle found in eukaryotic cells which contains genetic material."},{"definition":"A ganglion, cluster of many neuronal bodies where synapsing occurs."},{"definition":"The central part of a syllable, most commonly a vowel."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nucleus-us","text":"/ˈnuːkli.əs/"}]},{"word":"TEES","idx":12085,"count":3730254,"meanings":[{"definitions":[{"definition":"The name of the Latin-script letter T."},{"definition":"Something shaped like the letter T.","example":"angles and tees"},{"definition":"(clothing) T-shirt."},{"definition":"A flat area of ground from which players hit their first shots on a golf hole."},{"definition":"A usually wooden or plastic peg from which a ball is hit."},{"definition":"The target area of a curling rink"},{"definition":"The mark at which players aim in quoits."},{"definition":"A finial resembling an umbrella, crowning a dagoba in Indochinese countries."}],"partOfSpeech":"n"}]},{"word":"DETACHED","idx":12086,"count":3730246,"meanings":[{"definitions":[{"definition":"To take apart from; to take off.","example":"to detach the tag from a newly purchased garment"},{"definition":"To separate for a special object or use.","example":"to detach a ship from a fleet, or a company from a regiment"},{"definition":"To come off something.","example":"Now that the zipper has detached, my winter coat won't keep me very warm."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not physically attached; separated from something it could connect to."},{"definition":"Of a house: not joined to another house on either side."},{"definition":"Having or showing no bias or emotional involvement; disinterested."},{"definition":"Not influenced by anyone else; characterized by an impersonal objectivity; impartial."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"detached-us","text":"/dɪˈtæt͡ʃt/"}]},{"word":"SCOUTS","idx":12087,"count":3729780,"meanings":[{"definitions":[{"definition":"A person sent out to gain and bring in tidings; especially, one employed in war to gain information about the enemy and ground."},{"definition":"An act of scouting or reconnoitering."},{"definition":"A member of any number of youth organizations belonging to the international scout movement, such as the Boy Scouts of America or Girl Scouts of the United States."},{"definition":"A person who assesses and/or recruits others; especially, one who identifies promising talent on behalf of a sports team."},{"definition":"A college servant (in Oxford, England or Yale or Harvard), originally implying a male servant, attending to (usually several) students or undergraduates in a variety of ways that includes cleaning; corresponding to the duties of a gyp or possibly bedder at Cambridge University; and at Dublin, a skip."},{"definition":"A fielder in a game for practice."},{"definition":"(up until 1920s) A fighter aircraft."},{"definition":"Term of address for a man or boy."},{"definition":"A swift sailing boat."},{"definition":"A projecting rock."},{"definition":"The guillemot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To explore a wide terrain, as if on a search; to reconnoiter."},{"definition":"To observe, watch, or look for, as a scout; to follow for the purpose of observation, as a scout."},{"definition":"To reject with contempt.","example":"to scout an idea or an apology"},{"definition":"To scoff."},{"definition":"To pour forth a liquid forcibly, especially excrement."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/skaʊts/"}]},{"word":"MIST","idx":12090,"count":3728769,"meanings":[{"definitions":[{"definition":"Water or other liquid finely suspended in air.","example":"It was difficult to see through the morning mist."},{"definition":"A layer of fine droplets or particles.","example":"There was an oily mist on the lens."},{"definition":"Anything that dims, darkens, or hinders vision."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form mist.","example":"It's misting this morning."},{"definition":"To spray fine droplets on, particularly of water.","example":"I mist my tropical plants every morning."},{"definition":"To cover with a mist.","example":"The lens was misted."},{"definition":"(of the eyes) To be covered by tears.","example":"My eyes misted when I remembered what had happened."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mist-us","text":"/mɪst/"}]},{"word":"VERB","idx":12093,"count":3726924,"meanings":[{"definitions":[{"definition":"(grammar) A word that indicates an action, event, or state.","example":"The word “speak” is an English verb."},{"definition":"Any word; a vocable."},{"definition":"An action as opposed to a trait or thing.","example":"Kindness is a verb, not an adjective. You're only kind if you do kind things."},{"definition":"A named command that performs a specific operation on an object."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use any word that is not, or had not been a verb (especially a noun) as if it were a verb."},{"definition":"(used as a neutral, unspecific verb) To perform any action that is normally expressed by a verb."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"verb-us","text":"/vɝb/"}]},{"word":"CHIC","idx":12095,"count":3725795,"meanings":[{"definitions":[{"definition":"Good form; style."},{"definition":"A person with (a particular type of) chic."},{"definition":"A kind of ritual buffoon or clown in Yucatec Maya culture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Elegant, stylish."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʃik/"},{"text":"/ʃiːk/"},{"audio":"chic-1-au"}]},{"word":"HYDRO","idx":12096,"count":3725464,"meanings":[{"definitions":[{"definition":"Hydroelectric power"},{"definition":"Electrical power supply; specifically, electrical power provided by a utility (as a publicly-owned one); payment or bills for this.","example":"He crashed his car against a hydro pole."},{"definition":"A spa."},{"definition":"A floatplane, an airplane specialized for operating on water, having pontoon floats instead of skids or wheels"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Hydroelectric"},{"definition":"Hydroponic","example":"hydro watercress"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hydro-ca"}]},{"word":"NONLINEAR","idx":12097,"count":3725269,"meanings":[{"definitions":[{"definition":"(of a set of points) Not lying on a straight line."},{"definition":"(of a molecule) Whose atoms do not lie in a straight line."},{"definition":"(of a function) Having a product of independent variables, or a variable with an exponent not equal to one."},{"definition":"(of a system) Whose output is not directly proportional to its input."},{"definition":"Erratic and unpredictable; tending to jump back and forth.","example":"a film with a nonlinear plot"}],"partOfSpeech":"j"}]},{"word":"OBJECTION","idx":12099,"count":3725086,"meanings":[{"definitions":[{"definition":"The act of objecting."},{"definition":"A statement expressing opposition, or a reason or cause for expressing opposition (generally followed by the adposition to).","example":"I have no objection to any person's religion."},{"definition":"An official protest raised in a court of law during a legal trial over a violation of the rules of the court by the opposing party."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"objection-us","text":"/əbˈdʒɛkʃən/"}]},{"word":"PHOSPHATE","idx":12100,"count":3724512,"meanings":[{"definitions":[{"definition":"Any salt or ester of phosphoric acid."},{"definition":"A carbonated soft drink sweetened with fruit syrup and with some phosphoric acid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat or coat with a phosphate or with phosphoric acid"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfɑsfeɪt/"},{"text":"/ˈfɒsfeɪt/"}]},{"word":"PLAYA","idx":12101,"count":3723548,"meanings":[{"definitions":[{"definition":"A level area which habitually fills with water that evaporates entirely."},{"definition":"A dude (an informal term of address or general term to describe a person, typically male)."},{"definition":"A player (someone who plays the field, or has prowess in gaining romantic and sexual relationships)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈplaɪə/"}]},{"word":"GH","idx":12102,"count":3723010,"meanings":[{"definitions":[{"definition":"Initialism of good half."}],"partOfSpeech":"i"}]},{"word":"NOISY","idx":12103,"count":3722908,"meanings":[{"definitions":[{"definition":"Making a noise, especially a loud unpleasant sound","example":"the noisy crowd."},{"definition":"Full of noise.","example":"a noisy bar"},{"definition":"Unpleasant-looking and causing unwanted attention","example":"noisy clothes"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"noisy-us","text":"/ˈnɔɪzi/"}]},{"word":"ABIDE","idx":12105,"count":3722809,"meanings":[{"definitions":[{"definition":"To endure without yielding; to withstand; await defiantly; to encounter; to persevere.","example":"The old oak tree abides the wind endlessly."},{"definition":"To bear patiently; to tolerate; to put up with; stand."},{"definition":"To pay for; to stand the consequences of; to answer for; to suffer for; to atone for."},{"definition":"To wait in expectation."},{"definition":"To pause; to delay."},{"definition":"To stay; to continue in a place; to remain stable or fixed in some state or condition; to be left."},{"definition":"To have one's abode; to dwell; to reside; to sojourn."},{"definition":"To endure; to remain; to last."},{"definition":"To stand ready for; to await for someone; watch for."},{"definition":"To endure or undergo a hard trial or a task; to stand up under."},{"definition":"To await submissively; accept without question; submit to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"abide-us","text":"/əˈbaɪd/"}]},{"word":"RADIOACTIVE","idx":12106,"count":3721806,"meanings":[{"definitions":[{"definition":"Any radioactive substance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Exhibiting radioactivity."},{"definition":"Dangerous and disgusting, particularly of people or ideas.","example":"Even sleazy tactics and his radioactive mouth may not be able to contain this debacle."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɹeɪdioʊˈæktɪv/"},{"text":"/ˌɹeɪdioʊˈaktɪv/"}]},{"word":"SENTINEL","idx":12107,"count":3721697,"meanings":[{"definitions":[{"definition":"A sentry, watch, or guard."},{"definition":"A private soldier."},{"definition":"A unique string of characters recognised by a computer program for processing in a special way; a keyword.","example":"The  tag is a sentinel that suspends web-page processing and displays the subsequent text literally."},{"definition":"A sentinel crab."},{"definition":"A sign of a health risk (e.g. a disease, an adverse effect).","example":"sentinel animals can be used to explore endemic diseases."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To watch over as a guard.","example":"He sentineled the north wall."},{"definition":"To post as guard.","example":"He sentineled him on the north wall."},{"definition":"To post a guard for.","example":"He sentineled the north wall with just one man."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sentinel-us","text":"/ˈsɛntɪnəl/"}]},{"word":"BIRTHDAYS","idx":12108,"count":3721283,"meanings":[{"definitions":[{"definition":"The anniversary of the day on which someone is born."},{"definition":"The anniversary of the day on which something is created."},{"definition":"The date on which someone is born or something is created, more commonly called birthdate or date of birth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To celebrate one's birthday."}],"partOfSpeech":"ve"}]},{"word":"DESSERTS","idx":12109,"count":3720484,"meanings":[{"definitions":[{"definition":"A sweet confection served as the last course of a meal"}],"partOfSpeech":"n"}]},{"word":"PRESERVING","idx":12113,"count":3719018,"meanings":[{"definitions":[{"definition":"To protect; to keep from harm or injury.","example":"Every people have the right to preserve its identity and culture."},{"definition":"To save from decay by the use of some preservative substance, such as sugar or salt; to season and prepare (fruits, meat, etc.) for storage.","example":"to preserve peaches or grapes"},{"definition":"To maintain throughout; to keep intact.","example":"to preserve appearances; to preserve silence"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Preservation"}],"partOfSpeech":"n"}]},{"word":"VEST","idx":12114,"count":3719017,"meanings":[{"definitions":[{"definition":"A loose robe or outer garment worn historically by men in Arab or Middle Eastern countries."},{"definition":"A sleeveless garment that buttons down the front, worn over a shirt, and often as part of a suit; a waistcoat."},{"definition":"A sleeveless garment, often with a low-cut neck, usually worn under a shirt or blouse."},{"definition":"A sleeveless top, typically with identifying colours or logos, worn by an athlete or member of a sports team."},{"definition":"Any sleeveless outer garment, often for a purpose such as identification, safety, or storage."},{"definition":"A vestment."},{"definition":"Clothing generally; array; garb."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clothe with, or as with, a vestment, or garment; to dress; to robe; to cover, surround, or encompass closely."},{"definition":"To clothe with authority, power, etc.; to put in possession; to invest; to furnish; to endow; followed by with and the thing conferred.","example":"to vest a court with power to try cases of life and death"},{"definition":"To place or give into the possession or discretion of some person or authority; to commit to another; with in before the possessor.","example":"The power of life and death is vested in the king, or in the courts."},{"definition":"To invest; to put.","example":"to vest money in goods, land, or houses"},{"definition":"To clothe with possession; also, to give a person an immediate fixed right of present or future enjoyment of.","example":"an estate is vested in possession"},{"definition":"(of an inheritance or a trust fund) To devolve upon the person currently entitled when a prior interest has ended.","example":"Upon the death of the Sovereign the Crown automatically vests in the next heir without the need of coronation or other formality."},{"definition":"(financial) To become vested, to become permanent.","example":"My pension vests at the end of the month and then I can take it with me when I quit."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"vest-us","text":"/vɛst/"}]},{"word":"ECONOMIST","idx":12116,"count":3718338,"meanings":[{"definitions":[{"definition":"An expert in economics, especially one who studies economic data and extracts higher-level information or proposes theories."},{"definition":"One concerned with political economy."},{"definition":"One who manages a household."},{"definition":"One who economizes, or manages domestic or other concerns with frugality; one who expends money, time, or labor, judiciously, and without waste."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/iːˈkɑn.ə.mɪst/"},{"text":"/iːˈkɒn.ə.mɪst/"}]},{"word":"GROOMING","idx":12117,"count":3718290,"meanings":[{"definitions":[{"definition":"To attend to one's appearance and clothing."},{"definition":"To care for (horses or other animals) by brushing and cleaning them."},{"definition":"To prepare (someone) for election or appointment."},{"definition":"To prepare (a ski slope) for skiers by packing down the snow."},{"definition":"To attempt to gain the trust of (somebody, especially a minor) with the intention of subjecting them to abusive or exploitative behaviour such as sexual abuse or human trafficking."},{"definition":"In agile software development, to review and prioritize the items in the development backlog."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Care for one's personal appearance, hygiene, and clothing."},{"definition":"The practice of primates picking through the hair of others, looking for insects etc."},{"definition":"The act of teaching someone, often for advancement at work."},{"definition":"Caring for horses or other animals by brushing and cleaning them."},{"definition":"The act of attempting to gain the trust of a minor with the intention of having a sexual relationship with him or her."},{"definition":"In agile software development, the reviewing and prioritization of items in the development backlog."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹuːmɪŋ/"}]},{"word":"MERIDIAN","idx":12118,"count":3717338,"meanings":[{"definitions":[{"definition":"The south."},{"definition":"Midday, noon."},{"definition":"A great circle passing through the poles of the celestial sphere and the zenith for a particular point on the earth's surface."},{"definition":"An imaginary great circle on the Earth's surface, passing through the geographic poles, or that half of such a circle extending from pole to pole, all points of which have the same longitude."},{"definition":"The highest or most developed point of something; culmination, splendour."},{"definition":"A particular area or situation considered as having a specific identity or characteristic; the tastes or habits of a specific locale, group etc."},{"definition":"The middle period of someone's life, when they are at full strength or abilities; one's prime."},{"definition":"A line passing through the poles of any sphere; a notional line on the surface of a round or curved body."},{"definition":"A dram drunk at midday."},{"definition":"(acupuncture) Any of the pathways on the body along which the vital energy is thought to flow and, therefore, the acupoints are distributed."},{"definition":"The size of type between double great primer and canon, standardized as 44-point."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Meridional; relating to a meridian."},{"definition":"Relating to noon"},{"definition":"Relating to the highest point or culmination.","example":"meridian splendour"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"meridian-uk","text":"/məˈɹɪdɪən/"}]},{"word":"MARRIAGES","idx":12119,"count":3717000,"meanings":[{"definitions":[{"definition":"The state of being married.","example":"You should enter marriage for love."},{"definition":"A union of two or more people that creates a family tie and carries legal, social, and/or religious rights and responsibilities."},{"definition":"A homosexual relationship between male prisoners."},{"definition":"A wedding; a ceremony in which people wed.","example":"You are cordially invited to the marriage of James Smith and Jane Doe."},{"definition":"A close union."},{"definition":"A joining of two parts."},{"definition":"A king and a queen, when held as a hand in Texas hold 'em or melded in pinochle."},{"definition":"In solitaire or patience games, the placing a card of the same suit on the next one above or below it in value."}],"partOfSpeech":"n"}]}]