[{"word":"INCUBATING","idx":73986,"count":168352,"meanings":[{"definitions":[{"definition":"To brood, raise, or maintain eggs, organisms, or living tissue through the provision of ideal environmental conditions."},{"definition":"To incubate metaphorically; to ponder an idea slowly and deliberately as if in preparation for hatching it."}],"partOfSpeech":"ve"}]},{"word":"OTIC","idx":73987,"count":168347,"meanings":[{"definitions":[{"definition":"Of, relating/pertaining to, or located near the ear","example":"Otic preparations are used to treat infections of the ear canal."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɒtɪk/"}]},{"word":"COLONIZE","idx":73994,"count":168321,"meanings":[{"definitions":[{"definition":"To settle (a place) with colonists, and hence make (a place) into a colony."},{"definition":"To settle (a group of people, a species, or the like) in a place as a colony."},{"definition":"To settle among and establish control over (the indigenous people of an area)."},{"definition":"To begin a colony or colonies."},{"definition":"(by extension) To intrude into and take over (the autonomy, experience, social movement, etc, of a less powerful person or group); to commandeer or appropriate."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɑlənaɪz/"},{"text":"/ˈkɒlənaɪz/"}]},{"word":"DEMOLISHING","idx":73998,"count":168289,"meanings":[{"definitions":[{"definition":"To destroy.","example":"They demolished the old mill and put up four townhouses."},{"definition":"To defeat or consume utterly (as a theory, belief or opponent)."}],"partOfSpeech":"ve"}]},{"word":"UNDERTOW","idx":74002,"count":168268,"meanings":[{"definitions":[{"definition":"A short-range flow of water returning seaward from the waves breaking on the shore.","example":"A strong undertow may sweep a returning swimmer off their feet but it does not carry them far from the shore."},{"definition":"(by extension) A feeling that runs contrary to one's normal one."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pull or tow under; drag beneath; pull down."},{"definition":"To pull down by, or as by, an undertow."},{"definition":"To flow or behave as an undertow."}],"partOfSpeech":"ve"}]},{"word":"MADHOUSE","idx":74004,"count":168244,"meanings":[{"definitions":[{"definition":"A house where insane persons are confined; an insane asylum."},{"definition":"(by extension) A chaotic place."}],"partOfSpeech":"n"}]},{"word":"LOUPE","idx":74005,"count":168244,"meanings":[{"definitions":[{"definition":"A magnifying glass, usually mounted in an eyepiece, often used by jewellers and watchmakers."},{"definition":"A type of short-range binoculars used by surgeons and dentists."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/luːp/"}]},{"word":"INFLUENT","idx":74006,"count":168243,"meanings":[{"definitions":[{"definition":"A stream which flows into another stream or lake"},{"definition":"Fluids flowing in"},{"definition":"An organism having an important effect on a plant or animal community"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Flowing in"},{"definition":"Exercising astral influence"},{"definition":"Having an important effect on a plant or animal community"}],"partOfSpeech":"j"}]},{"word":"SNIPPED","idx":74010,"count":168232,"meanings":[{"definitions":[{"definition":"To cut with short sharp actions, as with scissors.","example":"I don't want you to take much hair off; just snip my mullet off."},{"definition":"To reduce the price of a product, to create a snip."},{"definition":"To break off; to snatch away."},{"definition":"To circumcise."},{"definition":"To remove the irrelevant parts of quotations in the reply message."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Circumcised."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/snɪpt/"}]},{"word":"PRATIQUE","idx":74012,"count":168229,"meanings":[{"definitions":[{"definition":"Permission to use a port given to a ship after compliance with quarantine or on conviction that she is free of contagious disease."},{"definition":"Practice; habits."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɹæˈtik/"},{"text":"/pɹæˈtiːk/"}]},{"word":"CALABASH","idx":74013,"count":168225,"meanings":[{"definitions":[{"definition":"A tree (known as the calabash tree; Crescentia cujete) native to Central and South America, the West Indies, and southern Florida, bearing large, round fruit used to make containers (sense 3); the fruit of this tree."},{"definition":"The bottle gourd (calabash vine, Lagenaria siceraria), believed to have originated in Africa, which is grown for its fruit that are used as a vegetable and to make containers (sense 3); the fruit of this plant."},{"definition":"A container made from the mature, dried shell of the fruit of one of the above plants; also, a similarly shaped container made from some other material."},{"definition":"A calabash and its contents; as much as fills such a container."},{"definition":"A musical instrument, most commonly a drum or rattle, made from a calabash fruit."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"calabash-uk","text":"/ˈkaləbaʃ/"}]},{"word":"SEXTILE","idx":74014,"count":168222,"meanings":[{"definitions":[{"definition":"A quantile of six equal proportions; any of the subsets thus obtained."},{"definition":"A segment that is a sixth of the whole."},{"definition":"A sextile aspect or position."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or denoting the aspect or position of any two celestial bodies separated by 60°."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɛks.taɪl/"}]},{"word":"BRIGANTINE","idx":74017,"count":168210,"meanings":[{"definitions":[{"definition":"A two-masted vessel, square-rigged on the foremast, but fore-and-aft-rigged mainsail with a square-rig above it on the mainmast."},{"definition":"A coat of armor for the body, consisting of scales or plates, sometimes overlapping each other, generally of metal, and sewn to linen or other material."}],"partOfSpeech":"n"}]},{"word":"VINEGARS","idx":74019,"count":168208,"meanings":[{"definitions":[{"definition":"A sour liquid formed by the fermentation of alcohol used as a condiment or preservative; a dilute solution of acetic acid."},{"definition":"Any variety of vinegar.","example":"a range of herb-flavoured vinegars"}],"partOfSpeech":"n"}]},{"word":"JUMPY","idx":74027,"count":168187,"meanings":[{"definitions":[{"definition":"Nervous and excited."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"jumpy-us","text":"/ˈdʒʌmpi/"}]},{"word":"JIGGLE","idx":74028,"count":168185,"meanings":[{"definitions":[{"definition":"A weak, shaking movement.","example":"Give the key a jiggle and see if it opens."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shake something gently; to rattle or wiggle.","example":"Jiggle the handle and see if the water stops."},{"definition":"To shake, rattle, or wiggle.","example":"The jelly jiggled in the bowl for a few moments after it was set down."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdʒɪɡəl/"}]},{"word":"PERSECUTIONS","idx":74047,"count":168119,"meanings":[{"definitions":[{"definition":"The act of persecuting."},{"definition":"A program or campaign to subjugate or eliminate a specific group of people, often based on race, religion, sexuality, or social beliefs."}],"partOfSpeech":"n"}]},{"word":"CRAMMING","idx":74051,"count":168105,"meanings":[{"definitions":[{"definition":"To press, force, or drive, particularly in filling, or in thrusting one thing into another; to stuff; to fill to superfluity.","example":"to cram fruit into a basket; to cram a room with people"},{"definition":"To fill with food to satiety; to stuff.","example":"The boy crammed himself with cake"},{"definition":"To put hastily through an extensive course of memorizing or study, as in preparation for an examination.","example":"A pupil is crammed by his tutor."},{"definition":"To study hard; to swot."},{"definition":"To eat greedily, and to satiety; to stuff oneself."},{"definition":"(British slang) To lie; to intentionally not tell the truth."},{"definition":"(British slang) To make (a person) believe false or exaggerated tales."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is crammed, or stuffed full."},{"definition":"An intensive course of hard study, as for an examination."}],"partOfSpeech":"n"}]},{"word":"CHUCKLING","idx":74052,"count":168102,"meanings":[{"definitions":[{"definition":"To laugh quietly or inwardly."},{"definition":"To communicate through chuckling.","example":"She chuckled her assent to my offer as she got in the car."},{"definition":"To make the sound of a chicken; to cluck."},{"definition":"To call together, or call to follow, as a hen calls her chickens; to cluck."},{"definition":"To fondle; to indulge or pamper."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(gerund of chuckle) An instance in which someone chuckles"}],"partOfSpeech":"n"}]},{"word":"DISFIGURED","idx":74056,"count":168094,"meanings":[{"definitions":[{"definition":"Change the appearance of something/someone to the negative.","example":"The burnings disfigured his face."}],"partOfSpeech":"ve"}]},{"word":"REASSEMBLED","idx":74060,"count":168082,"meanings":[{"definitions":[{"definition":"To assemble again"},{"definition":"To put back together; to reverse the process of disassembly"}],"partOfSpeech":"ve"}]},{"word":"ARTICULATIONS","idx":74066,"count":168067,"meanings":[{"definitions":[{"definition":"A joint or the collection of joints at which something is articulated, or hinged, for bending.","example":"The articulation allowed the robot to move around corners."},{"definition":"A manner or method by which elements of a system are connected."},{"definition":"The quality, clarity or sharpness of speech.","example":"His volume is reasonable, but his articulation could use work."},{"definition":"The manner in which a phoneme is pronounced."},{"definition":"The manner in which something is articulated (tongued, slurred or bowed).","example":"The articulation in this piece is tricky because it alternates between legato and staccato."},{"definition":"The interrelation and congruence of the flow of data between financial statements of an entity, especially between the income statement and balance sheet."}],"partOfSpeech":"n"}]},{"word":"AMPERES","idx":74067,"count":168057,"meanings":[{"definitions":[{"definition":"A unit of electrical current, the standard base unit in the International System of Units; colloquially amp. Abbreviation: amp, Symbol: A"}],"partOfSpeech":"n"}]},{"word":"POONS","idx":74070,"count":168046,"meanings":[{"definitions":[{"definition":"Any of several East Indian trees of the genus Calophyllum, yielding a light, hard wood used for masts, spars, etc."},{"definition":"Poontang, the vagina, or, intercourse with a woman.","example":"I'm gonna get me some poon at this party."},{"definition":"A wimp; a pussy."}],"partOfSpeech":"n"}]},{"word":"GIRDERS","idx":74078,"count":167998,"meanings":[{"definitions":[{"definition":"A beam of steel, wood, or reinforced concrete, used as a main horizontal support in a building or structure."},{"definition":"One who girds; a satirist."}],"partOfSpeech":"n"}]},{"word":"MOTORBOAT","idx":74082,"count":167980,"meanings":[{"definitions":[{"definition":"Any vessel driven by an engine (either inboard or outboard), but especially a small one."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press one's face between a woman's breasts."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"motorboat-au"}]},{"word":"EMPATHETIC","idx":74087,"count":167972,"meanings":[{"definitions":[{"definition":"Showing empathy for others, and recognizing their feelings; empathic"}],"partOfSpeech":"j"}]},{"word":"WASTERS","idx":74088,"count":167966,"meanings":[{"definitions":[{"definition":"Someone or something that wastes; someone who squanders or spends extravagantly."},{"definition":"An imperfection in the wick of a candle, causing it to waste."},{"definition":"A destroyer."},{"definition":"An item that is spoiled during its manufacture."},{"definition":"A kind of cudgel; also, a blunt-edged sword used as a foil."},{"definition":"A leister; a spear for catching fish."}],"partOfSpeech":"n"}]},{"word":"HEADPIECES","idx":74091,"count":167960,"meanings":[{"definitions":[{"definition":"The head; the brain."},{"definition":"Something covering the head."},{"definition":"Protecting cover for the head; a helmet."},{"definition":"A headset."},{"definition":"A headstall."},{"definition":"A decorative page heading used at the start of volumes or chapters."},{"definition":"The top piece or part of various things."}],"partOfSpeech":"n"}]},{"word":"ARABICA","idx":74099,"count":167929,"meanings":[{"definitions":[{"definition":"A species of coffee plant, Coffea arabica, native to Ethiopia"},{"definition":"The bean of this plant"},{"definition":"Coffee made from these coffee beans"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ə-ɹăbˈĭ-kə/"}]},{"word":"PYLONS","idx":74100,"count":167925,"meanings":[{"definitions":[{"definition":"A gateway to the inner part of an Ancient Egyptian temple."},{"definition":"A tower-like structure, usually one of a series, used to support high-voltage electricity cables."},{"definition":"A structure used to mount engines, missiles etc., to the underside of an aircraft wing or fuselage."},{"definition":"A starting derrick for an aeroplane."},{"definition":"A post, tower, etc. as on an aerodrome, or flying ground, serving to bound or mark a prescribed course of flight."},{"definition":"An obelisk."},{"definition":"A traffic cone."},{"definition":"An orange marker designating one of the four corners of the end zone in American football."},{"definition":"A rigid prosthesis for the lower leg."}],"partOfSpeech":"n"}]},{"word":"CRUNCHES","idx":74101,"count":167925,"meanings":[{"definitions":[{"definition":"A noisy crackling sound; the sound usually associated with crunching."},{"definition":"A critical moment or event."},{"definition":"A problem that leads to a crisis."},{"definition":"(exercise) A form of abdominal exercise, based on a sit-up but in which the lower back remains in contact with the floor."},{"definition":"The overtime work required to catch up and finish a project, usually in the final weeks of development before release."},{"definition":"A dessert consisting of a crunchy topping with fruit underneath."},{"definition":"(generally in the plural) A small piece created by crushing; a piece of material with a friable or crunchy texture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To crush something, especially food, with a noisy crackling sound.","example":"When I came home, Susan was watching TV with her feet up on the couch, crunching a piece of celery."},{"definition":"To be crushed with a noisy crackling sound.","example":"Beetles crunched beneath the men's heavy boots as they worked."},{"definition":"To calculate or otherwise process (e.g. to crunch numbers: to perform mathematical calculations). Presumably from the sound made by mechanical calculators.","example":"That metadata makes it much easier for the search engine to crunch the data for queries."},{"definition":"To grind or press with violence and noise."},{"definition":"To emit a grinding or crunching noise."},{"definition":"To compress (data) using a particular algorithm, so that it can be restored by decrunching."},{"definition":"To make employees work overtime in order to meet a deadline in the development of a project."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɹʌntʃɪz/"}]},{"word":"SPHAGNUM","idx":74102,"count":167924,"meanings":[{"definitions":[{"definition":"Any of various widely distributed mosses, of genus Sphagnum, which slowly decompose to form peat."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsfæɡnəm/"}]},{"word":"INFIGHTING","idx":74105,"count":167912,"meanings":[{"definitions":[{"definition":"To fight with allies or other members of the same group."},{"definition":"To box while extremely close to an opponent"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fighting or quarreling among the members of a single group or side."},{"definition":"Fighting with one's opponent closer than arm's length."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"infighting-us"}]},{"word":"HOTELIER","idx":74110,"count":167893,"meanings":[{"definitions":[{"definition":"Someone who runs a hotel"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/oʊ.təl.ˈjeɪ/"},{"text":"/ˌhəʊ.ˈtɛl.i.ə/"},{"text":"/ˌhoʊ.ˈtɛl.i.əɹ/"}]},{"word":"TRANSCENDED","idx":74114,"count":167877,"meanings":[{"definitions":[{"definition":"To pass beyond the limits of something."},{"definition":"To surpass, as in intensity or power; to excel."},{"definition":"To climb; to mount.","example":"lights in the heavens transcending the region of the clouds"}],"partOfSpeech":"ve"}]},{"word":"LEET","idx":74119,"count":167864,"meanings":[{"definitions":[{"definition":"A portion or list, especially a list of candidates for an office; also the candidates themselves."},{"definition":"A regular court, more specifically a court-leet, in which certain lords had jurisdiction over local disputes, or the physical area of this jurisdiction."},{"definition":"The European pollock."},{"definition":"An artificial watercourse, canal or aqueduct, but especially a millrace"},{"definition":"A place where roads meet or cross; intersection"},{"definition":"Abbreviation of leetspeak."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To allow to, not to prevent (+ infinitive, but usually without to).","example":"After he knocked for hours, I decided to let him come in."},{"definition":"To leave.","example":"Let me alone!"},{"definition":"To allow the release of (a fluid).","example":"The physicians let about a pint of his blood, but to no avail."},{"definition":"To allow possession of (a property etc.) in exchange for rent.","example":"I decided to let the farmhouse to a couple while I was working abroad."},{"definition":"To give, grant, or assign, as a work, privilege, or contract; often with out.","example":"to let the building of a bridge;  to let out the lathing and the plastering"},{"definition":"Used to introduce an imperative in the first or third person.","example":"Let P be the point where AB and OX intersect."},{"definition":"To cause (+ bare infinitive).","example":"Can you let me know what time you'll be arriving?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to leetspeak."},{"definition":"Possessing outstanding skill in a field; expert, masterful."},{"definition":"Having superior social rank over others; upper class, elite."},{"definition":"Awesome, typically to describe a feat of skill; cool, sweet."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"leet-ca","text":"/liːt/"}]},{"word":"INTERMEZZO","idx":74123,"count":167831,"meanings":[{"definitions":[{"definition":"A short piece of music or act in the interval of the main spectacle; a theatrical interlude."},{"definition":"A palate cleanser; a small snack with a bright light neutral taste; a fruit; a fresh sparkling wine; or a fruity or milky cocktail; that is served between courses in a meal."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪntɚˈmɛtsoʊ/"},{"text":"/ɪntəˈmɛtsəʊ/"}]},{"word":"REASSEMBLE","idx":74133,"count":167803,"meanings":[{"definitions":[{"definition":"To assemble again"},{"definition":"To put back together; to reverse the process of disassembly"}],"partOfSpeech":"ve"}]},{"word":"AUBERGES","idx":74136,"count":167780,"meanings":[{"definitions":[{"definition":"An inn or hostel."}],"partOfSpeech":"n"}]},{"word":"LEGISLATING","idx":74138,"count":167776,"meanings":[{"definitions":[{"definition":"To pass laws (including the amending or repeal of existing laws)."}],"partOfSpeech":"ve"}]},{"word":"DEXTRAN","idx":74139,"count":167762,"meanings":[{"definitions":[{"definition":"A biopolymer of glucose produced by enzymes of certain bacteria; used as a substitute for blood plasma, and as a stationary phase in chromatography."}],"partOfSpeech":"n"}]},{"word":"BIDETS","idx":74144,"count":167737,"meanings":[{"definitions":[{"definition":"A low-mounted plumbing fixture or type of sink intended for washing the external genitalia and the anus."},{"definition":"A small horse formerly allowed to each trooper or dragoon for carrying his baggage."}],"partOfSpeech":"n"}]},{"word":"COOKOUT","idx":74150,"count":167711,"meanings":[{"definitions":[{"definition":"A gathering for a meal that is cooked and eaten outside; either a domestic barbecue or a larger social event."}],"partOfSpeech":"n"}]},{"word":"BORDELLO","idx":74153,"count":167700,"meanings":[{"definitions":[{"definition":"A brothel"}],"partOfSpeech":"n"}]},{"word":"VIDEOTAPING","idx":74155,"count":167691,"meanings":[{"definitions":[{"definition":"To make a recording of something on videotape"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A recording onto videotape."}],"partOfSpeech":"n"}]},{"word":"FAINTEST","idx":74156,"count":167691,"meanings":[{"definitions":[{"definition":"(of a being) Lacking strength; weak; languid; inclined to lose consciousness","example":"I felt faint after my fifth gin and tonic."},{"definition":"Lacking courage, spirit, or energy; cowardly; dejected"},{"definition":"Barely perceptible; not bright, or loud, or sharp","example":"There was a faint red light in the distance."},{"definition":"Performed, done, or acted, weakly; not exhibiting vigor, strength, or energy","example":"faint efforts"},{"definition":"Slight; minimal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"faintest-us","text":"/ˈfeɪntəst/"}]},{"word":"RUGGEDIZED","idx":74159,"count":167685,"meanings":[{"definitions":[{"definition":"To produce a more rugged version of something, so that it will withstand rough treatment"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Modified to be more rugged, and to withstand rough treatment"}],"partOfSpeech":"j"}]},{"word":"MANAGEMENTS","idx":74160,"count":167681,"meanings":[{"definitions":[{"definition":"Administration; the use of limited resources combined with forecasting, planning, leadership and execution skills to achieve predetermined specific goals."},{"definition":"The executives of an organisation, especially senior executives."},{"definition":"Judicious use of means to accomplish an end.","example":"Excellent time management helped her succeed in all facets of her life."}],"partOfSpeech":"n"}]},{"word":"SUBARACHNOID","idx":74163,"count":167676,"meanings":[{"definitions":[{"definition":"Located or occurring below the arachnoid mater, often specifically between the arachnoid membrane and the pia mater"}],"partOfSpeech":"j"}]},{"word":"STRONGMAN","idx":74166,"count":167666,"meanings":[{"definitions":[{"definition":"Someone who performs feats of strength, sometimes in competitions or in a circus."},{"definition":"A forceful or brutal person, usually a ruler or tyrant."}],"partOfSpeech":"n"}]},{"word":"GENITIVE","idx":74167,"count":167663,"meanings":[{"definitions":[{"definition":"(grammar) An inflection pattern (of any given language) that expresses origin or ownership and possession."},{"definition":"(grammar) A word inflected in the genitive case; a word indicating origin, ownership or possession."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(grammar) Of or pertaining to that case (as the second case of Latin and Greek nouns) which expresses a quality, origin or possession. It corresponds to the possessive case in English."}],"partOfSpeech":"j"}]},{"word":"DIGITISED","idx":74169,"count":167661,"meanings":[{"definitions":[{"definition":"To represent something (such as an image or sound) as a structured sequence of binary digits"},{"definition":"To quantize a continuous or analog value; to convert it into a discrete value"},{"definition":"To finger.","example":"to digitize a pen"}],"partOfSpeech":"ve"}]},{"word":"UNCAPPED","idx":74171,"count":167652,"meanings":[{"definitions":[{"definition":"Not capped (in various senses)."},{"definition":"Not having made an appearance in an international sports match."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To remove a cap or cover from."},{"definition":"To take off one's cap."}],"partOfSpeech":"ve"}]},{"word":"NOGGIN","idx":74174,"count":167642,"meanings":[{"definitions":[{"definition":"A small mug, cup or ladle."},{"definition":"(obsolete outside dialectal) A small measure of spirits equivalent to a gill."},{"definition":"The head."},{"definition":"A signalling molecule involved in embryo development, producing large heads at high concentrations."},{"definition":"A horizontal beam used in the construction of a building, especially to strengthen upright posts."},{"definition":"Rough brick masonry used to fill open spaces."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈnɑɡn̩/"},{"text":"/ˈnɒɡɪn/"},{"audio":"noggin-au"}]},{"word":"SHUTDOWNS","idx":74175,"count":167641,"meanings":[{"definitions":[{"definition":"The action of stopping operations; a closing, of a computer, business, event, etc.","example":"You need to enter your password at startup, but it's not required at shutdown."},{"definition":"A statement, insult, etc. that prevents the opponent from replying further.","example":"When he insulted me, my reply was such a shutdown that he left the room."},{"definition":"An autistic response to stress, etc. where the individual becomes silent and motionless."}],"partOfSpeech":"n"}]},{"word":"FRAGS","idx":74178,"count":167627,"meanings":[{"definitions":[{"definition":"A fragmentation grenade."},{"definition":"A successful kill in a deathmatch game.","example":"I'd been fighting him for ages, and then you stole my frag!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deliberately kill (one's superior officer) with a fragmentation grenade."},{"definition":"To hit with the explosion of a fragmentation grenade."},{"definition":"To kill.","example":"I fragged him but he fell off the ledge afterwards."}],"partOfSpeech":"ve"}]},{"word":"DAYPACK","idx":74190,"count":167566,"meanings":[{"definitions":[{"definition":"A small backpack, suitable for a one-day hike or for carrying books around campus."}],"partOfSpeech":"n"}]},{"word":"MANIFESTOS","idx":74192,"count":167557,"meanings":[{"definitions":[{"definition":"A public declaration of principles, policies, or intentions, especially that of a political party.","example":"A creed is a manifesto of religious or spiritual beliefs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To issue a manifesto"}],"partOfSpeech":"ve"}]},{"word":"DIPOLES","idx":74194,"count":167546,"meanings":[{"definitions":[{"definition":"Any object (such as a magnet, polar molecule or antenna) that is oppositely charged at two points (or poles)"},{"definition":"Any molecule or radical that has delocalised positive and negative charges"},{"definition":"A dipole antenna"}],"partOfSpeech":"n"}]},{"word":"CUTENESS","idx":74198,"count":167536,"meanings":[{"definitions":[{"definition":"The state of being cute (endearingly attractive)."},{"definition":"Acuteness; cunning"}],"partOfSpeech":"n"}]},{"word":"GUARANA","idx":74201,"count":167528,"meanings":[{"definitions":[{"definition":"A tree, Paullinia cupana, native to Venezuela and northern Brazil."},{"definition":"The fruit from this tree."},{"definition":"An edible paste prepared from the seeds of the tree, formed into round or oblong cakes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡwəˈɹɑːnə/"}]},{"word":"DISPERSIONS","idx":74209,"count":167510,"meanings":[{"definitions":[{"definition":"The state of being dispersed; dispersedness."},{"definition":"A process of dispersing."},{"definition":"The degree of scatter of data."},{"definition":"The separation of visible light by refraction or diffraction."},{"definition":"The removal of inflammation."}],"partOfSpeech":"n"}]},{"word":"SKATED","idx":74211,"count":167502,"meanings":[{"definitions":[{"definition":"To move along a surface (ice or ground) using skates."},{"definition":"To skateboard"},{"definition":"To use the skating technique."},{"definition":"To get away with something; to be acquitted of a crime for which one is manifestly guilty."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"skated-uk","text":"/ˈskeɪtɪd/"}]},{"word":"TESTY","idx":74213,"count":167487,"meanings":[{"definitions":[{"definition":"Easily annoyed, irritable."},{"definition":"Marked by impatience or ill humor.","example":"He made testy remarks."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɛsti/"}]},{"word":"SWINGMAN","idx":74215,"count":167477,"meanings":[{"definitions":[{"definition":"A player who can swing between two different positions, often the small forward and shooting guard positions in basketball."}],"partOfSpeech":"n"}]},{"word":"PHYSIOLOGIST","idx":74221,"count":167433,"meanings":[{"definitions":[{"definition":"A person who studies or specializes in physiology."}],"partOfSpeech":"n"}]},{"word":"IMPRISON","idx":74222,"count":167427,"meanings":[{"definitions":[{"definition":"To put in or as if in prison; confine."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪmˈpɹɪzən/"}]},{"word":"BERETS","idx":74223,"count":167414,"meanings":[{"definitions":[{"definition":"A type of round, brimless cap with a soft top and a headband to secure it to the head; usually culturally associated with France."}],"partOfSpeech":"n"}]},{"word":"REPELLED","idx":74224,"count":167409,"meanings":[{"definitions":[{"definition":"To turn (someone) away from a privilege, right, job, etc."},{"definition":"To reject, put off (a request, demand etc.)."},{"definition":"To ward off (a malignant influence, attack etc.)."},{"definition":"To drive back (an assailant, advancing force etc.)."},{"definition":"To force away by means of a repulsive force."},{"definition":"To cause repulsion or dislike in; to disgust."},{"definition":"To save (a shot)."}],"partOfSpeech":"ve"}]},{"word":"BARBIES","idx":74228,"count":167390,"meanings":[{"definitions":[{"definition":"A barbecue (apparatus for grilling)."},{"definition":"A barbecue (event: cookout)."},{"definition":"A barbiturate."}],"partOfSpeech":"n"}]},{"word":"BREWPUB","idx":74230,"count":167384,"meanings":[{"definitions":[{"definition":"A public house with a brewery (usually a microbrewery) attached."}],"partOfSpeech":"n"}]},{"word":"MARQUESS","idx":74233,"count":167372,"meanings":[{"definitions":[{"definition":"A title of nobility for a man ranking beneath a duke and above an earl."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɑɹ.kwɪs/"},{"text":"/ˈmɑː.kwɪs/"}]},{"word":"PRECIPITATES","idx":74239,"count":167346,"meanings":[{"definitions":[{"definition":"To make something happen suddenly and quickly.","example":"it precipitated their success"},{"definition":"To throw an object or person from a great height."},{"definition":"To send violently into a certain state or condition.","example":"we were precipitated into a conflict"},{"definition":"To come out of a liquid solution into solid form.","example":"Adding the acid will cause the salt to precipitate."},{"definition":"To separate a substance out of a liquid solution into solid form."},{"definition":"To have water in the air fall to the ground, for example as rain, snow, sleet, or hail; be deposited as condensed droplets.","example":"It will precipitate tomorrow, but we don't know whether as rain or snow."},{"definition":"To cause (water in the air) to condense or fall to the ground."},{"definition":"To fall headlong."},{"definition":"To act too hastily; to be precipitous."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A product resulting from a process, event, or course of action"},{"definition":"A solid that exits the liquid phase of a solution"}],"partOfSpeech":"n"}]},{"word":"MORTISE","idx":74241,"count":167338,"meanings":[{"definitions":[{"definition":"A hole that is made to receive a tenon so as to form a joint."},{"definition":"Stability; power of adhesion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut a mortise in."},{"definition":"To join by a mortise and tenon."},{"definition":"To adjust the horizontal space between selected pairs of letters; to kern."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈmɔː(ɹ).təs/"}]},{"word":"UNCONVINCING","idx":74244,"count":167332,"meanings":[{"definitions":[{"definition":"To cause to abandon a conviction."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not convincing, plausible or believable","example":"He gave me an unconvincing explanation of the fault, but I have my doubts."}],"partOfSpeech":"j"}]},{"word":"PEES","idx":74250,"count":167310,"meanings":[{"definitions":[{"definition":"Urine."},{"definition":"The name of the Latin-script letter P.","example":"Mind your pees and cues."},{"definition":"The bill of an anchor."},{"definition":"The sliding weight on a steelyard."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To urinate.","example":"The schoolboy called out to his friend while he was peeing in the urinal."},{"definition":"(mildly vulgar) To drizzle.","example":"It's peeing with rain."}],"partOfSpeech":"ve"}]},{"word":"TALLIS","idx":74251,"count":167309,"meanings":[{"definitions":[{"definition":"A traditional Jewish prayer shawl with tassels which covers the chest and upper part of the back."}],"partOfSpeech":"n"}]},{"word":"REORDERED","idx":74252,"count":167307,"meanings":[{"definitions":[{"definition":"To place in a new order; to rearrange.","example":"The books were sorted by title, but I'm going to reorder them by author's surname."},{"definition":"To order (a product, etc.) again.","example":"We reorder printer paper about once a month."},{"definition":"To order or command again; to repeat an instruction to."}],"partOfSpeech":"ve"}]},{"word":"ICEBOX","idx":74254,"count":167291,"meanings":[{"definitions":[{"definition":"A box or compartment containing ice."},{"definition":"A compartment in a refrigerator that is colder than the rest of the refrigerator and is used as a freezer."},{"definition":"A refrigerator."},{"definition":"A prison."},{"definition":"A morgue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Agreeable, awesome. (as a superlative of cool)"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈʌɪsbɒks/"},{"audio":"icebox-au"}]},{"word":"SCOUTER","idx":74257,"count":167272,"meanings":[{"definitions":[{"definition":"A stoneworker who removes large projections by boring slanting or transverse holes and using wedges etc. to split the stone."}],"partOfSpeech":"n"}]},{"word":"GRENACHE","idx":74258,"count":167272,"meanings":[{"definitions":[{"definition":"A specific widely-planted variety of red wine grape, or a wine made from such grapes"}],"partOfSpeech":"n"}]},{"word":"DISBURSING","idx":74262,"count":167258,"meanings":[{"definitions":[{"definition":"To pay out, expend; usually from a public fund or treasury."}],"partOfSpeech":"ve"}]},{"word":"SLEUTHS","idx":74263,"count":167253,"meanings":[{"definitions":[{"definition":"A detective."},{"definition":"A sleuth-hound; a bloodhound."},{"definition":"An animal’s trail or track."},{"definition":"Slowness; laziness, sloth."},{"definition":"A collective term for a group of bears."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a detective; to try to discover who committed a crime, or, more generally, to solve a mystery."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/sluːθs/"}]},{"word":"METHICILLIN","idx":74266,"count":167241,"meanings":[{"definitions":[{"definition":"An antibiotic drug, chemically related to penicillin, often used against strains of bacteria which have become resistant to penicillin."}],"partOfSpeech":"n"}]},{"word":"PLUNDERING","idx":74267,"count":167239,"meanings":[{"definitions":[{"definition":"To pillage, take or destroy all the goods of, by force (as in war); to raid, sack.","example":"The mercenaries plundered the small town."},{"definition":"To take (goods) by pillage.","example":"The mercenaries plundered all the goods they found."},{"definition":"To take by force or wrongfully; to commit robbery or looting, to raid.","example":"“Now to plunder, mateys!” screamed a buccaneer, to cries of “Arrgh!” and “Aye!” all around."},{"definition":"To make extensive (over)use of, as if by plundering; to use or use up wrongfully.","example":"The miners plundered the jungle for its diamonds till it became a muddy waste."},{"definition":"To take unexpectedly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who plunders; pillaging or looting; plunder."}],"partOfSpeech":"n"}]},{"word":"ABHORRENT","idx":74270,"count":167235,"meanings":[{"definitions":[{"definition":"Inconsistent with, or far removed from, something; strongly opposed","example":"abhorrent thoughts"},{"definition":"Contrary to something; discordant."},{"definition":"Abhorring; detesting; having or showing abhorrence; loathing."},{"definition":"Detestable or repugnant."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/æbˈhɑɹ.ənt/"},{"text":"/æbˈ(h)ɒɹ.ənt/"}]},{"word":"BELATEDLY","idx":74276,"count":167222,"meanings":[{"definitions":[{"definition":"In a belated manner; tardily"}],"partOfSpeech":"v"}]},{"word":"COTILLION","idx":74284,"count":167198,"meanings":[{"definitions":[{"definition":"A bold dance performed in groups of eight where women lift their skirts to display their ankles.","example":"1797 Mrs. Hughes now joined them, and asked Miss Tilney if she was ready to go. \"I hope I shall have the pleasure of seeing you again soon,\" said Catherine. \"Shall you be at the cotillion ball tomorrow?\" Jane Austin Northanger Abbey (written 1797 first published 1818) Chapter 10."},{"definition":"The music regulating the cotillion.","example":"1848 I kept a parlor open for the reception of visitors, many came here to practise with me, and many more to listen to us—several young men put themselves under my tuition, and although I had never been taught myself, they progressed finely in their studies and I soon brought out, not only the best field music, but also for dinners, balls, cotilion and tea parties, weddings, &c. THRILLING SKETCH OF THE LIFE OF THE DISTINGUISHED CHIEF OKAH TUBBEE ALIAS, WM. CHUBBEE, Son of the Head Chief, Mosholeh Tubbee, of theChoctaw Nation of Indians. BY REV. L. L. ALLEN, AUTHOR OF “PENCILLINGS UPON THE RIO GRANDE,” &c. NEW YORK, 1848. ENTERED according to the Act of Congress, in the year 1848, by Okah Tubbee, alias William Chubbee, in the Clerk's Office of the District Court of the United States, for the Southern District of New York. AN ESSAY UPON THE INDIAN CHARACTER.http//docsouth.unc.edu/neh/tubbee1848/tubbee1848.xml"},{"definition":"Ellipsis of cotillion ball; a coming-of-age party meant to present girls newly transitioned into womanhood to the community for courtship."},{"definition":"A kind of woollen material for women's skirts."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dance the cotillion."}],"partOfSpeech":"ve"}]},{"word":"FLOWMETERS","idx":74287,"count":167193,"meanings":[{"definitions":[{"definition":"Any of various devices used to measure the flow of a fluid through a pipe, etc."}],"partOfSpeech":"n"}]},{"word":"STYMIED","idx":74291,"count":167178,"meanings":[{"definitions":[{"definition":"To thwart or stump; to cause to fail or to leave hopelessly puzzled, confused, or stuck.","example":"If writing dates has you stymied at times, it is probably for one of two reasons. https//www.grammarly.com/blog/how-to-write-dates/"},{"definition":"To bring into the position of, or impede by, a stymie."}],"partOfSpeech":"ve"}]},{"word":"REBELLIONS","idx":74294,"count":167172,"meanings":[{"definitions":[{"definition":"Armed resistance to an established government or ruler.","example":"The government is doing its best to stop rebellion in the country."},{"definition":"Defiance of authority or control; the act of rebelling.","example":"Having a tattoo was Mathilda's personal rebellion against her parents."},{"definition":"An organized, forceful subversion of the law of the land in an attempt to replace it with another form of government.","example":"The army general led a successful rebellion and became president of the country."}],"partOfSpeech":"n"}]},{"word":"SYMPATHIZERS","idx":74295,"count":167170,"meanings":[{"definitions":[{"definition":"A person who sympathizes (with a political cause, a side in a conflict, etc.); a supporter.","example":"His reputation was ruined when it was revealed that he had been a Nazi sympathizer before the war."},{"definition":"A person who has, shows or expresses sympathy (with another person or people); a person who enters into the feelings of another."}],"partOfSpeech":"n"}]},{"word":"SCRIBBLING","idx":74297,"count":167158,"meanings":[{"definitions":[{"definition":"To write or draw carelessly and in a hurry"},{"definition":"To doodle"},{"definition":"To card or tease (wool) coarsely; to run through a scribbler."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That which has been scribbled, written in a scrawled or careless hand."},{"definition":"The carding of wool or cotton."}],"partOfSpeech":"n"}]},{"word":"EMISSARY","idx":74303,"count":167139,"meanings":[{"definitions":[{"definition":"An agent sent on a mission to represent the interests of someone else."},{"definition":"A venous channel in the skull."},{"definition":"An underground channel by which the water of a lake escapes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛmɪˌsɛɹi/"}]},{"word":"PALEOZOIC","idx":74304,"count":167135,"meanings":[{"definitions":[{"definition":"Of a geologic era within the Phanerozoic eon that comprises the Cambrian, Ordovician, Silurian, Devonian, Carboniferous and Permian periods from about 542 to 250 million years ago, from the age of trilobites to that of reptiles."}],"partOfSpeech":"j"}]},{"word":"MUSKRAT","idx":74306,"count":167121,"meanings":[{"definitions":[{"definition":"A large aquatic rodent (Ondatra zibethicus)."},{"definition":"Any of several species of shrews in the family Soricidae, especially the Asian house shrew, Suncus murinus"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmʌskɹæt/"}]},{"word":"INHUMANITY","idx":74317,"count":167072,"meanings":[{"definitions":[{"definition":"The lack of compassion."},{"definition":"An inhuman act."}],"partOfSpeech":"n"}]},{"word":"SOUTHPAW","idx":74318,"count":167070,"meanings":[{"definitions":[{"definition":"One who is left-handed, especially in sports."},{"definition":"A boxer who leads with the right hand and guards with the left"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"southpaw-us","text":"/ˈsaʊθˌpɔː/"},{"audio":"southpaw-au","text":"/ˈsaʊθˌpɔː/"}]},{"word":"BELITTLE","idx":74327,"count":167035,"meanings":[{"definitions":[{"definition":"To knowingly say that something is smaller or less important than it actually is, especially as a way of showing contempt or deprecation.","example":"Don't belittle your colleagues."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"belittle-us","text":"/bɨˈlɪt.əl/"}]},{"word":"REPUDIATED","idx":74330,"count":167020,"meanings":[{"definitions":[{"definition":"To reject the truth or validity of; to deny."},{"definition":"To refuse to have anything to do with; to disown."},{"definition":"To refuse to pay or honor (a debt)."},{"definition":"To be repudiated."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Disowned"},{"definition":"Rejected as untrue or unjust"},{"definition":"Divorced such as by a spouse"}],"partOfSpeech":"j"}]},{"word":"CAIMAN","idx":74337,"count":166982,"meanings":[{"definitions":[{"definition":"Any of the relatively small crocodilians of genus Caiman, within family Alligatoridae."},{"definition":"A semi-aquatic lizard, of the genus Dracaena, found in South America. To differentiate from caimans, they are referred to as caiman lizards."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkeɪ.mən/"}]},{"word":"IMPECCABLY","idx":74345,"count":166958,"meanings":[{"definitions":[{"definition":"In a perfect or flawless manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɪmˈpɛk.ə.bli/"},{"audio":"impeccably-au"}]},{"word":"MONONUCLEOSIS","idx":74346,"count":166957,"meanings":[{"definitions":[{"definition":"A viral infection marked by extreme fatigue, high fever, and swollen lymph nodes."}],"partOfSpeech":"n"}]},{"word":"MUMBLES","idx":74348,"count":166947,"meanings":[{"definitions":[{"definition":"A quiet or unintelligible vocalization; a low tone of voice.","example":"All I could hear was a mumble from the next room."}],"partOfSpeech":"n"}]},{"word":"NITROCELLULOSE","idx":74354,"count":166928,"meanings":[{"definitions":[{"definition":"A cotton-like material, made from cellulose by the action of nitric and sulphuric acids, used in the manufacture of explosives, collodion etc."}],"partOfSpeech":"n"}]},{"word":"SPECIALISM","idx":74358,"count":166913,"meanings":[{"definitions":[{"definition":"Speciality."},{"definition":"The concentration of one's efforts upon a particular field of study."}],"partOfSpeech":"n"}]},{"word":"BRAINED","idx":74360,"count":166905,"meanings":[{"definitions":[{"definition":"To dash out the brains of; to kill by smashing the skull."},{"definition":"To strike (someone) on the head."},{"definition":"To destroy; to put an end to."},{"definition":"To conceive in the mind; to understand."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in combination, sometimes figurative) Having a particular kind or number of brain."}],"partOfSpeech":"j"}]},{"word":"CONCEPTUALIZED","idx":74362,"count":166900,"meanings":[{"definitions":[{"definition":"To interpret a phenomenon by forming a concept."},{"definition":"To conceive the idea for something."}],"partOfSpeech":"ve"}]},{"word":"TUNEUP","idx":74364,"count":166896,"meanings":[{"definitions":[{"definition":"A series of adjustments to an engine in order to improve its performance"},{"definition":"A series of preparations for vigorous exercise; a warm-up"},{"definition":"A match or race (frequently one exhibition in nature) contested as preparation for a match or race of high stakes."}],"partOfSpeech":"n"}]},{"word":"PASTS","idx":74365,"count":166896,"meanings":[{"definitions":[{"definition":"The period of time that has already happened, in contrast to the present and the future.","example":"a book about a time machine that can transport people back into the past"},{"definition":"(grammar) The past tense."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pæsts/"},{"text":"/pɑːsts/"}]},{"word":"ABSEILING","idx":74368,"count":166892,"meanings":[{"definitions":[{"definition":"To descend a steep or vertical drop using a rope with a mechanical friction device or (classic abseil) by wrapping the rope around the body; to rappel."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process or act of abseiling."}],"partOfSpeech":"n"}]},{"word":"SYMPATHETICALLY","idx":74369,"count":166891,"meanings":[{"definitions":[{"definition":"Owing to or showing evidence of \"sympathy\", or affinity; happening through or demonstrating correspondences, whether occult or physiological."},{"definition":"In a manner which demonstrates a sharing in the feelings of others; compassionately."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/sɪmpəˈθɛtɪk(ə)li/"}]},{"word":"TEMPURA","idx":74370,"count":166884,"meanings":[{"definitions":[{"definition":"A Japanese dish made by deep-frying vegetables, seafood, or other foods in a light batter."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛmpʊɹə/"}]},{"word":"FLOATATION","idx":74385,"count":166810,"meanings":[{"definitions":[{"definition":"A state of floating, or being afloat."},{"definition":"The ability (as of a tire or snowshoes) to stay on the surface of soft ground or snow."},{"definition":"(chemical engineering) A process of separating minerals by agitating a mixture with water and detergents etc; selected substances being carried to the surface in air bubbles."},{"definition":"The launching onto the market of a tranch of stocks or shares, usually a new issue."}],"partOfSpeech":"n"}]},{"word":"COMPOSES","idx":74387,"count":166804,"meanings":[{"definitions":[{"definition":"To make something by merging parts.","example":"The editor composed a historical journal from many individual letters."},{"definition":"To make up the whole; to constitute.","example":"A church is composed of its members."},{"definition":"To comprise."},{"definition":"To construct by mental labor; to think up; particularly, to produce or create a literary or musical work.","example":"It's difficult to compose without absolute silence."},{"definition":"(sometimes reflexive) To calm; to free from agitation.","example":"The defendant couldn't compose herself and was found in contempt."},{"definition":"To arrange the elements of a photograph or other picture."},{"definition":"To settle (an argument, dispute etc.); to come to a settlement."},{"definition":"To arrange in proper form; to reduce to order; to put in proper state or condition."},{"definition":"To arrange (types) in a composing stick for printing; to typeset."}],"partOfSpeech":"ve"}]},{"word":"PEONIES","idx":74388,"count":166802,"meanings":[{"definitions":[{"definition":"A flowering plant of the genus Paeonia with large fragrant flowers."},{"definition":"A dark red colour."}],"partOfSpeech":"n"}]},{"word":"KERSEY","idx":74394,"count":166778,"meanings":[{"definitions":[{"definition":"A type of rough woollen cloth."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɝzi/"},{"text":"/ˈkɜːzi/"}]},{"word":"OVERLEAF","idx":74396,"count":166771,"meanings":[{"definitions":[{"definition":"On the other side of a page"}],"partOfSpeech":"v"}]},{"word":"TAXMAN","idx":74399,"count":166762,"meanings":[{"definitions":[{"definition":"(sometimes derogatory) A tax collector."},{"definition":"(sometimes derogatory) A tax-collecting organ, personified."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtaksman/"}]},{"word":"DIGITISATION","idx":74400,"count":166757,"meanings":[{"definitions":[{"definition":"The conversion of data from analog to digital or binary."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdɪdʒɪtaɪˈzeɪʃən/"}]},{"word":"RASP","idx":74401,"count":166753,"meanings":[{"definitions":[{"definition":"A coarse file, on which the cutting prominences are distinct points raised by the oblique stroke of a sharp punch, instead of lines raised by a chisel, as on the true file."},{"definition":"The sound made by this tool when used, or any similar sound.","example":"the rasp of her perpetual cough"},{"definition":"The raspberry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use a rasp."},{"definition":"To make a noise similar to the one a rasp makes in use; to utter rasps."},{"definition":"To work something with a rasp.","example":"to rasp wood to make it smooth; to rasp bones to powder"},{"definition":"To grate harshly upon; to offend by coarse or rough treatment or language.","example":"His insults rasped my temper."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rasp-1-us"}]},{"word":"SEEDERS","idx":74403,"count":166733,"meanings":[{"definitions":[{"definition":"A device used to plant seeds; a seed drill"},{"definition":"An implement used to remove the seeds from fruit etc."},{"definition":"A person who seeds clouds in order to make it rain"},{"definition":"(file sharing) A person connected to a peer-to-peer network who has a complete or partial copy of a given file and makes it available for downloading."},{"definition":"A process that seeds a random number generator."}],"partOfSpeech":"n"}]},{"word":"BOBSLEIGH","idx":74404,"count":166731,"meanings":[{"definitions":[{"definition":"A sleigh for saw logs or heavy timber resting on two pairs of two short runners"},{"definition":"A winter sport in which teams make timed runs down narrow, twisting, banked purpose-built iced tracks in a gravity-powered sled."},{"definition":"The sled used in the sport of bobsleigh"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ride a bobsleigh."}],"partOfSpeech":"ve"}]},{"word":"DEMYSTIFIED","idx":74413,"count":166696,"meanings":[{"definitions":[{"definition":"To remove the mystery from something; to explain or clarify.","example":"The article was written to demystify the mechanics of the internal combustion engine."}],"partOfSpeech":"ve"}]},{"word":"PETERSHAM","idx":74414,"count":166692,"meanings":[{"definitions":[{"definition":"A rough, knotted woollen cloth, used chiefly for men's overcoats."},{"definition":"A coat made of that material."}],"partOfSpeech":"n"}]},{"word":"QUEENIE","idx":74417,"count":166678,"meanings":[{"definitions":[{"definition":"An effeminate man; a male homosexual (especially as a term of address)."},{"definition":"The queen scallop."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkwiːni/"}]},{"word":"WHACKING","idx":74420,"count":166659,"meanings":[{"definitions":[{"definition":"To hit, slap or strike."},{"definition":"To kill, bump off."},{"definition":"To share or parcel out; often with up.","example":"to whack the spoils of a robbery"},{"definition":"To beat convincingly; to thrash."},{"definition":"(usually in the negative) To surpass; to better."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A beating."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Exceptionally large; whopping (often followed by an adjective such as great or big)."}],"partOfSpeech":"j"}]},{"word":"INFIELDER","idx":74422,"count":166648,"meanings":[{"definitions":[{"definition":"A player who plays in the infield, which is the inner portion of the field."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"infielder-au"}]},{"word":"BIORHYTHMS","idx":74431,"count":166614,"meanings":[{"definitions":[{"definition":"Any cyclic biological or physiological pattern or activity"},{"definition":"(pseudoscience) Any of three sinusoidal graphs, normally plotted by computer, having a person's birthdate as origin, that that are supposed to give meaningful information about emotional levels, physical energy levels, and mental/psychic sensitivity."}],"partOfSpeech":"n"}]},{"word":"INTERLINKED","idx":74433,"count":166611,"meanings":[{"definitions":[{"definition":"To link together."},{"definition":"To link (two or more things) together."}],"partOfSpeech":"ve"}]},{"word":"INTERLACE","idx":74435,"count":166586,"meanings":[{"definitions":[{"definition":"(visual arts) A decorative element found especially in early medieval art","example":"Hiberno-Saxon interlace patterns"},{"definition":"A technique of improving the picture quality of a video signal primarily on CRT devices without consuming extra bandwidth."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cross one with another.","example":"to interlace wires"},{"definition":"To mingle; to blend."},{"definition":"To cross one another as if woven together; to intertwine; to blend intricately.","example":"interlacing branches"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈin.tɚ.leɪs/"}]}]