[{"word":"REACTING","idx":26546,"count":984631,"meanings":[{"definitions":[{"definition":"To act or perform a second time; to do over again; to reenact."},{"definition":"To return an impulse or impression; to resist the action of another body by an opposite force","example":"Every body reacts on the body that impels it from its natural state."},{"definition":"To act upon each other; to exercise a reciprocal or a reverse effect, as two or more chemical agents; to act in opposition."},{"definition":"To cause chemical agents to react; to cause one chemical agent to react with another."}],"partOfSpeech":"ve"}]},{"word":"INHALED","idx":26547,"count":984613,"meanings":[{"definitions":[{"definition":"To draw air into the lungs, through the nose or mouth by action of the diaphragm."},{"definition":"To draw air or any form of gas (either in a pure form, or mixed with small particles in form of aerosols/smoke -sometimes stemming from a medicament) into the lungs, through the nose or mouth by action of the diaphragm."},{"definition":"To eat very quickly."}],"partOfSpeech":"ve"}]},{"word":"FUSES","idx":26548,"count":984514,"meanings":[{"definitions":[{"definition":"A cord that, when lit, conveys the fire to some explosive device."},{"definition":"The mechanism that ignites the charge in an explosive device."},{"definition":"A device to prevent the overloading of an electrical circuit, containing a component that melts and interrupts the current when too high a load is passed through it."},{"definition":"Indicating a tendency to lose one's temper.","example":"When talking about being laid off, he has a short fuse."},{"definition":"A friction match for smokers' use, having a bulbous head which when ignited is not easily blown out even in a gale of wind."},{"definition":"A kind of match made of paper impregnated with niter and having the usual igniting tip."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To melt together; to blend; to mix indistinguishably."},{"definition":"To melt together."},{"definition":"To furnish with or install a fuse."},{"definition":"To form a bicyclic compound from two similar or different types of ring such that two or more atoms are shared between the resulting rings"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈfjuːzɪz/"}]},{"word":"COLLIDE","idx":26552,"count":984371,"meanings":[{"definitions":[{"definition":"To impact directly, especially if violent.","example":"When a body collides with another, then momentum is conserved."},{"definition":"To come into conflict, or be incompatible.","example":"China collided with the modern world."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"collide-us"},{"text":"/kəˈlɑɪd/"}]},{"word":"SEGREGATED","idx":26555,"count":984139,"meanings":[{"definitions":[{"definition":"To separate, especially by social policies that directly or indirectly keep races or ethnic groups apart."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a person or thing) Separated or isolated from others, or from another group."},{"definition":"(of an institution) Having access restricted to certain groups, or excluding certain groups."}],"partOfSpeech":"j"}]},{"word":"BLINDED","idx":26557,"count":983949,"meanings":[{"definitions":[{"definition":"To make temporarily or permanently blind.","example":"Don't wave that pencil in my face - do you want to blind me?"},{"definition":"To curse."},{"definition":"To darken; to obscure to the eye or understanding; to conceal."},{"definition":"To cover with a thin coating of sand and fine gravel, for example a road newly paved, in order that the joints between the stones may be filled."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Deprived of sight."},{"definition":"Lacking intellectual discernment, for example because of greed or stupidity."},{"definition":"Covered by blinds.","example":"blinded windows"},{"definition":"(of a bus) Displaying a particular destination or route number on the blinds.","example":"The bus was blinded for route 100 to the city centre."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈblaɪnd.əd/"}]},{"word":"AVENGERS","idx":26558,"count":983939,"meanings":[{"definitions":[{"definition":"One who avenges or vindicates","example":"an avenger of blood"},{"definition":"One who takes vengeance."}],"partOfSpeech":"n"}]},{"word":"TECHNOLOGIST","idx":26559,"count":983689,"meanings":[{"definitions":[{"definition":"A scientist or an engineer who specializes in a particular technology, or who uses technology in a particular field."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tɛkˈnɑləd͡ʒɪst/"},{"text":"/tɛkˈnɒləd͡ʒɪst/"}]},{"word":"MADRAS","idx":26560,"count":983628,"meanings":[{"definitions":[{"definition":"A brightly colored cotton fabric with a checked or striped pattern."},{"definition":"A large handkerchief of this fabric, worn on the head in the West Indies."}],"partOfSpeech":"n"}]},{"word":"SACRIFICING","idx":26561,"count":983589,"meanings":[{"definitions":[{"definition":"To offer (something) as a gift to a deity."},{"definition":"To give away (something valuable) to get at least a possibility of gaining something else of value (such as self-respect, trust, love, freedom, prosperity), or to avoid an even greater loss.","example":"Venison has many advantages over meat from factory farms, although it still requires a hunter to sacrifice the life of a deer."},{"definition":"To trade (a value of higher worth) for something of lesser worth in order to gain something else valued more, such as an ally or business relationship, or to avoid an even greater loss; to sell without profit to gain something other than money."},{"definition":"To intentionally give up (a piece) in order to improve one’s position on the board."},{"definition":"To advance (a runner on base) by batting the ball so it can be caught or fielded, placing the batter out, but with insufficient time to put the runner out."},{"definition":"To sell at a price less than the cost or actual value."},{"definition":"To destroy; to kill."}],"partOfSpeech":"ve"}]},{"word":"PIGMENTS","idx":26562,"count":983568,"meanings":[{"definitions":[{"definition":"Any color in plant or animal cells","example":"Chlorophyll is the pigment responsible for most plants' green colouring."},{"definition":"A dry colorant, usually an insoluble powder"},{"definition":"Wine flavoured with spices and honey."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add color or pigment to something."}],"partOfSpeech":"ve"}]},{"word":"FAITHS","idx":26563,"count":983524,"meanings":[{"definitions":[{"definition":"A trust or confidence in the intentions or abilities of a person, object, or ideal from prior empirical evidence.","example":"I have faith in the goodness of my fellow man."},{"definition":"The process of forming or understanding abstractions, ideas, or beliefs, without empirical evidence, experience or observation.","example":"I have faith in the healing power of crystals."},{"definition":"A religious or spiritual belief system.","example":"The Christian faith."},{"definition":"An obligation of loyalty or fidelity and the observance of such an obligation.","example":"He acted in good faith to restore broken diplomatic ties after defeating the incumbent."},{"definition":"Credibility or truth."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/feɪθs/"}]},{"word":"IMPACTING","idx":26564,"count":983514,"meanings":[{"definitions":[{"definition":"To collide or strike, the act of impinging.","example":"When the hammer impacts the nail, it bends."},{"definition":"To compress; to compact; to press into something or pack together.","example":"The footprints of birds do not impact the soil in the way those of dinosaurs do."},{"definition":"To influence; to affect; to have an impact on.","example":"I can make the changes, but it will impact the schedule."},{"definition":"To stamp or impress onto something.","example":"Ideas impacted on the mind."}],"partOfSpeech":"ve"}]},{"word":"AQUARIUMS","idx":26566,"count":983409,"meanings":[{"definitions":[{"definition":"A tank, often made of glass, for keeping live fish or other aquatic animals."},{"definition":"A public place where live fish and other aquatic animals are exhibited."}],"partOfSpeech":"n"}]},{"word":"TINKER","idx":26567,"count":983290,"meanings":[{"definitions":[{"definition":"An itinerant tinsmith and mender of household utensils made of metal."},{"definition":"A member of the Irish Traveller community. A gypsy."},{"definition":"(usually with \"little\") A mischievous person, especially a playful, impish youngster."},{"definition":"Someone who repairs, or attempts repair, on anything mechanical, or who invents such devices; one who tinkers; a tinkerer."},{"definition":"The act of repair or invention."},{"definition":"A hand mortar."},{"definition":"Any of various fish: the chub mackerel, the silverside, the skate, or a young mackerel about two years old."},{"definition":"A bird, the razor-billed auk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fiddle with something in an attempt to fix, mend or improve it, especially in an experimental or unskilled manner."},{"definition":"To work as a tinker."},{"definition":"To tinker with; to tweak or attempt to fix."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtɪŋkɚ/"},{"text":"/ˈtɪŋkə(ɹ)/"}]},{"word":"ECHOED","idx":26569,"count":983286,"meanings":[{"definitions":[{"definition":"(of a sound or sound waves) To reflect off a surface and return."},{"definition":"To reflect back (a sound)."},{"definition":"(by extension) To repeat (another's speech, opinion etc.).","example":"Sid echoed his father's point of view."},{"definition":"To repeat its input as input to some other device or system."},{"definition":"(whist) To give the echo signal, informing one's partner about cards one holds."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"echoed-us","text":"/ˈɛkoʊd/"}]},{"word":"RIGS","idx":26570,"count":983211,"meanings":[{"definitions":[{"definition":"The rigging of a sailing ship or other such craft."},{"definition":"Special equipment or gear used for a particular purpose.","example":"The climbers each had a different rig for climbing that particular rockface."},{"definition":"A large truck such as a semi-tractor.","example":"Every rig at the truckstop had custom-made mud-flaps."},{"definition":"The special apparatus used for drilling wells."},{"definition":"A costume or an outfit.","example":"My sister and I always made our own rigs for Halloween."},{"definition":"A computer case, often modified for looks."},{"definition":"An imperfectly castrated horse, sheep etc."},{"definition":"Radio equipment, especially a citizen's band transceiver."},{"definition":"A model outfitted with parameterized controls for animation."},{"definition":"A ridge."},{"definition":"A wanton; one given to unbecoming conduct."},{"definition":"A promiscuous woman."},{"definition":"A sportive or unbecoming trick; a frolic."},{"definition":"A blast of wind."},{"definition":"An algebraic structure similar to a ring, but without the requirement that every element have an additive inverse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fit out with a harness or other equipment."},{"definition":"To equip and fit (a ship) with sails, shrouds, and yards."},{"definition":"To dress or clothe in some costume."},{"definition":"To make or construct something in haste or in a makeshift manner.","example":"rig up a makeshift shelter"},{"definition":"To manipulate something dishonestly for personal gain or discriminatory purposes.","example":"to rig an election"},{"definition":"To make free with; hence, to steal; to pilfer."},{"definition":"To outfit a model with controls for animation."},{"definition":"To play the wanton; to act in an unbecoming manner; to play tricks."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹɪɡz/"}]},{"word":"GAZING","idx":26572,"count":983196,"meanings":[{"definitions":[{"definition":"To stare intently or earnestly.","example":"In fact, for Antonioni this gazing is probably the most fundamental of all cognitive activities ... (from Thinking in the Absence of Image)"},{"definition":"To stare at."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which somebody gazes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gazing-us","text":"/ˈɡeɪzɪŋ/"}]},{"word":"ARGININE","idx":26573,"count":983141,"meanings":[{"definitions":[{"definition":"An amino acid found in animal foods that plays an important role in several physiological processes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɑɹɡɪniːn/"}]},{"word":"SKEPTICISM","idx":26574,"count":983083,"meanings":[{"definitions":[{"definition":"The practice or philosophy of being a skeptic."},{"definition":"A studied attitude of questioning and doubt"},{"definition":"The doctrine that absolute knowledge is not possible"},{"definition":"A methodology that starts from a neutral standpoint and aims to acquire certainty though scientific or logical observation."},{"definition":"Doubt or disbelief of religious doctrines"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈskɛp.tɪˌsɪ.zəm/"}]},{"word":"MOOT","idx":26575,"count":983079,"meanings":[{"definitions":[{"definition":"A moot court."},{"definition":"A system of arbitration in many areas of Africa in which the primary goal is to settle a dispute and reintegrate adversaries into society rather than assess penalties."},{"definition":"A gathering of Rovers, usually in the form of a camp lasting 2 weeks."},{"definition":"A social gathering of pagans, normally held in a public house."},{"definition":"An assembly (usually for decision-making in a locality)."},{"definition":"A ring for gauging wooden pins."},{"definition":"A whisper, or an insinuation, also gossip or rumors.","example":"Haven't you heard the moot, mate? There are going to be layoffs. They are going to shit-can the lot of us."},{"definition":"(rural) Talk.","example":"No, there's no moot of it on the streets."},{"definition":"Vagina."},{"definition":"The stump of a tree; the roots and bottom end of a felled tree."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Subject to discussion (originally at a moot); arguable, debatable, unsolved or impossible to solve.","example":"1903, Walter Crane and Lewis F. Day, Moot Points: Friendly Disputes on Art and Industry Between Walter Crane and Lewis F. Day"},{"definition":"Being an exercise of thought; academic."},{"definition":"Having no practical impact or relevance.","example":"That point may make for a good discussion, but it is moot."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To bring up as a subject for debate, to propose."},{"definition":"To discuss or debate."},{"definition":"To make or declare irrelevant."},{"definition":"To argue or plead in a supposed case."},{"definition":"To talk or speak.","example":"'Tis no boot to moot again of it."},{"definition":"To say, utter, also insinuate.","example":"He could not moot the words."},{"definition":"To take root and begin to grow."},{"definition":"To turn up soil or dig up roots, especially an animal with the snout."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"moot-1-us","text":"/muːt/"},{"audio":"moot-1-au","text":"/muːt/"}]},{"word":"EIGHTIES","idx":26577,"count":982906,"meanings":[{"definitions":[{"definition":"The decade of the 1880s, 1980s, etc."},{"definition":"The decade of one's life from age 80 through age 89."},{"definition":"(temperature, rates) The range between 80 and 89."}],"partOfSpeech":"n"},{"definitions":[{"definition":"From or evoking the 81st through 90th years of a century (chiefly the 1980s).","example":"Sue picked a playlist of eighties music for the dinner to remind her wife of that night they met all those years ago."}],"partOfSpeech":"j"}]},{"word":"TELEVISED","idx":26579,"count":982625,"meanings":[{"definitions":[{"definition":"To broadcast, or be broadcast, by television"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Broadcast by television."}],"partOfSpeech":"j"}]},{"word":"SIMPLISTIC","idx":26582,"count":982397,"meanings":[{"definitions":[{"definition":"Overly simple."},{"definition":"In a manner that simplifies a concept or issue so that its nuance and complexity are lost or important details are overlooked."},{"definition":"Of or relating to simples, or medicinal herbs."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/sɪmˈplɪstɪk/"}]},{"word":"AMPHIBIANS","idx":26585,"count":982133,"meanings":[{"definitions":[{"definition":"An animal of the Amphibia; any four-legged vertebrate that does not have amniotic eggs, living both on land and in water."},{"definition":"A vehicle which can operate on land and water. See Wikipedia article on \"Amphibious aircraft\""}],"partOfSpeech":"n"}]},{"word":"FREEHOLD","idx":26586,"count":982038,"meanings":[{"definitions":[{"definition":"The tenure of property held in fee simple for life."},{"definition":"An estate held by a tenure of this type."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dispense property in this way."}],"partOfSpeech":"ve"}]},{"word":"BRAID","idx":26587,"count":981945,"meanings":[{"definitions":[{"definition":"A sudden movement; a jerk, a wrench."},{"definition":"A weave of three or more strands of fibers, ribbons, cords or hair often for decoration."},{"definition":"A stranded wire composed of a number of smaller wires twisted together"},{"definition":"A tubular sheath made of braided strands of metal placed around a central cable for shielding against electromagnetic interference."},{"definition":"A fancy; freak; caprice."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a sudden movement with, to jerk."},{"definition":"To start into motion."},{"definition":"To weave together, intertwine (strands of fibers, ribbons, etc.); to arrange (hair) in braids."},{"definition":"To mix, or make uniformly soft, by beating, rubbing, or straining, as in preparing food."},{"definition":"To reproach; to upbraid."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Deceitful."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"braid-1-us","text":"/bɹeɪd/"}]},{"word":"ANCE","idx":26588,"count":981759,"meanings":[{"definitions":[{"definition":"(frequency) One and only one time.","example":"I have only once eaten pizza."},{"definition":"(temporal location) Formerly; during some period in the past.","example":"He was once the most handsome man around."},{"definition":"Multiplied by one: indicating that a number is multiplied by one.","example":"Once three is three."},{"definition":"As soon as."},{"definition":"At a future time."}],"partOfSpeech":"v"}]},{"word":"FORESTER","idx":26589,"count":981592,"meanings":[{"definitions":[{"definition":"A person who practices forestry."},{"definition":"A person who lives in a forest."},{"definition":"A moth in the family Zygaenidae."},{"definition":"Any of various nymphalid butterflies of the genus Lethe. Other members of this genus are called tree browns and wood browns."}],"partOfSpeech":"n"}]},{"word":"RESISTED","idx":26590,"count":981525,"meanings":[{"definitions":[{"definition":"To attempt to counter the actions or effects of."},{"definition":"To withstand the actions of."},{"definition":"To oppose."},{"definition":"To be distasteful to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"resisted-us","text":"/ɹəˈzɪstɪd/"}]},{"word":"ENCAPSULATED","idx":26591,"count":981522,"meanings":[{"definitions":[{"definition":"To enclose something as if in a capsule."},{"definition":"To epitomize something by expressing it as a brief summary."},{"definition":"To enclose objects in a common interface in a way that makes them interchangeable, and guards their states from invalid changes."},{"definition":"To enclose data in packets that can be transmitted using a given protocol."}],"partOfSpeech":"ve"}]},{"word":"ALP","idx":26592,"count":981474,"meanings":[{"definitions":[{"definition":"A very high mountain. Specifically, one of the Alps, the highest chain of mountains in Europe."}],"partOfSpeech":"n"}]},{"word":"INJECTOR","idx":26593,"count":981446,"meanings":[{"definitions":[{"definition":"Any of various devices that are used to inject something."},{"definition":"An object that realizes a dependency injection."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˈdʒɛktɚ/"}]},{"word":"MUNRO","idx":26594,"count":981392,"meanings":[{"definitions":[{"definition":"Any Scottish mountain having a height of more than 3,000 feet; named after Sir Hugh Thomas Munro, Scottish mountaineer"}],"partOfSpeech":"n"}]},{"word":"AGAR","idx":26597,"count":981353,"meanings":[{"definitions":[{"definition":"A gelatinous material obtained from red algae, especially Gracilaria species, used as a bacterial culture medium, in electrophoresis and as a food additive."},{"definition":"A culture medium based on this material."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈeɪˌɡɑɹ/"},{"text":"/ˈeɪ.ɡɑː/"}]},{"word":"GRAINED","idx":26602,"count":981150,"meanings":[{"definitions":[{"definition":"To feed grain to."},{"definition":"To make granular; to form into grains."},{"definition":"To form grains, or to assume a granular form, as the result of crystallization; to granulate."},{"definition":"To texture a surface in imitation of the grain of a substance such as wood."},{"definition":"(tanning) To remove the hair or fat from a skin."},{"definition":"(tanning) To soften leather."},{"definition":"To yield fruit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a grain or grains"},{"definition":"Stained with an imitation wood grain"},{"definition":"(in combination) Having a specified type of grain e.g. close-grained"}],"partOfSpeech":"j"}]},{"word":"SHIRAZ","idx":26604,"count":981117,"meanings":[{"definitions":[{"definition":"A variety of black grape used to make wine"},{"definition":"A wine made from these grapes"}],"partOfSpeech":"n"}]},{"word":"ANNOUNCER","idx":26608,"count":980698,"meanings":[{"definitions":[{"definition":"One who makes announcements."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈnaʊnsɚ/"},{"text":"/əˈnaʊnsə/"}]},{"word":"POLYCARBONATE","idx":26611,"count":980341,"meanings":[{"definitions":[{"definition":"Any of a range of polymers of aromatic carbonates; they are used to make light, flexible alternatives to glass. Abbreviation: PC"}],"partOfSpeech":"n"}]},{"word":"DISGRACE","idx":26614,"count":980086,"meanings":[{"definitions":[{"definition":"The condition of being out of favor; loss of favor, regard, or respect."},{"definition":"The state of being dishonored, or covered with shame.","example":"Now she lives in disgrace."},{"definition":"Something which brings dishonor; the cause of reproach or shame; great discredit.","example":"His behaviour at the party was a total disgrace! He was leeching on all the ladies, and insulting the men."},{"definition":"An act of unkindness; a disfavor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put someone out of favor; to bring shame or ignominy upon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"disgrace-us","text":"/dɪsˈɡɹeɪs/"}]},{"word":"MEDIATE","idx":26615,"count":979863,"meanings":[{"definitions":[{"definition":"To resolve differences, or to bring about a settlement, between conflicting parties."},{"definition":"To intervene between conflicting parties in order to resolve differences or bring about a settlement."},{"definition":"To divide into two equal parts."},{"definition":"To act as an intermediary causal or communicative agent; to convey."},{"definition":"To act as a spiritualistic medium."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Acting through a mediating agency, indirect."},{"definition":"Intermediate between extremes."},{"definition":"Gained or effected by a medium or condition."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmidieɪt/"},{"text":"/ˈmidi.ət/"}]},{"word":"REIN","idx":26616,"count":979848,"meanings":[{"definitions":[{"definition":"A strap or rope attached to a bridle or bit, used to control a horse, animal or young child."},{"definition":"An instrument or means of curbing, restraining, or governing."},{"definition":"(chiefly in plural) A kidney."},{"definition":"The inward impulses; the affections and passions, formerly supposed to be located in the area of the kidneys."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To direct or stop a horse by using reins."},{"definition":"To restrain; to control; to check."},{"definition":"To obey directions given with the reins."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rein-us","text":"/ɹeɪn/"}]},{"word":"REALISATION","idx":26618,"count":979841,"meanings":[{"definitions":[{"definition":"The act of realizing."},{"definition":"The result of an artistic effort.","example":"The painter's realization of her concept was breathtaking."}],"partOfSpeech":"n"}]},{"word":"IRRITABLE","idx":26619,"count":979803,"meanings":[{"definitions":[{"definition":"Capable of being irritated."},{"definition":"Easily exasperated or excited.","example":"an irritable old man"},{"definition":"Responsive to stimuli."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɪɹɪtəbl/"}]},{"word":"CUNNING","idx":26622,"count":979573,"meanings":[{"definitions":[{"definition":"Sly; crafty; clever in surreptitious behaviour."},{"definition":"Skillful, artful."},{"definition":"Wrought with, or exhibiting, skill or ingenuity; ingenious.","example":"cunning work"},{"definition":"Cute, appealing.","example":"a cunning little boy"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Practical knowledge or experience; aptitude in performance; skill, proficiency; dexterity."},{"definition":"Practical skill employed in a secret or crafty manner; craft; artifice; skillful deceit; art or magic."},{"definition":"The disposition to employ one's skill in an artful manner; craftiness; guile; artifice; skill of being cunning, sly, conniving, or deceitful."},{"definition":"The natural wit or instincts of an animal.","example":"the cunning of the fox or hare"},{"definition":"Knowledge; learning; special knowledge (sometimes implying occult or magical knowledge)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cunning-us","text":"/ˈkʌnɪŋ/"}]},{"word":"FISTS","idx":26623,"count":979557,"meanings":[{"definitions":[{"definition":"A hand with the fingers clenched or curled inward.","example":"The boxer's fists rained down on his opponent in the last round."},{"definition":"The pointing hand symbol ☞."},{"definition":"The characteristic signaling rhythm of an individual telegraph or CW operator when sending Morse code."},{"definition":"A person's characteristic handwriting."},{"definition":"A group of men."},{"definition":"The talons of a bird of prey."},{"definition":"An attempt at something."},{"definition":"The act of breaking wind; fise."},{"definition":"A puffball."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To strike with the fist.","example":"...may not score a point with his open hand(s), but may score a point by fisting the ball. Damian Cullen. \"Running the rule.\" The Irish Times 18 Aug 2003, pg. 52."},{"definition":"To close (the hand) into a fist."},{"definition":"To grip with a fist."},{"definition":"To fist-fuck."},{"definition":"To break wind."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fists","text":"/fɪsts/"}]},{"word":"DIVIDER","idx":26624,"count":979417,"meanings":[{"definitions":[{"definition":"An object that separates."},{"definition":"A device resembling a drawing compass and used to transfer measurements of length."},{"definition":"The median or central reservation of a highway or other road where traffic in opposite directions are kept separated."},{"definition":"A person who divides or separates."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈvaɪdə(ɹ)/"}]},{"word":"ASSOCIATIVE","idx":26626,"count":979263,"meanings":[{"definitions":[{"definition":"Pertaining to, resulting from, or characterised by association; capable of associating; tending to associate or unite."},{"definition":"(of a binary operator *) Such that, for any operands a, b and c, (a * b) * c = a * (b * c); (of a ring, etc.) whose multiplication operation is associative."},{"definition":"Addressable by a key more complex than an integer index.","example":"AWK's associative arrays may be indexed by strings."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"associative-us","text":"/əˈsoʊ.si.ə.tɪv/"}]},{"word":"PENNIES","idx":26629,"count":979169,"meanings":[{"definitions":[{"definition":"In the United Kingdom and Ireland, a copper coin worth 1/240 of a pound sterling or Irish pound before decimalisation. Abbreviation: d."},{"definition":"In the United Kingdom, a copper coin worth 1/100 of a pound sterling. Abbreviation: p."},{"definition":"In Ireland, a coin worth 1/100 of an Irish pound before the introduction of the euro. Abbreviation: p."},{"definition":"In the US and Canada, a one-cent coin, worth 1/100 of a dollar. Abbreviation: ¢."},{"definition":"In various countries, a small-denomination copper or brass coin."},{"definition":"A unit of nail size, said to be either the cost per 100 nails, or the number of nails per penny. Abbreviation: d."},{"definition":"Money in general.","example":"to turn an honest penny"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To jam a door shut by inserting pennies between the doorframe and the door.","example":"Zach and Ben had only been at college for a week when their door was pennied by the girls down the hall."},{"definition":"To circumvent the tripping of an electrical circuit breaker by the dangerous practice of inserting a coin in place of a fuse in a fuse socket."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɛn.iːz/"}]},{"word":"MINIVAN","idx":26630,"count":979152,"meanings":[{"definitions":[{"definition":"A small van."}],"partOfSpeech":"n"}]},{"word":"CHIMP","idx":26632,"count":978917,"meanings":[{"definitions":[{"definition":"To review each image on a digital camera after it is taken."},{"definition":"To get very excited when showing images on a digital camera."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A species of great ape in the genus Pan, native to Africa, and believed by biologists to be the closest extant relative to humans."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"chimp-us","text":"/tʃɪmp/"}]},{"word":"GIRAFFE","idx":26635,"count":978584,"meanings":[{"definitions":[{"definition":"A ruminant, of the genus Giraffa, of the African savannah with long legs and highly elongated neck, which make it the tallest living animal; yellow fur patterned with dark spots, often in the form of a network; and two or more short, skin-covered horns, so-called; strictly speaking the horn-like projections are ossicones."},{"definition":"A giraffe unicycle."},{"definition":"A laugh.","example":"Are you having a giraffe?!"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"giraffe-us","text":"/d͡ʒəˈɹæf/"}]},{"word":"HEMORRHAGE","idx":26636,"count":978574,"meanings":[{"definitions":[{"definition":"A heavy release of blood within or from the body.","example":"We got news that he died of a hemorrhage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bleed copiously.","example":"He's hemorrhaging!"},{"definition":"To lose (something) in copious quantities.","example":"The company hemorrhaged money until eventually it went bankrupt."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hemorrhage-us","text":"/ˈhɛm(ə)ɹɪdʒ/"}]},{"word":"AWNING","idx":26637,"count":978521,"meanings":[{"definitions":[{"definition":"A rooflike cover, usually of canvas, extended over or before any place as a shelter from the sun, rain, or wind."},{"definition":"That part of the poop deck which is continued forward beyond the bulkhead of the cabin."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɔnɪŋ/"},{"text":"/ˈɔːnɪŋ/"},{"text":"/ˈɑnɪŋ/"}]},{"word":"PIA","idx":26638,"count":978459,"meanings":[{"definitions":[{"definition":"The pia mater, the innermost of the meninges that protect the brain and spinal cord"},{"definition":"A perennial Polynesian herb whose fleshy tubers yield arrowroot."}],"partOfSpeech":"n"}]},{"word":"OINTMENT","idx":26639,"count":978458,"meanings":[{"definitions":[{"definition":"A viscous preparation of oils and/or fats, usually containing medication, used as a treatment or as an emollient."},{"definition":"A substance used to anoint, as in religious rituals."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɔɪn(t)m(ə)nt/"},{"text":"/ˈɔɪntm(ə)nt/"}]},{"word":"SPILLED","idx":26640,"count":978351,"meanings":[{"definitions":[{"definition":"To drop something so that it spreads out or makes a mess; to accidentally pour.","example":"I spilled some sticky juice on the kitchen floor."},{"definition":"To spread out or fall out, as above.","example":"Some sticky juice spilled onto the kitchen floor."},{"definition":"To drop something that was intended to be caught."},{"definition":"To mar; to damage; to destroy by misuse; to waste."},{"definition":"To be destroyed, ruined, or wasted; to come to ruin; to perish; to waste."},{"definition":"To cause to flow out and be lost or wasted; to shed."},{"definition":"To cover or decorate with slender pieces of wood, metal, ivory, etc.; to inlay."},{"definition":"To relieve a sail from the pressure of the wind, so that it can be more easily reefed or furled, or to lessen the strain."},{"definition":"(Australian politics) To open the leadership of a parliamentary party for re-election."},{"definition":"To reveal information to an uninformed party.","example":"He spilled his guts out to his new psychologist."},{"definition":"(of a knot). To come undone."}],"partOfSpeech":"ve"}]},{"word":"STROUD","idx":26641,"count":978336,"meanings":[{"definitions":[{"definition":"A kind of coarse wool used in blankets or for garment by Native Americans."}],"partOfSpeech":"n"}]},{"word":"LEFTY","idx":26642,"count":978333,"meanings":[{"definitions":[{"definition":"One who is left-handed."},{"definition":"One who has left-wing political views."},{"definition":"One's left testicle.","example":"I'll bet my lefty he won't show up for work today."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Left-handed."},{"definition":"Intended for left-handed use.","example":"The lefty scissors are the ones with the red plastic handles."},{"definition":"Left-wing."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"lefty-au","text":"/ˈlɛfti/"}]},{"word":"TRIPPING","idx":26643,"count":978231,"meanings":[{"definitions":[{"definition":"To fall over or stumble over an object as a result of striking it with one's foot","example":"Be careful not to trip on the tree roots."},{"definition":"(sometimes followed by \"up\") to cause (a person or animal) to fall or stumble by knocking their feet from under them","example":"A pedestrian was able to trip the burglar as he was running away."},{"definition":"To be guilty of a misstep or mistake; to commit an offence against morality, propriety, etc"},{"definition":"To detect in a misstep; to catch; to convict"},{"definition":"To activate or set in motion, as in the activation of a trap, explosive, or switch","example":"When we get into the factory, trip the lights."},{"definition":"To be activated, as by a signal or an event","example":"The alarm system tripped, throwing everyone into a panic."},{"definition":"To experience a state of reverie or to hallucinate, due to consuming psychoactive drugs","example":"After taking the LSD, I started tripping about fairies and colors."},{"definition":"To journey, to make a trip","example":"Last summer we tripped to the coast."},{"definition":"To move with light, quick steps; to walk or move lightly; to skip"},{"definition":"To raise (an anchor) from the bottom, by its cable or buoy rope, so that it hangs free"},{"definition":"To pull (a yard) into a perpendicular position for lowering it"},{"definition":"(most commonly used in the form tripping) to become unreasonably upset, especially over something unimportant; to cause a scene or a disruption"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who trips."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Quick; nimble; stepping lightly and quickly."},{"definition":"Having the right forefoot lifted, the others remaining on the ground, as if trotting; trippant.","example":"a buck tripping"},{"definition":"Undergoing a hallucinogenic trip."},{"definition":"Saying crazy things.","example":"Y'all hoes be trippin."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"tripping-au","text":"/ˈtɹɪpɪŋ/"}]},{"word":"AZIMUTH","idx":26647,"count":977916,"meanings":[{"definitions":[{"definition":"An arc of the horizon intercepted between the meridian of the place and a vertical circle passing through the center of any object.","example":"the azimuth of a star"},{"definition":"The quadrant of an azimuth circle."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"azimuth-us","text":"/ˈæzɪməθ/"}]},{"word":"LOGISTICAL","idx":26648,"count":977713,"meanings":[{"definitions":[{"definition":"Relating to symbolic logic."},{"definition":"Relating to the logistic function."},{"definition":"Using sexagesimal fractions, especially in arithmetic or logarithms."},{"definition":"Relating to basic arithmetic."},{"definition":"Skilled in calculating."},{"definition":"Proportional."},{"definition":"(operations) Relating to logistics."},{"definition":"Relating to logistics.","example":"Feeding all those people will be a logistical nightmare."}],"partOfSpeech":"j"}]},{"word":"OCCIDENTAL","idx":26649,"count":977561,"meanings":[{"definitions":[{"definition":"A Western Christian of the Latin rite"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, pertaining to, or situated in, the occident, or west; western.","example":"occidental climates, or customs; an occidental planet."},{"definition":"Of a gem or precious stone: of inferior value or quality."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"occidental-us","text":"/ˌɒk.səˈdɛn.təl/"}]},{"word":"VIGOR","idx":26650,"count":977544,"meanings":[{"definitions":[{"definition":"Active strength or force of body or mind; capacity for exertion, physically, intellectually, or morally; energy."},{"definition":"Strength or force in animal or vegetable nature or action."},{"definition":"Strength; efficacy; potency."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vigor-us","text":"/ˈvɪɡɚ/"}]},{"word":"CHARIOT","idx":26651,"count":977505,"meanings":[{"definitions":[{"definition":"A two-wheeled horse-drawn vehicle, used in Bronze Age and Early Iron Age warfare."},{"definition":"A light four-wheeled carriage used for ceremonial or pleasure purposes."},{"definition":"(xiangqi) rook"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To convey by, or as if by, chariot."},{"definition":"To ride in a chariot."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chariot-us","text":"/ˈt͡ʃæɹiət/"}]},{"word":"BUOY","idx":26652,"count":977485,"meanings":[{"definitions":[{"definition":"A float moored in water to mark a location, warn of danger, or indicate a navigational channel."},{"definition":"A life-buoy; a life preserver."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To keep afloat or aloft; used with up."},{"definition":"To support or maintain at a high level."},{"definition":"To mark with a buoy.","example":"to buoy an anchor; to buoy or buoy off a channel"},{"definition":"To maintain or enhance enthusiasm or confidence; to lift the spirits of.","example":"Buoyed by the huge success, they announced two other projects."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbu.i/"},{"text":"/ˈbɔɪ/"}]},{"word":"MATRIMONIAL","idx":26657,"count":977357,"meanings":[{"definitions":[{"definition":"A classified advertisement describing an individual who wishes to find a marriage partner."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or having to do with matrimony and marriage."}],"partOfSpeech":"j"}]},{"word":"SQUADS","idx":26658,"count":977281,"meanings":[{"definitions":[{"definition":"A group of people organized for some common purpose, usually of about ten members."},{"definition":"One's friend group, taken collectively; one's peeps."}],"partOfSpeech":"n"}]},{"word":"TWEEN","idx":26661,"count":977071,"meanings":[{"definitions":[{"definition":"An action of tweening (inserting frames for continuity); a sequence of frames generated by tweening."},{"definition":"A person in their twenties, between 20 and 29 years old. Possibly including 30-32."},{"definition":"A child, usually a girl, in the age range between young childhood and adolescence, normally between eight and thirteen years of age."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To generate intermediate frames in an animated sequence so as to give the appearance of smooth movement."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or having to do with tweenagers."}],"partOfSpeech":"j"}]},{"word":"PAYBACK","idx":26662,"count":977064,"meanings":[{"definitions":[{"definition":"An act of revenge.","example":"They beat us last year, so this year's win was payback."},{"definition":"A benefit, reward, a form of recompense."},{"definition":"A return on investment"},{"definition":"A refund, reimbursement"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpeɪbæk/"}]},{"word":"DISCLOSING","idx":26663,"count":976980,"meanings":[{"definitions":[{"definition":"To open up, unfasten."},{"definition":"To uncover, physically expose to view."},{"definition":"To expose to the knowledge of others; to make known, state openly, reveal."}],"partOfSpeech":"ve"}]},{"word":"HYDRAULICS","idx":26664,"count":976898,"meanings":[{"definitions":[{"definition":"The engineering science that deals with practical applications where liquid is in motion and transmits energy."},{"definition":"The hydraulic system of a vehicle or other machine."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/haɪˈdɹɔːlɪks/"},{"text":"/haɪˈdɹɒlɪks/"}]},{"word":"ENDPOINTS","idx":26665,"count":976861,"meanings":[{"definitions":[{"definition":"Either of the two points at the ends of a line segment."},{"definition":"A defined occurrence during the observation period of an experiment or study."},{"definition":"The stage in a titration at which a change in the colour of an indicator indicates that no more titrant should be added."},{"definition":"The entity at one end of a connection."},{"definition":"Either of the two nodes of a graph of degree 1."}],"partOfSpeech":"n"}]},{"word":"MASTHEAD","idx":26666,"count":976725,"meanings":[{"definitions":[{"definition":"The top of a mast."},{"definition":"A list of a newspaper or other periodical's main staff, contributing writers, publisher, circulation, advertising rates etc."},{"definition":"The title (normally in a large and distinctive font) of a newspaper at the top of the front page"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send to the masthead as a punishment."}],"partOfSpeech":"ve"}]},{"word":"DISBURSEMENTS","idx":26669,"count":976656,"meanings":[{"definitions":[{"definition":"The act, instance, or process of disbursing."},{"definition":"Money paid out or spent."}],"partOfSpeech":"n"}]},{"word":"CANDIDACY","idx":26672,"count":976629,"meanings":[{"definitions":[{"definition":"The state of being a candidate."}],"partOfSpeech":"n"}]},{"word":"HYPNOTIC","idx":26673,"count":976495,"meanings":[{"definitions":[{"definition":"A person who is, or can be, hypnotized."},{"definition":"A soporific substance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to hypnosis or hypnotism."},{"definition":"(pharmaceutical effect) Inducing sleep; soporific."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/hɪpˈnɒtɪk/"}]},{"word":"ADULTERY","idx":26674,"count":976493,"meanings":[{"definitions":[{"definition":"Sexual intercourse by a married person with someone other than their spouse.","example":"She engaged in adultery because her spouse has a low libido, while hers is very high."},{"definition":"Lewdness or unchastity of thought as well as act, as forbidden by the seventh commandment."},{"definition":"Faithlessness in religion."},{"definition":"The fine and penalty formerly imposed for the offence of adultery."},{"definition":"The intrusion of a person into a bishopric during the life of the bishop."},{"definition":"(political economy) Adulteration; corruption."},{"definition":"Injury; degradation; ruin."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"adultery-us","text":"/əˈdʌltəɹi/"}]},{"word":"QUANTIFICATION","idx":26675,"count":976473,"meanings":[{"definitions":[{"definition":"The act of quantifying."},{"definition":"The expression of an economic activity in monetary units."},{"definition":"A limitation that is imposed on the variables of a proposition."}],"partOfSpeech":"n"}]},{"word":"COOLANT","idx":26677,"count":976352,"meanings":[{"definitions":[{"definition":"A medium, usually fluid, used to draw heat from an object.","example":"Coolant is used in car engines and industrial processes, where excess heat could cause machine damage."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkuːlənt/"}]},{"word":"SEVENTEENTH","idx":26678,"count":976269,"meanings":[{"definitions":[{"definition":"One of seventeen equal parts of a whole.","example":"A seventeeth of 340 is 20."},{"definition":"An interval of two octaves and a third."}],"partOfSpeech":"n"},{"definitions":[{"definition":"The ordinal form of the number seventeen."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"seventeenth-us","text":"/ˌsɛvənˈtiːnθ/"}]},{"word":"TEMPERAMENT","idx":26682,"count":975973,"meanings":[{"definitions":[{"definition":"A moderate and proportionable mixture of elements or ingredients in a compound; the condition in which elements are mixed in their proper proportions."},{"definition":"Any state or condition as determined by the proportion of its ingredients or the manner in which they are mixed; consistence, composition; mixture."},{"definition":"A person's usual manner of thinking, behaving or reacting."},{"definition":"A tendency to become irritable or angry."},{"definition":"The altering of certain intervals from their correct values in order to improve the moving from key to key."},{"definition":"Individual differences in behavior that are biologically based and are relatively independent of learning, system of values and attitudes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛmpəɹmənt/"}]},{"word":"PROSTITUTES","idx":26683,"count":975877,"meanings":[{"definitions":[{"definition":"Any person (especially a woman) who has sexual intercourse or engages in other sexual activity for payment, especially as a means of livelihood."},{"definition":"A person who does, or offers to do, a demeaning or dishonourable activity for money or personal gain; someone who acts in a dishonourable way for personal advantage."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To offer (oneself or someone else) for sexual activity in exchange for money."},{"definition":"To sacrifice (oneself, one's talents etc.) in return for profit or other advantage; to exploit for base purposes."}],"partOfSpeech":"ve"}]},{"word":"PARSED","idx":26685,"count":975795,"meanings":[{"definitions":[{"definition":"To resolve (a sentence, etc.) into its elements, pointing out the several parts of speech, and their relation to each other by agreement or government; to analyze and describe grammatically."},{"definition":"To examine closely; to scrutinize."},{"definition":"To split (a file or other input) into pieces of data that can be easily manipulated or stored."},{"definition":"To resolve (a string of code or text) into its elements to determine if it conforms to a particular grammar."},{"definition":"Of a string of code or text, sentence, etc.: to conform to rules of grammar, to be syntactically valid.","example":"This sentence doesn't parse."}],"partOfSpeech":"ve"}]},{"word":"SHAMROCK","idx":26686,"count":975776,"meanings":[{"definitions":[{"definition":"The trefoil leaf of any small clover, especially Trifolium repens, or such a leaf from a clover-like plant, commonly used as a symbol of Ireland.","example":"She wore a shamrock in honor of her Irish ancestry."},{"definition":"Any of several small plants, forms of clover, with trefoil leaves, especially Trifolium repens.","example":"The fields were covered with shamrocks."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"shamrock-us","text":"/ˈʃæm.ɹɑk/"}]},{"word":"HEALER","idx":26687,"count":975694,"meanings":[{"definitions":[{"definition":"One who heals, especially through faith."},{"definition":"Anything that heals; a medicine that heals some wound, injury, ailment, or disease."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhilɚ/"},{"text":"/ˈhiːlə(ɹ)/"}]},{"word":"HIVE","idx":26689,"count":975507,"meanings":[{"definitions":[{"definition":"A structure, whether artificial or natural, for housing a swarm of honeybees."},{"definition":"The bees of one hive; a swarm of bees."},{"definition":"A place swarming with busy occupants; a crowd."},{"definition":"A section of the registry."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enter or possess a hive."},{"definition":"To form a hive-like entity."},{"definition":"To collect into a hive.","example":"to hive a swarm of bees"},{"definition":"To store in a hive or similarly."},{"definition":"To take shelter or lodgings together; to reside in a collective body."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hive-uk","text":"/haɪv/"}]},{"word":"CIRCULATE","idx":26690,"count":975458,"meanings":[{"definitions":[{"definition":"To move in circles or through a circuit"},{"definition":"To cause (a person or thing) to move in circles or through a circuit"},{"definition":"To move from person to person, as at a party"},{"definition":"To spread or disseminate","example":"to circulate money or gossip"},{"definition":"To become widely known"},{"definition":"Of decimals: to repeat."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"circulate-us","text":"/ˈsɚˌkju.leɪt/"}]},{"word":"WARMERS","idx":26692,"count":975435,"meanings":[{"definitions":[{"definition":"Something that warms, such as a heater or a soup."},{"definition":"A piece of clothing for warmth, such as a bodywarmer or leg warmer."},{"definition":"An introductory activity, for example in a lesson, to stimulate interest in a topic."}],"partOfSpeech":"n"}]},{"word":"GLUED","idx":26693,"count":975384,"meanings":[{"definitions":[{"definition":"To join or attach something using glue.","example":"I need to glue the chair-leg back into place."},{"definition":"To cause something to adhere closely to; to follow attentively.","example":"His eyes were glued to the screen."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡluːd/"}]},{"word":"NEWT","idx":26694,"count":975360,"meanings":[{"definitions":[{"definition":"A small lizard-like amphibian in the family Salamandridae that lives in the water as an adult."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈn(j)ut/"},{"text":"/ˈnjuːt/"},{"text":"/ˈnjʉːt/"}]},{"word":"SYCAMORE","idx":26695,"count":975289,"meanings":[{"definitions":[{"definition":"Any of several North American plane trees, of the genus Platanus, especially Platanus occidentalis (American sycamore)."},{"definition":"A large British and European species of maple, Acer pseudoplatanus, known in North America as the sycamore maple."},{"definition":"A large tree bearing edible fruit, Ficus sycomorus, allied to the common fig and found in Egypt and Syria; also called the sycamore fig or the fig-mulberry; the Biblical sycomore."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sycamore-us","text":"/ˈsɪkəmɔɹ/"}]},{"word":"FRONTEND","idx":26696,"count":975264,"meanings":[{"definitions":[{"definition":"That part of a hardware or software system that is conceptually closest to the user; the user interface."}],"partOfSpeech":"n"}]},{"word":"ALLELES","idx":26698,"count":975151,"meanings":[{"definitions":[{"definition":"One of a number of alternative forms of the same gene occupying a given position, or locus, on a chromosome."}],"partOfSpeech":"n"}]},{"word":"HALFTIME","idx":26701,"count":975029,"meanings":[{"definitions":[{"definition":"The interval between the two halves of a sports match."},{"definition":"The time taken for a physical quantity to halve the difference between its present value and its final value."},{"definition":"The halftime show, the primary \"light\" entertainment of a game, after the second quarter when players can physically recover, coaches can give players a pep talk, bets can be doubled, etc."}],"partOfSpeech":"n"}]},{"word":"HANDWRITTEN","idx":26708,"count":974493,"meanings":[{"definitions":[{"definition":"To write something manually, normally used to emphasise that it is not being typed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Written with a pen or pencil, as opposed to typed"}],"partOfSpeech":"j"}]},{"word":"SHUTS","idx":26710,"count":974390,"meanings":[{"definitions":[{"definition":"The act or time of shutting; close.","example":"the shut of a door"},{"definition":"A door or cover; a shutter."},{"definition":"The line or place where two pieces of metal are welded together."},{"definition":"A narrow alley or passage acting as a short cut through the buildings between two streets."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To close, to stop from being open.","example":"Please shut the door."},{"definition":"To close, to stop being open.","example":"If you wait too long, the automatic door will shut."},{"definition":"To close a business temporarily, or (of a business) to be closed.","example":"The pharmacy is shut on Sunday."},{"definition":"To confine in an enclosed area.","example":"I shut the cat in the kitchen before going out."},{"definition":"To catch or snag in the act of shutting something.","example":"He's just shut his finger in the door."},{"definition":"To preclude; to exclude; to bar out."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ʃʌts/"}]},{"word":"TENDERNESS","idx":26712,"count":974154,"meanings":[{"definitions":[{"definition":"A tendency to express warm, compassionate feelings","example":"When the lovers were together, their cold indifference gave way to love and tenderness."},{"definition":"Concern for the feelings or welfare of others","example":"When they saw the poor orphans, they were overwhelmed with tenderness for them."},{"definition":"Pain or discomfort when an affected area is touched","example":"He noted her extreme tenderness when he touched the bruise on her thigh."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tenderness-us","text":"/ˈtɛn.dɚ.nɪs/"}]},{"word":"OCULAR","idx":26714,"count":973769,"meanings":[{"definitions":[{"definition":"The eyepiece of a microscope or other optical instrument."},{"definition":"Any of the scales forming the margin of a reptile's eye."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to the eye, or the sense of sight","example":"It took some time after he lost his eye for him to receive his ocular prosthesis."},{"definition":"Resembling the eye.","example":"ocular markings on the wings of a butterfly"},{"definition":"Seen by, or seeing with, the eye; visual."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɑ.kjə.lɚ/"},{"text":"/ˈɒk.jə.lə/"}]},{"word":"SANDMAN","idx":26715,"count":973700,"meanings":[{"definitions":[{"definition":"A legendary figure who is said to bring good sleep and dreams by sprinkling magical sand into people's eyes."},{"definition":"Used as a symbol of the passage of time toward death."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsænd.mæn/"}]},{"word":"SMELLING","idx":26716,"count":973663,"meanings":[{"definitions":[{"definition":"To sense a smell or smells.","example":"I can smell fresh bread."},{"definition":"Followed by like or of if descriptive: to have a particular smell, whether good or bad.","example":"Her feet smell of cheese."},{"definition":"(without a modifier) To smell bad; to stink.","example":"Ew, this stuff smells."},{"definition":"To have a particular tincture or smack of any quality; to savour.","example":"A report smells of calumny."},{"definition":"To exercise sagacity."},{"definition":"To detect or perceive; often with out."},{"definition":"To give heed to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is smelled."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsmɛlɪŋ/"}]},{"word":"DUNG","idx":26718,"count":973533,"meanings":[{"definitions":[{"definition":"Manure; animal excrement."},{"definition":"A type of manure, as from a particular species or type of animal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fertilize with dung."},{"definition":"(calico printing) To immerse or steep, as calico, in a bath of hot water containing cow dung, done to remove the superfluous mordant."},{"definition":"To release dung: to defecate."},{"definition":"To hit or strike."},{"definition":"To dash; to throw violently."},{"definition":"To inflict minor damage upon, especially by hitting or striking."},{"definition":"To fire or reject.","example":"His top school dinged him last week."},{"definition":"To deduct, as points, from another, in the manner of a penalty; to penalize.","example":"My bank dinged me three bucks for using their competitor's ATM."},{"definition":"To mishit (a golf ball)."},{"definition":"To discard (especially rubbish); to chuck out."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"dung-uk","text":"/ˈdʌŋ/"}]},{"word":"SCRATCHED","idx":26720,"count":973372,"meanings":[{"definitions":[{"definition":"To rub a surface with a sharp object, especially by a living creature to remove itching with nails, claws, etc.","example":"Could you please scratch my back?"},{"definition":"To rub the skin with rough material causing a sensation of irritation; to cause itching.","example":"I don't like that new scarf because it scratches my neck."},{"definition":"To mark a surface with a sharp object, thereby leaving a scratch (noun).","example":"A real diamond can easily scratch a pane of glass."},{"definition":"To cross out, strike out, strike through some text on a page."},{"definition":"To produce a distinctive sound on a turntable by moving a vinyl record back and forth while manipulating the crossfader (see also scratching)."},{"definition":"To commit a foul in pool, as where the cue ball is put into a pocket or jumps off the table.","example":"Embarrassingly, he scratched on the break, popping the cue completely off the table."},{"definition":"To score, not by skillful play but by some fortunate chance of the game."},{"definition":"To write or draw hastily or awkwardly; scrawl."},{"definition":"To dig or excavate with the claws.","example":"Some animals scratch holes, in which they burrow."},{"definition":"To dig or scrape (a person's skin) with claws or fingernails in self-defense or with the intention to injure.","example":"The cat scratched the little girl."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Produced by scratching."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/skɹæt͡ʃt/"}]},{"word":"CONCLUSIVE","idx":26721,"count":973331,"meanings":[{"definitions":[{"definition":"Pertaining to a conclusion."},{"definition":"Providing an end to something; decisive."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kənˈklusɪv/"}]},{"word":"SCOOPS","idx":26722,"count":973251,"meanings":[{"definitions":[{"definition":"Any cup- or bowl-shaped tool, usually with a handle, used to lift and move loose or soft solid material.","example":"She kept a scoop in the dog food."},{"definition":"The amount or volume of loose or solid material held by a particular scoop.","example":"I'll have one scoop of chocolate ice-cream."},{"definition":"The act of scooping, or taking with a scoop or ladle; a motion with a scoop, as in dipping or shovelling."},{"definition":"A story or fact; especially, news learned and reported before anyone else."},{"definition":"An opening in a hood/bonnet or other body panel to admit air, usually for cooling the engine."},{"definition":"The digging attachment on a front-end loader."},{"definition":"A place hollowed out; a basinlike cavity; a hollow."},{"definition":"A spoon-shaped surgical instrument, used in extracting certain substances or foreign bodies."},{"definition":"A special spinal board used by emergency medical service staff that divides laterally to scoop up patients."},{"definition":"A sweep; a stroke; a swoop."},{"definition":"The peak of a cap."},{"definition":"A hole on the playfield that catches a ball, but eventually returns it to play in one way or another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lift, move, or collect with a scoop or as though with a scoop.","example":"He used both hands to scoop water and splash it on his face."},{"definition":"To make hollow; to dig out.","example":"I tried scooping a hole in the sand with my fingers."},{"definition":"To report on something, especially something worthy of a news article, before (someone else).","example":"The paper across town scooped them on the City Hall scandal."},{"definition":"(often with \"up\") To begin a vocal note slightly below the target pitch and then to slide up to the target pitch, especially in country music."},{"definition":"To pick (someone) up","example":"You have a car. Can you come and scoop me?"}],"partOfSpeech":"ve"}]},{"word":"EIGENVALUES","idx":26725,"count":973051,"meanings":[{"definitions":[{"definition":"A scalar, \\lambda, such that there exists a non-zero vector x (a corresponding eigenvector) for which the image of x under a given linear operator \\mathrm{A} is equal to the image of x under multiplication by \\lambda; i.e. \\mathrm{A} x = \\lambda x.","example":"The eigenvalues \\lambda of a square transformation matrix \\mathrm{M} may be found by solving \\det(\\mathrm{M} - \\lambda\\mathrm{I}) = 0."}],"partOfSpeech":"n"}]},{"word":"ALDER","idx":26726,"count":972850,"meanings":[{"definitions":[{"definition":"Any of several trees or shrubs of the genus Alnus, belonging to the birch family."},{"definition":"An alderman or alderwoman."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɔːldə/"},{"text":"/ˈɑldɚ/"}]},{"word":"POLLUTED","idx":26727,"count":972801,"meanings":[{"definitions":[{"definition":"To make something harmful, especially by the addition of some unwanted product.","example":"The factory polluted the river when it cleaned its tanks."},{"definition":"To make something or somewhere less suitable for some activity, especially by the introduction of some unnatural factor.","example":"The lights from the stadium polluted the night sky, and we couldn't see the stars."},{"definition":"To corrupt or profane"},{"definition":"To violate sexually; to debauch; to dishonour."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made unclean or impure"},{"definition":"Drunk"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"polluted-us"}]},{"word":"UNDERSIGNED","idx":26728,"count":972793,"meanings":[{"definitions":[{"definition":"The person or those people, mentioned in a document, whose names and signatures appear at the end"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of a document) having signatures at the end or bottom"},{"definition":"(of a person) having signed at the end of a document"}],"partOfSpeech":"j"}]},{"word":"LARK","idx":26729,"count":972650,"meanings":[{"definitions":[{"definition":"Any of various small, singing passerine birds of the family Alaudidae."},{"definition":"Any of various similar-appearing birds, but usually ground-living, such as the meadowlark and titlark."},{"definition":"(by extension) One who wakes early; one who is up with the larks."},{"definition":"A romp, frolic, some fun."},{"definition":"A prank."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To catch larks (type of bird).","example":"to go larking"},{"definition":"To sport, engage in harmless pranking."},{"definition":"To frolic, engage in carefree adventure."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lark-us","text":"/lɑɹk/"}]},{"word":"AIRBRUSH","idx":26730,"count":972594,"meanings":[{"definitions":[{"definition":"A miniature, handheld paint sprayer, powered by compressed air or other gas, used for delicate, artistic painting, or sometimes retouching of photographs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To paint using an airbrush."},{"definition":"To touch up or enhance a photograph or person, often with intent to mislead."}],"partOfSpeech":"ve"}]},{"word":"COMMS","idx":26734,"count":972423,"meanings":[{"definitions":[{"definition":"The act or fact of communicating anything; transmission.","example":"communication of a secret"},{"definition":"The concept or state of exchanging data or information between entities.","example":"Some say that communication is a necessary prerequisite for sentience; others say that it is a result thereof."},{"definition":"A message; the essential data transferred in an act of communication.","example":"Surveillance was accomplished by means of intercepting the spies' communications."},{"definition":"The body of all data transferred to one or both parties during an act of communication.","example":"The subpoena required that the company document their communication with the plaintiff."},{"definition":"An instance of information transfer; a conversation or discourse.","example":"The professors' communications consisted of lively discussions via email."},{"definition":"A passageway or opening between two locations; connection.","example":"A round archway at the far end of the hallway provided communication to the main chamber."},{"definition":"A connection between two tissues, organs, or cavities."},{"definition":"Association; company."},{"definition":"Participation in Holy Communion."},{"definition":"A trope by which a speaker assumes that his hearer is a partner in his sentiments, and says \"we\" instead of \"I\" or \"you\"."}],"partOfSpeech":"n"}]},{"word":"RESTORES","idx":26735,"count":972420,"meanings":[{"definitions":[{"definition":"To reestablish, or bring back into existence.","example":"He restored my lost faith in him by doing a good deed."},{"definition":"To bring back to good condition from a state of decay or ruin."},{"definition":"To give or bring back (that which has been lost or taken); to bring back to the owner; to replace."},{"definition":"To give in place of, or as restitution for."},{"definition":"To recover (data, etc.) from a backup.","example":"There was a crash last night, and we're still restoring the file system."},{"definition":"To bring (a note) back to its original signification."},{"definition":"To make good; to make amends for."}],"partOfSpeech":"ve"}]},{"word":"REGEXP","idx":26736,"count":972398,"meanings":[{"definitions":[{"definition":"A concise description of a regular formal language with notations for concatenation, alternation, and iteration (repetition) of subexpressions."},{"definition":"(more generally) Any pattern for text matching or searching, frequently offering more or less functionality than a theoretical regular expression."}],"partOfSpeech":"n"}]},{"word":"LULLABY","idx":26737,"count":972209,"meanings":[{"definitions":[{"definition":"A cradlesong, a soothing song to calm children or lull them to sleep."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sing a lullaby to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lullaby-us","text":"/ˈlʌləbaɪ/"}]},{"word":"TRUCKER","idx":26741,"count":971864,"meanings":[{"definitions":[{"definition":"One who has done something offensive; a deceitful, dishonest, or disreputable person; a deceiver; a cheat."},{"definition":"A rogue; rascal; miscreant; a ne'er-do-well."},{"definition":"One who drives a truck, especially as an occupation."},{"definition":"One who trucks or trafficks, by trade of goods; a trafficker.","example":"No man having ever yet driven a saving bargain with this great trucker for souls. — South."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Dishonest; resulting from or inspired by dishonesty."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"trucker-uk","text":"/ˈtɹʌkə/"}]},{"word":"CHIROPRACTORS","idx":26743,"count":971844,"meanings":[{"definitions":[{"definition":"A health-care practitioner who specializes in chiropractic, the hands on or hand-held instrumental movement of the bone structure of the body to improve the function of the joints or nervous system."}],"partOfSpeech":"n"}]},{"word":"HOES","idx":26744,"count":971831,"meanings":[{"definitions":[{"definition":"A whore; a sexually promiscuous woman; in general use as a highly offensive name-calling word for a woman with connotations of loose sexuality.","example":"Bros before hoes!"},{"definition":"Care, anxiety, trouble, sorrow."},{"definition":"An agricultural tool consisting of a long handle with a flat blade fixed perpendicular to it at the end, used for digging rows."},{"definition":"The horned or piked dogfish."},{"definition":"A piece of land that juts out towards the sea; a promontory."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To care, be anxious, long."},{"definition":"To cut, dig, scrape, turn, arrange, or clean, with this tool.","example":"Every year, I hoe my garden for aeration."},{"definition":"To clear from weeds, or to loosen or arrange the earth about, with a hoe.","example":"to hoe corn"}],"partOfSpeech":"ve"}]},{"word":"LAWNS","idx":26745,"count":971756,"meanings":[{"definitions":[{"definition":"An open space between woods."},{"definition":"Ground (generally in front of or around a house) covered with grass kept closely mown."},{"definition":"An overgrown agar culture, such that no separation between single colonies exists."},{"definition":"A type of thin linen or cotton."},{"definition":"(in the plural) Pieces of this fabric, especially as used for the sleeves of a bishop."},{"definition":"A piece of clothing made from lawn."}],"partOfSpeech":"n"}]},{"word":"MIRRORING","idx":26748,"count":971543,"meanings":[{"definitions":[{"definition":"Of an event, activity, behaviour, etc, to be identical to, to be a copy of."},{"definition":"To create something identical to (a web site, etc.)."},{"definition":"To reflect, as in a mirror."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A reflection or inversion."}],"partOfSpeech":"n"}]},{"word":"CHOKING","idx":26749,"count":971485,"meanings":[{"definitions":[{"definition":"To be unable to breathe because of obstruction of the windpipe (for instance food or other objects that go down the wrong way, or fumes or particles in the air that cause the throat to constrict).","example":"Ever since he choked on a bone, he has refused to eat fish."},{"definition":"To prevent (someone) from breathing or talking by strangling or filling the windpipe.","example":"The collar of this shirt is too tight; it’s choking me."},{"definition":"To obstruct (a passage, etc.) by filling it up or clogging it.","example":"to choke a cave passage with boulders and mud"},{"definition":"To hinder or check, as growth, expansion, progress, etc.; to kill (a plant by robbing it of nutrients); to extinguish (fire by robbing it of oxygen)."},{"definition":"To perform badly at a crucial stage of a competition because one is nervous, especially when one is winning.","example":"He has a lot of talent, but he tends to choke under pressure."},{"definition":"To move one's fingers very close to the tip of a pencil, brush or other art tool."},{"definition":"To be checked or stopped, as if by choking"},{"definition":"To check or stop (an utterance or voice) as if by choking."},{"definition":"To have a feeling of strangulation in one's throat as a result of passion or strong emotion."},{"definition":"To give (someone) a feeling of strangulation as a result of passion or strong emotion."},{"definition":"To say (something) with one’s throat constricted (due to emotion, for example)."},{"definition":"To use the choke valve of (a vehicle) to adjust the air/fuel mixture in the engine."},{"definition":"(of a duct) To reach a condition of maximum flowrate, due to the flow at the narrowest point of the duct becoming sonic (Ma = 1)."},{"definition":"To make a choke, as in a cartridge, or in the bore of the barrel of a shotgun."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process in which a person's airway becomes blocked, resulting in asphyxia in cases that are not treated promptly."},{"definition":"The act of coughing when a foreign object (i.e. food, beverages) becomes lodged in a person's airway."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"choking-us","text":"/ˈtʃoʊkɪŋ/"}]},{"word":"CASTOR","idx":26750,"count":971100,"meanings":[{"definitions":[{"definition":"A hat made from the fur of the beaver."},{"definition":"A heavy quality of broadcloth for overcoats."},{"definition":"Castoreum (bitter exudate of mature beavers)."},{"definition":"Any of various nymphalid butterflies of the genus Ariadne, of Africa and Asia."},{"definition":"A variety of petalite found in Elba."},{"definition":"Someone or something that casts","example":"a caster of spells; a caster of stones; a caster of bronze statuary; an online caster of video games"},{"definition":"A wheeled assembly attached to a larger object at its base to facilitate rolling. A caster usually consists of a wheel (which may be plastic, a hard elastomer, or metal), an axle, a mounting provision (usually a stem, flange, or plate), and sometimes a swivel (which allows the caster to rotate for steering).","example":"Many office chairs roll on a set of casters."},{"definition":"A shaker with a perforated top for sprinkling condiments such as sugar, salt, pepper, etc.","example":"a set of casters"},{"definition":"A stand to hold a set of shakers or cruets."},{"definition":"The angle of the axis around which a car's front wheels rotate when the steering wheel is turned, with a vertical axis being defined as zero caster."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɑːs.tə/"}]},{"word":"PLENTIFUL","idx":26751,"count":971017,"meanings":[{"definitions":[{"definition":"Existing in large number or ample amount.","example":"She accumulated a plentiful collection of books."},{"definition":"Yielding abundance; fruitful.","example":"Some years, the tree is a plentiful source of apples."},{"definition":"Lavish; profuse; prodigal"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"plentiful-us","text":"/ˈplɛntɪfl̩/"}]},{"word":"MASSIVELY","idx":26753,"count":970841,"meanings":[{"definitions":[{"definition":"In a massive manner, in a way that appears large, heavy or imposing."},{"definition":"Greatly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"massively-au"}]},{"word":"STATELY","idx":26754,"count":970817,"meanings":[{"definitions":[{"definition":"Of people: worthy of respect; dignified, regal."},{"definition":"Of movement: deliberate, unhurried; dignified."},{"definition":"Grand, impressive, imposing."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a stately manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈsteɪtli/"}]},{"word":"AERONAUTICAL","idx":26755,"count":970791,"meanings":[{"definitions":[{"definition":"Of or pertaining to the scientific study of flight"}],"partOfSpeech":"j"}]},{"word":"PWR","idx":26757,"count":970509,"meanings":[{"definitions":[{"definition":"Power"},{"definition":"(nuclear power) pressurized water reactor"}],"partOfSpeech":"n"}]},{"word":"RACED","idx":26758,"count":970447,"meanings":[{"definitions":[{"definition":"To take part in a race (in the sense of a contest).","example":"The drivers were racing around the track."},{"definition":"To compete against in such a race.","example":"I raced him to the car, but he was there first, so he got to ride shotgun."},{"definition":"To move or drive at high speed; to hurry or speed.","example":"As soon as it was time to go home, he raced for the door."},{"definition":"Of a motor, to run rapidly when not engaged to a transmission."},{"definition":"To assign a race to; to perceive as having a (usually specified) race."},{"definition":"To demolish; to level to the ground."},{"definition":"To scrape as if with a razor."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(social studies) Belonging to a certain race of people."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"raced-us"}]},{"word":"DEUCE","idx":26759,"count":970434,"meanings":[{"definitions":[{"definition":"A card with two pips, one of four in a standard deck of playing cards."},{"definition":"A side of a die with two spots."},{"definition":"A cast of dice totalling two."},{"definition":"The number two."},{"definition":"A tied game where either player can win by scoring two consecutive points."},{"definition":"A curveball."},{"definition":"A '32 Ford."},{"definition":"(in the plural) 2-barrel (twin choke) carburetors (in the phrase 3 deuces: an arrangement on a common intake manifold)."},{"definition":"(restaurants) A table seating two diners."},{"definition":"A piece of excrement."},{"definition":"(epithet) The Devil, used in exclamations of confusion or anger."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"deuce-1-us","text":"/duːs/"}]},{"word":"OMA","idx":26762,"count":970173,"meanings":[{"definitions":[{"definition":"(among people of German ancestry) grandmother, grandma."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈoʊmə/"}]},{"word":"SQUIRRELS","idx":26763,"count":970153,"meanings":[{"definitions":[{"definition":"Any of the rodents of the family Sciuridae distinguished by their large bushy tail."},{"definition":"A person, usually a freezoner, who applies L. Ron Hubbard's technology in a heterodox manner."},{"definition":"One of the small rollers of a carding machine which work with the large cylinder."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To store in a secretive manner, to hide something for future use"}],"partOfSpeech":"ve"}]},{"word":"EXHIBITIONISM","idx":26765,"count":970127,"meanings":[{"definitions":[{"definition":"The practice or character trait of deliberately drawing attention to oneself."},{"definition":"The practice or character trait of deliberately displaying one's genitals, nipples, or buttocks in public."}],"partOfSpeech":"n"}]},{"word":"RISER","idx":26767,"count":969986,"meanings":[{"definitions":[{"definition":"Someone or something which rises."},{"definition":"A platform or stand used to lift or elevate something.","example":"The choir stood on risers for the performance."},{"definition":"The vertical part of a step on a staircase."},{"definition":"The main body of a bow."},{"definition":"A vertical utility conduit, pipe or path between floors of a building for placement of cables (e.g. telephone, networking), or to convey fluids (e.g. gas, water)."},{"definition":"A pipe connecting an individual exhaust port of an internal combustion engine to the muffler, particularly on aircraft."},{"definition":"A Manx cat with a showable short tail."},{"definition":"A strip of webbing joining a parachute's harness to the rigging lines."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"riser-us"},{"text":"/ˈɹaɪ.zə(ɹ)/"}]},{"word":"REDUX","idx":26768,"count":969917,"meanings":[{"definitions":[{"definition":"(of a topic) Redone, restored, brought back, or revisited.","example":"After an unusually cold August, September felt like summer redux as a heatwave sent temperatures soaring."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹiˈdʌks/"}]},{"word":"DRAWBACKS","idx":26769,"count":969891,"meanings":[{"definitions":[{"definition":"A disadvantage; something that detracts or takes away.","example":"Poor fuel economy is a common drawback among larger vehicles."},{"definition":"A partial refund of an import fee, as when goods are re-exported from the country that collected the fee."},{"definition":"The inhalation of a lungful of smoke from a cigarette."}],"partOfSpeech":"n"}]},{"word":"AUDIOBOOK","idx":26771,"count":969846,"meanings":[{"definitions":[{"definition":"A recording, usually made available for sale, of a reading of the full text or of an abridgement of a book."}],"partOfSpeech":"n"}]},{"word":"COMPENSATORY","idx":26772,"count":969793,"meanings":[{"definitions":[{"definition":"(of a payment) Intended to recompense someone who has experienced loss, suffering, or injury."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kəmˈpɛn.səˌtɔr.i/"},{"text":"/kɒm.pɛnˈseɪ.tər.i/"}]},{"word":"EVOKED","idx":26773,"count":969775,"meanings":[{"definitions":[{"definition":"To call out; to draw out or bring forth."},{"definition":"To cause the manifestation of something (emotion, picture, etc.) in someone's mind or imagination.","example":"Being here evokes long forgotten memories."},{"definition":"To elicit a response."}],"partOfSpeech":"ve"}]},{"word":"DICTATES","idx":26774,"count":969650,"meanings":[{"definitions":[{"definition":"An order or command.","example":"I must obey the dictates of my conscience."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To order, command, control."},{"definition":"To speak in order for someone to write down the words.","example":"She is dictating a letter to a stenographer."}],"partOfSpeech":"ve"}]},{"word":"COUPLINGS","idx":26775,"count":969556,"meanings":[{"definitions":[{"definition":"Act of joining together to form a couple"},{"definition":"A device that couples two things together"},{"definition":"The degree of reliance between two program modules"},{"definition":"A connection between two electronic circuits such that a signal can pass between them"},{"definition":"The property of physical systems that they are interacting with each other"},{"definition":"(sexuality) sexual intercourse"}],"partOfSpeech":"n"}]},{"word":"STUDDED","idx":26777,"count":969467,"meanings":[{"definitions":[{"definition":"Having studs.","example":"She had studded boots."},{"definition":"(in combination) Having many of some specified thing.","example":"a celebrity-studded gala"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈstʌdɪd/"}]},{"word":"CLERIC","idx":26779,"count":969331,"meanings":[{"definitions":[{"definition":"A clergy member."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/klɛɹɪk/"}]},{"word":"INDIVIDUALITY","idx":26781,"count":969138,"meanings":[{"definitions":[{"definition":"The characteristics that contribute to the differentiation or distinction of someone or something from a group of otherwise comparable identity."},{"definition":"A person."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɪndɪvɪd͡ʒuˈælɪti/"}]},{"word":"SPARED","idx":26782,"count":968969,"meanings":[{"definitions":[{"definition":"To show mercy."},{"definition":"To keep."},{"definition":"To give up To deprive oneself of, as by being frugal; to do without; to dispense with; to give up; to part with."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"spared-us","text":"/ˈspɛɹd/"}]},{"word":"ANTICIPATING","idx":26783,"count":968838,"meanings":[{"definitions":[{"definition":"To act before (someone), especially to prevent an action."},{"definition":"To take up or introduce (something) prematurely.","example":"The advocate plans to anticipate a part of her argument."},{"definition":"To know of (something) before it happens; to expect.","example":"Please anticipate a journey of an hour from your house to the airport"},{"definition":"To eagerly wait for (something)","example":"Little Johnny started to anticipate the arrival of Santa Claus a week before Christmas."}],"partOfSpeech":"ve"}]},{"word":"BROWNIE","idx":26787,"count":968396,"meanings":[{"definitions":[{"definition":"A small square piece of rich cake, usually made with chocolate."},{"definition":"A mythical creature, a helpful elf who would secretly do people's housework for them."},{"definition":"A household spirit or revered ancestor."},{"definition":"Any of various lycaenid butterflies of the Eurasian genus Miletus."},{"definition":"A brown trout (Salmo trutta)."},{"definition":"A tall, long-necked beer bottle, made from brown coloured glass."},{"definition":"A person of Arab, Indian or Hispanic descent. Also rarely used for a Native American or Pacific Islander."},{"definition":"A girl in the first level of girl scouts."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɹaʊni/"},{"audio":"brownie-au"}]},{"word":"UNDRESSING","idx":26788,"count":968360,"meanings":[{"definitions":[{"definition":"To remove one's clothing."},{"definition":"To remove one’s clothing."},{"definition":"To remove the clothing of (someone)."},{"definition":"To strip of something."},{"definition":"To take the dressing, or covering, from.","example":"to undress a wound"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of removing somebody's clothes."}],"partOfSpeech":"n"}]},{"word":"MACROPHAGES","idx":26790,"count":968283,"meanings":[{"definitions":[{"definition":"A white blood cell that phagocytizes necrotic cell debris and foreign material, including viruses, bacteria, and tattoo ink. It presents foreign antigens on MHC II to lymphocytes. Part of the innate immune system."}],"partOfSpeech":"n"}]},{"word":"COMPUTES","idx":26793,"count":968099,"meanings":[{"definitions":[{"definition":"To reckon or calculate.","example":"Can anyone here compute the square root of 10201?"},{"definition":"To make sense.","example":"Does that compute, or do I need to explain further?"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəmˈpjuːts/"}]},{"word":"QUITS","idx":26794,"count":968086,"meanings":[{"definitions":[{"definition":"To pay (a debt, fine etc.)."},{"definition":"To repay (someone) for (something)."},{"definition":"To repay, pay back (a good deed, injury etc.)."},{"definition":"To conduct or acquit (oneself); to behave (in a specified way)."},{"definition":"To carry through; to go through to the end."},{"definition":"To set at rest; to free, as from anything harmful or oppressive; to relieve; to clear; to liberate."},{"definition":"To release from obligation, accusation, penalty, etc.; to absolve; to acquit."},{"definition":"To abandon, renounce (a thing)."},{"definition":"To leave (a place)."},{"definition":"To resign from (a job, office, position, etc.).","example":"After having to work overtime without being paid, I quit my job."},{"definition":"To stop, give up (an activity) (usually + gerund or verbal noun).","example":"John is planning to quit smoking."},{"definition":"To close (an application)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"On equal monetary terms; neither owing or being owed.","example":"Here's the last of the money you lent me. We're quits now, right?"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Any of numerous species of small passerine birds native to tropical America."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kwɪts/"}]},{"word":"ENSIGN","idx":26795,"count":967853,"meanings":[{"definitions":[{"definition":"A badge of office, rank, or power."},{"definition":"The lowest grade of commissioned officer in the United States Navy, junior to a lieutenant junior grade."},{"definition":"A flag or banner carried by military units; a standard or color/colour."},{"definition":"The principal flag or banner flown by a ship (usually at the stern) to indicate nationality."},{"definition":"Any prominent flag or banner."},{"definition":"A junior commissioned officer in the 18th and 19th centuries whose duty was to carry the unit's ensign."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To designate as by an ensign."},{"definition":"To distinguish by a mark or ornament."},{"definition":"To distinguish by an ornament, especially by a crown.","example":"Any charge which has a crown immediately above or upon it, is said to be ensigned."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ensign-us","text":"/ˈɛn.saɪn/"}]},{"word":"RESTRAINING","idx":26798,"count":967792,"meanings":[{"definitions":[{"definition":"To control or keep in check."},{"definition":"To deprive of liberty."},{"definition":"To restrict or limit.","example":"He was restrained by the straight jacket."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which someone or something is restrained."}],"partOfSpeech":"n"}]},{"word":"CHARISMATIC","idx":26799,"count":967779,"meanings":[{"definitions":[{"definition":"A member of the Charismatic Movement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, related to, or having charisma."},{"definition":"Of, related to, or being a member of a form of Christianity that emphasises the role of the Holy Spirit."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌkɛɹəzˈmætək/"},{"text":"/ˌkæɹɪzˈmætɪk/"}]},{"word":"TELECONFERENCE","idx":26801,"count":967616,"meanings":[{"definitions":[{"definition":"A telephone conference, an arranged phone call between more than two parties.","example":"The four of us should have a teleconference next week."},{"definition":"More generally, the live exchange of information among persons and machines remote from one another but linked by a telecommunications system, over telephone, video or other means."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take part in a teleconference.","example":"I teleconferenced with marketing and engineering."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"teleconference-us"}]},{"word":"BLOCKADE","idx":26804,"count":967434,"meanings":[{"definitions":[{"definition":"The physical blocking or surrounding of a place, especially a port, in order to prevent commerce and traffic in or out."},{"definition":"(by extension) Any form of formal isolation of something, especially with the force of law or arms."},{"definition":"The ships or other forces used to effect a naval blockade."},{"definition":"Preventing an opponent's pawn moving by placing a piece in front of it"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create a blockade against."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"blockade-uk","text":"/blɒˈkeɪd/"}]},{"word":"NEARING","idx":26806,"count":967220,"meanings":[{"definitions":[{"definition":"To come closer to; to approach.","example":"The ship nears the land."}],"partOfSpeech":"ve"}]},{"word":"RUFF","idx":26808,"count":967030,"meanings":[{"definitions":[{"definition":"A circular frill or ruffle on a garment, especially a starched, fluted frill at the neck in Elizabethan and Jacobean England (1560s–1620s)."},{"definition":"Anything formed with plaits or flutings like a frill."},{"definition":"Senses relating to animals."},{"definition":"A collar on a shaft or other piece to prevent endwise motion."},{"definition":"An exhibition of haughtiness or pride."},{"definition":"Tumultuous or wanton conduct or procedure."},{"definition":"Arripis georgianus, a fish found in cool waters off the southern coast of Australia; the Australian herring or tommy ruff."},{"definition":"A bottom-dwelling carnivorous fish of the family Sparidae found in temperate and tropical waters; a porgy or sea bream."},{"definition":"Gymnocephalus cernua, a small Eurasian freshwater fish."},{"definition":"Other species in the same genus."},{"definition":"An instance of ruffing, or an opportunity to ruff, when unable to follow suit."},{"definition":"A game similar to whist and its predecessor."},{"definition":"A low, vibrating beat of a drum, quieter than a roll; a ruffle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shape (fabric, etc.) into a ruff; to adorn (a garment, etc.) with a ruff."},{"definition":"Of a falcon, hawk, etc.: to hit (the prey) without fixing or grabbing hold of it."},{"definition":"To ruffle; to disorder."},{"definition":"Of a bird: to ruffle its feathers."},{"definition":"To boast, to brag."},{"definition":"To speak in a loud and domineering manner; to bluster, to swagger."},{"definition":"To play a trump card to a trick when unable to follow suit (that is, to play a card of the same suit as the previous or leading card)."},{"definition":"Especially in the form ruff out: to defeat (a card, etc.) by ruffing, thus establishing the master card in the suit led."},{"definition":"To beat a ruff or ruffle, as on a drum."},{"definition":"Of a drum, etc.: to have a ruff or ruffle beaten on it."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The bark of a dog; arf, woof."}],"partOfSpeech":"i"},{"definitions":[{"definition":"Not smooth; uneven."},{"definition":"Approximate; hasty or careless; not finished.","example":"a rough estimate; a rough sketch of a building; a rough plan"},{"definition":"Turbulent.","example":"rough sea"},{"definition":"Difficult; trying.","example":"Being a teenager nowadays can be rough."},{"definition":"Crude; unrefined","example":"His manners are a bit rough, but he means well."},{"definition":"Violent; not careful or subtle","example":"This box has been through some rough handling."},{"definition":"Loud and hoarse; offensive to the ear; harsh; grating.","example":"a rough tone; a rough voice"},{"definition":"Not polished; uncut; said of a gem.","example":"a rough diamond"},{"definition":"Harsh-tasting.","example":"rough wine"},{"definition":"Somewhat ill; sick"},{"definition":"Unwell due to alcohol; hungover"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ruff-uk","text":"/ɹʌf/"}]},{"word":"TUX","idx":26809,"count":966952,"meanings":[{"definitions":[{"definition":"A tuxedo."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tʌks/"}]},{"word":"BURGLAR","idx":26810,"count":966938,"meanings":[{"definitions":[{"definition":"A person who breaks in to premises with the intent of committing theft","example":"The burglar made off with a large diamond from the museum."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To commit burglary; to burgle."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɝɡlɚ/"},{"text":"/ˈbɜːɡlə(ɹ)/"}]},{"word":"ASYMMETRY","idx":26811,"count":966872,"meanings":[{"definitions":[{"definition":"Absence of symmetry or proportion between the parts of a thing, or a distinction that produces such a lack of symmetry."},{"definition":"The lack of a common measure between two objects or quantities; incommensurability."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/eɪˈsɪmɪtɹi/"}]},{"word":"WARPED","idx":26813,"count":966860,"meanings":[{"definitions":[{"definition":"To twist or become twisted, physically or mentally:"},{"definition":"(ropemaking) To run (yarn) off the reel into hauls to be tarred."},{"definition":"To arrange (strands of thread, etc) so that they run lengthwise in weaving."},{"definition":"To plot; to fabricate or weave (a plot or scheme)."},{"definition":"To change or fix (make fixed, for example by freezing)."},{"definition":"To move:"},{"definition":"(obsolete outside dialectal, of an animal) To bring forth (young) prematurely."},{"definition":"To fertilize (low-lying land) by letting the tide, a river, or other water in upon it to deposit silt and alluvial matter."},{"definition":"(very rare) To throw."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Distorted by warping; twisted out of shape"},{"definition":"Of a person's mind, attitudes, etc, perverse, strange, aberrant or deviant.","example":"a warped sense of humour"}],"partOfSpeech":"j"}]},{"word":"HAMILTONIAN","idx":26818,"count":966489,"meanings":[{"definitions":[{"definition":"Of, attributed to or inspired by the Irish mathematician, astronomer and physicist William Rowan Hamilton (1805–1865)."},{"definition":"(of a cycle/path) That visits each vertex exactly once."},{"definition":"(of a graph) Containing a Hamiltonian cycle."},{"definition":"(of certain fiscal policies) Advocated by Alexander Hamilton."},{"definition":"Relating to James Hamilton (1769-1831), or his method of teaching languages without grammar, by a literal interlinear word-for-word translation."},{"definition":"Relating to Sir William Hamilton, 9th Baronet (1788–1856), Scottish metaphysician."},{"definition":"Of or relating to any city named Hamilton."}],"partOfSpeech":"j"}]},{"word":"ALGEBRAS","idx":26820,"count":966368,"meanings":[{"definitions":[{"definition":"A system for computation using letters or other symbols to represent numbers, with rules for manipulating these symbols."},{"definition":"The surgical treatment of a dislocated or fractured bone. Also : a dislocation or fracture."},{"definition":"The study of algebraic structures."},{"definition":"A universal algebra."},{"definition":"An algebraic structure consisting of a module over a commutative ring (or a vector space over a field) along with an additional binary operation that is bilinear over module (or vector) addition and scalar multiplication."},{"definition":"A collection of subsets of a given set, such that this collection contains the empty set, and the collection is closed under unions and complements (and thereby also under intersections and differences)."},{"definition":"One of several other types of mathematical structure."},{"definition":"A system or process, that is like algebra by substituting one thing for another, or in using signs, symbols, etc., to represent concepts or ideas."}],"partOfSpeech":"n"}]},{"word":"QUOTIENT","idx":26821,"count":966254,"meanings":[{"definitions":[{"definition":"The number resulting from the division of one number by another.","example":"The quotient of 12 divided by 4 is 3."},{"definition":"By analogy, the result of any process that is the inverse of multiplication as defined for any mathematical entities other than numbers."},{"definition":"A quotum or quota."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"quotient-us","text":"/ˈkwoʊʃənt/"}]},{"word":"TRIBUTES","idx":26822,"count":966102,"meanings":[{"definitions":[{"definition":"An acknowledgment of gratitude, respect or admiration; an accompanying gift.","example":"Please accept this as a tribute of our thanks."},{"definition":"A payment made by one nation to another in submission.","example":"The Ancient Romans made their conquered countries pay tribute."},{"definition":"Extortion; protection money."},{"definition":"A payment made by a feudal vassal to his lord."},{"definition":"A certain proportion of the mined ore, or of its value, given to the miner as payment."}],"partOfSpeech":"n"}]},{"word":"FREEZES","idx":26823,"count":966045,"meanings":[{"definitions":[{"definition":"Especially of a liquid, to become solid due to low temperature.","example":"The lake froze solid."},{"definition":"To lower something's temperature to the point that it freezes or becomes hard.","example":"Don't freeze meat twice."},{"definition":"To drop to a temperature below zero degrees celsius, where water turns to ice.","example":"It didn't freeze this winter, but last winter was very harsh."},{"definition":"To be affected by extreme cold.","example":"Don't go outside wearing just a t-shirt; you'll freeze!"},{"definition":"(of machines and software) To come to a sudden halt, stop working (functioning).","example":"Since the last update, the program freezes / freezes up after a few minutes of use."},{"definition":"(of people and other animals) To stop (become motionless) or be stopped due to attentiveness, fear, surprise, etc.","example":"Despite all of the rehearsals, I froze up as soon as I got on stage."},{"definition":"To cause someone to become motionless."},{"definition":"To lose or cause to lose warmth of feeling; to shut out; to ostracize.","example":"Over time, he froze towards her, and ceased to react to her friendly advances."},{"definition":"To cause loss of animation or life in, from lack of heat; to give the sensation of cold to; to chill."},{"definition":"To prevent the movement or liquidation of a person's financial assets","example":"The court froze the criminal's bank account."},{"definition":"Of prices, spending etc., to keep at the same level, without any increase."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A period of intensely cold weather."},{"definition":"A halt of a regular operation."},{"definition":"The state when either a single computer program, or the whole system ceases to respond to inputs."},{"definition":"A precise draw weight shot where a delivered stone comes to a stand-still against a stationary stone, making it nearly impossible to knock out."},{"definition":"A block on pay rises or on the hiring of new employees etc.","example":"a hiring freeze; a pay freeze"},{"definition":"A kind of coarse woolen cloth or stuff with a shaggy or tufted (friezed) nap on one side."},{"definition":"That part of the entablature of an order which is between the architrave and cornice. It is a flat member or face, either uniform or broken by triglyphs, and often enriched with figures and other ornaments of sculpture."},{"definition":"Any sculptured or richly ornamented band in a building or, by extension, in rich pieces of furniture."},{"definition":"A banner with a series of pictures.","example":"The classroom had an alphabet frieze that showed an animal for each letter."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɹiːzɪz/"}]},{"word":"KNOLL","idx":26824,"count":965905,"meanings":[{"definitions":[{"definition":"A small mound or rounded hill."},{"definition":"A knell."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ring (a bell) mournfully; to knell."},{"definition":"To sound, like a bell; to knell."},{"definition":"To arrange related objects in parallel or at 90 degree angles."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/noʊl/"},{"text":"/nəʊl/"}]},{"word":"WILDCAT","idx":26825,"count":965878,"meanings":[{"definitions":[{"definition":"A cat that lives in the wilderness, specifically"},{"definition":"A person who acts like a wildcat, (usually) a violent and easily-angered person or a sexually vigorous one."},{"definition":"An offensive formation with an unbalanced line and a snap directly to the running back rather than the quarterback."},{"definition":"A wheel that can be adjusted so as to revolve either with or on the shaft of a capstan."},{"definition":"Clipping of wildcat money, notes issued by a wildcat bank."},{"definition":"A cartridge modified from another calibre rather than being commercially produced."},{"definition":"(organized labour) A labour strike that has not been authorized by the leaders of a trade union."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drill for oil in an area where no oil has been found before.","example":"You'd have to be very rich or very desperate to go wildcatting that far east."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(usually derogatory) Of or concerning businesses operating outside standard or legitimate practice, especially:"},{"definition":"Of or concerning customized or hand-made cartridges."},{"definition":"Unauthorized by the proper authorities."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"wildcat-us","text":"/ˈwaɪldˌkæt/"}]},{"word":"THINNING","idx":26826,"count":965822,"meanings":[{"definitions":[{"definition":"To make thin or thinner."},{"definition":"To become thin or thinner.","example":"The crowds thinned after the procession had passed: there was nothing more to see."},{"definition":"To dilute."},{"definition":"To remove some plants or parts of plants in order to improve the growth of what remains."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Process of removing plants or parts of plants to facilitate the growth of other plants"},{"definition":"Wood, leaves, or other plant parts removed during the process of thinning"},{"definition":"The action or result of reducing thickness, density, or number"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Becoming less thick, dense, or numerous","example":"thinning hair"}],"partOfSpeech":"j"}]},{"word":"INLAY","idx":26827,"count":965778,"meanings":[{"definitions":[{"definition":"The material placed within a different material in the form of a decoration."},{"definition":"A filling for a tooth, made of ceramic or gold to fit the cavity and shape of tooth and cemented into place."},{"definition":"The piece of paper or the booklet inside the case of a CD or DVD"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place (pieces of a foreign material) within another material to form a decorative design."},{"definition":"To place an inlay in a tooth."}],"partOfSpeech":"ve"}]},{"word":"PRIMROSE","idx":26829,"count":965703,"meanings":[{"definitions":[{"definition":"A flowering plant of the genus Primula."},{"definition":"A plant of the family Primulaceae."},{"definition":"A plant of the genus Oenothera, better known as an evening primrose."},{"definition":"A flower of a primrose plant."},{"definition":"A light yellow colour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pick primroses.","example":"We went primrosing on Sunday and returned with a full basket."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a light yellow colour."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpɹɪm.ɹoʊz/"},{"text":"/ˈpɹɪm.ɹəʊz/"}]},{"word":"PARTING","idx":26832,"count":965617,"meanings":[{"definitions":[{"definition":"To leave the company of."},{"definition":"To cut hair with a parting; shed."},{"definition":"To divide in two.","example":"to part the curtains"},{"definition":"To be divided in two or separated; shed.","example":"A rope parts.  His hair parts in the middle."},{"definition":"To divide up; to share."},{"definition":"To have a part or share; to partake."},{"definition":"To separate or disunite; to remove from contact or contiguity; to sunder."},{"definition":"To hold apart; to stand or intervene between."},{"definition":"To separate by a process of extraction, elimination, or secretion.","example":"to part gold from silver"},{"definition":"To leave; to quit."},{"definition":"To leave (an IRC channel)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of parting or dividing; the state of being parted; division; separation."},{"definition":"A farewell, the act of departing politely."},{"definition":"The dividing line formed by combing the hair in different directions; part (US)"},{"definition":"(founding) The surface of the sand of one section of a mould where it meets that of another section."},{"definition":"The separation and determination of alloys; especially, the separation, as by acids, of gold from silver in the assay button."},{"definition":"A joint or fissure, as in a coal seam."},{"definition":"The breaking, as of a cable, by violence."},{"definition":"Lamellar separation in a crystallized mineral, due to some other cause than cleavage, as to the presence of twinning lamellae."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"parting-us","text":"/ˈpɑɹtɪŋ/"}]},{"word":"CORDUROY","idx":26835,"count":965501,"meanings":[{"definitions":[{"definition":"A heavy fabric, usually made of cotton, with vertical ribs."},{"definition":"Cheap and poor-quality whiskey."},{"definition":"A pattern on snow resulting from the use of a snow groomer to pack snow and improve skiing, snowboarding and snowmobile trail conditions. Corduroy is widely regarded as a good surface on which to ski or ride."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make (a road) by laying down split logs or tree-trunks over a marsh, swamp etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"corduroy-us","text":"/ˈkɔɹdəɹɔɪ/"}]},{"word":"AVOCADO","idx":26836,"count":965374,"meanings":[{"definitions":[{"definition":"The large, usually yellowish-green or black, pulpy fruit of the avocado tree."},{"definition":"The avocado tree, Persea americana, of the laurel family."},{"definition":"A dark chartreuse colour, like the colour of the skin of an avocado."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a dull yellowish-green colour."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"avocado-us","text":"/ævəˈkɑdoʊ/"}]},{"word":"TORPEDO","idx":26837,"count":965365,"meanings":[{"definitions":[{"definition":"An electric ray of the genus Torpedo."},{"definition":"A cylindrical explosive projectile that can travel underwater and is used as a weapon."},{"definition":"A submarine sandwich."},{"definition":"A naval mine."},{"definition":"An explosive device buried underground and set off remotely, to destroy fortifications, troops, or cavalry; a land torpedo."},{"definition":"A professional gunman or assassin."},{"definition":"A small explosive device attached to the top of the rail to provide an audible warning when a train passes over it."},{"definition":"A kind of firework in the form of a small ball, or pellet, which explodes when thrown upon a hard object."},{"definition":"An automobile with a torpedo body."},{"definition":"(usually in the plural) A woman's shoe with a pointed toe."},{"definition":"(usually in the plural) A large breast; breast with a large nipple."},{"definition":"A marijuana cigarette."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send a torpedo, usually from a submarine, that explodes below the waterline of the target ship."},{"definition":"To sink a ship with one of more torpedoes."},{"definition":"To undermine or destroy any endeavor with a stealthy, powerful attack."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˌtɔɹˈpi.doʊ/"},{"text":"/ˌtɔː(ɹ)ˈpiː.dəʊ/"},{"audio":"torpedo-au"}]},{"word":"OCTETS","idx":26838,"count":965314,"meanings":[{"definitions":[{"definition":"A group or set of eight of something."},{"definition":"A group of eight musicians performing together.","example":"An octet of waiters sang her \"Happy Birthday\"."},{"definition":"A composition for such a group of musicians."},{"definition":"A byte of eight bits. Abbreviation: o"},{"definition":"A group of three bits, representing any of eight possible values."}],"partOfSpeech":"n"}]},{"word":"EVALUATOR","idx":26840,"count":965224,"meanings":[{"definitions":[{"definition":"Agent noun of evaluate; one who evaluates.","example":"They were asked to program an expression evaluator that could determine the value of a numeric expression."}],"partOfSpeech":"n"}]},{"word":"GID","idx":26841,"count":965159,"meanings":[{"definitions":[{"definition":"A disease of sheep caused by tapeworm."},{"definition":"A fiddle."}],"partOfSpeech":"n"}]},{"word":"MUFFLER","idx":26842,"count":965036,"meanings":[{"definitions":[{"definition":"Part of the exhaust pipe of a car that dampens the noise the engine produces."},{"definition":"A silencer or suppressor fitted to a gun."},{"definition":"A type of scarf."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"muffler-us","text":"/ˈmʌflɚ/"}]},{"word":"JUMPERS","idx":26843,"count":964686,"meanings":[{"definitions":[{"definition":"Someone or something that jumps, e.g. a participant in a jumping event in track or skiing."},{"definition":"A person who attempts suicide by jumping from a great height."},{"definition":"A short length of electrical conductor, to make a temporary connection. Also jump wire."},{"definition":"A removable connecting pin on an electronic circuit board."},{"definition":"A long drilling tool used by masons and quarry workers, consisting of an iron bar with a chisel-edged steel tip at one or both ends, operated by striking it against the rock, turning it slightly with each blow."},{"definition":"A crude kind of sleigh, usually a simple box on runners which are in one piece with the poles that form the thills."},{"definition":"A jumping spider"},{"definition":"The larva of the cheese fly."},{"definition":"(18th century) One of certain Calvinistic Methodists in Wales whose worship was characterized by violent convulsions."},{"definition":"A spring to impel the star wheel, or a pawl to lock fast a wheel, in a repeating timepiece."},{"definition":"A shot in which the player releases the ball at the highest point of a jump; a jump shot."},{"definition":"A nuclear power plant worker who repairs equipment in areas with extremely high levels of radiation."},{"definition":"A woolen sweater or pullover."},{"definition":"A loose outer jacket, especially one worn by workers and sailors."},{"definition":"A one-piece, sleeveless dress, or a skirt with straps and a complete or partial bodice, usually worn over a blouse by women and children."},{"definition":"(usually as jumpers) Rompers."}],"partOfSpeech":"n"}]},{"word":"TROUBLESOME","idx":26846,"count":964520,"meanings":[{"definitions":[{"definition":"Causing trouble or anxiety","example":"The computer has been very troublesome for me. It never works when I need to use it."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"troublesome-us","text":"/ˈtɹʌbl̩səm/"}]},{"word":"MANIFOLDS","idx":26847,"count":964488,"meanings":[{"definitions":[{"definition":"A copy made by the manifold writing process."},{"definition":"A pipe fitting or similar device that connects multiple inputs or outputs."},{"definition":"(chiefly in the plural) The third stomach of a ruminant animal, an omasum."},{"definition":"A topological space that looks locally like the \"ordinary\" Euclidean space \\mathbb{R}^n and is Hausdorff."},{"definition":"A polygon mesh representing the continuous, closed surface of a solid object"}],"partOfSpeech":"n"}]},{"word":"EUCHARIST","idx":26850,"count":964355,"meanings":[{"definitions":[{"definition":"The Christian sacrament of Holy Communion."},{"definition":"(by extension) A Christian religious service in which this sacrament is enacted."},{"definition":"The substances received during this sacrament, namely the bread and wine, seen as Christ’s body and blood."}],"partOfSpeech":"n"}]},{"word":"VARIANCES","idx":26852,"count":964262,"meanings":[{"definitions":[{"definition":"The act of varying or the state of being variable."},{"definition":"A difference between what is expected and what is observed; deviation."},{"definition":"The state of differing or being in conflict."},{"definition":"An official permit to do something that is ordinarily forbidden by regulations."},{"definition":"A discrepancy between two legal documents."},{"definition":"A departure from a cause of action originally in a complaint."},{"definition":"The second central moment in probability."},{"definition":"The number of degrees of freedom in a system."},{"definition":"Covariance and contravariance generally.","example":"Depending on the variance of the type constructor, the subtyping relation of the simple types may be either preserved, reversed, or ignored for the respective complex types."}],"partOfSpeech":"n"}]},{"word":"OBJECTIVITY","idx":26854,"count":964042,"meanings":[{"definitions":[{"definition":"The state of being objective, just, unbiased and not influenced by emotions or personal prejudices."},{"definition":"The world as it really is; reality."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɑbd͡ʒɛkˈtɪvɪti/"},{"text":"/ˌɒbd͡ʒɛkˈtɪvɪti/"}]},{"word":"INCUBATED","idx":26857,"count":963849,"meanings":[{"definitions":[{"definition":"To brood, raise, or maintain eggs, organisms, or living tissue through the provision of ideal environmental conditions."},{"definition":"To incubate metaphorically; to ponder an idea slowly and deliberately as if in preparation for hatching it."}],"partOfSpeech":"ve"}]},{"word":"TURNOVERS","idx":26861,"count":963453,"meanings":[{"definitions":[{"definition":"The amount of money taken as sales transacted in a given period.","example":"The company had an annual turnover of $500,000."},{"definition":"The frequency with which stock is replaced after being used or sold, workers leave and are replaced, a property changes hands, etc.","example":"High staff-turnover can lead to low morale amongst employees"},{"definition":"A semicircular pastry made by turning one half of a circular crust over the other, enclosing the filling (usually fruit).","example":"They only served me one apple turnover for breakfast."},{"definition":"A loss of possession of the ball without scoring.","example":"The Nimrods committed another dismaying turnover en route to another humiliating loss."},{"definition":"A measure of leg speed: the frequency with which one takes strides when running, typically given in strides per minute."},{"definition":"The act or result of overturning something; an upset.","example":"a bad turnover in a carriage"},{"definition":"An apprentice, in any trade, who is handed over from one master to another to complete his time."}],"partOfSpeech":"n"}]},{"word":"BEV","idx":26862,"count":963441,"meanings":[{"definitions":[{"definition":"A liquid to consume; a drink, such as tea, coffee, liquor, beer, milk, juice, or soft drinks, usually excluding water."},{"definition":"(A gift of) drink money."}],"partOfSpeech":"n"}]},{"word":"CHANGERS","idx":26864,"count":963372,"meanings":[{"definitions":[{"definition":"Someone or something who changes things."},{"definition":"Someone or something that changes or transforms itself."},{"definition":"A person employed in changing or discounting money."}],"partOfSpeech":"n"}]},{"word":"HERETO","idx":26866,"count":963160,"meanings":[{"definitions":[{"definition":"To here, to this"},{"definition":"Yet, so far"},{"definition":"Regarding this subject"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"hereto-us"},{"text":"/ˌhɪɹˈtuː/"}]},{"word":"MAGNETISM","idx":26867,"count":963103,"meanings":[{"definitions":[{"definition":"The property of being magnetic."},{"definition":"The science which treats of magnetic phenomena."},{"definition":"Power of attraction; power to excite the feelings and to gain the affections."},{"definition":"Animal magnetism."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmæɡ.nəˌtɪz.əm/"}]},{"word":"INVENTIVE","idx":26870,"count":962883,"meanings":[{"definitions":[{"definition":"Of, or relating to invention; pertaining to the act of devising new mechanisms or processes.","example":"an inventive pursuit"},{"definition":"Possessed of a particular capacity for the design of new mechanisms or processes, creative or skilful at inventing.","example":"an inventive fellow"},{"definition":"Purposefully fictive","example":"an inventive story"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈvɛntɪv/"}]},{"word":"SPECULATE","idx":26871,"count":962777,"meanings":[{"definitions":[{"definition":"To think, meditate or reflect on a subject; to consider, to deliberate or cogitate."},{"definition":"To make an inference based on inconclusive evidence; to surmise or conjecture."},{"definition":"To make a risky trade in the hope of making a profit; to venture or gamble."},{"definition":"To anticipate which branch of code will be chosen and execute it in advance."}],"partOfSpeech":"ve"}]},{"word":"CLINICIAN","idx":26872,"count":962730,"meanings":[{"definitions":[{"definition":"A healthcare provider working in a clinic or hospital."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/klɪˈnɪʃən/"}]},{"word":"CRAZE","idx":26874,"count":962477,"meanings":[{"definitions":[{"definition":"Craziness; insanity."},{"definition":"A strong habitual desire or fancy."},{"definition":"A temporary passion or infatuation, as for some new amusement, pursuit, or fashion; a fad"},{"definition":"A crack in the glaze or enamel caused by exposure of the pottery to great or irregular heat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To weaken; to impair; to render decrepit."},{"definition":"To derange the intellect of; to render insane."},{"definition":"To be crazed, or to act or appear as one that is crazed; to rave; to become insane."},{"definition":"To break into pieces; to crush; to grind to powder. See crase."},{"definition":"To crack, as the glazing of porcelain or pottery."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"craze-us","text":"/kɹeɪz/"}]},{"word":"DISPATCHES","idx":26875,"count":962459,"meanings":[{"definitions":[{"definition":"A message sent quickly, as a shipment, a prompt settlement of a business, or an important official message sent by a diplomat, or military officer."},{"definition":"The act of doing something quickly.","example":"We must act with dispatch in this matter."},{"definition":"A mission by an emergency response service, typically attend to an emergency in the field."},{"definition":"The passing on of a message for further processing, especially via a dispatch table."},{"definition":"A dismissal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send (a shipment) with promptness."},{"definition":"To send (a person) away hastily."},{"definition":"To send (an important official message) promptly, by means of a diplomat or military officer."},{"definition":"To send (a journalist) to a place in order to report."},{"definition":"To dispose of speedily, as business; to execute quickly; to make a speedy end of; to finish; to perform."},{"definition":"To rid; to free."},{"definition":"To destroy quickly and efficiently."},{"definition":"To pass on for further processing, especially via a dispatch table (often with to)."},{"definition":"To hurry."},{"definition":"To deprive."}],"partOfSpeech":"ve"}]},{"word":"CRAFTSMEN","idx":26877,"count":962328,"meanings":[{"definitions":[{"definition":"A male artisan."}],"partOfSpeech":"n"}]},{"word":"CURACAO","idx":26878,"count":962320,"meanings":[{"definitions":[{"definition":"A liqueur, made from eau-de-vie, sugar and, as flavor, dried peel of sweet and sour oranges."}],"partOfSpeech":"n"}]},{"word":"RAPPORTEUR","idx":26879,"count":962192,"meanings":[{"definitions":[{"definition":"A person appointed by a deliberative body to investigate an issue or a situation, and report back to that body."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɹæ.pɔɹˈtɜɹ/"},{"text":"/ˌɹæ.pɔːˈtɜː/"}]},{"word":"DESIRING","idx":26880,"count":962129,"meanings":[{"definitions":[{"definition":"To want; to wish for earnestly.","example":"I desire to speak with you."},{"definition":"To put a request to (someone); to entreat."},{"definition":"To want emotionally or sexually.","example":"She has desired him since they first met."},{"definition":"To express a wish for; to entreat; to request."},{"definition":"To require; to demand; to claim."},{"definition":"To miss; to regret."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A yearning for; a want."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈzaɪ(ə)ɹɪŋ/"}]},{"word":"POWERLINE","idx":26883,"count":961914,"meanings":[{"definitions":[{"definition":"An electrical wire, cable or conduit, suspended in air by utility poles or transmission towers, or buried underground, used for the carrying of electricity either from a power source such as a generating station to a substation, or from a substation to a building such as a plant, commercial building or a home."}],"partOfSpeech":"n"}]},{"word":"SAFEGUARDING","idx":26889,"count":961678,"meanings":[{"definitions":[{"definition":"To protect, to keep safe.","example":"She kept a savings to safeguard against debt and emergencies."},{"definition":"To escort safely."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Protection"}],"partOfSpeech":"n"}]},{"word":"GRATED","idx":26892,"count":961391,"meanings":[{"definitions":[{"definition":"To furnish with grates; to protect with a grating or crossbars","example":"to grate a window"},{"definition":"To shred (things, usually foodstuffs), by rubbing across a grater","example":"I need to grate the cheese before the potato is cooked."},{"definition":"To make an unpleasant rasping sound, often as the result of rubbing against something","example":"Listening to his teeth grate all day long drives me mad."},{"definition":"(by extension) to get on one's nerves; to irritate, annoy","example":"She’s nice enough, but she can begin to grate if there is no-one else to talk to."},{"definition":"(by extension) to annoy"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Produced by grating.","example":"I topped my chili with grated cheese and my mango soufflé with grated orange rind."},{"definition":"Furnished with a grate or grating.","example":"grated windows"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"grated-us","text":"[ˈɡɹeɪ̯ɾɪd]"}]},{"word":"SUBMARINES","idx":26894,"count":961254,"meanings":[{"definitions":[{"definition":"A boat that can go underwater."},{"definition":"A kind of sandwich made in a long loaf of bread."},{"definition":"Pitch delivered with an underhand motion."},{"definition":"Any submarine plant or animal."},{"definition":"A stowaway on a seagoing vessel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To operate or serve on a submarine."},{"definition":"To torpedo; to destroy with a sudden sneak attack."},{"definition":"(sometimes figurative) To sink or submerge oneself."}],"partOfSpeech":"ve"}]},{"word":"CHROMOSOMAL","idx":26896,"count":961144,"meanings":[{"definitions":[{"definition":"Of or relating to chromosomes."}],"partOfSpeech":"j"}]},{"word":"PROVOKE","idx":26898,"count":960917,"meanings":[{"definitions":[{"definition":"To cause someone to become annoyed or angry.","example":"Don't provoke the dog; it may try to bite you."},{"definition":"To bring about a reaction."},{"definition":"To appeal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"provoke-us","text":"/pɹəˈvoʊk/"}]},{"word":"SALESPERSON","idx":26901,"count":960705,"meanings":[{"definitions":[{"definition":"A person whose job is to sell things, either in a shop/store or elsewhere."}],"partOfSpeech":"n"}]},{"word":"SUPERFAMILY","idx":26902,"count":960628,"meanings":[{"definitions":[{"definition":"A taxonomic category above family and below order (and its subdivisions)."},{"definition":"A large group of related proteins or other molecules."}],"partOfSpeech":"n"}]},{"word":"ACCOMMODATING","idx":26904,"count":960249,"meanings":[{"definitions":[{"definition":"To render fit, suitable, or correspondent; to adapt.","example":"to accommodate ourselves to circumstances"},{"definition":"To cause to come to agreement; to bring about harmony; to reconcile.","example":"to accommodate differences"},{"definition":"To provide housing for.","example":"to accommodate an old friend for a week"},{"definition":"To provide with something desired, needed, or convenient.","example":"to accommodate a friend with a loan"},{"definition":"To do a favor or service for; to oblige."},{"definition":"To show the correspondence of; to apply or make suit by analogy; to adapt or fit, as teachings to accidental circumstances, statements to facts, etc.","example":"to accommodate prophecy to events"},{"definition":"To give consideration to; to allow for."},{"definition":"To contain comfortably; to have space for.","example":"This venue accommodates three hundred people."},{"definition":"To adapt oneself; to be conformable or adapted; become adjusted."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Affording, or disposed to afford, accommodation; obliging; helpful."},{"definition":"Pliable; easily corrupted."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ə.ˈkɒm.ə.ˌdeɪ.tɪŋ/"}]},{"word":"BANDED","idx":26908,"count":959981,"meanings":[{"definitions":[{"definition":"To fasten with a band."},{"definition":"To fasten an identifying band around the leg of (a bird)."},{"definition":"To group together for a common purpose; to confederate."},{"definition":"To group (students) together by perceived ability; to stream."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Marked with bands of colour"},{"definition":"Divided into bands"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈbændɪd/"}]},{"word":"DEPORTATION","idx":26909,"count":959947,"meanings":[{"definitions":[{"definition":"The act of deporting or exiling, or the state of being deported; banishment; transportation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/diːˌpɔːˈteɪʃən/"}]},{"word":"ZOOS","idx":26912,"count":959877,"meanings":[{"definitions":[{"definition":"A park where live animals are exhibited."},{"definition":"Any place that is wild, crowded, or chaotic.","example":"The shopping center was a zoo the week before Christmas."},{"definition":"The jungle."}],"partOfSpeech":"n"}]},{"word":"ACTIVATES","idx":26913,"count":959851,"meanings":[{"definitions":[{"definition":"To encourage development or induce increased activity; to stimulate."},{"definition":"To put a device, mechanism (alarm etc.) or system into action or motion; to trigger, to actuate, to set off, to enable."},{"definition":"To render more reactive; excite."},{"definition":"To render a molecule reactive, active, or effective in performing its function."},{"definition":"To render a substance radioactive."},{"definition":"To hasten a chemical reaction, especially by heating."},{"definition":"To remove the limitations of demoware by providing a license; to unlock."},{"definition":"To aerate in order to aid decomposition of organic matter."},{"definition":"To organize or create a military unit or station."},{"definition":"To bring a player back after an injury."}],"partOfSpeech":"ve"}]},{"word":"CUTTINGS","idx":26914,"count":959725,"meanings":[{"definitions":[{"definition":"The action of the verb to cut.","example":"How many different cuttings can this movie undergo?"},{"definition":"A section removed from a larger whole."},{"definition":"An abridged selection of written work, often intended for performance.","example":"The actor had to make his cutting shorter to fit the audition time."},{"definition":"An open passage at a level lower than the surrounding terrain, dug for a canal, railway, or road to go through."},{"definition":"(sound engineering) The editing of film or other recordings."},{"definition":"The process of bringing metals to a desired shape by chipping away the unwanted material.","example":"Boring, drilling, milling, and turning are all different kinds of metal cutting processes."},{"definition":"The act of cutting one's own skin as a symptom of a mental disorder; self-harm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkʌtɪŋz/"}]},{"word":"HIBERNATE","idx":26915,"count":959696,"meanings":[{"definitions":[{"definition":"To spend winter time in hibernation."},{"definition":"To live in seclusion."},{"definition":"To enter a standby state which conserves power without losing the contents of memory."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈhaɪbəˌneɪt/"}]},{"word":"INVESTS","idx":26917,"count":959654,"meanings":[{"definitions":[{"definition":"To spend money, time, or energy on something, especially for some benefit or purpose; used with in.","example":"We'd like to thank all the contributors who have invested countless hours into this event."},{"definition":"To clothe or wrap (with garments)."},{"definition":"To put on (clothing)."},{"definition":"To envelop, wrap, cover."},{"definition":"To commit money or capital in the hope of financial gain."},{"definition":"To ceremonially install someone in some office."},{"definition":"To formally give (someone) some power or authority."},{"definition":"To formally give (power or authority)."},{"definition":"To surround, accompany, or attend."},{"definition":"To lay siege to.","example":"to invest a town"},{"definition":"To make investments."},{"definition":"To prepare for lost wax casting by creating an investment mold (a mixture of a silica sand and plaster)."},{"definition":"To be involved in; to form strong attachments to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An unnamed tropical weather pattern \"to investigate\" for development into a significant (named) system."}],"partOfSpeech":"n"}]},{"word":"EXTREMISTS","idx":26918,"count":959602,"meanings":[{"definitions":[{"definition":"A person who holds extreme views, especially one who advocates such views; a radical or fanatic."}],"partOfSpeech":"n"}]},{"word":"SCULPTOR","idx":26920,"count":959376,"meanings":[{"definitions":[{"definition":"A person who sculpts; an artist who produces sculpture."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sculptor-us","text":"/ˈskʌlptɚ/"}]},{"word":"COMMENDED","idx":26923,"count":959180,"meanings":[{"definitions":[{"definition":"To congratulate or reward.","example":"The schoolboy was commended for raising the alarm about the burning building."},{"definition":"To praise or acclaim."},{"definition":"To entrust or commit to the care of someone else."},{"definition":"To mention by way of courtesy, implying remembrance and goodwill."},{"definition":"To recommend."},{"definition":"To adorn; to set off."}],"partOfSpeech":"ve"}]},{"word":"ROPER","idx":26924,"count":959126,"meanings":[{"definitions":[{"definition":"An accomplice who locates a mark to be swindled by a confidence trickster."},{"definition":"Agent noun of rope; one who uses a rope, especially one who throws a lariat or lasso."},{"definition":"A maker of ropes."},{"definition":"One who ropes goods; a packer."},{"definition":"A crafty fellow; one fit to be hanged."},{"definition":"A person hired by a gambling establishment to locate potential customers and bring them in."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"roper-au"}]},{"word":"NARROWING","idx":26925,"count":959121,"meanings":[{"definitions":[{"definition":"To reduce in width or extent; to contract.","example":"We need to narrow the search."},{"definition":"To get narrower.","example":"The road narrows."},{"definition":"(of a person or eyes) To partially lower one's eyelids in a way usually taken to suggest a defensive, aggressive or penetrating look.","example":"He stepped in front of me, narrowing his eyes to slits."},{"definition":"To contract the size of, as a stocking, by taking two stitches into one."},{"definition":"To convert to a data type that cannot hold as many distinct values.","example":"to narrow an int variable to a short variable"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of becoming narrow.","example":"narrowings of the road"},{"definition":"The part of a stocking that is narrowed."}],"partOfSpeech":"n"}]},{"word":"CYCLICAL","idx":26927,"count":958986,"meanings":[{"definitions":[{"definition":"Recurring at regular intervals"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsaɪklɪkəl/"}]},{"word":"MECHANICALLY","idx":26928,"count":958903,"meanings":[{"definitions":[{"definition":"In a mechanical manner."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/məˈkænɪkli/"}]},{"word":"CYTOKINES","idx":26929,"count":958861,"meanings":[{"definitions":[{"definition":"Any of various small regulatory proteins that regulate the cells of the immune system."}],"partOfSpeech":"n"}]},{"word":"IMPROVISATION","idx":26930,"count":958793,"meanings":[{"definitions":[{"definition":"The act or art of composing and making music, poetry, and the like, extemporaneously","example":"He played a quick improvisation on the keyboard."},{"definition":"That which is improvised; an impromptu."},{"definition":"Musical technique, characteristic of blues music."},{"definition":"The act of improvising, acting or going about something without planning ahead"}],"partOfSpeech":"n"}]},{"word":"PROFANITY","idx":26931,"count":958756,"meanings":[{"definitions":[{"definition":"The quality of being profane; quality of irreverence, of treating sacred things with contempt."},{"definition":"Obscene, lewd or abusive language.","example":"He ran up and down the street screaming profanities like a madman."}],"partOfSpeech":"n"}]},{"word":"TOURED","idx":26933,"count":958722,"meanings":[{"definitions":[{"definition":"To make a journey","example":"The Rolling Stones were still touring when they were in their seventies."},{"definition":"To make a circuit of a place","example":"The circuses have been touring Europe for the last few weeks."},{"definition":"To toot a horn."}],"partOfSpeech":"ve"}]},{"word":"PLAYMATE","idx":26939,"count":958445,"meanings":[{"definitions":[{"definition":"A companion for someone (especially a child) to play with."},{"definition":"A female who has appeared as the centerfold in Playboy magazine."},{"definition":"A person's lover."}],"partOfSpeech":"n"}]},{"word":"COVARIANCE","idx":26941,"count":958402,"meanings":[{"definitions":[{"definition":"A statistical measure defined as \\scriptstyle\\operatorname{Cov}(X, Y) = \\operatorname{E}((X - \\mu) (Y - \\nu)) given two real-valued random variables X and Y, with expected values \\scriptstyle E(X)\\,=\\,\\mu and \\scriptstyle E(Y)\\,=\\,\\nu."},{"definition":"The conversion of data types from wider to narrower in certain situations."}],"partOfSpeech":"n"}]},{"word":"SCUM","idx":26942,"count":958309,"meanings":[{"definitions":[{"definition":"A layer of impurities that accumulates at the surface of a liquid (especially molten metal or water).","example":"During smelting, scum rises to the surface and is then removed by the smelter."},{"definition":"A greenish water vegetation (such as algae), usually found floating on the surface of ponds","example":"These organisms form scum in large quantities."},{"definition":"The topmost liquid layer of a cesspool or septic tank."},{"definition":"(chiefly US) semen"},{"definition":"A reprehensible person or persons.","example":"People who sell used-up pens are scum, just total low-lives."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the layer of scum from (a liquid etc.)."},{"definition":"To remove (something) as scum."},{"definition":"To become covered with scum."},{"definition":"To scour (the land, sea etc.)."},{"definition":"To gather together, as scum."},{"definition":"To startscum or savescum."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scum-us","text":"/skʌm/"}]},{"word":"BOBBLE","idx":26943,"count":958150,"meanings":[{"definitions":[{"definition":"A furry ball attached on top of a hat."},{"definition":"Elasticated band used for securing hair (for instance in a ponytail), a hair tie"},{"definition":"A pill (a ball formed on the surface of the fabric, as on laundered clothes)."},{"definition":"A localized set of stitches forming a raised bump."},{"definition":"A wobbling motion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bob up and down."},{"definition":"To make a mistake in."},{"definition":"To roll slowly."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bobble-uk","text":"/ˈbɒbəl/"}]},{"word":"SEASONING","idx":26944,"count":958129,"meanings":[{"definitions":[{"definition":"Something used to add taste or flavour to food, such as salt and pepper or other condiment, herb or spice."},{"definition":"(by extension) Anything added to increase enjoyment."},{"definition":"A coat of polymerized oil inside a cooking vessel which renders the surface non-stick."},{"definition":"An alcoholic intoxication.","example":"Some of our gentlemen officers, happening to stop at a tavern, or rather a sort of grogshop, took such a seasoning that two or three of them became “quite frisky.”"},{"definition":"In diamond-cutting, the charging of the laps or wheels with diamond dust and oil."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make fit for any use by time or habit; to habituate; to accustom; to inure.","example":"to season oneself to a climate"},{"definition":"(by extension) To prepare by drying or hardening, or removal of natural juices.","example":"The timber needs to be seasoned."},{"definition":"To become mature; to grow fit for use; to become adapted to a climate."},{"definition":"To become dry and hard, by the escape of the natural juices, or by being penetrated with other substance.","example":"The wood has seasoned in the sun."},{"definition":"To mingle: to moderate, temper, or qualify by admixture."},{"definition":"To copulate with; to impregnate."},{"definition":"To flavour food with spices, herbs or salt."}],"partOfSpeech":"ve"}]},{"word":"AIRFIELD","idx":26947,"count":958086,"meanings":[{"definitions":[{"definition":"An open field designated for the taking off and landing of aircraft, but which, unlike an airport, does not necessarily have terminals or paved runways."}],"partOfSpeech":"n"}]},{"word":"FLIPPING","idx":26948,"count":958055,"meanings":[{"definitions":[{"definition":"To throw so as to turn over.","example":"You need to flip the pancake onto the other side."},{"definition":"To put into a quick revolving motion through a snap of the thumb and index finger.","example":"If you can't decide which option to go for, flip a coin."},{"definition":"To win a state (or county) won by another party in the preceding elections","example":"Wisconsin had been Democratic for decades, but the Republicans flipped it in 2016."},{"definition":"To turn state's evidence; to agree to testify against one's co-conspirators in exchange for concessions from prosecutors.","example":"The mafioso flipped on his superiors to get a lighter sentence."},{"definition":"To induce someone to turn state's evidence; to get someone to agree to testify against their co-conspirators in exchange for concessions.","example":"The district attorney was able to strengthen his case against the bank robber by flipping the getaway driver."},{"definition":"To go berserk or crazy.","example":"I'd flip if anyone broke my phone."},{"definition":"To buy an asset (usually a house), improve it and sell it quickly for profit."},{"definition":"To invert a bit (binary digit), changing it from 0 to 1 or from 1 to 0."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The practice of buying real estate, making improvements to it, and reselling it for a higher price."}],"partOfSpeech":"n"},{"definitions":[{"definition":"A mild intensifier.","example":"Where's my flipping watch?"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Fucking; used as an intensifier to modify verbs, adjectives, and other adverbs","example":"Do you flipping think I'm stupid?"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈflɪpɪŋ/"}]},{"word":"DISRUPTED","idx":26949,"count":958043,"meanings":[{"definitions":[{"definition":"To throw into confusion or disorder.","example":"Hecklers disrupted the man's speech."},{"definition":"To interrupt or impede.","example":"Work on the tunnel was disrupted by a strike."},{"definition":"To improve a product or service in ways that displace an established one and surprise the market.","example":"The internet makes it easier for leaner businesses to disrupt the larger and more unwieldy ones."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Subject to disruption."}],"partOfSpeech":"j"}]},{"word":"ADJOURN","idx":26951,"count":957864,"meanings":[{"definitions":[{"definition":"To postpone.","example":"The trial was adjourned for a week."},{"definition":"To defer; to put off temporarily or indefinitely."},{"definition":"To end or suspend an event.","example":"The court will adjourn for lunch."},{"definition":"To move as a group from one place to another.","example":"After the dinner, we will adjourn to the bar."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"adjourn-us","text":"/əˈdʒɝn/"}]},{"word":"RESTOCKING","idx":26952,"count":957711,"meanings":[{"definitions":[{"definition":"To stock again; to resupply with stocks."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of replenishing stock.","example":"The new product sold so rapidly that the shelves needed two restockings in a day."}],"partOfSpeech":"n"}]},{"word":"LGBT","idx":26953,"count":957692,"meanings":[{"definitions":[{"definition":"Initialism of lesbian, gay, bisexual and transgender/transsexual (community)."},{"definition":"(chiefly in the plural) A member of the LGBT community.","example":"2018 Disgraced former Fox News host Bill O’Reilly claims ‘the LGBTs’ are trying to rid America of white men Pink News"}],"partOfSpeech":"n"}]},{"word":"WIDOWS","idx":26955,"count":957656,"meanings":[{"definitions":[{"definition":"A woman whose spouse has died (and who has not remarried); feminine of widower."},{"definition":"A person whose spouse has died (and who has not remarried)."},{"definition":"(in combination) A woman whose husband is often away pursuing a sport, etc."},{"definition":"An additional hand of cards dealt face down in some card games, to be used by the highest bidder."},{"definition":"A single line of type that ends a paragraph, carried over to the next page or column."},{"definition":"A venomous spider, of the genus Latrodectus."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a widow or widower of someone; to cause the death of the spouse of."},{"definition":"To strip of anything valued."},{"definition":"To endow with a widow's right."},{"definition":"To be widow to."}],"partOfSpeech":"ve"}]},{"word":"CONVEYING","idx":26956,"count":957594,"meanings":[{"definitions":[{"definition":"To move (something) from one place to another.","example":"Air conveys sound. Water is conveyed through the pipe."},{"definition":"To take or carry (someone) from one place to another."},{"definition":"To communicate; to make known; to portray.","example":"to convey an impression; to convey information"},{"definition":"To transfer legal rights (to).","example":"He conveyed ownership of the company to his daughter."},{"definition":"To manage with privacy; to carry out."},{"definition":"To carry or take away secretly; to steal; to thieve."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kənˈveɪɪŋ/"}]},{"word":"CITRINE","idx":26957,"count":957591,"meanings":[{"definitions":[{"definition":"A goldish-yellow colour, like that of a lemon."},{"definition":"A brownish-yellow quartz."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a goldish-yellow colour."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɪtɹain/"},{"text":"/ˈsɪtɹin/"}]},{"word":"NEOPLASM","idx":26958,"count":957579,"meanings":[{"definitions":[{"definition":"An abnormal new growth of disorganized tissue in animals or plants."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"neoplasm-us","text":"/ˈniːoʊˌplæzəm/"},{"audio":"neoplasm-au","text":"/ˈniːoʊˌplæzəm/"}]},{"word":"RETHINKING","idx":26959,"count":957374,"meanings":[{"definitions":[{"definition":"To think again about a problem."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of thinking again or differently.","example":"rethinkings of the capitalist system"}],"partOfSpeech":"n"}]},{"word":"PRECINCTS","idx":26961,"count":957247,"meanings":[{"definitions":[{"definition":"(chiefly in the plural) An enclosed space having defined limits, normally marked by walls."},{"definition":"A pedestrianized and uncovered shopping area."},{"definition":"(law enforcement) A subdivision of a city under the jurisdiction of a specific group of police; the police station situated in that district."},{"definition":"A subdivision of a city or town for the purposes of voting and representation in city or town government. In cities, precincts may be grouped into wards."}],"partOfSpeech":"n"}]},{"word":"ORIENTATIONS","idx":26962,"count":957179,"meanings":[{"definitions":[{"definition":"The determination of the relative position of something or someone."},{"definition":"The relative physical position or direction of something."},{"definition":"The construction of a Christian church to have its aisle in an east-west direction with the altar at the east end."},{"definition":"An inclination, tendency or direction."},{"definition":"The ability to orient.","example":"The homing instinct in pigeons is an example of orientation."},{"definition":"An adjustment to a new environment."},{"definition":"An introduction to a (new) environment."},{"definition":"The direction of print across the page; landscape or portrait."},{"definition":"The choice of which ordered bases are \"positively\" oriented and which are \"negatively\" oriented on a real vector space."},{"definition":"The designation of a parametrised curve as \"positively\" or \"negatively\" oriented (or \"nonorientable\"); the analogous description of a surface or hypersurface."}],"partOfSpeech":"n"}]},{"word":"MEDIUMS","idx":26964,"count":957106,"meanings":[{"definitions":[{"definition":"(plural media or mediums) The chemistry of the surrounding environment, e.g. solid, liquid, gas, vacuum, or a specific substance such as a solvent."},{"definition":"(plural media or mediums) The materials or empty space through which signals, waves or forces pass."},{"definition":"(plural media or mediums) A format for communicating or presenting information."},{"definition":"(plural media or mediums) The materials used to finish a workpiece using a mass finishing or abrasive blasting process."},{"definition":"(plural media or mediums) A nutrient solution for the growth of cells in vitro."},{"definition":"(plural media or mediums) The means, channel, or agency by which an aim is achieved."},{"definition":"(plural mediums or media) A liquid base which carries pigment in paint."},{"definition":"(plural mediums or media) A tool used for painting or drawing.","example":"Acrylics, oils, charcoal, and gouache are all mediums I used in my painting."},{"definition":"(plural mediums) Someone who supposedly conveys information from the spirit world."},{"definition":"(plural mediums) Anything having a measurement intermediate between extremes, such as a garment or container."},{"definition":"(plural mediums) A person whom garments or apparel of intermediate size fit."},{"definition":"(plural mediums) A half-pint serving of Guinness (or other stout in some regions)."},{"definition":"A middle place or degree.","example":"a happy medium"},{"definition":"An average; sometimes the mathematical mean."},{"definition":"The mean or middle term of a syllogism, that by which the extremes are brought into connection."}],"partOfSpeech":"n"}]},{"word":"CALUMET","idx":26965,"count":957088,"meanings":[{"definitions":[{"definition":"A clay tobacco-pipe used by American Indians, especially as a symbol of truce or peace."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæljʊmɛt/"}]},{"word":"PELLET","idx":26966,"count":957052,"meanings":[{"definitions":[{"definition":"A small, compressed, hard chunk of matter.","example":"a pellet of wood, paper, or ore"},{"definition":"A lead projectile used as ammunition in rifled air guns."},{"definition":"Compressed byproduct of digestion regurgitated by owls. Serves as a waste disposal mechanism for indigestible parts of food, such as fur and bones."},{"definition":"A roundel sable (black circular spot; also called ogress)."},{"definition":"One of the short conductive tubes in a Pelletron particle accelerator."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into pellets."},{"definition":"To strike with pellets."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pellet-uk","text":"/ˈpɛlɪt/"}]},{"word":"DISCERN","idx":26967,"count":957040,"meanings":[{"definitions":[{"definition":"To detect with the senses, especially with the eyes."},{"definition":"To perceive, recognize, or comprehend with the mind; to descry."},{"definition":"To distinguish something as being different from something else; to differentiate.","example":"He was too young to discern right from wrong."},{"definition":"To perceive differences."}],"partOfSpeech":"ve"}]},{"word":"BRAN","idx":26968,"count":957029,"meanings":[{"definitions":[{"definition":"The broken coat of the seed of wheat, rye, or other cereal grain, separated from the flour or meal by sifting or bolting; the coarse, chaffy part of ground grain."},{"definition":"The European carrion crow."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bran-uk","text":"/ˈbɹæn/"}]},{"word":"DOGGIE","idx":26969,"count":956964,"meanings":[{"definitions":[{"definition":"A dog, especially a small one.","example":"That's such a cute little doggy, Keira!"},{"definition":"Doggy style","example":"Her favourite position is doggy."},{"definition":"(armed services) A junior temporarily assigned to do minor duties for a senior; a gofer."}],"partOfSpeech":"n"}]},{"word":"INFLOW","idx":26970,"count":956879,"meanings":[{"definitions":[{"definition":"The act or process of flowing in or into"},{"definition":"Anything which flows in or into","example":"The inflow of air"},{"definition":"Influence from outside."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flow in."}],"partOfSpeech":"ve"}]},{"word":"LYMPHOCYTE","idx":26972,"count":956696,"meanings":[{"definitions":[{"definition":"A type of white blood cell with a spherical nucleus occurring in the lymphatic system, including B cells, T cells and natural killer cells."}],"partOfSpeech":"n"}]},{"word":"FUMES","idx":26973,"count":956671,"meanings":[{"definitions":[{"definition":"A gas or vapour/vapor that is strong-smelling or dangerous to inhale.","example":"Don't stand around in there breathing the fumes while the adhesive cures."},{"definition":"A material that has been vaporized from the solid or liquid state to the gas state and re-coalesced to the solid state.","example":"Lead fume is a greyish powder, mainly comprising lead sulfate."},{"definition":"Rage or excitement which deprives the mind of self-control.","example":"the fumes of passion"},{"definition":"Anything unsubstantial or airy; idle conceit; vain imagination."},{"definition":"The incense of praise; inordinate flattery."},{"definition":"A passionate person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To expose (something) to fumes; specifically, to expose wood, etc., to ammonia in order to produce dark tints."},{"definition":"To apply or offer incense to."},{"definition":"To emit fumes."},{"definition":"To pass off in fumes or vapours."},{"definition":"To express or feel great anger.","example":"He’s still fuming about the argument they had yesterday."},{"definition":"To be as in a mist; to be dulled and stupefied."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fjuːmz/"}]},{"word":"FUTILE","idx":26974,"count":956638,"meanings":[{"definitions":[{"definition":"Incapable of producing results; doomed not to be successful; not worth attempting."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfju.taɪ.əl/"},{"text":"/ˈfjuː.taɪl/"}]},{"word":"DISQUALIFIED","idx":26976,"count":956438,"meanings":[{"definitions":[{"definition":"To make ineligible for something.","example":"My age disqualifies me for the position."},{"definition":"To exclude from consideration by the explicit revocation of a previous qualification.","example":"The athlete was disqualified after performance-enhancing drugs were found in his hotel room."}],"partOfSpeech":"ve"}]},{"word":"FENCED","idx":26977,"count":956261,"meanings":[{"definitions":[{"definition":"To enclose, contain or separate by building fence."},{"definition":"To defend or guard."},{"definition":"To engage in the selling or buying of stolen goods."},{"definition":"To engage in the sport of fencing."},{"definition":"To jump over a fence."},{"definition":"To conceal the truth by giving equivocal answers; to hedge; to be evasive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Surrounded by a fence; enclosed."}],"partOfSpeech":"j"}]},{"word":"WHITEBOARD","idx":26979,"count":956145,"meanings":[{"definitions":[{"definition":"A writing board finished with a hard white material, which can be written upon using special non-permanent markers and subsequently wiped clean."},{"definition":"(by extension) A collaborative tool allowing several users to write and draw on the same shared display."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwaɪtbɔːd/"}]},{"word":"EEL","idx":26980,"count":956144,"meanings":[{"definitions":[{"definition":"Any freshwater or marine fish of the order Anguilliformes, which are elongated and resemble snakes."},{"definition":"The European eel, Anguilla anguilla."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fish for eels."},{"definition":"To move with a sinuous motion like that of an eel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"eel-us","text":"/iːl/"}]},{"word":"ANIMATE","idx":26981,"count":956038,"meanings":[{"definitions":[{"definition":"To impart motion or the appearance of motion to.","example":"If we animate the model, we can see the complexity of the action."},{"definition":"To give spirit or vigour to; to stimulate or enliven; to inspirit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That which lives."},{"definition":"Possessing the quality or ability of motion."},{"definition":"Dynamic, energetic.","example":"She is an engaging and animate speaker."},{"definition":"(grammar, of a noun or pronoun) Having a referent that includes a human, animal, plant or other entity which is considered alive.","example":"Nouns can be singular or plural, and one of two genders, animate or inanimate."},{"definition":"(grammar) Inflected to agree with an animate noun or pronoun."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"animate-us","text":"/ˈæ.nə.meɪt/"}]},{"word":"FARO","idx":26984,"count":955606,"meanings":[{"definitions":[{"definition":"A game of chance played by betting on the order in which certain cards will appear when taken singly from the top of the pack."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɛəɹəʊ/"}]},{"word":"RESEMBLING","idx":26985,"count":955572,"meanings":[{"definitions":[{"definition":"To be like or similar to (something); to represent as similar.","example":"The twins resemble each other."},{"definition":"To compare; to regard as similar, to liken."},{"definition":"To counterfeit; to imitate."},{"definition":"To cause to imitate or be like; to make similar."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to resemble."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"resembling-us","text":"/ɹɪˈzɛmblɪŋ/"}]},{"word":"INVERTEBRATES","idx":26987,"count":955451,"meanings":[{"definitions":[{"definition":"An animal without vertebrae, i.e. backbone."},{"definition":"A spineless person; a coward."}],"partOfSpeech":"n"}]},{"word":"TOTEM","idx":26988,"count":955271,"meanings":[{"definitions":[{"definition":"Any natural object or living creature that serves as an emblem of a tribe, clan or family."},{"definition":"The representation of such object or creature."},{"definition":"The clan whose kinship is defined in reference to such an object or creature."},{"definition":"An arbitrarily chosen object serving as a reminder to check whether one is awake or not, to aid in having lucid dreams."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtoʊtəm/"},{"text":"/ˈtəʊtəm/"}]},{"word":"ELLIPTIC","idx":26989,"count":955168,"meanings":[{"definitions":[{"definition":"Of or pertaining to an ellipse."},{"definition":"Of or pertaining to a broad field of mathematics that originates from the problem of calculating arc lengths of an ellipse.","example":"Elliptic curve"},{"definition":"(in combination, of certain functions, equations and operators) That has coefficients satisfying a condition analogous to the condition for the general equation for a conic section to be of an ellipse.","example":"Elliptic operator"},{"definition":"(of leaves) Oval, with a short or no point."}],"partOfSpeech":"j"}]},{"word":"AGONIST","idx":26991,"count":955141,"meanings":[{"definitions":[{"definition":"Someone involved in a contest or battle (as in an agon), protagonist."},{"definition":"The muscle that contracts while the other relaxes.","example":"When bending the elbow, the biceps is the agonist."},{"definition":"A molecule that can combine with a receptor on a cell to produce a physiological reaction.","example":"Acetylcholine is an agonist at the cholinergic receptor."}],"partOfSpeech":"n"}]},{"word":"EXPERIMENTALLY","idx":26992,"count":955140,"meanings":[{"definitions":[{"definition":"In the manner of an experiment"}],"partOfSpeech":"v"}]},{"word":"DRINKERS","idx":26994,"count":954994,"meanings":[{"definitions":[{"definition":"Agent noun of drink; someone or something that drinks."},{"definition":"Someone who drinks alcoholic beverages on a regular basis."},{"definition":"A device from which animals can drink.","example":"a bell drinker"},{"definition":"A pub."}],"partOfSpeech":"n"}]}]