[{"word":"NETTLES","idx":59149,"count":248995,"meanings":[{"definitions":[{"definition":"Any plant whose foliage is covered with stinging, mildly poisonous hairs, causing an instant rash."},{"definition":"Certain plants that have spines or prickles:"},{"definition":"Certain non-stinging plants, mostly in the family Lamiaceae, that resemble the species of Urtica:"},{"definition":"Loosely, anything which causes a similarly stinging rash, such as a jellyfish or sea nettle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of the nettle plant and similar physical causes, to sting, causing a rash in someone.","example":"The children were badly nettled after playing in the field."},{"definition":"To pique, irritate, vex or provoke."}],"partOfSpeech":"ve"}]},{"word":"SUNRAY","idx":59151,"count":248980,"meanings":[{"definitions":[{"definition":"A beam of sunlight; a sunbeam"},{"definition":"A beam of artificial light, especially one rich in ultraviolet"},{"definition":"A plant, Enceliopsis nudicaulis, that has a broad, yellow flowerhead"}],"partOfSpeech":"n"}]},{"word":"SCUD","idx":59154,"count":248971,"meanings":[{"definitions":[{"definition":"The act of scudding."},{"definition":"Clouds or rain driven by the wind."},{"definition":"A loose formation of small ragged cloud fragments (or fog) not attached to a larger higher cloud layer."},{"definition":"A gust of wind."},{"definition":"A scab on a wound."},{"definition":"A small flight of larks, or other birds, less than a flock."},{"definition":"Any swimming amphipod."},{"definition":"A swift runner."},{"definition":"A form of garden hoe."},{"definition":"A slap; a sharp stroke."},{"definition":"Pornography."},{"definition":"The drink Irn-Bru.","example":"a bottle of scud"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To race along swiftly (especially used of clouds)."},{"definition":"To run, or be driven, before a high wind with no sails set."},{"definition":"To hit or slap."},{"definition":"To speed."},{"definition":"To skim flat stones so they skip along the water."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Naked."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"scud-au"}]},{"word":"CULMINATE","idx":59159,"count":248953,"meanings":[{"definitions":[{"definition":"Of a heavenly body, to be at the highest point, reach its greatest altitude."},{"definition":"To reach the (physical) summit, highest point, peak etc."},{"definition":"To reach a climax; to come to the decisive point (especially as an end or conclusion).","example":"The class will culminate with a rigorous examination."},{"definition":"To finalize, bring to a conclusion, form the climax of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Relating to the culmen"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"culminate-uk","text":"/ˈkʌlmɪneɪt/"}]},{"word":"DECONSTRUCTING","idx":59162,"count":248941,"meanings":[{"definitions":[{"definition":"To break something down into its component parts."},{"definition":"To analyse in terms of deconstruction (a philosophical theory of textual criticism)."},{"definition":"To analyse (generally)."},{"definition":"To critique (generally)."},{"definition":"(especially US sports) To destroy.","example":"2014, Ian Levy, 2014 Jun 16, The Spurs’ Deconstruction of the Heat Is Now Complete"}],"partOfSpeech":"ve"}]},{"word":"CORRELATING","idx":59163,"count":248941,"meanings":[{"definitions":[{"definition":"To compare things and bring them into a relation having corresponding characteristics"},{"definition":"To be related by a correlation"}],"partOfSpeech":"ve"}]},{"word":"RAKED","idx":59164,"count":248939,"meanings":[{"definitions":[{"definition":"To walk; to roam, to wander."},{"definition":"Of animals (especially sheep): to graze."},{"definition":"To roam or wander through (somewhere)."},{"definition":"To act upon with a rake, or as if with a rake.","example":"She is raking the gravel path to keep it even."},{"definition":"To move swiftly; to proceed rapidly."},{"definition":"Of a bird of prey: to fly after a quarry; also, to fly away from the falconer, to go wide of the quarry being pursued."},{"definition":"To incline (something) from a perpendicular direction.","example":"A mast rakes aft."},{"definition":"Senses relating to watercraft."},{"definition":"To behave as a rake; to lead a hedonistic and immoral life."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sloping"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹeɪkt/"}]},{"word":"FUMIGATION","idx":59165,"count":248917,"meanings":[{"definitions":[{"definition":"The act of fumigating, or applying smoke or vapor, as for disinfection."},{"definition":"Vapor raised in the process of fumigating."}],"partOfSpeech":"n"}]},{"word":"PRECONCEPTION","idx":59168,"count":248902,"meanings":[{"definitions":[{"definition":"An opinion formed before obtaining adequate evidence, especially as the result of bias or prejudice."},{"definition":"A prejudice that prevents rational consideration of an issue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Preconceptional."}],"partOfSpeech":"j"}]},{"word":"BIM","idx":59169,"count":248902,"meanings":[{"definitions":[{"definition":"Woman"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bim-au"}]},{"word":"JUSTIFIABLY","idx":59170,"count":248885,"meanings":[{"definitions":[{"definition":"In a justifiable manner; with justification"}],"partOfSpeech":"v"}]},{"word":"CRUISED","idx":59173,"count":248855,"meanings":[{"definitions":[{"definition":"To sail about, especially for pleasure."},{"definition":"To travel at constant speed for maximum operating efficiency."},{"definition":"To move about an area leisurely in the hope of discovering something, or looking for custom."},{"definition":"To inspect (forest land) for the purpose of estimating the quantity of lumber it will yield."},{"definition":"To actively seek a romantic partner or casual sexual partner by moving about a particular area; to troll."},{"definition":"(child development) To walk while holding on to an object (stage in development of ambulation, typically occurring at 10 months)."},{"definition":"To win easily and convincingly.","example":"Germany cruised to a World Cup victory over the short-handed Australians."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kɹuːzd/"}]},{"word":"STUPIDLY","idx":59175,"count":248850,"meanings":[{"definitions":[{"definition":"In a stupid manner."}],"partOfSpeech":"v"}]},{"word":"LASHING","idx":59176,"count":248838,"meanings":[{"definitions":[{"definition":"To strike with a lash; to whip or scourge with a lash, or with something like one."},{"definition":"To strike forcibly and quickly, as with a lash; to beat, or beat upon, with a motion like that of a lash."},{"definition":"To throw out with a jerk or quickly."},{"definition":"To scold; or to satirize; to censure with severity."},{"definition":"To ply the whip; to strike."},{"definition":"To utter censure or sarcastic language."},{"definition":"(of rain) To fall heavily, especially in the phrase lash down"},{"definition":"To bind with a rope, cord, thong, or chain, so as to fasten.","example":"lash a pack on a horse's back"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something used to tie something or lash it to something.","example":"The lashings, which had been holding the chest to the deck of the storm-tossed ship, broke, and it went overboard."},{"definition":"(in the form \"lashings of\"): plenty of","example":"Lashings of ginger beer"},{"definition":"The act of one who, or that which, lashes; castigation; chastisement."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lashing-au","text":"/ˈlæʃɪŋ/"}]},{"word":"OCCIPITAL","idx":59177,"count":248834,"meanings":[{"definitions":[{"definition":"The occipital bone."},{"definition":"An occipital scale in reptiles."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the occiput (back of the head) or the occipital bone."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɒk.ˈsɪp.ɪt.əl/"}]},{"word":"THEISM","idx":59179,"count":248823,"meanings":[{"definitions":[{"definition":"Belief in the existence of at least one deity."},{"definition":"(narrowly) Belief in the existence of a personal creator god, goddess, gods and/or goddesses present and active in the governance and organization of the world and the universe. The God may be known by or through revelation."},{"definition":"A morbid condition resulting from excessive consumption of tea."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈθiɪzəm/"}]},{"word":"GAUDY","idx":59181,"count":248813,"meanings":[{"definitions":[{"definition":"One of the large beads in the rosary at which the paternoster is recited."},{"definition":"A reunion held by one of the colleges of the University of Oxford for alumni, normally held during the summer vacations."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Very showy or ornamented, now especially when excessive, or in a tasteless or vulgar manner"},{"definition":"Fun; merry; festive"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɡɔ.di/"},{"text":"/ˈɡɔː.di/"},{"audio":"gaudy-au"}]},{"word":"TABLING","idx":59194,"count":248717,"meanings":[{"definitions":[{"definition":"To tabulate; to put into a table or grid.","example":"to table fines"},{"definition":"To supply (a guest, client etc.) with food at a table; to feed."},{"definition":"To delineate; to represent, as in a picture; to depict."},{"definition":"(non-US) To put on the table of a commission or legislative assembly; to propose for formal discussion or consideration, to put on the agenda."},{"definition":"To remove from the agenda, to postpone dealing with; to shelve (to indefinitely postpone consideration or discussion of something).","example":"The legislature tabled the amendment, so they will not be discussing it until later."},{"definition":"To join (pieces of timber) together using coaks."},{"definition":"To put on a table."},{"definition":"To make board hems in the skirts and bottoms of (sails) in order to strengthen them in the part attached to the bolt-rope."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A forming into tables; a setting down in order."},{"definition":"The letting of one timber into another by alternate scores or projections, as in shipbuilding; a crude form of dovetailing."},{"definition":"A broad hem on the edge of a sail."},{"definition":"Board; support"}],"partOfSpeech":"n"}]},{"word":"SWOON","idx":59199,"count":248694,"meanings":[{"definitions":[{"definition":"A faint."},{"definition":"An infatuation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To faint, to lose consciousness."},{"definition":"(by extension) To be overwhelmed by emotion, especially infatuation."},{"definition":"To make a moan, sigh, or some other sound expressing infatuation or affection.","example":"The girls swooned at the picture of their favorite actor."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/swuːn/"}]},{"word":"HUNDREDTHS","idx":59203,"count":248663,"meanings":[{"definitions":[{"definition":"The person or thing in the hundredth position."},{"definition":"One of a hundred equal parts of a whole."}],"partOfSpeech":"n"}]},{"word":"BUCKSKIN","idx":59204,"count":248642,"meanings":[{"definitions":[{"definition":"The skin of a male deer, a buck."},{"definition":"Clothing made from buckskin."},{"definition":"A grayish yellow in colour."},{"definition":"A soft strong leather, usually yellowish or grayish in color, made of deerskin."},{"definition":"A person clothed in buckskin, particularly an American soldier of the Revolutionary war."},{"definition":"Breeches made of buckskin."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a grayish yellow in colour."}],"partOfSpeech":"j"}]},{"word":"BRICKYARD","idx":59205,"count":248633,"meanings":[{"definitions":[{"definition":"A factory where bricks are produced or distributed"}],"partOfSpeech":"n"}]},{"word":"CAPTCHA","idx":59209,"count":248625,"meanings":[{"definitions":[{"definition":"A computerized test requiring the human user to perform a task deemed to be difficult to automate, such as entering a displayed series of distorted characters or describing images, to demonstrate that he/she is a human and not a computer program."}],"partOfSpeech":"n"}]},{"word":"FLOATER","idx":59211,"count":248608,"meanings":[{"definitions":[{"definition":"Agent noun of float; one who or that which floats."},{"definition":"An employee of a company who does not have fixed tasks to do but fills in wherever needed, usually when someone else is away."},{"definition":"An unaffiliated player."},{"definition":"A voter who shifts from party to party, especially one whose vote can be purchased."},{"definition":"A person, such as a delegate to a convention or a member of a legislature, who represents an irregular constituency, such as one formed by a union of the voters of two counties neither of which has a number sufficient to be allowed a (or an extra) representative of its own."},{"definition":"One who votes illegally in various polling places or election districts, either under false registration made by himself or under the name of some properly registered person who has not already voted."},{"definition":"An \"extra\" male at a dinner party, or a young friend of the hostess, whose assignment is to entertain the female guests."},{"definition":"A threadlike speck in the visual field that seems to move, possibly caused by degeneration of the vitreous humour."},{"definition":"(police jargon) A corpse floating in a body of water."},{"definition":"A piece of faeces that floats.","example":"He left a floater in the toilet."},{"definition":"(by extension) Someone who attaches themselves to a group of people, much to the dismay of that group, and repeatedly shows up to participate in group activities despite attempts to get rid of, or “flush,” that person."},{"definition":"A policy covering property at more than one location or which may be in transit."},{"definition":"A floating rate bond."},{"definition":"A maneuver in which a surfer transitions above the unbroken face of the wave onto the lip, or on top of the breaking section of the wave."},{"definition":"A coin which does not spin when thrown in the air."},{"definition":"A pie floater."},{"definition":"A sandal."},{"definition":"A kind of river mussel (genus Anodonta)."},{"definition":"A book circulated between prisoners that is not part of the official prison library."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfloʊ.təɹ/"},{"text":"/ˈfləʊ.tə/"},{"audio":"floater-au"}]},{"word":"CRICKETERS","idx":59216,"count":248573,"meanings":[{"definitions":[{"definition":"A person who plays cricket."}],"partOfSpeech":"n"}]},{"word":"FREEMASONS","idx":59217,"count":248571,"meanings":[{"definitions":[{"definition":"A member of a guild of skilled itinerant masons during the Middle Ages and early modern times."}],"partOfSpeech":"n"}]},{"word":"TROIKA","idx":59224,"count":248534,"meanings":[{"definitions":[{"definition":"A Russian carriage drawn by a team of three horses abreast."},{"definition":"A party or group of three, especially a ruling council of three people in Russian contexts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"troika-uk","text":"/ˈtɹɔɪ.kə/"}]},{"word":"MANPAGES","idx":59226,"count":248528,"meanings":[{"definitions":[{"definition":"A block of user documentation."}],"partOfSpeech":"n"}]},{"word":"RECLUSE","idx":59228,"count":248513,"meanings":[{"definitions":[{"definition":"A person who lives in self-imposed isolation or seclusion from the world, especially for religious purposes; a hermit"},{"definition":"The place where a recluse dwells; a place of isolation or seclusion"},{"definition":"A brown recluse spider"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shut; to seclude"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Sequestered; secluded, isolated","example":"a recluse monk or hermit"},{"definition":"Hidden, secret"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈkluːs/"}]},{"word":"OUTFITTING","idx":59236,"count":248440,"meanings":[{"definitions":[{"definition":"To provide with, usually for a specific purpose.","example":"The expedition was outfitted with proper clothing, food, and other necessities."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(chiefly in the plural) A furnishing or accoutrement."}],"partOfSpeech":"n"}]},{"word":"DISPLACING","idx":59237,"count":248421,"meanings":[{"definitions":[{"definition":"To put out of place; to disarrange."},{"definition":"To move something, or someone, especially to forcibly move people from their homeland."},{"definition":"To supplant, or take the place of something or someone; to substitute."},{"definition":"To replace, on account of being superior to or more suitable than that which is being replaced.","example":"Electronic calculators soon displaced the older mechanical kind."},{"definition":"(of a floating ship) To have a weight equal to that of the water displaced."},{"definition":"To repress"}],"partOfSpeech":"ve"}]},{"word":"PROTOZOA","idx":59238,"count":248413,"meanings":[{"definitions":[{"definition":"Any of the diverse group of eukaryotes, of the phylum Protozoa, that are primarily unicellular, existing singly or aggregating into colonies, are usually nonphotosynthetic, and are often classified further into phyla according to their capacity for and means of motility, as by pseudopods, flagella, or cilia."},{"definition":"A protozoan."}],"partOfSpeech":"n"}]},{"word":"STONING","idx":59239,"count":248405,"meanings":[{"definitions":[{"definition":"To pelt with stones, especially to kill by pelting with stones.","example":"She got stoned to death after they found her."},{"definition":"To wall with stones."},{"definition":"To remove a stone from (fruit etc.)."},{"definition":"To form a stone during growth, with reference to fruit etc."},{"definition":"To intoxicate, especially with narcotics. (Usually in passive)"},{"definition":"To do nothing, to stare blankly into space and not pay attention when relaxing or when bored."},{"definition":"To lap with an abrasive stone to remove surface irregularities."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lapidation: punishment by throwing stones, usually resulting in death"}],"partOfSpeech":"n"}]},{"word":"BLACKER","idx":59242,"count":248383,"meanings":[{"definitions":[{"definition":"One who blacks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of an object) Absorbing all light and reflecting none; dark and hueless."},{"definition":"(of a place, etc) Without light."},{"definition":"(sometimes capitalized) Of or relating to any of various ethnic groups having dark pigmentation of the skin."},{"definition":"Designated for use by those ethnic groups which have dark pigmentation of the skin.","example":"black drinking fountain; black hospital"},{"definition":"(of a card) Of the spades or clubs suits. Compare red","example":"I was dealt two red queens, and he got one of the black queens."},{"definition":"Bad; evil; ill-omened."},{"definition":"Expressing menace, or discontent; threatening; sullen.","example":"He shot her a black look."},{"definition":"(of objects, markets, etc) Illegitimate, illegal or disgraced."},{"definition":"Overcrowded."},{"definition":"(of coffee or tea) Without any cream, milk or creamer.","example":"Jim drinks his coffee black, but Ellen prefers it with creamer."},{"definition":"Of or relating to the playing pieces of a board game deemed to belong to the \"black\" set (in chess the set used by the player who moves second) (often regardless of the pieces' actual colour)."},{"definition":"Said of a symbol or character that is solid, filled with color. Compare white."},{"definition":"Related to the Christian Democratic Union of Germany.","example":"After the election, the parties united in a black-yellow alliance."},{"definition":"Clandestine; relating to a political, military, or espionage operation or site, the existence or details of which is withheld from the general public.","example":"5 percent of the Defense Department funding will go to black projects."},{"definition":"Occult; relating to something (such as mystical or magical knowledge) which is unknown to or kept secret from the general public."},{"definition":"Protestant, often with the implication of being militantly pro-British or anti-Catholic"},{"definition":"Having one or more features (hair, fur, armour, clothes, bark, etc) that is dark (or black); in taxonomy, especially: dark in comparison to another species with the same base name."},{"definition":"Foul; dirty."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈblækɚ/"}]},{"word":"WEARABLES","idx":59243,"count":248372,"meanings":[{"definitions":[{"definition":"Something that can be worn; an item of clothing."},{"definition":"Ellipsis of wearable computer"}],"partOfSpeech":"n"}]},{"word":"SUBSTRUCTURE","idx":59245,"count":248350,"meanings":[{"definitions":[{"definition":"The supporting part of a structure (either physical or organizational; the foundation)."},{"definition":"The earth or gravel that the railway tracks are embedded in."}],"partOfSpeech":"n"}]},{"word":"ASPIRES","idx":59248,"count":248326,"meanings":[{"definitions":[{"definition":"To have a strong desire or ambition to achieve something.","example":"He aspires to become a successful doctor."},{"definition":"To go as high as, to reach the top of (something)."},{"definition":"To move upward; to be very tall."}],"partOfSpeech":"ve"}]},{"word":"HANDRAILS","idx":59252,"count":248297,"meanings":[{"definitions":[{"definition":"A rail which can be held, such as on the side of a staircase, ramp or other walkway, and serving as a support or guard."}],"partOfSpeech":"n"}]},{"word":"TELEGRAPHIC","idx":59254,"count":248295,"meanings":[{"definitions":[{"definition":"Of, or relating to the telegraph."},{"definition":"Brief or concise, especially resembling a telegram with clipped syntax."}],"partOfSpeech":"j"}]},{"word":"REVITALIZED","idx":59255,"count":248291,"meanings":[{"definitions":[{"definition":"To give new life, energy, activity or success to something.","example":"Japanese investment has revitalised this part of Britain!"},{"definition":"To rouse from a state of inactivity or quiescence."}],"partOfSpeech":"ve"}]},{"word":"REMAKING","idx":59257,"count":248254,"meanings":[{"definitions":[{"definition":"To make again."},{"definition":"To make a new, especially updated, version of (a film, video game, etc.)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Recreation; reconstruction"}],"partOfSpeech":"n"}]},{"word":"NETWORKER","idx":59258,"count":248253,"meanings":[{"definitions":[{"definition":"One who engages in networking","example":"He's a great networker; he knows people all over the world."}],"partOfSpeech":"n"}]},{"word":"BRAINY","idx":59259,"count":248252,"meanings":[{"definitions":[{"definition":"Very intellectually capable."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"brainy-uk","text":"/ˈbɹeɪni/"}]},{"word":"SOPS","idx":59261,"count":248241,"meanings":[{"definitions":[{"definition":"Something entirely soaked."},{"definition":"A piece of solid food to be soaked in liquid food."},{"definition":"Something given or done to pacify or bribe."},{"definition":"A weak, easily frightened or ineffectual person; a milksop"},{"definition":"Gravy."},{"definition":"A thing of little or no value."},{"definition":"A piece of turf placed in the road as a target for a throw in road bowling."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To steep or dip in any liquid."},{"definition":"To soak in, or be soaked; to percolate."}],"partOfSpeech":"ve"}]},{"word":"DEES","idx":59262,"count":248228,"meanings":[{"definitions":[{"definition":"The name of the Latin-script letter D."},{"definition":"Something shaped like the letter D, such as a dee lock.","example":"the pommel is furnished with dees."},{"definition":"Police detective.","example":"the dees are about."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/diːz/"}]},{"word":"TABLOIDS","idx":59263,"count":248224,"meanings":[{"definitions":[{"definition":"A newspaper having pages half the dimensions of the standard format."},{"definition":"A newspaper, especially one in this format, that favours stories of a sensational or even fictitious nature over serious news."},{"definition":"A compressed portion of drugs, chemicals, etc.; a tablet."}],"partOfSpeech":"n"}]},{"word":"CROSSCUT","idx":59265,"count":248212,"meanings":[{"definitions":[{"definition":"A crosswise cut."},{"definition":"A shortcut."},{"definition":"An instance of filmic crosscutting."},{"definition":"A crosscut saw."},{"definition":"A level driven across the course of a vein, or across the main workings, as from one gangway to another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut across something."},{"definition":"To cut repeatedly between two concurrent scenes."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɹɑskʌt/"},{"text":"/ˈkɹɒskʌt/"}]},{"word":"MANDIBLE","idx":59268,"count":248163,"meanings":[{"definitions":[{"definition":"The lower jaw, especially the lower jawbone."},{"definition":"One of a pair of mouthparts of an arthropod, designed for holding and cutting food."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmændəb(ə)l/"}]},{"word":"MOONBAT","idx":59271,"count":248121,"meanings":[{"definitions":[{"definition":"A liberal (someone with a left-wing ideology)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmuːnˌbæt/"}]},{"word":"FRESCOES","idx":59272,"count":248120,"meanings":[{"definitions":[{"definition":"A cool, refreshing state of the air; coolness, duskiness, shade."},{"definition":"An artwork made by applying water-based pigment to wet or fresh lime mortar or plaster."},{"definition":"The technique used to make such an artwork."}],"partOfSpeech":"n"}]},{"word":"PATTED","idx":59273,"count":248108,"meanings":[{"definitions":[{"definition":"To (gently) tap the flat of one's hand on a person or thing.","example":"To show affection, he decided he would pat the boy on the head."},{"definition":"To hit lightly and repeatedly with the flat of the hand to make smooth or flat","example":"I patted the cookie dough into shape."},{"definition":"To stroke or fondle (an animal).","example":"Do you want to pat the cat?"},{"definition":"To gently rain."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"patted-us","text":"/ˈpatɪd/"}]},{"word":"PURITANS","idx":59274,"count":248107,"meanings":[{"definitions":[{"definition":"(often disapproving) a puritanical person"}],"partOfSpeech":"n"}]},{"word":"MACGYVER","idx":59275,"count":248107,"meanings":[{"definitions":[{"definition":"To assemble or repair something by ingenious improvisation, using everyday items that would not usually be used for the purpose.","example":"No place to climb? MacGyver your own set-up in a power rack for rope pull-ups or rows. 14 March 2014"}],"partOfSpeech":"ve"}]},{"word":"GENTLEWOMAN","idx":59277,"count":248086,"meanings":[{"definitions":[{"definition":"A woman of the nobility."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʒɛntəlˌwʊmən/"}]},{"word":"CARTOUCHE","idx":59281,"count":248078,"meanings":[{"definitions":[{"definition":"An ornamental figure, often on an oval shield."},{"definition":"(Egyptian hieroglyphs) An oval figure containing the characters of an important personal name, such as that of royal or divine people."},{"definition":"A paper cartridge."},{"definition":"A wooden case filled with balls, to be shot from a cannon."},{"definition":"A gunner's bag for ammunition."},{"definition":"A military pass for a soldier on furlough."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cartouche-us","text":"/kɑɹˈtuʃ/"}]},{"word":"FROSH","idx":59282,"count":248077,"meanings":[{"definitions":[{"definition":"A frog."},{"definition":"A first-year student, at certain universities, and a first-or-second-year student at other universities.","example":"That frosh is really getting on my nerves!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To initiate academic freshmen, notably in a testing way.","example":"This campus does not tolerate froshing in any form."},{"definition":"To damage through incompetence.","example":"Trying to open my car door with a coat hanger, I froshed the mechanism."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɹɑʃ/"},{"text":"/fɹɔʃ/"},{"audio":"frosh-au"}]},{"word":"MALNOURISHED","idx":59283,"count":248072,"meanings":[{"definitions":[{"definition":"To feed insufficiently, to cause malnutrition."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Suffering from malnutrition"}],"partOfSpeech":"j"}]},{"word":"KEBAB","idx":59285,"count":248067,"meanings":[{"definitions":[{"definition":"A dish of pieces of meat, fish, or vegetables roasted on a skewer or spit, especially a doner kebab."},{"definition":"A shish kebab or any other food on a skewer."},{"definition":"The outward growing portions of a shish kebab structure."},{"definition":"A Muslim, usually of southern European, Middle Eastern, or North African descent."},{"definition":"The vulva."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To roast in the style of a kebab"},{"definition":"To stab or skewer"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"kebab-au","text":"/kəˈbæb/"}]},{"word":"KNOTTING","idx":59286,"count":248058,"meanings":[{"definitions":[{"definition":"To form into a knot; to tie with a knot or knots.","example":"We knotted the ends of the rope to keep it from unravelling."},{"definition":"To form wrinkles in the forehead, as a sign of concentration, concern, surprise, etc.","example":"She knotted her brow in concentration while attempting to unravel the tangled strands."},{"definition":"To unite closely; to knit together."},{"definition":"To entangle or perplex; to puzzle."},{"definition":"To form knots."},{"definition":"To knit knots for a fringe."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The formation of a knot."},{"definition":"The swelling of the bulbus glandis."}],"partOfSpeech":"n"}]},{"word":"AFFIRMATIVELY","idx":59288,"count":248045,"meanings":[{"definitions":[{"definition":"In an affirming manner."}],"partOfSpeech":"v"}]},{"word":"STATEROOMS","idx":59289,"count":248035,"meanings":[{"definitions":[{"definition":"An apartment in a palace or great house for use on ceremonial occasions."},{"definition":"A superior cabin for a ship's officer or captain."},{"definition":"A private cabin in a ship or train."}],"partOfSpeech":"n"}]},{"word":"SUNDIALS","idx":59290,"count":248029,"meanings":[{"definitions":[{"definition":"A device measuring the time of day by the position of a shadow cast by a pole or plate (gnomon) upon an engraved series of marks."}],"partOfSpeech":"n"}]},{"word":"CLOTURE","idx":59292,"count":248020,"meanings":[{"definitions":[{"definition":"In legislative assemblies that permit unlimited debate (that is, a filibuster): a motion, procedure or rule by which debate is ended so that a vote may be taken on the matter. For example, in the United States Senate, a three-fifths majority vote of the body is required to invoke cloture and terminate debate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To end legislative debate by this means."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkloʊ.tʃɚ/"},{"text":"/ˈkloʊ.tjʊə(ɹ)/"}]},{"word":"PIGGYBACK","idx":59293,"count":248018,"meanings":[{"definitions":[{"definition":"A ride on somebody's back or shoulders."},{"definition":"An act or instance of piggybacking."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To attach or append something to another (usually larger) object or event.","example":"The popular host can’t claim credit for the trade, though. The idea wasn’t his. He piggybacked off another successful investor who had a history of picking winners."},{"definition":"To obtain a wireless internet connection by bringing one's own computer within the range of another's wireless connection without that subscriber's permission or knowledge."},{"definition":"To utilize \"last-mile\" wiring rented from a larger owner ISP by a smaller ISP."},{"definition":"To carry someone on the back or shoulders."},{"definition":"To transport (a lorry/truck) on a flatbed railway waggon"},{"definition":"To enter a secured area at the same time along with someone having authorized access; to tailgate"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"On somebody's back or shoulders.","example":"a piggyback ride"},{"definition":"Pertaining to transportation of goods where one transportation unit is carried on the back of something else. For example, a truck on a train."}],"partOfSpeech":"j"},{"definitions":[{"definition":"On somebody's back or shoulders.","example":"to ride piggyback"}],"partOfSpeech":"v"}]},{"word":"GYMNASTS","idx":59300,"count":247952,"meanings":[{"definitions":[{"definition":"One who performs gymnastics"}],"partOfSpeech":"n"}]},{"word":"CRIMPING","idx":59304,"count":247925,"meanings":[{"definitions":[{"definition":"To press into small ridges or folds, to pleat, to corrugate.","example":"Cornish pasties are crimped during preparation."},{"definition":"To fasten by bending metal so that it squeezes around the parts to be fastened.","example":"He crimped the wire in place."},{"definition":"To pinch and hold; to seize."},{"definition":"To style hair into a crimp, to form hair into tight curls, to make it kinky."},{"definition":"To bend or mold leather into shape."},{"definition":"To gash the flesh, e.g. of a raw fish, to make it crisper when cooked."},{"definition":"To impress (seamen or soldiers); to entrap, to decoy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is crimped."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɹɪmpɪŋ/"}]},{"word":"VARNISHES","idx":59305,"count":247916,"meanings":[{"definitions":[{"definition":"A type of paint with a solvent that evaporates to leave a hard, transparent, glossy film."},{"definition":"Anything resembling such a paint; glossy appearance."},{"definition":"(by extension) A deceptively showy appearance."},{"definition":"A passenger train, probably derived from the varnished passenger cars used at one time."}],"partOfSpeech":"n"}]},{"word":"VEGETATED","idx":59306,"count":247904,"meanings":[{"definitions":[{"definition":"(of a plant) To grow or sprout."},{"definition":"(of a wart etc) To spread abnormally."},{"definition":"To live or spend a period of time in a dull, inactive, unchallenging way."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"On which vegetation is growing.","example":"a vegetated streambank"}],"partOfSpeech":"j"}]},{"word":"CALCULI","idx":59307,"count":247902,"meanings":[{"definitions":[{"definition":"Calculation; computation."},{"definition":"Any formal system in which symbolic expressions are manipulated according to fixed rules.","example":"lambda calculus"},{"definition":"(often definite, the calculus) Differential calculus and integral calculus considered as a single subject; analysis."},{"definition":"A stony concretion that forms in a bodily organ.","example":"renal calculus ( = kidney stone)"},{"definition":"Deposits of calcium phosphate salts on teeth."},{"definition":"A decision-making method, especially one appropriate for a specialised realm."}],"partOfSpeech":"n"}]},{"word":"VICTORS","idx":59319,"count":247819,"meanings":[{"definitions":[{"definition":"The winner in a fight or contest."},{"definition":"The letter V in the ICAO spelling alphabet."}],"partOfSpeech":"n"}]},{"word":"REVELS","idx":59325,"count":247758,"meanings":[{"definitions":[{"definition":"The outer side of a window or door frame; the jamb."},{"definition":"A revelation; an uncovering of what was hidden.","example":"The comedian had been telling us about his sleep being disturbed by noise. Then came the reveal: he was sleeping on a bed in a department store."},{"definition":"(obsolete in the US) The side of an opening for a window, doorway, or the like, between the door frame or window frame and the outer surface of the wall; or, where the opening is not filled with a door, etc., the whole thickness of the wall; the jamb."},{"definition":"An instance of merrymaking; a celebration."},{"definition":"A kind of dance."},{"definition":"A wake for the dead."}],"partOfSpeech":"n"}]},{"word":"SUGARY","idx":59326,"count":247749,"meanings":[{"definitions":[{"definition":"Of food, drink, etc, containing or covered with a large amount of sugar"},{"definition":"Of behavior, exaggeratedly sweet and pleasant, often to the point of aversion."},{"definition":"Fond of sweets."}],"partOfSpeech":"j"}]},{"word":"DROVES","idx":59335,"count":247699,"meanings":[{"definitions":[{"definition":"A number of cattle driven to market or new pastures."},{"definition":"(usually in the plural) A large number of people on the move (literally or figuratively)."},{"definition":"(collective) A group of hares."},{"definition":"A road or track along which cattle are habitually driven."},{"definition":"A narrow drain or channel used in the irrigation of land."},{"definition":"A broad chisel used to bring stone to a nearly smooth surface."},{"definition":"The grooved surface of stone finished by the drove chisel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To herd cattle; particularly over a long distance."},{"definition":"To finish (stone) with a drove chisel."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɹoʊvz/"},{"text":"/dɹəʊvz/"}]},{"word":"ONC","idx":59337,"count":247670,"meanings":[{"definitions":[{"definition":"Oncology."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Oncological."}],"partOfSpeech":"j"}]},{"word":"HYPOALLERGENIC","idx":59338,"count":247657,"meanings":[{"definitions":[{"definition":"Containing fewer allergens; minimally allergenic."},{"definition":"Relating to a hypoallergen."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/haɪ.po.æl.ɚˈdʒɛn.ɪk/"},{"text":"/haɪ.pəʊ.æl.ə(ɹ)ˈdʒɛn.ɪk/"}]},{"word":"WISEGUY","idx":59339,"count":247653,"meanings":[{"definitions":[{"definition":"One who is insolent or flippant; one who makes jokes or perpetrates pranks.","example":"Her reputation for being a wise guy made her new teachers hesitant about having her in their classes."},{"definition":"A knowledgable or successful sports bettor."},{"definition":"A member of the Mafia; a mobster."},{"definition":"A hipster."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wiseguy-us"}]},{"word":"SLUR","idx":59340,"count":247649,"meanings":[{"definitions":[{"definition":"An insult or slight.","example":"a racial slur"},{"definition":"A set of notes that are played legato, without separate articulation."},{"definition":"The symbol indicating a legato passage, written as an arc over the slurred notes (not to be confused with a tie)."},{"definition":"A trick or deception."},{"definition":"In knitting machines, a device for depressing the sinkers successively by passing over them."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To insult or slight."},{"definition":"To run together; to articulate poorly.","example":"to slur syllables;  He slurs his speech when he is drunk."},{"definition":"To play legato or without separate articulation; to connect (notes) smoothly."},{"definition":"To soil; to sully; to contaminate; to disgrace."},{"definition":"To cover over; to disguise; to conceal; to pass over lightly or with little notice."},{"definition":"To cheat, as by sliding a die; to trick."},{"definition":"To blur or double, as an impression from type; to mackle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slur-us","text":"/slɜː(ɹ)/"},{"audio":"slur-uk","text":"/slɜː(ɹ)/"}]},{"word":"BOOKMAN","idx":59351,"count":247512,"meanings":[{"definitions":[{"definition":"(Old English law) One who held bookland."},{"definition":"A studious or learned man; a scholar; a student of books."},{"definition":"One who sells or publishes books; a bookseller."}],"partOfSpeech":"n"}]},{"word":"TROTTERS","idx":59354,"count":247479,"meanings":[{"definitions":[{"definition":"In harness racing, a horse with a gait in which the front and back legs on opposite sides take a step together alternating with the other set of opposite legs; as opposed to a pacer."},{"definition":"The foot of a pig, sheep, or other quadruped."}],"partOfSpeech":"n"}]},{"word":"FERROMAGNETIC","idx":59355,"count":247474,"meanings":[{"definitions":[{"definition":"Of a material, such as iron or nickel, that is easily magnetized"}],"partOfSpeech":"j"}]},{"word":"PHRASED","idx":59356,"count":247451,"meanings":[{"definitions":[{"definition":"To express (an action, thought or idea) by means of particular words.","example":"I wasn't sure how to phrase my condolences without sounding patronising."},{"definition":"To perform a passage with the correct phrasing."},{"definition":"To divide into melodic phrases."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/fɹeɪzd/"}]},{"word":"BINAURAL","idx":59361,"count":247431,"meanings":[{"definitions":[{"definition":"Of, relating to, affecting, or designed for use with two ears."}],"partOfSpeech":"j"}]},{"word":"PUDDLES","idx":59362,"count":247430,"meanings":[{"definitions":[{"definition":"A small pool of water, usually on a path or road."},{"definition":"Stagnant or polluted water."},{"definition":"A homogeneous mixture of clay, water, and sometimes grit, used to line a canal or pond to make it watertight."},{"definition":"The ripple left by the withdrawal of an oar from the water."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a puddle."},{"definition":"To play or splash in a puddle."},{"definition":"Of butterflies, to congregate on a puddle or moist substance to pick up nutrients."},{"definition":"To process iron, gold, etc., by means of puddling."},{"definition":"To line a canal with puddle (clay)."},{"definition":"To collect ideas, especially abstract concepts, into rough subtopics or categories, as in study, research or conversation."},{"definition":"To make (clay, loam, etc.) dense or close, by working it when wet, so as to render impervious to water."},{"definition":"To make foul or muddy; to pollute with dirt; to mix dirt with (water)."}],"partOfSpeech":"ve"}]},{"word":"EPHEMERIS","idx":59366,"count":247417,"meanings":[{"definitions":[{"definition":"(singular or plural) A journal or diary."},{"definition":"A table giving the apparent position of celestial bodies throughout the year; normally given as right ascension and declination."},{"definition":"Software that calculates the apparent position of celestial bodies."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪˈfɛməɹɪs/"}]},{"word":"REFURBISH","idx":59367,"count":247402,"meanings":[{"definitions":[{"definition":"To rebuild or replenish with all new material; to restore to original (or better) working order and appearance."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"refurbish-us","text":"/ɹiˈfɝbɪʃ/"}]},{"word":"LATCHING","idx":59369,"count":247390,"meanings":[{"definitions":[{"definition":"To close or lock as if with a latch."},{"definition":"To catch; lay hold of."},{"definition":"To smear; to anoint."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A loop or eye formed on the head rope of a bonnet, by which it is attached to the foot of a sail."},{"definition":"The situation where one speaker's utterance immediately follows another speaker's utterance, without pause or overlap."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of something that latches."}],"partOfSpeech":"j"}]},{"word":"NOBLEMAN","idx":59372,"count":247368,"meanings":[{"definitions":[{"definition":"A peer; an aristocrat; ranks range from baron to king to emperor."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nobleman-us","text":"/ˈnoʊbl̩mən/"}]},{"word":"ASSAILANT","idx":59376,"count":247362,"meanings":[{"definitions":[{"definition":"Someone who attacks or assails another violently, or criminally."},{"definition":"(by extension) A hostile critic or opponent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Assailing; attacking."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈseɪlənt/"}]},{"word":"DYSTOPIA","idx":59379,"count":247320,"meanings":[{"definitions":[{"definition":"A vision of a future that is a corrupted (usually beyond recognition) utopian society."},{"definition":"A miserable, dysfunctional state or society that has a very poor standard of living."},{"definition":"Anatomical tissue that is not found in its usual place.","example":"The patient suffers from adrenal dystopia."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪsˈtoʊpi.ə/"},{"text":"/ˈdɪsˌtəʊpɪi.ə/"},{"audio":"dystopia-au"}]},{"word":"AMBIT","idx":59385,"count":247267,"meanings":[{"definitions":[{"definition":"The sphere or area of control and influence of something."},{"definition":"A circuit, or a boundary around a property."},{"definition":"The extent of actions, thoughts, or the meaning of words, etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ambit-uk","text":"/ˈæmbɪt/"}]},{"word":"FLATNESS","idx":59386,"count":247253,"meanings":[{"definitions":[{"definition":"The state of being flat"},{"definition":"The state of being two-dimensional; planar : planarity"},{"definition":"The state of being bland : dullness"},{"definition":"Mattness, the quality of a painted surface which scatters or absorbs the light falling on it, so as to be substantially free from gloss or sheen"},{"definition":"Lack of bouquet and freshness of a wine, through too much aeration or infection with film yeasts"},{"definition":"Slim-tailedness or platykurticity"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈflætnəs/"}]},{"word":"PARDONS","idx":59388,"count":247232,"meanings":[{"definitions":[{"definition":"Forgiveness for an offence."},{"definition":"An order that releases a convicted criminal without further punishment, prevents future punishment, or (in some jurisdictions) removes an offence from a person's criminal record, as if it had never been committed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To forgive (a person)."},{"definition":"To refrain from exacting as a penalty."},{"definition":"To grant an official pardon for a crime."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɑɹ.dn̩z/"},{"text":"/ˈpɑɹ.dənz/"}]},{"word":"DEBAUCHERY","idx":59389,"count":247215,"meanings":[{"definitions":[{"definition":"Indulgence in sensual pleasures; scandalous activities involving sex, alcohol, or drugs without inhibition."},{"definition":"Seduction from duty."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈbɔː.t͡ʃə.ɹi/"}]},{"word":"EXTRAVAGANCE","idx":59391,"count":247211,"meanings":[{"definitions":[{"definition":"Excessive or superfluous expenditure of money."},{"definition":"Prodigality, as of anger, love, expression, imagination, or demands."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪkˈstɹævəɡəns/"}]},{"word":"BUTTRESS","idx":59392,"count":247209,"meanings":[{"definitions":[{"definition":"A brick or stone structure built against another structure to support it."},{"definition":"Anything that serves to support something; a prop."},{"definition":"A buttress-root."},{"definition":"A feature jutting prominently out from a mountain or rock; a crag, a bluff."},{"definition":"Anything that supports or strengthens."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To support something physically with, or as if with, a prop or buttress."},{"definition":"(by extension) To support something or someone by supplying evidence; to corroborate or substantiate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"buttress-uk","text":"/ˈbʌtɹəs/"}]},{"word":"EUTROPHICATION","idx":59398,"count":247169,"meanings":[{"definitions":[{"definition":"The process of becoming eutrophic; the ecosystem's response to the addition of artificial or natural nutrients, mainly phosphates, through detergents, fertilizers, or sewage, to an aquatic system."}],"partOfSpeech":"n"}]},{"word":"AUTHORISING","idx":59402,"count":247135,"meanings":[{"definitions":[{"definition":"To grant (someone) the permission or power necessary to do (something).","example":"The General Assembly authorized the Council to take up the matter."},{"definition":"To permit (something), to sanction or consent to (something).","example":"The judge authorized the wiretapping."}],"partOfSpeech":"ve"}]},{"word":"DEFUSE","idx":59403,"count":247134,"meanings":[{"definitions":[{"definition":"To remove the fuse from (a bomb, etc.)."},{"definition":"To make less dangerous, tense, or hostile.","example":"to defuse a hostage situation"},{"definition":"To disorder; to make shapeless."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/diːˈfjuːz/"}]},{"word":"WHISKER","idx":59406,"count":247102,"meanings":[{"definitions":[{"definition":"That part of the beard which grows upon the sides of the face, usually of the male, or upon the chin, or upon both."},{"definition":"A hair of the beard."},{"definition":"One of the long, projecting hairs growing at the sides of the mouth of a cat, or other animal."},{"definition":"The (very small) distance between two things.","example":"It missed falling on your foot by a whisker."},{"definition":"Spreaders from the bows to spread the bowsprit shrouds."},{"definition":"A graphic element that shows the maxima and minima in a box plot."},{"definition":"One who, or that which, whisks, or moves with a quick, sweeping motion."},{"definition":"A small tendril that forms on metal."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/wɪskə(ɹ)/"}]},{"word":"GHOUL","idx":59409,"count":247064,"meanings":[{"definitions":[{"definition":"(Muslim demonology) A demon said to feed on corpses."},{"definition":"A graverobber."},{"definition":"A person with an undue interest in death and corpses, or more generally in things that are revolting and repulsive."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ghoul-uk","text":"/ɡuːl/"}]},{"word":"MICROECONOMIC","idx":59410,"count":247061,"meanings":[{"definitions":[{"definition":"Of, or relating to, a microeconomy or microeconomics."}],"partOfSpeech":"j"}]},{"word":"RIGORS","idx":59411,"count":247044,"meanings":[{"definitions":[{"definition":"Short for rigor mortis."},{"definition":"Severity or strictness."},{"definition":"Harshness, as of climate."},{"definition":"A trembling or shivering response."},{"definition":"Character of being unyielding or inflexible."},{"definition":"Shrewd questioning."},{"definition":"Higher level of difficulty."}],"partOfSpeech":"n"}]},{"word":"BOOBED","idx":59414,"count":247018,"meanings":[{"definitions":[{"definition":"To behave stupidly; to act like a boob."},{"definition":"To make a mistake"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in composition) Having boobs (breasts) of a specified kind.","example":"a large-boobed woman"}],"partOfSpeech":"j"}]},{"word":"FOREGONE","idx":59415,"count":247015,"meanings":[{"definitions":[{"definition":"To precede, to go before."},{"definition":"To let pass, to leave alone, to let go."},{"definition":"To do without, to abandon, to renounce."},{"definition":"To refrain from, to abstain from, to pass up, to withgo.","example":"I wouldn't forgo something, unless I'm convinced that it's detrimental in some way or another."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Previous, former"},{"definition":"Bygone"},{"definition":"Inevitable, predictable"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"foregone-us","text":"/ˈfoɹɡɔn/"}]},{"word":"TANDOORI","idx":59418,"count":246988,"meanings":[{"definitions":[{"definition":"(of food) A dish that was cooked in a tandoor."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of food) Cooked in a tandoor."}],"partOfSpeech":"j"}]},{"word":"ALEXANDRITE","idx":59420,"count":246953,"meanings":[{"definitions":[{"definition":"A form of chrysoberyl that displays a colour change dependent upon the light source, along with strong pleochroism."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌæl.ɪɡ.ˈzæn.dɹaɪt/"}]},{"word":"OVERJOYED","idx":59424,"count":246915,"meanings":[{"definitions":[{"definition":"To give great joy, delight or pleasure to"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Very happy."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌoʊvɚˈdʒɔɪd/"},{"text":"/ˌəʊvəˈdʒɔɪd/"}]},{"word":"FASTBALL","idx":59426,"count":246909,"meanings":[{"definitions":[{"definition":"Any of the variations of high speed pitches thrown in baseball"},{"definition":"A four-seam fastball, which is a backspin pitch thrown with a ball gripped in the direction to cause four of the seams of the ball to cross the flight path and released with roughly equal pressure by the index and middle fingers","example":"The pitcher had a blazing fastball."}],"partOfSpeech":"n"}]},{"word":"RECTIFIERS","idx":59428,"count":246897,"meanings":[{"definitions":[{"definition":"Something that rectifies."},{"definition":"A device that converts alternating current into direct current; often a diode."},{"definition":"An instrument used for determining and rectifying the variations of the compass on board ship."},{"definition":"(artificial neural networks) The activation function f(x) = \\max(0, x), where x is the input to a neuron."}],"partOfSpeech":"n"}]},{"word":"COMPACTNESS","idx":59429,"count":246889,"meanings":[{"definitions":[{"definition":"The state of being compact"}],"partOfSpeech":"n"}]},{"word":"MONOPOLISTIC","idx":59431,"count":246887,"meanings":[{"definitions":[{"definition":"Acting in the manner of a monopoly.","example":"The antitrust laws try to prevent monopolistic behavior."}],"partOfSpeech":"j"}]},{"word":"FASTPITCH","idx":59442,"count":246833,"meanings":[{"definitions":[{"definition":"A variety of softball in which the ball may be pitched at faster speed."}],"partOfSpeech":"n"}]},{"word":"LISH","idx":59444,"count":246796,"meanings":[{"definitions":[{"definition":"A hybrid variety of English having a name that is derived from a portmanteau of the name of one language and the word English, such as Chinglish (Chinese + English), Spanglish (Spanish + English), Taglish (Tagalog + English), etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(British dialect) active; nimble; lithe."}],"partOfSpeech":"j"}]},{"word":"APOLOGISTS","idx":59445,"count":246789,"meanings":[{"definitions":[{"definition":"One who makes an apology."},{"definition":"One who speaks or writes in defense of a faith, a cause, or an institution."}],"partOfSpeech":"n"}]},{"word":"UNBUNDLING","idx":59446,"count":246784,"meanings":[{"definitions":[{"definition":"To separate parts which have been bundled together."},{"definition":"To break down a product or service into a number of separate elements that can be charged for individually."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is unbundled."}],"partOfSpeech":"n"}]},{"word":"CLACK","idx":59454,"count":246726,"meanings":[{"definitions":[{"definition":"An abrupt, sharp sound, especially one made by two hard objects colliding repetitively; a sound midway between a click and a clunk."},{"definition":"Anything that causes a clacking noise, such as the clapper of a mill, or a clack valve."},{"definition":"Chatter; prattle."},{"definition":"The tongue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a sudden, sharp noise, or succession of noises; to click."},{"definition":"To cause to make a sudden, sharp noise, or succession of noises; to click."},{"definition":"To chatter or babble; to utter rapidly without consideration."},{"definition":"To cut the sheep's mark off (wool), to make the wool weigh less and thus yield less duty."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/klæk/"}]},{"word":"LOTSA","idx":59465,"count":246642,"meanings":[{"definitions":[{"definition":"Pronunciation spelling of lots of."}],"partOfSpeech":"j"}]},{"word":"REFILLED","idx":59468,"count":246635,"meanings":[{"definitions":[{"definition":"To fill up once again.","example":"Can you refill my cup please? I've finished my coffee."},{"definition":"To repeat a prescription."}],"partOfSpeech":"ve"}]},{"word":"DIGESTER","idx":59470,"count":246629,"meanings":[{"definitions":[{"definition":"One who, or that which, digests."},{"definition":"A medicine or food that aids digestion, or strengthens digestive power."},{"definition":"A strong closed vessel in which bones or other substances may be subjected, usually in water or other liquid, to a temperature above that of boiling, in order to soften them."}],"partOfSpeech":"n"}]},{"word":"FRETBOARD","idx":59474,"count":246617,"meanings":[{"definitions":[{"definition":"A fret or plate put over the neck of musical instruments or its fingerboard, to create a different sound of notes."}],"partOfSpeech":"n"}]},{"word":"WHIFF","idx":59479,"count":246582,"meanings":[{"definitions":[{"definition":"A waft; a brief, gentle breeze; a light gust of air"},{"definition":"An odour carried briefly through the air"},{"definition":"A short inhalation or exhalation of breath, especially of smoke from a cigarette or pipe."},{"definition":"A slight sign of something; a glimpse."},{"definition":"A strike (from the batter’s perspective)"},{"definition":"An attempted shot that completely misses the ball."},{"definition":"The megrim, a fish: Lepidorhombus boscii or Lepidorhombus whiffiagonis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To waft."},{"definition":"To sniff."},{"definition":"To strike out."},{"definition":"To miss the ball completely."},{"definition":"To attempt to strike and miss, especially being off-balance/vulnerable after missing."},{"definition":"To throw out in whiffs; to consume in whiffs; to puff."},{"definition":"To carry or convey by a whiff, or as by a whiff; to puff or blow away."},{"definition":"To have or give off a strong, unpleasant smell."},{"definition":"To fail spectacularly at a task."},{"definition":"To fish with a handline."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a strong or unpleasant odor."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"whiff-au"}]},{"word":"BURROWING","idx":59483,"count":246564,"meanings":[{"definitions":[{"definition":"To dig a tunnel or hole"},{"definition":"(with adverbial of direction) to move underneath or press up against in search of safety or comfort","example":"The young girl burrowed into the bed."},{"definition":"(with into) to investigate thoroughly","example":"The journalist burrowed into the origins of the mayor's corruption."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or result of making a burrow."}],"partOfSpeech":"n"}]},{"word":"STROLLED","idx":59485,"count":246558,"meanings":[{"definitions":[{"definition":"To wander on foot; to ramble idly or leisurely; to rove."},{"definition":"To go somewhere with ease."},{"definition":"To walk the streets as a prostitute."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/stɹoʊld/"},{"text":"/stɹəʊld/"}]},{"word":"SORORITIES","idx":59487,"count":246547,"meanings":[{"definitions":[{"definition":"A group of girls or women associated for a common purpose; a sisterhood."},{"definition":"A social organization of female students at a college or university; usually identified by Greek letters."}],"partOfSpeech":"n"}]},{"word":"BLOKES","idx":59496,"count":246481,"meanings":[{"definitions":[{"definition":"A man, a fellow; an ordinary man, a man on the street."},{"definition":"A man who behaves in a particularly laddish or overtly heterosexual manner."},{"definition":"(A lower deck term for) the Captain or Executive Officer of a warship, with particular reference to discipline and punishment."},{"definition":"An exemplar of a certain masculine, independent male archetype."},{"definition":"An anglophone man."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bloʊks/"},{"text":"/bləʊks/"}]},{"word":"LATCHED","idx":59498,"count":246471,"meanings":[{"definitions":[{"definition":"To close or lock as if with a latch."},{"definition":"To catch; lay hold of."},{"definition":"To smear; to anoint."}],"partOfSpeech":"ve"}]},{"word":"SPAWNS","idx":59502,"count":246441,"meanings":[{"definitions":[{"definition":"To produce or deposit (eggs) in water."},{"definition":"To generate, bring into being, especially non-mammalian beings in very large numbers."},{"definition":"To bring forth in general.","example":"The Web server spawns a new process to handle each client's request."},{"definition":"To induce (aquatic organisms) to spawn."},{"definition":"To plant with fungal spawn."},{"definition":"To deposit (numerous) eggs in water."},{"definition":"To reproduce, especially in large numbers."},{"definition":"(of a character or object) (To cause) to appear spontaneously in a game at a certain point and time."}],"partOfSpeech":"ve"}]},{"word":"URIC","idx":59509,"count":246402,"meanings":[{"definitions":[{"definition":"Pertaining to, contained in, or obtained from urine."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈjʊɹɪk/"}]},{"word":"LETHALITY","idx":59516,"count":246378,"meanings":[{"definitions":[{"definition":"The fact of something being lethal; the ability of something to kill"},{"definition":"The rate of death of organisms exposed to something"}],"partOfSpeech":"n"}]},{"word":"HORSERACING","idx":59520,"count":246332,"meanings":[{"definitions":[{"definition":"A sport where horses and their jockeys compete to race around a track the fastest."}],"partOfSpeech":"n"}]},{"word":"ENCRUSTED","idx":59521,"count":246331,"meanings":[{"definitions":[{"definition":"To cover with a hard crust.","example":"a doughnut encrusted with sugar"},{"definition":"To form a crust."},{"definition":"To inset or affix decorative materials upon (a surface); to inlay into, as a piece of carving or other ornamental object.","example":"The jeweller encrusted the ring with gems."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having an incrustation"}],"partOfSpeech":"j"}]},{"word":"REJECTIONS","idx":59522,"count":246328,"meanings":[{"definitions":[{"definition":"The act of rejecting."},{"definition":"The state of being rejected."},{"definition":"A blocked shot."}],"partOfSpeech":"n"}]},{"word":"CLASHED","idx":59523,"count":246307,"meanings":[{"definitions":[{"definition":"To make a clashing sound.","example":"The cymbals clashed."},{"definition":"To cause to make a clashing sound."},{"definition":"To come into violent conflict.","example":"Fans from opposing teams clashed on the streets after the game."},{"definition":"To argue angrily."},{"definition":"(in games or sports) To face each other in an important game."},{"definition":"(of clothes, decor, colours) To fail to look good together; to contrast unattractively; to fail to harmonize.","example":"The hotel room was ugly, and the wallpaper clashed with the carpet."},{"definition":"(of events) To coincide, to happen at the same time, thereby rendering it impossible to attend all.","example":"I can't come to your wedding because it clashes with a friend's funeral."},{"definition":"To chatter or gossip."}],"partOfSpeech":"ve"}]},{"word":"HOLDALL","idx":59524,"count":246306,"meanings":[{"definitions":[{"definition":"A large bag for carrying things while travelling."},{"definition":"A book or similar printed work containing a wide variety of information."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhoʊldɔːl/"}]},{"word":"HARPOON","idx":59527,"count":246248,"meanings":[{"definitions":[{"definition":"A spearlike weapon with a barbed head used in hunting whales and large fish."},{"definition":"A harmonica."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shoot something with a harpoon."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hɑːɹˈpuːn/"},{"text":"/hɑːˈpuːn/"},{"audio":"harpoon-au"}]},{"word":"REINING","idx":59528,"count":246243,"meanings":[{"definitions":[{"definition":"To direct or stop a horse by using reins."},{"definition":"To restrain; to control; to check."},{"definition":"To obey directions given with the reins."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɹeɪnɪŋ/"}]},{"word":"REWRITES","idx":59532,"count":246195,"meanings":[{"definitions":[{"definition":"The act of writing again or anew.","example":"The film script underwent a rewrite for the European market."},{"definition":"Something that has been written again."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write again, differently; to modify (a piece of writing or music, etc.).","example":"The editor asked me to rewrite my article for a non-technical audience."},{"definition":"To write out again (without changes)."}],"partOfSpeech":"ve"}]},{"word":"PUBLICISED","idx":59535,"count":246161,"meanings":[{"definitions":[{"definition":"To make widely known to the public.","example":"The scandal was so publicised that he lost the next election."},{"definition":"To advertise, create publicity for.","example":"They're already publicising next month's concert."}],"partOfSpeech":"ve"}]},{"word":"SOMBRE","idx":59537,"count":246150,"meanings":[{"definitions":[{"definition":"Gloom; obscurity; duskiness."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make sombre or dark; to make shady."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Dark; gloomy; shadowy, dimly lit."},{"definition":"Dull or dark in colour or brightness."},{"definition":"Melancholic, gloomy, dreary, dismal; grim."},{"definition":"Grave; extremely serious.","example":"a sombre situation"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sombre-us","text":"/ˈsɑmbɚ/"}]},{"word":"SUCCINATE","idx":59541,"count":246116,"meanings":[{"definitions":[{"definition":"Any salt or ester of succinic acid."}],"partOfSpeech":"n"}]},{"word":"MACHINATIONS","idx":59542,"count":246113,"meanings":[{"definitions":[{"definition":"A clever scheme or artful plot, usually crafted for evil purposes."},{"definition":"The act of machinating or plotting."}],"partOfSpeech":"n"}]},{"word":"HEARSE","idx":59548,"count":246067,"meanings":[{"definitions":[{"definition":"A hind (female deer) in the second year of her age."},{"definition":"A framework of wood or metal placed over the coffin or tomb of a deceased person, and covered with a pall; also, a temporary canopy bearing wax lights and set up in a church, under which the coffin was placed during the funeral ceremonies."},{"definition":"A grave, coffin, tomb, or sepulchral monument."},{"definition":"A bier or handbarrow for conveying the dead to the grave."},{"definition":"A carriage or vehicle specially adapted or used for transporting a dead person to the place of funeral or to the grave."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enclose in a hearse; to entomb."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hearse-uk","text":"/hɜːs/"}]},{"word":"FLUORESCEIN","idx":59554,"count":246021,"meanings":[{"definitions":[{"definition":"Any of a class of yellow xanthene dyes which are visible when highly diluted; used forensically to detect traces of blood, and in analytical chemistry as an indicator in silver nitrate titrations"}],"partOfSpeech":"n"}]},{"word":"REBROADCAST","idx":59556,"count":246018,"meanings":[{"definitions":[{"definition":"To broadcast again."}],"partOfSpeech":"ve"}]},{"word":"PARAPHRASING","idx":59566,"count":245950,"meanings":[{"definitions":[{"definition":"To restate something as, or to compose a paraphrase."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A paraphrased statement."}],"partOfSpeech":"n"}]},{"word":"SUPERSIZE","idx":59567,"count":245949,"meanings":[{"definitions":[{"definition":"To increase the size of something, especially to unusual proportions."}],"partOfSpeech":"ve"}]},{"word":"BOOTCUT","idx":59568,"count":245949,"meanings":[{"definitions":[{"definition":"Pants cut as if to allow the legs to fit over boots."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of pants (trousers), cut as if to allow the legs of the pants to fit over boots."}],"partOfSpeech":"j"}]},{"word":"ROAMED","idx":59569,"count":245948,"meanings":[{"definitions":[{"definition":"To wander or travel freely and with no specific destination."},{"definition":"To use a network or service from different locations or devices."},{"definition":"To transmit (resources) between different locations or devices, to allow comparable usage from any of them."},{"definition":"To range or wander over.","example":"Gangs of thugs roamed the streets."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"roamed-us"}]},{"word":"CAULK","idx":59571,"count":245944,"meanings":[{"definitions":[{"definition":"A pointed projection on a horseshoe to prevent it slipping."},{"definition":"A spike on the sole of a boot to prevent slipping, particularly used in logging"},{"definition":"Caulking."},{"definition":"A composition of vehicle and pigment used at ambient temperatures for filling/sealing joints or junctures, that remains elastic for an extended period of time after application."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drive oakum into the seams of a ship's wooden deck or hull to make it watertight."},{"definition":"To apply caulking to joints, cracks, or a juncture of different materials."},{"definition":"Fuck"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"caulk-us","text":"/kælk/"}]},{"word":"PHARMACOTHERAPY","idx":59573,"count":245932,"meanings":[{"definitions":[{"definition":"The use of pharmaceuticals to treat disease"}],"partOfSpeech":"n"}]},{"word":"APPROBATION","idx":59574,"count":245899,"meanings":[{"definitions":[{"definition":"The act of approving; an assenting to the propriety of a thing with some degree of pleasure or satisfaction; approval, sanction, commendation or official recognition."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"approbation-us","text":"/ˌæp.ɹoʊˈbeɪ.ʃən/"}]},{"word":"SCRATCHY","idx":59576,"count":245885,"meanings":[{"definitions":[{"definition":"Characterized by scratches."},{"definition":"(chiefly of a sore throat) Annoying, irritating, itchy."},{"definition":"(of an analogue radio transmission) Noisy, lossy; marred by white noise or static as a result of poor or low signal, interference or unfavourable atmospheric conditions.","example":"The FM station two hundred miles away was receivable, but the audio was too scratchy to positively identify."},{"definition":"(of a phonograph record) Having popping and/or crackling sounds due to excessive wear, especially from scratch marks."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈskɹætʃi/"}]},{"word":"MONOLAYER","idx":59577,"count":245867,"meanings":[{"definitions":[{"definition":"A layer of material that is one molecule thick"},{"definition":"A layer of tissue that is one cell thick"}],"partOfSpeech":"n"}]},{"word":"CALMNESS","idx":59579,"count":245856,"meanings":[{"definitions":[{"definition":"The state of being calm; tranquillity; silence."},{"definition":"The product of being calm."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɑ(l)mnəs/"},{"text":"/ˈkɑːmnəs/"}]},{"word":"CONFOUND","idx":59580,"count":245851,"meanings":[{"definitions":[{"definition":"A confounding variable."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To perplex or puzzle."},{"definition":"To fail to see the difference; to mix up; to confuse right and wrong."},{"definition":"To make something worse.","example":"Don't confound the situation by yelling."},{"definition":"To combine in a confused fashion; to mingle so as to make the parts indistinguishable."},{"definition":"To cause to be ashamed; to abash.","example":"His actions confounded the skeptics."},{"definition":"To defeat, to frustrate, to thwart."},{"definition":"To damn (a mild oath).","example":"Confound the lady!"},{"definition":"To bring to ruination."},{"definition":"To stun, amaze"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"confound-us","text":"/kənˈfaʊnd/"}]}]