[{"word":"POPCORN","idx":14132,"count":2889969,"meanings":[{"definitions":[{"definition":"A snack food made from corn/maize kernels popped by dry heating."},{"definition":"A type of maize with a hard outer hull that, along with the type of starch it contains, makes it suitable for popping."},{"definition":"A kind of stitch similar to a bobble."},{"definition":"(by extension) Entertainment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(Of a guinea pig) to stand up or jump up quickly."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpɑp.kɔɹn/"},{"text":"/ˈpɒp.kɔː(ɹ)n/"}]},{"word":"DISADVANTAGED","idx":14134,"count":2889348,"meanings":[{"definitions":[{"definition":"To place at a disadvantage.","example":"They fear it might disadvantage honest participants to allow automated entries."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lacking an advantage relative to another."},{"definition":"Poor; in financial difficulties."}],"partOfSpeech":"j"}]},{"word":"DIAGONAL","idx":14136,"count":2888910,"meanings":[{"definitions":[{"definition":"A line joining non-adjacent vertices of a polygon."},{"definition":"Anything forming or resembling such a line, particularly:"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Joining two nonadjacent vertices (of a polygon or polyhedron)."},{"definition":"Having slanted or oblique lines or markings."},{"definition":"Having a slanted or oblique direction."},{"definition":"Of or related to the cater-corner (diagonally opposite) legs of a quadruped, whether the front left and back right or front right and back left."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/daɪˈæɡnəl/"}]},{"word":"UNITE","idx":14137,"count":2888724,"meanings":[{"definitions":[{"definition":"A British gold coin worth 20 shillings, first produced during the reign of King James I, and bearing a legend indicating the king's intention of uniting the kingdoms of England and Scotland."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bring together as one.","example":"I hope this song can unite people from all different cultures."},{"definition":"To come together as one.","example":"If we want to win, we will need to unite."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"unite-us","text":"/juˈnaɪt/"}]},{"word":"CRACKED","idx":14138,"count":2888206,"meanings":[{"definitions":[{"definition":"To form cracks.","example":"It's been so dry, the ground is starting to crack."},{"definition":"To break apart under pressure.","example":"When I tried to stand on the chair, it cracked."},{"definition":"To become debilitated by psychological pressure.","example":"Anyone would crack after being hounded like that."},{"definition":"To break down or yield, especially under interrogation or torture.","example":"When we showed him the pictures of the murder scene, he cracked."},{"definition":"To make a cracking sound.","example":"The bat cracked with authority and the ball went for six."},{"definition":"(of a voice) To change rapidly in register.","example":"His voice cracked with emotion."},{"definition":"(of a pubescent boy's voice) To alternate between high and low register in the process of eventually lowering.","example":"His voice finally cracked when he was fourteen."},{"definition":"To make a sharply humorous comment.","example":"\"I would too, with a face like that,\" she cracked."},{"definition":"To make a crack or cracks in.","example":"The ball cracked the window."},{"definition":"To break open or crush to small pieces by impact or stress.","example":"You'll need a hammer to crack a black walnut."},{"definition":"To strike forcefully.","example":"She cracked him over the head with her handbag."},{"definition":"To open slightly.","example":"Could you please crack the window?"},{"definition":"To cause to yield under interrogation or other pressure. (Figurative)","example":"They managed to crack him on the third day."},{"definition":"To solve a difficult problem. (Figurative, from cracking a nut.)","example":"I've finally cracked it, and of course the answer is obvious in hindsight."},{"definition":"To overcome a security system or a component.","example":"It took a minute to crack the lock, three minutes to crack the security system, and about twenty minutes to crack the safe."},{"definition":"To cause to make a sharp sound.","example":"to crack a whip"},{"definition":"To tell (a joke).","example":"The performance was fine until he cracked that dead baby joke."},{"definition":"To break down (a complex molecule), especially with the application of heat: to pyrolyse.","example":"Acetone is cracked to ketene and methane at 700°C."},{"definition":"To circumvent software restrictions such as regional coding or time limits.","example":"That software licence will expire tomorrow unless we can crack it."},{"definition":"To open a canned beverage, or any packaged drink or food.","example":"I'd love to crack open a beer."},{"definition":"To brag, boast."},{"definition":"To be ruined or impaired; to fail."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Broken so that cracks appear on, or under, the surface."},{"definition":"Broken into coarse pieces."},{"definition":"(of a voice) Harsh or dissonant."},{"definition":"Crazy; crackpot."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"cracked-au","text":"/kɹækt/"}]},{"word":"DEBTOR","idx":14139,"count":2887944,"meanings":[{"definitions":[{"definition":"A person or firm that owes money; one in debt; one who owes a debt"},{"definition":"One who owes another anything, or is under obligation, arising from express agreement, implication of law, or principles of natural justice, to pay money or to fulfill some other obligation; in bankruptcy or similar proceedings, the person who is the subject of the proceeding."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɛt.ɚ/"},{"text":"/ˈdɛt.ə/"},{"text":"/ˈdet.ə/"}]},{"word":"SHEAR","idx":14144,"count":2886210,"meanings":[{"definitions":[{"definition":"A cutting tool similar to scissors, but often larger."},{"definition":"The act of shearing, or something removed by shearing."},{"definition":"Forces that push in opposite directions."},{"definition":"A transformation that displaces every point in a direction parallel to some given line by a distance proportional to the point’s distance from the line."},{"definition":"The response of a rock to deformation usually by compressive stress, resulting in particular textures."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut, originally with a sword or other bladed weapon, now usually with shears, or as if using shears."},{"definition":"To remove the fleece from a sheep etc by clipping."},{"definition":"To deform because of forces pushing in opposite directions."},{"definition":"To transform by displacing every point in a direction parallel to some given line by a distance proportional to the point’s distance from the line."},{"definition":"To make a vertical cut in the coal."},{"definition":"To reap, as grain."},{"definition":"To deprive of property; to fleece."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shear-us","text":"/ʃiɹ/"}]},{"word":"MORTAL","idx":14145,"count":2886162,"meanings":[{"definitions":[{"definition":"A human; someone susceptible to death.","example":"Her wisdom was beyond that of a mere mortal."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Susceptible to death by aging, sickness, injury, or wound; not immortal."},{"definition":"Causing death; deadly, fatal, killing, lethal (now only of wounds, injuries etc.)."},{"definition":"Punishable by death."},{"definition":"Fatally vulnerable."},{"definition":"Of or relating to the time of death."},{"definition":"Affecting as if with power to kill; deathly.","example":"mortal enemy"},{"definition":"Human; belonging or pertaining to people who are mortal.","example":"mortal wit or knowledge; mortal power"},{"definition":"Very painful or tedious; wearisome.","example":"a sermon lasting two mortal hours"},{"definition":"Very drunk; wasted; smashed."},{"definition":"Of a sin: involving the penalty of spiritual death, rather than merely venial."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Mortally; enough to cause death.","example":"It's mortal cold out there."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"mortal-us"},{"text":"/ˈmɔːtəl/"}]},{"word":"SOVEREIGNTY","idx":14146,"count":2885932,"meanings":[{"definitions":[{"definition":"(of a polity) The state of making laws and controlling resources without the coercion of other nations."},{"definition":"(of a ruler) Supreme authority over all things."},{"definition":"(of a person) The liberty to decide one's thoughts and actions."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsɒv.ɹən.ti/"}]},{"word":"SUPERMARKET","idx":14147,"count":2885844,"meanings":[{"definitions":[{"definition":"A large self-service store that sells groceries and, usually, medications, household goods and/or clothing.","example":"I went to the supermarket to buy some food."},{"definition":"A chain of such stores."},{"definition":"A one-stop shop; a place offering a range of products or services."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"supermarket-uk","text":"/ˌsuːpəˈmɑːkɪt/"}]},{"word":"FRANCHISES","idx":14148,"count":2884783,"meanings":[{"definitions":[{"definition":"The right to vote at a public election or referendum; see: suffrage, suffragette."},{"definition":"A right or privilege officially granted to a person, a group of people, or a company by a government."},{"definition":"An acknowledgment of a corporation's existence and ownership."},{"definition":"The authorization granted by a company to sell or distribute its goods or services in a certain area.","example":"McDonalds has exported its franchise."},{"definition":"A business operating under such authorization, a franchisee."},{"definition":"A legal exemption from jurisdiction."},{"definition":"The membership of a corporation or state; citizenship."},{"definition":"The district or jurisdiction to which a particular privilege extends; the limits of an immunity; hence, an asylum or sanctuary."},{"definition":"The collection of organizations in the history of a sports team; the tradition of a sports team as an entity, extending beyond the contemporary organization.","example":"The Whalers' home city of Hartford was one of many for the franchise."},{"definition":"The positive influence on the buying behavior of customers exerted by the reputation of a company or a brand."},{"definition":"The loose collection of fictional works pertaining to a particular universe, including literary, film or television series from various sources.","example":"the Star Wars franchise"},{"definition":"Exemption from constraint or oppression; freedom; liberty."},{"definition":"Magnanimity; generosity; liberality; frankness; nobility."}],"partOfSpeech":"n"}]},{"word":"RAMS","idx":14149,"count":2884604,"meanings":[{"definitions":[{"definition":"A male sheep, typically uncastrated"},{"definition":"A battering ram; a heavy object used for breaking through doors."},{"definition":"A warship intended to sink other ships by ramming them."},{"definition":"A piston powered by hydraulic pressure."},{"definition":"A weight which strikes a blow, in a ramming device such as a pile driver, a steam hammer, a stamp mill."},{"definition":"A French trick-taking card game related to nap and loo."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To collide with (an object), usually with the intention of damaging it or disabling its function.","example":"The man, driving an SUV, then rammed the gate, according to police."},{"definition":"To strike (something) hard, especially with an implement.","example":"After placing the cartridge in the musket, ram it down securely with the ramrod."},{"definition":"To fill or compact by pounding or driving.","example":"Rammed earth walls"},{"definition":"To thrust during sexual intercourse."}],"partOfSpeech":"ve"}]},{"word":"CLEANSING","idx":14150,"count":2884249,"meanings":[{"definitions":[{"definition":"To free from dirt; to clean, to purify."},{"definition":"To spiritually purify; to free from guilt or sin; to purge."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of removing dirt, toxins etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That cleanses.","example":"Apply the cleansing cream to your skin."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈklɛn.zɪŋ/"}]},{"word":"BOO","idx":14152,"count":2884230,"meanings":[{"definitions":[{"definition":"A derisive shout made to indicate disapproval."},{"definition":"A close acquaintance or significant other."},{"definition":"Cannabis."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shout extended boos derisively.","example":"When he took the podium, the crowd booed."},{"definition":"To shout extended boos at, as a form of derision.","example":"The protesters loudly booed the visiting senator."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A loud exclamation intended to scare someone, especially a child. Usually used when one has been hidden from the victim and then suddenly appeared unexpectedly."},{"definition":"Used ironically in a situation where one had the opportunity to scare someone by speaking suddenly."},{"definition":"An exclamation used by a member or many members of an audience, as at a stage play or sports game, to indicate derision or disapproval of what has just occurred."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"boo-au","text":"/buː/"}]},{"word":"HMMM","idx":14153,"count":2883359,"meanings":[{"definitions":[{"definition":"Indicating thinking or pondering.","example":"Hmm... I just can't decide between the two."},{"definition":"A demand for an answer to a question.","example":"Just where were you until 2 a.m.? Hmm?"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"hmmm-us","text":"/hm̩ː/"}]},{"word":"GENOMIC","idx":14154,"count":2882963,"meanings":[{"definitions":[{"definition":"Of or pertaining to a genome."}],"partOfSpeech":"j"}]},{"word":"GOWN","idx":14155,"count":2882930,"meanings":[{"definitions":[{"definition":"A loose, flowing upper garment."},{"definition":"A woman's ordinary outer dress, such as a calico or silk gown."},{"definition":"The official robe of certain professional men and scholars, such as university students and officers, barristers, judges, etc."},{"definition":"(by metonymy) The university community.","example":"In the perennial town versus gown battles, townies win some violent battles, but the collegians are winning the war."},{"definition":"A loose wrapper worn by gentlemen within doors; a dressing gown."},{"definition":"Any sort of dress or garb."},{"definition":"The robe worn by a surgeon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dress in a gown, to don or garb with a gown."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gown-us","text":"/ɡaʊn/"}]},{"word":"HELPDESK","idx":14156,"count":2882761,"meanings":[{"definitions":[{"definition":"A section of an organization offering specialist advice to customers or users who have problems, especially with computer equipment or systems."}],"partOfSpeech":"n"}]},{"word":"PONDS","idx":14157,"count":2882178,"meanings":[{"definitions":[{"definition":"An inland body of standing water, either natural or man-made, that is smaller than a lake."},{"definition":"An inland body of standing water of any size that is fed by springs rather than by a river."},{"definition":"The Atlantic Ocean. Especially in across the pond.","example":"I haven't been back home across the pond in twenty years."}],"partOfSpeech":"n"}]},{"word":"ARCHERY","idx":14158,"count":2882154,"meanings":[{"definitions":[{"definition":"The practice or sport of shooting arrows with a bow."},{"definition":"A group of archers."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɑɹtʃəɹiː/"}]},{"word":"REFUSES","idx":14159,"count":2881547,"meanings":[{"definitions":[{"definition":"To decline (a request or demand).","example":"My request for a pay rise was refused."},{"definition":"To decline a request or demand, forbear; to withhold permission.","example":"I asked the star if I could have her autograph, but she refused."},{"definition":"To throw back, or cause to keep back (as the centre, a wing, or a flank), out of the regular alignment when troops are about to engage the enemy.","example":"to refuse the right wing while the left wing attacks"},{"definition":"To disown."},{"definition":"To melt again."}],"partOfSpeech":"ve"}]},{"word":"EXCLUDES","idx":14160,"count":2880324,"meanings":[{"definitions":[{"definition":"To bar (someone) from entering; to keep out."},{"definition":"To expel; to put out.","example":"to exclude young animals from the womb or from eggs"},{"definition":"To omit from consideration.","example":"Count from 1 to 30, but exclude the prime numbers."},{"definition":"To refuse to accept (evidence) as valid."},{"definition":"To eliminate from diagnostic consideration."}],"partOfSpeech":"ve"}]},{"word":"SABBATH","idx":14162,"count":2879663,"meanings":[{"definitions":[{"definition":"Saturday, observed in Judaism and some Christian denominations as a day of rest and worship."},{"definition":"Sunday, observed in most of Christianity as a day of rest and worship."},{"definition":"Friday, observed in Islam as a day of rest and worship.","example":"There are three Sabbaths–Friday (Muslim), Saturday (Jewish), and Sunday (Christian)."},{"definition":"A meeting of witches. (Also called a witches' sabbath, sabbat or black sabbath.)"},{"definition":"Among the ancient Jews and Hebrews, the seventh year, when the land was left fallow."}],"partOfSpeech":"n"}]},{"word":"RUIN","idx":14163,"count":2879219,"meanings":[{"definitions":[{"definition":"(sometimes in the plural) The remains of a destroyed or dilapidated construction, such as a house or castle."},{"definition":"The state of being a ruin, destroyed or decayed.","example":"The monastery has fallen into ruin."},{"definition":"Something that leads to serious trouble or destruction.","example":"Gambling has been the ruin of many."},{"definition":"A fall or tumble."},{"definition":"A change that destroys or defeats something; destruction; overthrow.","example":"the ruin of a ship or an army;  the ruin of a constitution or a government;  the ruin of health or hopes"},{"definition":"Complete financial loss; bankruptcy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause the fiscal ruin of.","example":"With all these purchases, you surely mean to ruin us!"},{"definition":"To destroy or make something no longer usable.","example":"He ruined his new white slacks by accidentally spilling oil on them."},{"definition":"To cause severe financial loss to; to bankrupt or drive out of business.","example":"The crooked stockbroker's fraudulent scheme ruined dozens of victims; some investors lost their life savings and even their houses."},{"definition":"To upset or overturn the plans or progress of, or to have a disastrous effect on something.","example":"My car breaking down just as I was on the road ruined my vacation."},{"definition":"To make something less enjoyable or likeable.","example":"I used to love that song, but being assaulted when that song was playing ruined the song for me."},{"definition":"To reveal the ending of (a story); to spoil."},{"definition":"To fall into a state of decay."},{"definition":"To seduce or debauch, and thus harm the social standing of.","example":"The young libertine was notorious for ruining local girls."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ruin-us","text":"/ˈɹuː.ɪn/"}]},{"word":"TRUMP","idx":14164,"count":2879094,"meanings":[{"definitions":[{"definition":"The suit, in a game of cards, that outranks all others.","example":"Diamonds were declared trump(s)."},{"definition":"A playing card of that suit.","example":"He played an even higher trump."},{"definition":"Something that gives one an advantage, especially one held in reserve."},{"definition":"An excellent person; a fine fellow, a good egg."},{"definition":"An old card game, almost identical to whist; the game of ruff."},{"definition":"A card of the major arcana of the tarot."},{"definition":"A trumpet."},{"definition":"Flatulence."},{"definition":"The noise made by an elephant through its trunk."},{"definition":"A musical instrument consisting of a flexible metal or bamboo “tongue” attached to a frame. This tongue is placed in the performer’s mouth and plucked with the finger to produce a note of constant pitch. Melodies can be created by changing the shape of the mouth and causing different overtones."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To play on (a card of another suit) with a trump.","example":"He knew the hand was lost when his ace was trumped."},{"definition":"To play a trump, or to take a trick with a trump."},{"definition":"To get the better of, or finesse, a competitor."},{"definition":"To impose unfairly; to palm off."},{"definition":"To supersede.","example":"In this election, it would seem issues of national security trumped economic issues."},{"definition":"To outweigh; be stronger, greater, bigger than or in other way superior to."},{"definition":"To blow a trumpet."},{"definition":"To flatulate.","example":"And without warning me, as he lay there, he suddenly trumped next to me in bed."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"trump-us","text":"/tɹʌmp/"},{"audio":"trump-uk","text":"/tɹʌmp/"}]},{"word":"ESCAPED","idx":14166,"count":2878893,"meanings":[{"definitions":[{"definition":"To get free; to free oneself.","example":"The factory was evacuated after toxic gases escaped from a pipe."},{"definition":"To avoid (any unpleasant person or thing); to elude, get away from.","example":"He only got a fine and so escaped going to jail."},{"definition":"To avoid capture; to get away with something, avoid punishment.","example":"Luckily, I escaped with only a fine."},{"definition":"To elude the observation or notice of; to not be seen or remembered by.","example":"The name of the hotel escapes me at present."},{"definition":"To cause (a single character, or all such characters in a string) to be interpreted literally, instead of with any special meaning it would usually have in the same context, often by prefixing with another character.","example":"Brion escaped the double quote character on Windows by adding a second double quote within the literal."},{"definition":"To halt a program or command by pressing a key (such as the \"Esc\" key) or combination of keys."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having escaped, especially from prison or another place of confinement.","example":"People are being warned not to approach the escaped prisoner."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"escaped-us","text":"/ɪˈskeɪpt/"}]},{"word":"PRECURSOR","idx":14167,"count":2878856,"meanings":[{"definitions":[{"definition":"That which precurses: a forerunner, predecessor, or indicator of approaching events."},{"definition":"One of the compounds that participates in the chemical reaction that produces another compound."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of intersymbol interference) Caused by the following symbol."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹɨˈkɜɹ.səɹ/"}]},{"word":"MATES","idx":14168,"count":2878121,"meanings":[{"definitions":[{"definition":"The conclusive victory in a game of chess that occurs when an opponent's king is threatened with unavoidable capture."},{"definition":"(by extension) Any losing situation with no escape; utter defeat."},{"definition":"A fellow, comrade, colleague, partner or someone with whom something is shared, e.g. shipmate, classmate."},{"definition":"(especially of a non-human animal) A breeding partner."},{"definition":"A friend, usually of the same sex.","example":"He's my best mate."},{"definition":"Friendly term of address to a stranger, usually male, of similar age","example":"Excuse me, mate, have you got the time?"},{"definition":"In naval ranks, a non-commissioned officer or his subordinate (e.g. Boatswain's Mate, Gunner's Mate, Sailmaker's Mate, etc)."},{"definition":"A ship's officer, subordinate to the master on a commercial ship."},{"definition":"A first mate."},{"definition":"A technical assistant in certain trades (e.g. gasfitter's mate, plumber's mate); sometimes an apprentice."},{"definition":"The other member of a matched pair of objects.","example":"I found one of the socks I wanted to wear, but I couldn't find its mate."},{"definition":"A suitable companion; a match; an equal."},{"definition":"The abovementioned plant; the leaves and shoots used for the tea"},{"definition":"An evergreen tree, Ilex paraquariensis, native to South America, cultivated for its leaves."},{"definition":"A beverage, resembling tea, made from the dried leaves of this plant."},{"definition":"A cup of this drink."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put the king of an opponent into checkmate.","example":"That jerk checkmated me in four moves!"},{"definition":"(by extension) To place in a losing situation that has no escape."},{"definition":"To match, fit together without space between.","example":"The pieces of the puzzle mate perfectly."},{"definition":"To copulate."},{"definition":"To pair in order to raise offspring"},{"definition":"To arrange in matched pairs."},{"definition":"To introduce (animals) together for the purpose of breeding."},{"definition":"(of an animal) To copulate with."},{"definition":"To marry; to match (a person)."},{"definition":"To match oneself against; to oppose as equal; to compete with."},{"definition":"To fit (objects) together without space between."},{"definition":"To move (a space shuttle orbiter) onto the back of an aircraft that can carry it."},{"definition":"To confuse; to confound."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Friendly; having a friendship (with).","example":"He is mates with my brother."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/meɪts/"}]},{"word":"AVIAN","idx":14170,"count":2877167,"meanings":[{"definitions":[{"definition":"A bird."},{"definition":"A bird-like or flying creature."},{"definition":"(furry fandom) Someone who roleplays or describes themselves as being a bird or bird-like animal character with human characteristics."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Characteristic of or pertaining to birds, or to bird-like or flying creatures."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈeɪvi.ən/"}]},{"word":"VISAS","idx":14173,"count":2876354,"meanings":[{"definitions":[{"definition":"A permit to enter and leave a country, normally issued by the authorities of the country to be visited."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To endorse (a passport, etc.)."}],"partOfSpeech":"ve"}]},{"word":"MATRICES","idx":14174,"count":2875818,"meanings":[{"definitions":[{"definition":"The womb."},{"definition":"The material or tissue in which more specialized structures are embedded."},{"definition":"An extracellular matrix, the material or tissue between the cells of animals or plants."},{"definition":"Part of the mitochondrion."},{"definition":"The medium in which bacteria are cultured."},{"definition":"A rectangular arrangement of numbers or terms having various uses such as transforming coordinates in geometry, solving systems of linear equations in linear algebra and representing graphs in graph theory."},{"definition":"A two-dimensional array."},{"definition":"A grid-like arrangement of electronic components, especially one intended for information coding, decoding or storage."},{"definition":"A table of data."},{"definition":"A geological matrix."},{"definition":"(archaeology and paleontology) The sediment surrounding and including the artifacts, features, and other materials at a site."},{"definition":"The environment from which a given sample is taken."},{"definition":"In hot metal typesetting, a mold for casting a letter."},{"definition":"In printmaking, the plate or block used, with ink, to hold the image that makes up the print."},{"definition":"The cavity or mold in which anything is formed."},{"definition":"(dyeing) The five simple colours (black, white, blue, red, and yellow) from which all the others are formed."},{"definition":"A binding agent of composite materials, e.g. resin in fibreglass."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmeɪtɹɪsiːz/"}]},{"word":"ANYWAYS","idx":14175,"count":2874936,"meanings":[{"definitions":[{"definition":"In any way."},{"definition":"Anyway, anyhow, in any case."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈɛn.iˌweɪz/"}]},{"word":"PASSAGES","idx":14177,"count":2874522,"meanings":[{"definitions":[{"definition":"A paragraph or section of text or music with particular meaning.","example":"She struggled to play the difficult passages."},{"definition":"Part of a path or journey.","example":"He made his passage through the trees carefully, mindful of the stickers."},{"definition":"An incident or episode."},{"definition":"The official approval of a bill or act by a parliament.","example":"The company was one of the prime movers in lobbying for the passage of the act."},{"definition":"The advance of time."},{"definition":"The use of tight brushwork to link objects in separate spatial plains. Commonly seen in Cubist works."},{"definition":"A passageway or corridor."},{"definition":"An underground cavity, formed by water or falling rocks, which is much longer than it is wide."},{"definition":"The vagina."},{"definition":"The act of passing; movement across or through."},{"definition":"The right to pass from one place to another."},{"definition":"A fee paid for passing or for being conveyed between places."},{"definition":"Serial passage, a technique used in bacteriology and virology"},{"definition":"A gambling game for two players using three dice, in which the object is to throw a double over ten."},{"definition":"A movement in classical dressage, in which the horse performs a very collected, energetic, and elevated trot that has a longer period of suspension between each foot fall than a working trot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pass something, such as a pathogen or stem cell, through a host or medium","example":"After 24 hours, the culture was passaged to an agar plate."},{"definition":"To make a passage, especially by sea; to cross","example":"They passaged to America in 1902."},{"definition":"To execute a passage movement"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"passages-us","text":"/ˈpæsɪdʒɪz/"}]},{"word":"ETIOLOGY","idx":14178,"count":2874131,"meanings":[{"definitions":[{"definition":"The establishment of a cause, origin, or reason for something."},{"definition":"The study of causes or causation."},{"definition":"The study or investigation of the causes of disease; a scientific explanation for the origin of a disease."}],"partOfSpeech":"n"}]},{"word":"CEREAL","idx":14180,"count":2871293,"meanings":[{"definitions":[{"definition":"A type of grass (such as wheat, rice or oats) cultivated for its edible grains."},{"definition":"The grains of such a grass."},{"definition":"Breakfast cereal.","example":"Which cereal would you like for breakfast?"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cereal-us","text":"[ˈsɪəɹiːəɫ]"}]},{"word":"COMPREHENSION","idx":14181,"count":2870530,"meanings":[{"definitions":[{"definition":"Thorough understanding"},{"definition":"The totality of intensions, that is, attributes, characters, marks, properties, or qualities, that the object possesses, or else the totality of intensions that are pertinent to the context of a given discussion."},{"definition":"A compact syntax for generating a list in some functional programming languages."},{"definition":"The inclusion of nonconformists within the Church of England."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɑmpɹɪˈhɛnʃn̩/"},{"text":"/kɒmpɹɪˈhɛnʃn̩/"}]},{"word":"RESOLVING","idx":14185,"count":2869298,"meanings":[{"definitions":[{"definition":"To find a solution to (a problem)."},{"definition":"To reduce to simple or intelligible notions; to make clear or certain; to unravel; to explain.","example":"to resolve a riddle"},{"definition":"To make a firm decision to do something.","example":"I resolve to finish this work before I go home."},{"definition":"To determine or decide in purpose; to make ready in mind; to fix; to settle.","example":"He was resolved by an unexpected event."},{"definition":"To come to an agreement or make peace; patch up relationship, settle differences, bury the hatchet.","example":"After two weeks of bickering, they finally resolved their differences."},{"definition":"To break down into constituent parts; to decompose; to disintegrate; to return to a simpler constitution or a primeval state."},{"definition":"To cause to perceive or understand; to acquaint; to inform; to convince; to assure; to make certain."},{"definition":"To cause a chord to go from dissonance to consonance."},{"definition":"To render visible or distinguishable the parts of something."},{"definition":"To find the IP address of a hostname, or the entity referred to by a symbol in source code; to look up."},{"definition":"To melt; to dissolve; to liquefy or soften (a solid)."},{"definition":"To melt; to dissolve; to become liquid."},{"definition":"To liquefy (a gas or vapour)."},{"definition":"To disperse or scatter; to discuss, as an inflammation or a tumour."},{"definition":"To relax; to lay at ease."},{"definition":"To separate racemic compounds into their enantiomers."},{"definition":"To solve (an equation, etc.)."},{"definition":"To solve again.","example":"I’ll have to resolve the equation with the new values."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of forming a resolution."}],"partOfSpeech":"n"}]},{"word":"DRILLS","idx":14187,"count":2868306,"meanings":[{"definitions":[{"definition":"A tool used to remove material so as to create a hole, typically by plunging a rotating cutting bit into a stationary workpiece.","example":"Wear safety glasses when operating an electric drill."},{"definition":"The portion of a drilling tool that drives the bit.","example":"Use a drill with a wire brush to remove any rust or buildup."},{"definition":"An activity done as an exercise or practice (especially a military exercise), particularly in preparation for some possible future event or occurrence.","example":"Regular fire drills can ensure that everyone knows how to exit safely in an emergency."},{"definition":"Any of several molluscs, of the genus Urosalpinx, especially the oyster drill (Urosalpinx cinerea), that drill holes in the shells of other animals."},{"definition":"A style of trap music with gritty, violent lyrics, originating on the South Side of Chicago."},{"definition":"An agricultural implement for making holes for sowing seed, and sometimes so formed as to contain seeds and drop them into the hole made."},{"definition":"A light furrow or channel made to put seed into, when sowing."},{"definition":"A row of seed sown in a furrow."},{"definition":"A small trickling stream; a rill."},{"definition":"An Old World monkey of West Africa, Mandrillus leucophaeus, similar in appearance to the mandrill, but lacking the colorful face."},{"definition":"A strong, durable cotton fabric with a strong bias (diagonal) in the weave."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create (a hole) by removing material with a drill (tool).","example":"Drill a small hole to start the screw in the right direction."},{"definition":"To practice, especially in (or as in) a military context.","example":"They drilled daily to learn the routine exactly."},{"definition":"To cause to drill (practice); to train in military arts.","example":"The sergeant was up by 6:00 every morning, drilling his troops."},{"definition":"To repeat an idea frequently in order to encourage someone to remember it.","example":"The instructor drilled into us the importance of reading the instructions."},{"definition":"To investigate or examine something in more detail or at a different level","example":"Drill deeper and you may find the underlying assumptions faulty."},{"definition":"To hit or kick with a lot of power."},{"definition":"To hit someone with a pitch, especially in an intentional context."},{"definition":"To have sexual intercourse with; to penetrate."},{"definition":"To sow (seeds) by dribbling them along a furrow or in a row."},{"definition":"To cause to flow in drills or rills or by trickling; to drain by trickling.","example":"waters drilled through a sandy stratum"},{"definition":"To entice or allure; to decoy; with on."},{"definition":"To cause to slip or waste away by degrees."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɹɪlz/"}]},{"word":"CHAMP","idx":14190,"count":2867858,"meanings":[{"definitions":[{"definition":"Buddy, sport, mate (as a term of address)","example":"Whatcha doing, champ?"},{"definition":"An ongoing winner in a game or contest.","example":"The defending champion is expected to defeat his challenger."},{"definition":"Someone who is chosen to represent a group of people in a contest.","example":"Barcelona is eligible to play in FIFA Club World Cup as the champion of Europe."},{"definition":"Someone who fights for a cause or status.","example":"champion of women's suffrage"},{"definition":"Someone who fights on another's behalf.","example":"champion of the poor"},{"definition":"A meal of mashed potatoes and scallions"},{"definition":"Champagne"},{"definition":"(obsolete or rare) the field or ground on which carving appears in relief"},{"definition":"(obsolete or rare) the field of a shield"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bite or chew, especially noisily or impatiently."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"champ-1-uk","text":"/t͡ʃæmp/"}]},{"word":"PERSONALISED","idx":14191,"count":2867842,"meanings":[{"definitions":[{"definition":"To adapt something to the needs or tastes of an individual"},{"definition":"To represent something abstract as a person; to embody"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Adapted to the needs of an individual"},{"definition":"Embodied"}],"partOfSpeech":"j"}]},{"word":"HOSPICE","idx":14192,"count":2867761,"meanings":[{"definitions":[{"definition":"A lodging for pilgrims or the destitute, normally provided by a monastic order."},{"definition":"The provision of palliative care for terminally ill patients, either at a specialized facility or at a residence, and support for the family, typically refraining from taking extraordinary measures to prolong life."},{"definition":"A specialized facility or organization offering palliative care for the terminally ill."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɑspɪs/"},{"text":"/ˈhɒspɪs/"}]},{"word":"AGREEING","idx":14194,"count":2867051,"meanings":[{"definitions":[{"definition":"To harmonize in opinion, statement, or action; to be in unison or concord; to be or become united or consistent; to concur.","example":"all parties agree in the expediency of the law."},{"definition":"To yield assent; to accede;—followed by to.","example":"to agree to an offer, or to opinion."},{"definition":"To yield assent to; to approve."},{"definition":"To make a stipulation by way of settling differences or determining a price; to exchange promises; to come to terms or to a common resolve; to promise."},{"definition":"To be conformable; to resemble; to coincide; to correspond.","example":"the picture does not agree with the original; the two scales agree exactly."},{"definition":"(now always with with) To suit or be adapted in its effects; to do well.","example":"the same food does not agree with every constitution."},{"definition":"(grammar) To correspond to (another word) in a grammatical category, such as gender, number, case, or person.","example":"In Romanian, the articles, adjectives, pronouns agree in gender, number and case with the noun they refer to."},{"definition":"To consent to a contract or to an element of a contract."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An agreement."}],"partOfSpeech":"n"}]},{"word":"EXHIBITOR","idx":14196,"count":2866316,"meanings":[{"definitions":[{"definition":"Someone who exhibits something"},{"definition":"Someone who organizes an exhibition"}],"partOfSpeech":"n"}]},{"word":"RENTED","idx":14197,"count":2865890,"meanings":[{"definitions":[{"definition":"To occupy premises in exchange for rent.","example":"I rented a house from my friend's parents for a year."},{"definition":"To grant occupation in return for rent.","example":"We rented our house to our son's friend for a year."},{"definition":"To obtain or have temporary possession of an object (e.g. a movie) in exchange for money."},{"definition":"To be leased or let for rent.","example":"The house rents for five hundred dollars a month."}],"partOfSpeech":"ve"}]},{"word":"DEDUCTIONS","idx":14198,"count":2865841,"meanings":[{"definitions":[{"definition":"That which is deducted; that which is subtracted or removed"},{"definition":"A sum that can be removed from tax calculations; something that is written off","example":"You might want to donate the old junk and just take the deduction."},{"definition":"A process of reasoning that moves from the general to the specific, in which a conclusion follows necessarily from the premises presented, so that the conclusion cannot be false if the premises are true."},{"definition":"A conclusion; that which is deduced, concluded or figured out","example":"He arrived at the deduction that the butler didn't do it."},{"definition":"The ability or skill to deduce or figure out; the power of reason","example":"Through his powers of deduction, he realized that the plan would never work."}],"partOfSpeech":"n"}]},{"word":"BRUSHED","idx":14200,"count":2865016,"meanings":[{"definitions":[{"definition":"To clean with a brush.","example":"Brush your teeth."},{"definition":"To untangle or arrange with a brush.","example":"Brush your hair."},{"definition":"To apply with a brush.","example":"Brush the paint onto the walls."},{"definition":"To remove with a sweeping motion.","example":"Brush the flour off your clothes."},{"definition":"To touch with a sweeping motion, or lightly in passing.","example":"Her scarf brushed his skin."},{"definition":"To clean one's teeth by brushing them."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Rubbed, especially as a finish.","example":"The brushed aluminum vase had a soft appearance."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"brushed-uk","text":"/ˈbɹʌʃt/"}]},{"word":"AUGMENTATION","idx":14201,"count":2864943,"meanings":[{"definitions":[{"definition":"The act or process of augmenting."},{"definition":"A particular mark of honour, granted by the sovereign in consideration of some noble action, or by favour; and either quartered with the family arms, or on an escutcheon or canton."},{"definition":"A surgical procedure to enlarge a body part, as breast augmentation."},{"definition":"The stage of a disease during which symptoms increase or continue."},{"definition":"A compositional technique where the composer lengthens the melody by lengthening its note values."},{"definition":"An increase of stipend obtained by a parish minister by an action raised in the Court of Teinds against the titular and heritors."}],"partOfSpeech":"n"}]},{"word":"OTTO","idx":14202,"count":2864525,"meanings":[{"definitions":[{"definition":"An essential oil extracted from flowers."},{"definition":"A perfume made from this oil."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"otto-us","text":"/ˈɑtoʊ/"}]},{"word":"ANNUITY","idx":14203,"count":2864316,"meanings":[{"definitions":[{"definition":"A right to receive amounts of money regularly over a certain fixed period, in perpetuity, or, especially, over the remaining life or lives of one or more beneficiaries."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈn(j)uɪti/"}]},{"word":"ASSORTMENT","idx":14204,"count":2863593,"meanings":[{"definitions":[{"definition":"A collection of varying but related items.","example":"This box has an assortment of chocolates. There's a picture on the cover so you know which is which."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈsɔːtmənt/"}]},{"word":"CREDIBLE","idx":14205,"count":2863534,"meanings":[{"definitions":[{"definition":"Believable or plausible."},{"definition":"Authentic or convincing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹɛdəbl̩/"}]},{"word":"SPORTSWEAR","idx":14206,"count":2862863,"meanings":[{"definitions":[{"definition":"Casual clothing that is comfortable to wear when exercising or partaking in sport; activewear."}],"partOfSpeech":"n"}]},{"word":"CULTURED","idx":14208,"count":2862362,"meanings":[{"definitions":[{"definition":"To maintain in an environment suitable for growth (especially of bacteria) (compare cultivate)"},{"definition":"To increase the artistic or scientific interest (in something) (compare cultivate)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Learned in the ways of civilized society; civilized; refined."},{"definition":"Artificially developed.","example":"cultured plant"}],"partOfSpeech":"j"}]},{"word":"IMPORTING","idx":14209,"count":2862094,"meanings":[{"definitions":[{"definition":"To bring (something) in from a foreign country, especially for sale or trade."},{"definition":"To load a file into a software application from another version or system.","example":"How can I import files from older versions of this application?"},{"definition":"To be important; to be significant; to be of consequence."},{"definition":"To be of importance to (someone or something)."},{"definition":"To be incumbent on (someone to do something)."},{"definition":"To be important or crucial to (that something happen)."},{"definition":"To mean, signify."},{"definition":"To express, to imply."}],"partOfSpeech":"ve"}]},{"word":"DELIBERATELY","idx":14210,"count":2862093,"meanings":[{"definitions":[{"definition":"Intentionally, or after deliberation; not accidentally.","example":"He deliberately broke that, didn't he?"},{"definition":"Taking one's time, slowly and carefully.","example":"After being called upon, he strode deliberately up to the blackboard."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"deliberately-us","text":"/dəˈlɪb(ə)ɹətli/"}]},{"word":"RECAP","idx":14211,"count":2861982,"meanings":[{"definitions":[{"definition":"A tire that has had new tread glued on."},{"definition":"A recapitulation."},{"definition":"A leveraged recapitalization accomplished by increasing the debt to equity ratio."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To seal (something) again with a cap."},{"definition":"To replace the worn tread on a tire by gluing a new outer portion. (US English only - Retread in UK English)"},{"definition":"To recapitulate."},{"definition":"To replace capacitors in electronic equipment."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"recap-1-uk","text":"/ɹiːˈkæp/"}]},{"word":"OPENLY","idx":14212,"count":2861856,"meanings":[{"definitions":[{"definition":"In an open manner, visibly, not covertly."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"openly-us","text":"/ˈoʊpənli/"}]},{"word":"TODDLERS","idx":14213,"count":2861828,"meanings":[{"definitions":[{"definition":"A young child who has started walking but not fully mastered it, typically between one and three years old."}],"partOfSpeech":"n"}]},{"word":"CRAWL","idx":14215,"count":2859784,"meanings":[{"definitions":[{"definition":"The act of moving slowly on hands and knees etc, or with frequent stops."},{"definition":"A rapid swimming stroke with alternate overarm strokes and a fluttering kick."},{"definition":"A very slow pace.","example":"My computer has slowed down to a crawl since I installed that software package."},{"definition":"A piece of horizontally or vertically scrolling text overlaid on the main image."},{"definition":"A pen or enclosure of stakes and hurdles for holding fish."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To creep; to move slowly on hands and knees, or by dragging the body along the ground.","example":"Clutching my wounded side, I crawled back to the trench."},{"definition":"To move forward slowly, with frequent stops.","example":"The rush-hour traffic crawled around the bypass."},{"definition":"To act in a servile manner.","example":"Don't come crawling to me with your useless apologies!"},{"definition":"(with \"with\") See crawl with."},{"definition":"To feel a swarming sensation.","example":"The horrible sight made my skin crawl."},{"definition":"To swim using the crawl stroke.","example":"I think I'll crawl the next hundred metres."},{"definition":"To move over an area on hands and knees.","example":"The baby crawled the entire second floor."},{"definition":"To visit while becoming inebriated.","example":"They crawled the downtown bars."},{"definition":"To visit files or web sites in order to index them for searching.","example":"Yahoo Search has updated its Slurp Crawler to crawl web sites faster and more efficiently."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crawl-us","text":"/kɹɔl/"}]},{"word":"SPARKLING","idx":14218,"count":2859116,"meanings":[{"definitions":[{"definition":"To emit sparks; to throw off ignited or incandescent particles","example":"The wood was sparkling in the bonfire."},{"definition":"(by extension) To shine as if throwing off sparks; to emit flashes of light; to scintillate; to twinkle","example":"The stars sparkle in the sky."},{"definition":"To manifest itself by, or as if by, emitting sparks; to glisten; to flash."},{"definition":"To emit little bubbles, as certain kinds of liquors; to effervesce","example":"sparkling water"},{"definition":"To emit in the form or likeness of sparks."},{"definition":"To disperse."},{"definition":"To scatter on or over."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Act or appearance of something that sparkles; a sparkle; a gleam."},{"definition":"A sparkling wine."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of an object, reflecting light as if giving off tiny sparks."},{"definition":"Of a beverage, especially an alcoholic beverage, containing dissolved carbon dioxide (either naturally or that has been added) that comes out of solution in the form of many tiny bubbles."},{"definition":"Brilliant and vivacious."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sparkling-uk","text":"/ˈspɑːklɪŋ/"}]},{"word":"JABBER","idx":14219,"count":2858295,"meanings":[{"definitions":[{"definition":"Rapid or incoherent talk, with indistinct utterance; gibberish."},{"definition":"One who or that which jabs."},{"definition":"A kind of hand-operated corn planter."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To talk rapidly, indistinctly, or unintelligibly; to utter gibberish or nonsense."},{"definition":"To utter rapidly or indistinctly; to gabble."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdʒæbə(ɹ)/"}]},{"word":"BINDINGS","idx":14221,"count":2857186,"meanings":[{"definitions":[{"definition":"An item (usually rope, tape, or string) used to hold two or more things together."},{"definition":"The spine of a book where the pages are held together."},{"definition":"A finishing on a seam or hem of a garment."},{"definition":"The association of a named item with an element of a program."},{"definition":"The interface of a library with a programming language other than one it is written in.","example":"The Python binding is automatically generated."},{"definition":"The action or result of making two or more molecules stick together."}],"partOfSpeech":"n"}]},{"word":"CONVINCING","idx":14223,"count":2856694,"meanings":[{"definitions":[{"definition":"To make someone believe, or feel sure about something, especially by using logic, argument or evidence.","example":"I wouldn't have or do something, unless I'm convinced that it's good."},{"definition":"To persuade."},{"definition":"To overcome, conquer, vanquish."},{"definition":"To confute; to prove wrong."},{"definition":"To prove guilty; to convict."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which somebody is convinced."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Effective as proof or evidence.","example":"Our convincing evidence was sufficient in the end to win the trial."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kənˈvɪnsɪŋ/"}]},{"word":"ROTATE","idx":14224,"count":2856677,"meanings":[{"definitions":[{"definition":"To spin, turn, or revolve.","example":"He rotated in his chair to face me."},{"definition":"To advance through a sequence; to take turns.","example":"The nurses' shifts rotate each week."},{"definition":"(of aircraft) To lift the nose, just prior to takeoff.","example":"The aircraft rotates at sixty knots."},{"definition":"To spin, turn, or revolve something.","example":"Rotate the dial to the left."},{"definition":"To advance something through a sequence; to allocate or deploy in turns."},{"definition":"To replace older materials or to place older materials in front of newer ones so that older ones get used first.","example":"The supermarket rotates the stock daily so that old foods don't sit around."},{"definition":"To grow or plant (crops) in a certain order."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having the parts spreading out like a wheel; wheel-shaped.","example":"a rotate spicule or scale; a rotate corolla"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rotate-us","text":"/ˈɹoʊteɪt/"}]},{"word":"FLAWS","idx":14225,"count":2856172,"meanings":[{"definitions":[{"definition":"A flake, fragment, or shiver."},{"definition":"A thin cake, as of ice."},{"definition":"A crack or breach, a gap or fissure; a defect of continuity or cohesion.","example":"That vase has a flaw."},{"definition":"A defect, fault, or imperfection, especially one that is hidden."},{"definition":"A sudden burst or gust of wind of short duration; windflaw."},{"definition":"A storm of short duration."},{"definition":"A sudden burst of noise and disorder"}],"partOfSpeech":"n"}]},{"word":"TRACING","idx":14227,"count":2855401,"meanings":[{"definitions":[{"definition":"To follow the trail of."},{"definition":"To follow the history of."},{"definition":"To draw or sketch lightly or with care.","example":"He carefully traced the outlines of the old building before him."},{"definition":"To copy onto a sheet of paper superimposed over the original, by drawing over its lines."},{"definition":"To copy; to imitate."},{"definition":"To walk; to go; to travel."},{"definition":"To walk over; to pass through; to traverse."},{"definition":"To follow the execution of the program by making it to stop after every instruction, or by making it print a message after every step."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The reproduction of an image made by copying it through translucent paper."},{"definition":"A record in the form of a graph made by a device such as a seismograph."},{"definition":"The process of finding something that is lost by studying evidence."},{"definition":"A regular path or track; a course."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɹeɪsɪŋ/"}]},{"word":"DEVIATIONS","idx":14228,"count":2855243,"meanings":[{"definitions":[{"definition":"The act of deviating; wandering off the correct or true path or road"},{"definition":"A departure from the correct way of acting"},{"definition":"The state or result of having deviated; a transgression; an act of sin; an error; an offense.","example":"mankind’s deviation from divine will"},{"definition":"(contract law) The voluntary and unnecessary departure of a ship from, or delay in, the regular and usual course of the specific voyage insured, thus releasing the underwriters from their responsibility."},{"definition":"(Absolute Deviation) The shortest distance between the center of the target and the point where a projectile hits or bursts."},{"definition":"For interval variables and ratio variables, a measure of difference between the observed value and the mean."},{"definition":"The signed difference between a value and its reference value."}],"partOfSpeech":"n"}]},{"word":"INCOMES","idx":14229,"count":2854711,"meanings":[{"definitions":[{"definition":"Money one earns by working or by capitalising on the work of others."},{"definition":"Money coming in to a fund, account, or policy."},{"definition":"A coming in; arrival; entrance; introduction."},{"definition":"A newcomer or arrival; an incomer."},{"definition":"An entrance-fee."},{"definition":"A coming in as by influx or inspiration, hence, an inspired quality or characteristic, as courage or zeal; an inflowing principle."},{"definition":"A disease or ailment without known or apparent cause, as distinguished from one induced by accident or contagion; an oncome."},{"definition":"That which is taken into the body as food; the ingesta; sometimes restricted to the nutritive, or digestible, portion of the food."}],"partOfSpeech":"n"}]},{"word":"SUBWOOFER","idx":14231,"count":2853707,"meanings":[{"definitions":[{"definition":"An electronic speaker designed to produce low-frequency sound, especially bass."}],"partOfSpeech":"n"}]},{"word":"AMORTIZATION","idx":14232,"count":2853615,"meanings":[{"definitions":[{"definition":"The reduction of loan principal over a series of payments."},{"definition":"The distribution of the cost of an intangible asset, such as an intellectual property right, over the projected useful life of the asset."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˌmɔɹtəˈzeɪʃən/"},{"text":"/əˌmɔːtaɪˈzeɪʃən/"}]},{"word":"NEUROLOGY","idx":14233,"count":2853302,"meanings":[{"definitions":[{"definition":"The branch of medicine that deals with the disorders of nervous system including the brain and spinal cord of the central nervous system and the nerves, muscles, and neuromuscular junction of the peripheral nervous system."},{"definition":"Focal neurologic signs; focal neurologic deficits.","example":"Patient had no neurology."},{"definition":"Neurological examination.","example":"Neurology is normal."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/n(j)uˈɹɒlədʒi/"}]},{"word":"FRAGILE","idx":14235,"count":2852127,"meanings":[{"definitions":[{"definition":"Easily broken or destroyed, and thus often of subtle or intricate structure.","example":"He is a very fragile person and gets easily depressed."},{"definition":"Feeling weak or easily disturbed as a result of illness."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fragile-us","text":"/ˈfɹædʒəl/"}]},{"word":"RADIATOR","idx":14241,"count":2850529,"meanings":[{"definitions":[{"definition":"Anything which radiates or emits rays."},{"definition":"A device that lowers engine coolant temperature by conducting heat to the air, through metal fins."},{"definition":"(of buildings) A finned metal fixture that carries hot water or steam in order to heat a room."},{"definition":"A type of antenna."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"radiator-us","text":"/ˈɹeɪ.diˌeɪ.tɚ/"}]},{"word":"COMPETENCIES","idx":14243,"count":2849437,"meanings":[{"definitions":[{"definition":"A sufficient supply (of)."},{"definition":"A sustainable income."},{"definition":"The ability to perform some task; competence."},{"definition":"Meeting specified qualifications to perform."},{"definition":"Implicit knowledge of a language’s structure."}],"partOfSpeech":"n"}]},{"word":"RESTORING","idx":14244,"count":2847991,"meanings":[{"definitions":[{"definition":"To reestablish, or bring back into existence.","example":"He restored my lost faith in him by doing a good deed."},{"definition":"To bring back to good condition from a state of decay or ruin."},{"definition":"To give or bring back (that which has been lost or taken); to bring back to the owner; to replace."},{"definition":"To give in place of, or as restitution for."},{"definition":"To recover (data, etc.) from a backup.","example":"There was a crash last night, and we're still restoring the file system."},{"definition":"To bring (a note) back to its original signification."},{"definition":"To make good; to make amends for."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"restoring-us"}]},{"word":"RUSHING","idx":14246,"count":2847595,"meanings":[{"definitions":[{"definition":"To hurry; to perform a task with great haste.","example":"rush one's dinner;   rush off an email response"},{"definition":"To flow or move forward rapidly or noisily.","example":"armies rush to battle;   waters rush down a precipice."},{"definition":"To dribble rapidly."},{"definition":"(contact sports) To run directly at another player in order to block or disrupt play."},{"definition":"To cause to move or act with unusual haste.","example":"Don't rush your client or he may withdraw."},{"definition":"To make a swift or sudden attack."},{"definition":"To swiftly attack without warning."},{"definition":"To attack (an opponent) with a large swarm of units."},{"definition":"(college) To attempt to join a fraternity or sorority; to undergo hazing or initiation in order to join a fraternity or sorority."},{"definition":"To transport or carry quickly.","example":"The shuttle rushes passengers from the station to the airport."},{"definition":"To roquet an object ball to a particular location on the lawn."},{"definition":"To recite (a lesson) or pass (an examination) without an error."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A rapid surging motion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Rapidly flowing or surging."},{"definition":"Full of activity, busy."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹʌʃɪŋ/"}]},{"word":"BEHOLD","idx":14247,"count":2847118,"meanings":[{"definitions":[{"definition":"To see or look at, esp. appreciatively; to descry, look upon."},{"definition":"To look."},{"definition":"To contemplate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Look, a call of attention to something"},{"definition":"Lo!"}],"partOfSpeech":"i"}],"phonetics":[{"audio":"behold-us","text":"/bɪˈhoʊld/"}]},{"word":"ALTERATION","idx":14249,"count":2846655,"meanings":[{"definitions":[{"definition":"The act of altering or making different."},{"definition":"The state of being altered; a change made in the form or nature of a thing; changed condition."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"alteration-us","text":"/ɔl.tɚˈeɪ.ʃən/"}]},{"word":"HOTSPOTS","idx":14250,"count":2846220,"meanings":[{"definitions":[{"definition":"An optical phenomenon which creates a bright spot around the shadow of the viewer's head, when the surface on which the shadow falls has special optical characteristics (as with dewy grass)."},{"definition":"A place notable for a high level of activity or danger."},{"definition":"A part of an application that consumes a significant amount of execution time."},{"definition":"Part of a control that responds dynamically as the user moves the pointer over it, as for example in an image map."},{"definition":"A location in which WiFi Internet access is available."},{"definition":"The region of a gene in which there is higher than normal rate of mutation."},{"definition":"The surface manifestation of a plume that rises from deep in the celestial body's mantle."}],"partOfSpeech":"n"}]},{"word":"TRAINEE","idx":14251,"count":2844915,"meanings":[{"definitions":[{"definition":"Someone who is still in the process of being formally trained in a workplace."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tɹeɪˈni/"}]},{"word":"PODCASTING","idx":14253,"count":2844136,"meanings":[{"definitions":[{"definition":"To deliver (an audio programme) over the internet on a regular basis."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The distribution of multimedia files over the Internet for playback on a mobile device, often in MP3 format."}],"partOfSpeech":"n"}]},{"word":"MURDERED","idx":14254,"count":2843529,"meanings":[{"definitions":[{"definition":"To deliberately kill (a person or persons) without justification, especially with malice aforethought.","example":"The woman found dead in her kitchen was murdered by her husband."},{"definition":"To defeat decisively.","example":"Our team is going to murder them."},{"definition":"To kick someone's ass or chew someone out (used to express one’s anger at somebody).","example":"He's torn my best shirt. When I see him, I'll murder him!"},{"definition":"To botch or mangle."},{"definition":"To devour, ravish.","example":"I could murder a hamburger right now."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been murdered."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"murdered-us","text":"/ˈmɝ.dɚd/"}]},{"word":"CENTENNIAL","idx":14255,"count":2843140,"meanings":[{"definitions":[{"definition":"The hundredth anniversary of an event or happening."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to, or associated with, the commemoration of an event that happened a hundred years before.","example":"a centennial ode"},{"definition":"Happening once in a hundred years.","example":"a centennial jubilee; a centennial celebration"},{"definition":"Lasting or aged a hundred years."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"centennial-uk","text":"/sɛnˈtɛnɪəl/"}]},{"word":"TUNA","idx":14256,"count":2842548,"meanings":[{"definitions":[{"definition":"Any of several species of fish of the genus Thunnus in the family Scombridae."},{"definition":"The edible flesh of the tuna."},{"definition":"The prickly pear, a type of cactus native to Mexico in the genus Opuntia."},{"definition":"The fruit of the cactus."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tuna-us","text":"/ˈtju.nə/"}]},{"word":"BLUEGRASS","idx":14257,"count":2842501,"meanings":[{"definitions":[{"definition":"Kentucky bluegrass, Poa pratensis."},{"definition":"A style of country music with roots in Scots-Irish Appalachian folk music, blues, and jazz and characterized by banjos, fiddles, acoustic guitars, dobros, and mandolins; but containing no drums, electric guitars, pianos or other keyboard or wind instruments."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bluegrass-us"}]},{"word":"HAZEL","idx":14258,"count":2841268,"meanings":[{"definitions":[{"definition":"A tree or shrub of the genus Corylus, bearing edible nuts called hazelnuts or filberts."},{"definition":"The nut of the hazel tree."},{"definition":"The wood of a hazelnut tree."},{"definition":"A greenish-brown colour, the colour of a ripe hazelnut."},{"definition":"Freestone"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a greenish-brown colour. (often used to refer to eye colour)"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hazel-us","text":"/ˈheɪzəl/"}]},{"word":"WIPE","idx":14259,"count":2841184,"meanings":[{"definitions":[{"definition":"The act of wiping something.","example":"multiple wipes of a computer's hard disk"},{"definition":"A soft piece of cloth or cloth-like material used for wiping."},{"definition":"A kind of film transition where one shot replaces another by travelling from one side of the frame to another or with a special shape."},{"definition":"A sarcastic remark; a reproof, a jibe."},{"definition":"A lapwing, especially a northern lapwing (Vanellus vanellus)."},{"definition":"An instance of all members of a party dying in a single campaign, event, or battle; a wipeout."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move an object over, maintaining contact, with the intention of removing some substance from the surface. (Compare rub.)","example":"I wiped the sweat from my brow with the back of my hand."},{"definition":"To remove by rubbing; to rub off; to obliterate; usually followed by away, off, or out."},{"definition":"To cheat; to defraud; to trick; usually followed by out."},{"definition":"To erase.","example":"I accidentally wiped my hard drive."},{"definition":"To make (a joint, as between pieces of lead pipe), by surrounding the junction with a mass of solder, applied in a plastic condition by means of a rag with which the solder is shaped by rubbing."},{"definition":"To remove an expression from one's face.","example":"You should wipe that smirk off your face before the boss comes in."},{"definition":"To deperm (a ship)."},{"definition":"To have all members of a party die in a single campaign, event, or battle; to be wiped out.","example":"If you try to fight that boss underprepared, you're definitely gonna wipe."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wipe-us","text":"/waɪp/"}]},{"word":"LEDGER","idx":14260,"count":2840827,"meanings":[{"definitions":[{"definition":"A book for keeping notes, especially one for keeping accounting records; a record book, a register."},{"definition":"A large, flat stone, especially one laid over a tomb."},{"definition":"A collection of accounting entries consisting of credits and debits."},{"definition":"A board attached to a wall to provide support for attaching other structural elements (such as deck joists or roof rafters) to a building."},{"definition":"Short for ledger bait or ledger line (“fishing line used with ledger bait for bottom fishing; ligger”)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To record (something) in, or as if in, a ledger."},{"definition":"To use (a certain type of bait) in bottom fishing."},{"definition":"To engage in bottom fishing."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ledger-uk","text":"/ˈlɛdʒə/"}]},{"word":"SCARLET","idx":14261,"count":2840266,"meanings":[{"definitions":[{"definition":"A brilliant red colour tinged with orange."},{"definition":"Cloth of a scarlet color."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dye or tinge with scarlet."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of a bright red colour."},{"definition":"Sinful or whorish.","example":"a scarlet woman"},{"definition":"(Ireland) Tragic or disappointing."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"scarlet-uk","text":"/ˈskɑːlɪt/"}]},{"word":"CRUSHED","idx":14262,"count":2840208,"meanings":[{"definitions":[{"definition":"To press between two hard objects; to squeeze so as to alter the natural shape or integrity of it, or to force together into a mass.","example":"to crush grapes"},{"definition":"To reduce to fine particles by pounding or grinding","example":"to crush quartz"},{"definition":"To overwhelm by pressure or weight.","example":"After the corruption scandal, the opposition crushed the ruling party in the elections"},{"definition":"To oppress or grievously burden."},{"definition":"To overcome completely; to subdue totally.","example":"The sultan's black guard crushed every resistance bloodily."},{"definition":"To be or become broken down or in, or pressed into a smaller compass, by external weight or force","example":"an eggshell crushes easily"},{"definition":"To feel infatuation or unrequited love.","example":"She's crushing on him."},{"definition":"To give a compressed or foreshortened appearance to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pulverized, rendered into small, disconnected fragments."},{"definition":"Broken, saddened, depressed."},{"definition":"Of a fabric, having the appearance of having been crushed.","example":"Her top was of black crushed velvet."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/kɹʌʃt/"}]},{"word":"ACRONYMS","idx":14263,"count":2840173,"meanings":[{"definitions":[{"definition":"An abbreviation formed by the initial letters of other words, sometimes exclusively such abbreviations when pronounced as a word (as \"laser\") rather than as individual letters (initialisms such as \"TNT\")."},{"definition":"An abbreviation formed by the beginning letters or syllables of other words (as \"Benelux\")."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into an acronym."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈæ.kɹə.nɪmz/"}]},{"word":"LAUGHS","idx":14264,"count":2839804,"meanings":[{"definitions":[{"definition":"An expression of mirth particular to the human species; the sound heard in laughing; laughter.","example":"His deep laughs boomed through the room."},{"definition":"Something that provokes mirth or scorn.","example":"Your new hat's an absolute laugh, dude."},{"definition":"A fun person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To show mirth, satisfaction, or derision, by peculiar movement of the muscles of the face, particularly of the mouth, causing a lighting up of the face and eyes, and usually accompanied by the emission of explosive or chuckling sounds from the chest and throat; to indulge in laughter.","example":"There were many laughing children running on the school grounds."},{"definition":"To be or appear cheerful, pleasant, mirthful, lively, or brilliant; to sparkle; to sport."},{"definition":"(followed by \"at\") To make an object of laughter or ridicule; to make fun of; to deride; to mock.","example":"Don't laugh at my new hat, man!"},{"definition":"To affect or influence by means of laughter or ridicule."},{"definition":"To express by, or utter with, laughter."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"laughs-us"},{"audio":"laughs-uk"}]},{"word":"CONNIE","idx":14265,"count":2838668,"meanings":[{"definitions":[{"definition":"A rabbit, especially the European rabbit, Oryctolagus cuniculus (formerly known as Lepus cuniculus)."},{"definition":"Rabbit fur."},{"definition":"Locally for other rabbit-like or hyrax-like animals, such as the Cape hyrax (das, dassie) or the pika (Ochotona princeps, formerly Lagomys princeps)."},{"definition":"A simpleton; one who may be taken in by a cony-catcher."},{"definition":"An edible West Indian fish, a grouper given in different sources as: Epinephelus apua, the hind of Bermuda; nigger-fish, Epinephelus punctatus; Cephalopholis fulva."},{"definition":"Several species of tropical west Atlantic groupers of family Epinephelidae, such as the mutton hamlet, graysby, Cuban coney, and rooster hind."},{"definition":"The burbot."},{"definition":"A woman; a sweetheart."}],"partOfSpeech":"n"}]},{"word":"AUTOGRAPHED","idx":14266,"count":2838531,"meanings":[{"definitions":[{"definition":"To sign, or write one’s name or signature on a book etc"},{"definition":"To write something in one's own handwriting"}],"partOfSpeech":"ve"}]},{"word":"REFERENDUM","idx":14267,"count":2838258,"meanings":[{"definitions":[{"definition":"A direct popular vote on a proposed law or constitutional amendment. The adposition on is usually used before the related subject of the vote."},{"definition":"An action, choice, etc., which is perceived as passing judgment on another matter.","example":"My father is taking my decision on whether to go to university as a referendum on his performance as a parent, and it's very stressful."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌɹɛfəˈɹɛndəm/"}]},{"word":"MODULATION","idx":14268,"count":2837610,"meanings":[{"definitions":[{"definition":"The process of applying a signal to a carrier, modulating."},{"definition":"The variation and regulation of a population, physiological response, etc."},{"definition":"A change in key."}],"partOfSpeech":"n"}]},{"word":"STATUES","idx":14269,"count":2837498,"meanings":[{"definitions":[{"definition":"A three-dimensional work of art, usually representing a person or animal, usually created by sculpting, carving, molding, or casting."},{"definition":"A portrait."},{"definition":"A children's game in which the players have to stand still without moving."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"statues-us"}]},{"word":"DEPTHS","idx":14270,"count":2836629,"meanings":[{"definitions":[{"definition":"The vertical distance below a surface; the degree to which something is deep","example":"Measure the depth of the water in this part of the bay."},{"definition":"The distance between the front and the back, as the depth of a drawer or closet"},{"definition":"The intensity, complexity, strength, seriousness or importance of an emotion, situation, etc.","example":"The depth of her misery was apparent to everyone."},{"definition":"Lowness","example":"the depth of a sound"},{"definition":"(colors) the total palette of available colors"},{"definition":"The property of appearing three-dimensional","example":"The depth of field in this picture is amazing."},{"definition":"(usually in the plural) the deepest part (usually of a body of water)","example":"The burning ship finally sunk into the depths."},{"definition":"(usually in the plural) a very remote part.","example":"In the depths of the night,"},{"definition":"The most severe part","example":"in the depth of the crisis"},{"definition":"The number of simple elements which an abstract conception or notion includes; the comprehension or content"},{"definition":"A pair of toothed wheels which work together"},{"definition":"The perpendicular distance from the chord to the farthest point of an arched surface"},{"definition":"The lower of the two ranks of a value in an ordered set of values"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"depths-us","text":"/dɛpθs/"}]},{"word":"SPICES","idx":14271,"count":2836609,"meanings":[{"definitions":[{"definition":"Aromatic or pungent plant matter (usually dried) used to season or flavour food."},{"definition":"Appeal, interest; an attribute that makes something appealing, interesting, or engaging."},{"definition":"A synthetic cannabinoid drug."},{"definition":"Sweets, candy."},{"definition":"Species; kind."},{"definition":"A characteristic touch or taste; smack; flavour."},{"definition":"An aromatic odour."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add spice or spices to; season."},{"definition":"To spice up."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈspaɪsɪz/"}]},{"word":"COMMUNION","idx":14272,"count":2836584,"meanings":[{"definitions":[{"definition":"A joining together of minds or spirits."},{"definition":"Holy Communion"},{"definition":"A form of ecclesiastical unity between the Roman Church and another, so that the latter is considered part of the former."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kəˈmjuːnjən/"}]},{"word":"LOADER","idx":14273,"count":2836507,"meanings":[{"definitions":[{"definition":"Agent noun of load; a person or device that loads.","example":"The auto-loader on the gun kept jamming so they did it manually."},{"definition":"A program that prepares other programs for execution."},{"definition":"A tractor with a scoop, for example: bucket loader, front-end loader, wheel loader, etc."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈloʊdɚ/"}]},{"word":"UNCERTAINTIES","idx":14274,"count":2835124,"meanings":[{"definitions":[{"definition":"Doubt; the condition of being uncertain or without conviction."},{"definition":"Something uncertain or ambiguous."},{"definition":"A parameter that measures the dispersion of a range of measured values."}],"partOfSpeech":"n"}]},{"word":"COLONIES","idx":14275,"count":2835074,"meanings":[{"definitions":[{"definition":"A governmental unit created on land of another country owned by colonists from a country."},{"definition":"A settlement of emigrants who move to a new place, but remain culturally tied to their place of origin"},{"definition":"Region or governmental unit created by another country and generally ruled by another country.","example":"Bermuda is a crown colony of Great Britain."},{"definition":"An apartment complex or neighborhood.","example":"Our colony is quite small, but each apartment is large."},{"definition":"A group of people with the same interests or ethnic origin concentrated in a particular geographic area","example":"The Amana Colonies in Iowa were settled by people from Germany."},{"definition":"A group of organisms of same or different species living together in close association.","example":"a colony of specialized polyps and medusoids"},{"definition":"A local group of Beaver Scouts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"colonies-us"}]},{"word":"FOLLOWERS","idx":14276,"count":2834316,"meanings":[{"definitions":[{"definition":"One who follows, comes after another."},{"definition":"Something that comes after another thing."},{"definition":"One who is a part of master's physical group, such as a servant or retainer."},{"definition":"One who follows mentally, adherer to the opinions, ideas or teachings of another, a movement etc."},{"definition":"An imitator, who follows another's example."},{"definition":"A pursuer."},{"definition":"An account holder who subscribes to see content from another account on a social media platform.","example":"I have over 50 followers on Twitter, but all my tweets only get 10 likes."},{"definition":"A machine part receiving motion from another."},{"definition":"A man courting a maidservant."},{"definition":"Young cattle."},{"definition":"A metal piece placed at the top of a candle to keep the wax melting evenly."},{"definition":"Any of the three players (the ruckman, ruck rover, and rover) who usually follow the ball around the ground rather than occupying a fixed position."},{"definition":"A debt collector."}],"partOfSpeech":"n"}]},{"word":"LATENCY","idx":14278,"count":2833462,"meanings":[{"definitions":[{"definition":"The state of being latent."},{"definition":"A delay, a period between the initiation of something and the occurrence."},{"definition":"The delay between a stimulus and the response it triggers in an organism."},{"definition":"A stage in Sigmund Freud's psychoanalytic theory of the psychosexual development of children where children become asexual until their sexual desires come back at puberty."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈleɪ.tən.si/"}]},{"word":"THEMED","idx":14279,"count":2833049,"meanings":[{"definitions":[{"definition":"To give a theme to.","example":"We themed the birthday party around superheroes."},{"definition":"To apply a theme to; to change the visual appearance and/or layout of (software)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(often in combination) Having a particular theme or topic"}],"partOfSpeech":"j"}]},{"word":"MESSY","idx":14280,"count":2833021,"meanings":[{"definitions":[{"definition":"(of a place, situation, person, etc) In a disorderly state; chaotic; disorderly.","example":"Jim ran his fingers through his messy brown hair."},{"definition":"(of a person) Prone to causing mess.","example":"He is the messiest person I've ever met."},{"definition":"(of a situation) Difficult or unpleasant to deal with.","example":"a messy divorce"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmɛsi/"}]},{"word":"SQUADRON","idx":14281,"count":2833002,"meanings":[{"definitions":[{"definition":"Primarily, a square; hence, a square body of troops; a body of troops drawn up in a square."},{"definition":"A body of cavalry comprising two companies or troops, averaging from one hundred and twenty to two hundred soldiers."},{"definition":"A body of infantrymen made up of several platoons, averaging from eighty to one hundred and fifty men, and led by a captain or a major."},{"definition":"A detachment of vessels employed on any particular service or station, under the command of the senior officer","example":"the North Atlantic Squadron"},{"definition":"(air force) A tactical air force unit; consists of at least two flights; multiple squadrons make up a group or wing (depending on particular air force)."},{"definition":"(U.S. Space Force) A spaceforce unit; multiple squadrons make up an operations delta or a support garrison."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"squadron-us"},{"text":"/ˈskwɒd.ɹən/"}]},{"word":"RUPEE","idx":14284,"count":2831536,"meanings":[{"definitions":[{"definition":"The common name for the monetary currencies used in modern India, Mauritius, Nepal, Pakistan, the Seychelles, or Sri Lanka, often abbreviated ₨."},{"definition":"A silver coin circulating in India between the 16th and 20th centuries, weighing one tola (formerly 170–180 troy grains; from 1833, 180 troy grains)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹuˈpi/"},{"text":"/ɹʊ-/"},{"audio":"rupee-au"}]},{"word":"SUBSIDY","idx":14286,"count":2830929,"meanings":[{"definitions":[{"definition":"Financial support or assistance, such as a grant.","example":"Manufacturing firms are supported by government subsidies in some countries."},{"definition":"Money granted by parliament to the British Crown."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsʌbsɨdi/"}]},{"word":"DEMOLITION","idx":14287,"count":2830701,"meanings":[{"definitions":[{"definition":"The process of demolishing or destroying buildings or other structures."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdɛm.əˈlɪʃən/"}]},{"word":"EMPOWERMENT","idx":14289,"count":2829471,"meanings":[{"definitions":[{"definition":"The achievement of political, social or economic power by an individual or group."},{"definition":"The process of supporting another person or persons to discover and claim personal power."},{"definition":"The state of being empowered (either generally, or specifically)."},{"definition":"Government programs encouraging advancement of blacks."}],"partOfSpeech":"n"}]},{"word":"FELONY","idx":14290,"count":2828329,"meanings":[{"definitions":[{"definition":"A serious criminal offense, which, under United States federal law, is punishable by imprisonment for a term exceeding one year or by death."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɛ.lə.ni/"}]},{"word":"LUNGS","idx":14291,"count":2828099,"meanings":[{"definitions":[{"definition":"A biological organ of vertebrates that controls breathing and oxygenates the blood."},{"definition":"(plural) Capacity for exercise or exertion; breath.","example":"He hasn't the lungs to play long rallies like he use to."},{"definition":"That which supplies oxygen or fresh air, such as trees, parklands, forest, etc., to a place."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lungs-us","text":"/lʌŋz/"}]},{"word":"MONUMENTS","idx":14292,"count":2827606,"meanings":[{"definitions":[{"definition":"A structure built for commemorative or symbolic reasons, or as a memorial; a commemoration.","example":"There is a monument on the town green to the soldiers who died in World War I."},{"definition":"An important site owned by the community as a whole."},{"definition":"An exceptional or proud achievement."},{"definition":"An important burial vault or tomb."},{"definition":"A legal document."},{"definition":"A surveying reference point marked by a permanently fixed marker (a survey monument)."},{"definition":"A pile of stones left by a prospector to claim ownership of ore etc. found in a mine."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmɑnjəmənts/"},{"text":"/ˈmɒnjʊmənts/"}]},{"word":"VERONICA","idx":14293,"count":2827245,"meanings":[{"definitions":[{"definition":"The image of Jesus's face believed to have been made on the cloth with which St Veronica wiped his face as he went to be crucified; or the cloth used for this."},{"definition":"A circular swinging movement of the cape, used to avoid the bull."},{"definition":"A flower of the genus Veronica, usually having blue petals."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To draw a muleta over and away from a bull's face in bullfighting."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/vəˈɹɒnɪkə/"},{"audio":"veronica-au"}]},{"word":"FILTERED","idx":14294,"count":2826739,"meanings":[{"definitions":[{"definition":"To sort, sift, or isolate.","example":"This strainer should filter out the large particles."},{"definition":"To diffuse; to cause to be less concentrated or focused.","example":"The leaves of the trees filtered the light."},{"definition":"To pass through a filter or to act as though passing through a filter.","example":"The water filtered through the rock and soil."},{"definition":"To move slowly or gradually; to come or go a few at a time.","example":"The crowd filtered into the theater."},{"definition":"To ride a motorcycle between lanes on a road","example":"I can skip past all the traffic on my bike by filtering."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"With a filter (e.g., a cigarette)."},{"definition":"Having been filtered (e.g., coffee grounds)."}],"partOfSpeech":"j"}]},{"word":"REPLACEMENTS","idx":14295,"count":2826285,"meanings":[{"definitions":[{"definition":"A person or thing that takes the place of another; a substitute."},{"definition":"The act of replacing something.","example":"The replacement of that broken light-bulb will have to wait until I can buy a new one."},{"definition":"The removal of an edge of crystal, by one plane or more."}],"partOfSpeech":"n"}]},{"word":"GROWERS","idx":14296,"count":2826087,"meanings":[{"definitions":[{"definition":"A farmer; one who grows things.","example":"He was an orange grower from Florida."},{"definition":"Something that grows.","example":"These flowers are fast growers"},{"definition":"Someone or something who becomes more likeable over time","example":"I didn't like the song at first, but it is a real grower."},{"definition":"A man whose penis does not show its full size until it is erect."}],"partOfSpeech":"n"}]},{"word":"SUBTITLES","idx":14298,"count":2825488,"meanings":[{"definitions":[{"definition":"(authorship) A heading below or after a title."},{"definition":"Textual versions of the dialog in films, usually displayed at the bottom of the screen."}],"partOfSpeech":"n"}]},{"word":"ADJ","idx":14299,"count":2825380,"meanings":[{"definitions":[{"definition":"(grammar) A word that modifies a noun or describes a noun’s referent.","example":"The words “big” and “heavy” are English adjectives."},{"definition":"A dependent; an accessory."},{"definition":"An appendage; something attached to something else in a subordinate capacity."},{"definition":"A person associated with another, usually in a subordinate position; a colleague."},{"definition":"An unmalted grain or grain product that supplements the main mash ingredient."},{"definition":"A quality or property of the body or mind, whether natural or acquired, such as colour in the body or judgement in the mind."},{"definition":"A key or scale closely related to another as principal; a relative or attendant key."},{"definition":"(grammar) A dispensable phrase in a clause or sentence that amplifies its meaning, such as \"for a while\" in \"I typed for a while\"."},{"definition":"(X-bar theory) A constituent which is both the daughter and the sister of an X-bar."},{"definition":"Symploce."},{"definition":"One of a pair of morphisms which relate to each other through a pair of adjoint functors."},{"definition":"The action of adjusting something"},{"definition":"The result of adjusting something; a small change; a minor correction; a modification or alteration"},{"definition":"The settling or balancing of a financial account","example":"The credit card company made an adjustment to my account to waive the late fee."},{"definition":"The behavioural process of balancing conflicting needs, or needs against obstacles in the environment.","example":"When Jim graduated, he found adjustment to the working world difficult."},{"definition":"The assessment, by an insurance company, of a claim; the settlement of such a claim"}],"partOfSpeech":"n"}]},{"word":"HAUL","idx":14301,"count":2825285,"meanings":[{"definitions":[{"definition":"An act of hauling or pulling, particularly with force; a (violent) pull or tug."},{"definition":"The distance over which something is hauled or transported, especially if long.","example":"Getting to his place was a real haul."},{"definition":"An amount of something that has been taken, especially of fish, illegal loot, or items purchased on a shopping trip.","example":"The robber’s haul was over thirty items."},{"definition":"Short for haul video."},{"definition":"(ropemaking) A bundle of many threads to be tarred."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transport by drawing or pulling, as with horses or oxen, or a motor vehicle.","example":"to haul logs to a sawmill"},{"definition":"To draw or pull something heavy."},{"definition":"To carry or transport something, with a connotation that the item is heavy or otherwise difficult to move."},{"definition":"To drag, to pull, to tug."},{"definition":"Followed by up: to summon to be disciplined or held answerable for something."},{"definition":"To pull apart, as oxen sometimes do when yoked."},{"definition":"To steer (a vessel) closer to the wind."},{"definition":"Of the wind: to shift fore (more towards the bow)."},{"definition":"To haul ass.","example":"“How fast was he goin’?” / “I don’t know exactly, but he must’ve been haulin’, given where he landed.”"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hɔl/"},{"text":"/hɔːl/"},{"audio":"haul-au"}]},{"word":"ACUPUNCTURE","idx":14302,"count":2825171,"meanings":[{"definitions":[{"definition":"The insertion of needles into the (living) tissue of the body, especially for purposes of pain relief."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat with acupuncture."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"acupuncture-us","text":"/ˈæ.kju.ˌpʌŋk.t͡ʃɝ/"}]},{"word":"WORKLOAD","idx":14303,"count":2824856,"meanings":[{"definitions":[{"definition":"The amount of work assigned to a particular worker, normally in a specified time period"},{"definition":"The amount of work that a machine can handle or produce"}],"partOfSpeech":"n"}]},{"word":"ACKNOWLEDGEMENT","idx":14304,"count":2823891,"meanings":[{"definitions":[{"definition":"The act of acknowledging"},{"definition":"The act of recognizing in a particular character or relationship; recognition of existence, authority, truth, or genuineness."},{"definition":"A reward or other expression or token of gratitude."},{"definition":"An expression of gratitude for a benefit or an obligation.","example":"the acknowledgment of a favor"},{"definition":"A message from the addressee informing the originator that the originator's communication has been received and understood.","example":"the acknowledgment of a wedding invitation"},{"definition":"A response (ACK) sent by a receiver to indicate successful receipt of a transmission (See Wikipedia article on transmission)."},{"definition":"A recognition as genuine or valid; an avowing or admission in legal form.","example":"acknowledgment of a deed"},{"definition":"The act of a person admitting a child as their own."},{"definition":"A formal statement or document recognizing the fulfillment or execution of a legal requirement or procedure."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"acknowledgement-us"}]},{"word":"HIGHLIGHTING","idx":14305,"count":2823564,"meanings":[{"definitions":[{"definition":"To make prominent; emphasize."},{"definition":"To be a highlight of."},{"definition":"To mark (important passages of text), e.g. with a fluorescent marker pen or in a wordprocessor, as a means of memory retention or for later reference."},{"definition":"To dye (part of the hair) a different color than the rest."},{"definition":"To seek the attention of (a user) on IRC by mentioning their name in a message, causing that message to appear highlighted on their screen."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The visual emphasis of text by means of a highlight."},{"definition":"An area of the skin or hair containing highlights."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing emphasis, drawing attention; revealing.","example":"The most highlighting part of the case study is research, collection and analysis of data."}],"partOfSpeech":"j"}]},{"word":"DULY","idx":14306,"count":2823211,"meanings":[{"definitions":[{"definition":"In a due, fit, or becoming manner; as it ought to be; properly.","example":"The citizen's concern was duly noted in the meeting minutes."},{"definition":"Regularly; at the proper time."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"duly-us","text":"/ˈduli/"}]},{"word":"ROASTED","idx":14307,"count":2822882,"meanings":[{"definitions":[{"definition":"To cook food by heating in an oven or over a fire without covering, resulting in a crisp, possibly even slightly charred appearance.","example":"to roast meat on a spit"},{"definition":"To cook by surrounding with hot embers, ashes, sand, etc.","example":"to roast a potato in ashes"},{"definition":"To process by drying through exposure to sun or artificial heat","example":"Coffee beans need roasting before use."},{"definition":"To heat to excess; to heat violently; to burn."},{"definition":"To admonish someone vigorously","example":"I’m late home for the fourth time this week; my mate will really roast me this time."},{"definition":"To subject to bantering, severely criticize, sometimes as a comedy routine.","example":"The class clown enjoys being roasted by mates as well as staff."},{"definition":"To dissipate by heat the volatile parts of, as ores."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Cooked by roasting."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"roasted-us","text":"/ˈɹoʊstɪd/"}]},{"word":"TENDERS","idx":14308,"count":2822708,"meanings":[{"definitions":[{"definition":"Care, kind concern, regard."},{"definition":"The inner flight muscle (pectoralis minor) of poultry."},{"definition":"Someone who tends or waits on someone."},{"definition":"A railroad car towed behind a steam engine to carry fuel and water."},{"definition":"A naval ship that functions as a mobile base for other ships.","example":"destroyer tender"},{"definition":"A smaller boat used for transportation between a large ship and the shore."},{"definition":"Anything which is offered, proffered, put forth or bid with the expectation of a response, answer, or reply.","example":"You offer me the sword of my father, the very man whose bones, because of your perfidy, lie under the sod of Crecy. Aye, I'll surely take it, and just as surely you shall die with your tender through your heart!"},{"definition":"A means of payment such as a check or cheque, cash or credit card.","example":"Your credit card has been declined so you need to provide some other tender such as cash."},{"definition":"A formal offer to buy or sell something.","example":"We will submit our tender to you within the week."},{"definition":"Any offer or proposal made for acceptance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make tender or delicate; to weaken."},{"definition":"To feel tenderly towards; to regard fondly or with consideration."},{"definition":"To work on a tender."},{"definition":"To offer, to give.","example":"to tender one’s resignation"},{"definition":"To offer a payment, as at sales or auctions."}],"partOfSpeech":"ve"}]},{"word":"INVITING","idx":14309,"count":2822014,"meanings":[{"definitions":[{"definition":"To ask for the presence or participation of someone or something.","example":"We invited our friends round for dinner."},{"definition":"To request formally.","example":"I invite you all to be seated."},{"definition":"To encourage.","example":"I always invite criticism of my definitions."},{"definition":"To allure; to draw to; to tempt to come; to induce by pleasure or hope; to attract."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Invitation"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Alluring; tempting; attractive."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈvaɪtɪŋ/"}]},{"word":"RIG","idx":14310,"count":2821809,"meanings":[{"definitions":[{"definition":"The rigging of a sailing ship or other such craft."},{"definition":"Special equipment or gear used for a particular purpose.","example":"The climbers each had a different rig for climbing that particular rockface."},{"definition":"A large truck such as a semi-tractor.","example":"Every rig at the truckstop had custom-made mud-flaps."},{"definition":"The special apparatus used for drilling wells."},{"definition":"A costume or an outfit.","example":"My sister and I always made our own rigs for Halloween."},{"definition":"A computer case, often modified for looks."},{"definition":"An imperfectly castrated horse, sheep etc."},{"definition":"Radio equipment, especially a citizen's band transceiver."},{"definition":"A model outfitted with parameterized controls for animation."},{"definition":"A ridge."},{"definition":"A wanton; one given to unbecoming conduct."},{"definition":"A promiscuous woman."},{"definition":"A sportive or unbecoming trick; a frolic."},{"definition":"A blast of wind."},{"definition":"An algebraic structure similar to a ring, but without the requirement that every element have an additive inverse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fit out with a harness or other equipment."},{"definition":"To equip and fit (a ship) with sails, shrouds, and yards."},{"definition":"To dress or clothe in some costume."},{"definition":"To make or construct something in haste or in a makeshift manner.","example":"rig up a makeshift shelter"},{"definition":"To manipulate something dishonestly for personal gain or discriminatory purposes.","example":"to rig an election"},{"definition":"To make free with; hence, to steal; to pilfer."},{"definition":"To outfit a model with controls for animation."},{"definition":"To play the wanton; to act in an unbecoming manner; to play tricks."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rig-au","text":"/ɹɪɡ/"}]},{"word":"GRASSROOTS","idx":14312,"count":2821246,"meanings":[{"definitions":[{"definition":"Of, or relating to people or society at the local level, particularly in politics, social movements, etc.; of the grass roots."}],"partOfSpeech":"j"}]},{"word":"MICK","idx":14313,"count":2821071,"meanings":[{"definitions":[{"definition":"An Irishman"},{"definition":"A Catholic, particularly of Irish descent."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Easy.","example":"Geology is so mick - half the jocks are in it."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mick-au","text":"/mɪk/"}]},{"word":"REDEVELOPMENT","idx":14315,"count":2820529,"meanings":[{"definitions":[{"definition":"The process of developing something anew.","example":"the redevelopment of the hero's character in a comic book"},{"definition":"The demolition of old, redundant or unfashionable buildings or infrastructure and the construction of new ones on the same site."}],"partOfSpeech":"n"}]},{"word":"MUSTARD","idx":14316,"count":2820441,"meanings":[{"definitions":[{"definition":"A plant of certain species of the genus Brassica, or of related genera (especially Sinapis alba, in the family Brassicaceae, with yellow flowers, and linear seed pods)."},{"definition":"Powder or paste made from seeds of the mustard plant, and used as a condiment or a spice.","example":"When the waitress brought the food, I asked whether she had any Dijon mustard."},{"definition":"The leaves of the mustard plant, used as a salad.","example":"Mustard and cress sandwiches."},{"definition":"Dark yellow colour, the colour of mustard."},{"definition":"The tomalley of a crab, which resembles the condiment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a dark yellow colour."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mustard-us","text":"[ˈmʌs.tɚd]"},{"audio":"mustard-uk","text":"[ˈmɐs.təd]"}]},{"word":"STRAIT","idx":14317,"count":2820437,"meanings":[{"definitions":[{"definition":"A narrow channel of water connecting two larger bodies of water.","example":"The Strait of Gibraltar"},{"definition":"A narrow pass, passage or street."},{"definition":"A neck of land; an isthmus."},{"definition":"(often in the plural) A difficult position.","example":"to be in dire straits"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To confine; put to difficulties."},{"definition":"To tighten."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Narrow; restricted as to space or room; close."},{"definition":"Righteous, strict.","example":"to follow the strait and narrow"},{"definition":"Tight; close; tight-fitting."},{"definition":"Close; intimate; near; familiar."},{"definition":"Difficult; distressful."},{"definition":"Parsimonious; stingy; mean."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Strictly; rigorously."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"strait-us","text":"/stɹeɪt/"}]},{"word":"MASTERPIECE","idx":14318,"count":2820342,"meanings":[{"definitions":[{"definition":"A piece of work that has been given much critical praise, especially one that is considered the greatest work of a person's career."},{"definition":"A work of outstanding creativity, skill or workmanship.","example":"Masterpieces are not completed, they are abandoned."},{"definition":"A work created in order to qualify as a master craftsman and member of a guild."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"masterpiece-us","text":"/ˈmæstɚˌpis/"}]},{"word":"OBEY","idx":14319,"count":2820117,"meanings":[{"definitions":[{"definition":"To do as ordered by (a person, institution etc), to act according to the bidding of."},{"definition":"To do as one is told."},{"definition":"To be obedient, compliant (to a given law, restriction etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"obey-us","text":"/oʊˈbeɪ/"}]},{"word":"CELLPHONE","idx":14320,"count":2819831,"meanings":[{"definitions":[{"definition":"A portable, wireless telephone, which changes antenna connections seamlessly during travel from one radio reception cell to another without losing the party-to-party call connection."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a call on a cellphone."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsɛlfoʊn/"},{"text":"/ˈsɛlfəʊn/"}]},{"word":"DONKEY","idx":14321,"count":2819753,"meanings":[{"definitions":[{"definition":"A domestic animal, Equus asinus asinus, similar to a horse"},{"definition":"A stubborn person"},{"definition":"A fool"},{"definition":"A small auxiliary engine"},{"definition":"A bad poker player"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"donkey-us","text":"/ˈdɑŋki/"}]},{"word":"SAX","idx":14322,"count":2819089,"meanings":[{"definitions":[{"definition":"A slate-cutter's hammer; slate-ax."},{"definition":"A knife or sword; a dagger about 50 cm (20 inches) in length."},{"definition":"A single-reed instrument musical instrument of the woodwind family, usually made of brass and with a distinctive loop bringing the bell upwards."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut or slash with a sharp instrument; incise; scarify."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sax-uk","text":"/sæks/"}]},{"word":"JACKS","idx":14323,"count":2818856,"meanings":[{"definitions":[{"definition":"A coarse mediaeval coat of defence, especially one made of leather."},{"definition":"A man."},{"definition":"A device or utensil."},{"definition":"A non-tool object or thing."},{"definition":"A plant or animal."},{"definition":"The edible fruit of the Asian tree (Artocarpus heterophyllus); also the tree itself."},{"definition":"A home run."},{"definition":"(games) A children's game involving picking up objects; knucklebones; jackstones."},{"definition":"Alternative form of jakes: an outhouse or lavatory."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"jacks-au","text":"/dʒæks/"}]},{"word":"CONCEIVED","idx":14324,"count":2818126,"meanings":[{"definitions":[{"definition":"To develop an idea; to form in the mind; to plan; to devise; to originate."},{"definition":"To understand (someone)."},{"definition":"To become pregnant (with).","example":"Assisted procreation can help those trying to conceive."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"conceived-us","text":"/kənˈsiːvd/"}]},{"word":"TRIGGERED","idx":14325,"count":2818102,"meanings":[{"definitions":[{"definition":"To fire a weapon."},{"definition":"To initiate something.","example":"The controversial article triggered a deluge of angry letters from readers."},{"definition":"To spark a response, especially a negative emotional response, in (someone).","example":"This story contains a rape scene and may be triggering for rape victims."},{"definition":"To activate; to become active."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a trigger that reacts to some specific condition.","example":"a motion-triggered alarm"}],"partOfSpeech":"j"}]},{"word":"BOASTS","idx":14326,"count":2817353,"meanings":[{"definitions":[{"definition":"A brag; ostentatious positive appraisal of oneself."},{"definition":"Something that one brags about.","example":"It was his regular boast that he could eat two full English breakfasts in one sitting."},{"definition":"A shot where the ball is driven off a side wall and then strikes the front wall."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To brag; to talk loudly in praise of oneself."},{"definition":"To speak of with pride, vanity, or exultation, with a view to self-commendation; to extol."},{"definition":"To speak in exulting language of another; to glory; to exult."},{"definition":"To play a boast shot."},{"definition":"To possess something special.","example":"His family boasted a famous name."},{"definition":"To dress, as a stone, with a broad chisel."},{"definition":"(sculpting) To shape roughly as a preparation for the finer work to follow; to cut to the general form required."}],"partOfSpeech":"ve"}]},{"word":"PRAYING","idx":14327,"count":2816625,"meanings":[{"definitions":[{"definition":"To direct words and/or thoughts to God or any higher being, for the sake of adoration, thanks, petition for help, etc.","example":"Muslims pray in the direction of Mecca."},{"definition":"To humbly beg a person for aid or their time."},{"definition":"To ask earnestly for; to seek to obtain by supplication; to entreat for."},{"definition":"To implore, to entreat, to request."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of saying a prayer."}],"partOfSpeech":"n"}]},{"word":"OSS","idx":14328,"count":2816145,"meanings":[{"definitions":[{"definition":"(representing dialect pronunciation) Horse."}],"partOfSpeech":"n"}]},{"word":"MULTIPLY","idx":14329,"count":2815756,"meanings":[{"definitions":[{"definition":"An act or instance of multiplying."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To increase the amount, degree or number of (something)."},{"definition":"(with by) To perform multiplication on (a number).","example":"when you multiply 3 by 7, you get 21;  he multiplied several numbers"},{"definition":"To grow in number."},{"definition":"To breed or propagate."},{"definition":"To perform multiplication.","example":"He had been multiplying, but it occurred to him he needed to resolve the exponents, first."},{"definition":"To be a factor in a multiplication with (another factor)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In many or multiple ways."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"multiply-1-uk","text":"/ˈmʌltɪplaɪ/"}]},{"word":"INTERCOURSE","idx":14330,"count":2815487,"meanings":[{"definitions":[{"definition":"Communication, conversation."},{"definition":"Dealings between countries."},{"definition":"Dealings with people, including commerce and trade."},{"definition":"Sexual intercourse usually involving humans."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have sexual intercourse."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"intercourse-us","text":"/ˈɪn.tɚˌkoɹs/"}]},{"word":"RADIAL","idx":14332,"count":2815296,"meanings":[{"definitions":[{"definition":"A radial tire / radial tyre."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Arranged like rays that radiate from, or converge to a common centre."},{"definition":"Moving along a radius."},{"definition":"Of, or relating to the radius bone."},{"definition":"Of, or relating to the radius (vein), and/or the wing areas next to it."},{"definition":"Developing uniformly on all sides."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹeɪdi.əl/"}]},{"word":"MARE","idx":14333,"count":2814699,"meanings":[{"definitions":[{"definition":"An adult female horse."},{"definition":"A foolish woman."},{"definition":"A type of evil spirit formerly thought to sit on the chest of a sleeping person; also, the feeling of suffocation felt during sleep, attributed to such a spirit."},{"definition":"A demon or monster, thought to plague people while they slept and cause a feeling of suffocation and terror during sleep."},{"definition":"Sleep paralysis."},{"definition":"A very bad or frightening dream.","example":"I had a nightmare that I tried to run but could neither move nor breathe."},{"definition":"Any bad, miserable, difficult or terrifying situation or experience that arouses anxiety, terror, agony or great displeasure.","example":"Cleaning up after identity theft can be a nightmare of phone calls and letters."},{"definition":"A large, dark plain, which may have the appearance of a sea."},{"definition":"On Saturn's moon Titan, a large expanse of what is thought to be liquid hydrocarbons."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mare-1-us","text":"/mɛəɹ/"}]},{"word":"ROUTINELY","idx":14334,"count":2814368,"meanings":[{"definitions":[{"definition":"In a routine manner, in a way that has become common or expected."},{"definition":"Done by rote or habit, as part of a routine, without attention or concern.","example":"We routinely test the fire extinguishers but no one ever expects them to fail."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɹuːˈtiːnli/"}]},{"word":"INSTRUCTED","idx":14335,"count":2814313,"meanings":[{"definitions":[{"definition":"To teach by giving instructions.","example":"Listen carefully when someone instructs you how to assemble the furniture."},{"definition":"To tell (someone) what they must or should do.","example":"The doctor instructed me to keep my arm immobilised and begin physiotherapy."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"instructed-us","text":"/ɪnˈstɹʌktɪd/"}]},{"word":"STOLE","idx":14336,"count":2814273,"meanings":[{"definitions":[{"definition":"To take illegally, or without the owner's permission, something owned by someone else.","example":"Three irreplaceable paintings were stolen from the gallery."},{"definition":"(of ideas, words, music, a look, credit, etc.) To appropriate without giving credit or acknowledgement.","example":"They stole my idea for a biodegradable, disposable garbage de-odorizer."},{"definition":"To get or effect surreptitiously or artfully.","example":"He stole glances at the pretty woman across the street."},{"definition":"To acquire at a low price.","example":"He stole the car for two thousand less than its book value."},{"definition":"To draw attention unexpectedly in (an entertainment), especially by being the outstanding performer. Usually used in the phrase steal the show."},{"definition":"To move silently or secretly.","example":"He stole across the room, trying not to wake her."},{"definition":"To convey (something) clandestinely."},{"definition":"To withdraw or convey (oneself) clandestinely."},{"definition":"To advance safely to (another base) during the delivery of a pitch, without the aid of a hit, walk, passed ball, wild pitch, or defensive indifference."},{"definition":"To dispossess"},{"definition":"To borrow for a short moment.","example":"Can I steal your pen?"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An ecclesiastical garment consisting of a decorated band worn on the back of the neck with each end hanging over the chest."},{"definition":"A scarf-like garment, often made of fur."},{"definition":"A stolon."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"stole-us","text":"/ˈstoʊl/"}]},{"word":"ARMOUR","idx":14338,"count":2813708,"meanings":[{"definitions":[{"definition":"A protective layer over a body, vehicle, or other object intended to deflect or diffuse damaging forces."},{"definition":"A natural form of this kind of protection on an animal's body."},{"definition":"Metal plate, protecting a ship, military vehicle, or aircraft."},{"definition":"A tank, or other heavy mobile assault vehicle."},{"definition":"A military formation consisting primarily of tanks or other armoured fighting vehicles, collectively."},{"definition":"The naturally occurring surface of pebbles, rocks or boulders that line the bed of a waterway or beach and provide protection against erosion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To equip something with armour or a protective coating or hardening."},{"definition":"To provide something with an analogous form of protection."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"armour-us","text":"/ˈɑːɹ.mɚ/"}]},{"word":"SUMMARIZED","idx":14339,"count":2813586,"meanings":[{"definitions":[{"definition":"To prepare a summary of (something).","example":"Jim was asked to summarize the document by Wednesday."},{"definition":"To give a recapitulation of the salient facts; to recapitulate or review.","example":"After the meeting, Jim summarized the major decisions made."}],"partOfSpeech":"ve"}]},{"word":"AVALANCHE","idx":14340,"count":2813307,"meanings":[{"definitions":[{"definition":"A large mass or body of snow and ice sliding swiftly down a mountain side, or falling down a precipice."},{"definition":"A fall of earth, rocks, etc., similar to that of an avalanche of snow or ice."},{"definition":"(by extension) A sudden, great, or irresistible descent or influx; anything like an avalanche in suddenness and overwhelming quantity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To descend like an avalanche."},{"definition":"To come down upon; to overwhelm.","example":"The shelf broke and the boxes avalanched the workers."},{"definition":"To propel downward like an avalanche."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"avalanche-us","text":"/ˈævəlæntʃ/"}]},{"word":"UPLOADING","idx":14343,"count":2812451,"meanings":[{"definitions":[{"definition":"To transfer data to a computer on a network, especially to a server on the Internet.","example":"You will have to convert your photograph to a jpg format if you wish to upload it."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something is uploaded."}],"partOfSpeech":"n"}]},{"word":"MANUSCRIPTS","idx":14344,"count":2812288,"meanings":[{"definitions":[{"definition":"A book, composition or any other document, written by hand (or manually typewritten), not mechanically reproduced."},{"definition":"A single, original copy of a book, article, composition etc, written by hand or even printed, submitted as original for (copy-editing and) reproductive publication."}],"partOfSpeech":"n"}]},{"word":"MANAGERIAL","idx":14345,"count":2811433,"meanings":[{"definitions":[{"definition":"Of or relating to a manager or management; involving management-like duties."}],"partOfSpeech":"j"}]},{"word":"EXHIBITED","idx":14349,"count":2810420,"meanings":[{"definitions":[{"definition":"To display or show (something) for others to see, especially at an exhibition or contest.","example":"He wanted to exhibit his baseball cards."},{"definition":"To demonstrate.","example":"The players exhibited great skill."},{"definition":"To submit (a physical object) to a court as evidence.","example":"I now exhibit this bloody hammer."},{"definition":"To put on a public display.","example":"Will you be exhibiting this year?"},{"definition":"To administer as a remedy.","example":"to exhibit calomel"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"exhibited-us","text":"/ɪɡˈzɪbɪtɪd/"}]},{"word":"DISCIPLES","idx":14350,"count":2810173,"meanings":[{"definitions":[{"definition":"A person who learns from another, especially one who then teaches others."},{"definition":"An active follower or adherent of someone, or some philosophy etc."},{"definition":"A wretched, miserable-looking man."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"disciples-us","text":"/dɪˈsaɪpl̩z/"}]},{"word":"SHAVING","idx":14351,"count":2809902,"meanings":[{"definitions":[{"definition":"To make bald or shorter by using a tool such as a razor or pair of electric clippers to cut the hair close to the skin."},{"definition":"To cut anything in this fashion.","example":"The labourer with the bending scythe is seen / Shaving the surface of the waving green."},{"definition":"To remove hair from one's face by this means.","example":"I had little time to shave this morning."},{"definition":"To cut finely, as with slices of meat."},{"definition":"To skim along or near the surface of; to pass close to, or touch lightly, in passing."},{"definition":"To reduce in size or weight."},{"definition":"To be hard and severe in a bargain with; to practice extortion on; to cheat."},{"definition":"To buy (a note) at a discount greater than the legal rate of interest, or to deduct in discounting it more than the legal rate allows."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A thin, shaved off slice of wood, metal, or other material."},{"definition":"The action of having a shave."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈʃeɪvɪŋ/"}]},{"word":"BISHOPS","idx":14354,"count":2808778,"meanings":[{"definitions":[{"definition":"An overseer of congregations: either any such overseer, generally speaking, or (in Eastern Orthodoxy, Catholicism, Anglicanism, etc.) an official in the church hierarchy (actively or nominally) governing a diocese, supervising the church's priests, deacons, and property in its territory."},{"definition":"The holder of the Greek or Roman position of episcopus, supervisor over the public dole of grain, etc."},{"definition":"Any watchman, inspector, or overlooker."},{"definition":"A chief of the Festival of Fools or St. Nicholas Day."},{"definition":"The chess piece denoted ♗ or ♝ which moves along diagonal lines and developed from the shatranj alfil (\"elephant\") and was originally known as the aufil or archer in English."},{"definition":"Any of various African birds of the genus Euplectes; a kind of weaverbird closely related to the widowbirds."},{"definition":"A ladybug or ladybird, beetles of the family Coccinellidae."},{"definition":"A sweet drink made from wine, usually with oranges, lemons, and sugar; mulled and spiced port."},{"definition":"A bustle."},{"definition":"A children's smock or pinafore."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a bishop, to perform the duties of a bishop, especially to confirm another's membership in the church."},{"definition":"To make a bishop."},{"definition":"To provide with bishops."},{"definition":"To permit food (especially milk) to burn while cooking (from bishops' role in the inquisition or as mentioned in the quotation below, of horses)."},{"definition":"(by extension, of horses) To make a horse seem younger, particularly by manipulation of its teeth."},{"definition":"To murder by drowning."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bishops-us","text":"/ˈbɪʃəps/"}]},{"word":"DESTROYING","idx":14356,"count":2808051,"meanings":[{"definitions":[{"definition":"To damage beyond use or repair.","example":"Hooligans destroy unprovoked."},{"definition":"To neutralize, undo a property or condition.","example":"Smoking destroys the natural subtlety of the palate."},{"definition":"To put down or euthanize.","example":"Destroying a rabid dog is required by law."},{"definition":"To severely disrupt the well-being of (a person); ruin.","example":"Her divorce destroyed her; she had a nervous breakdown and was severely depressed for more than a year."},{"definition":"To defeat soundly."},{"definition":"To remove data.","example":"The memory leak happened because we forgot to destroy the temporary lists."},{"definition":"To sing a song poorly."},{"definition":"(antiphrasis) To exhaust duly and thus recreate or build up.","example":"This exercise is going to destroy all parts of your shoulders."},{"definition":"To penetrate sexually in an aggressive way.","example":"She got destroyed by her lover on the carpet."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"destroying-us","text":"/dɪˈstɹɔɪ(j)ɪŋ/"}]},{"word":"HUMOROUS","idx":14357,"count":2807909,"meanings":[{"definitions":[{"definition":"Full of humor or arousing laughter; funny."},{"definition":"Showing humor; witty, jocular."},{"definition":"Damp or watery."},{"definition":"Dependent on or caused by one's humour or mood; capricious, whimsical."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈhjuːməɹɪs/"},{"text":"/ˈhjuːməɹəs/"}]},{"word":"TONNES","idx":14358,"count":2807733,"meanings":[{"definitions":[{"definition":"A metric unit of mass equal to 1000 kilograms. Symbol: t"},{"definition":"A score of 100."}],"partOfSpeech":"n"}]},{"word":"THUNDERBIRD","idx":14360,"count":2806892,"meanings":[{"definitions":[{"definition":"A mythological bird, often associated with stormy weather, especially in various indigenous North American mythologies."},{"definition":"An Australian insectivorous songbird (Pachycephala pectoralis, formerly Pachycephala gutturalis), whose male is conspicuously marked with black and yellow, and has a black crescent on the breast."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈθʌndɚ.bɝd/"},{"text":"/ˈθʌndə.bɜːd/"}]},{"word":"FAA","idx":14361,"count":2806551,"meanings":[{"definitions":[{"definition":"The letter ف in the Arabic script."}],"partOfSpeech":"n"}]},{"word":"CORONA","idx":14362,"count":2806095,"meanings":[{"definitions":[{"definition":"The luminous plasma atmosphere of the Sun or other star, extending millions of kilometres into space, most easily seen during a total solar eclipse."},{"definition":"A circle or set of circles visible around a bright celestial object, especially the Sun or the Moon, attributable to an optical phenomenon produced by the diffraction of its light by small water droplets or tiny ice crystals."},{"definition":"(by extension) Any luminous or crownlike ring around an object or person."},{"definition":"A luminous appearance caused by corona discharge, often seen as a bluish glow in the air adjacent to pointed metal conductors carrying high voltages."},{"definition":"The large, flat, projecting member of a cornice which crowns the entablature, situated above the bed moulding and below the cymatium."},{"definition":"A large, round pendent chandelier, with spikes around its upper rim to hold candles or lamps, usually hung from the roof of a church."},{"definition":"A crown or garland bestowed among the Romans as a reward for distinguished services."},{"definition":"Any appendage of an organism that resembles a crown or corona."},{"definition":"An upper or crownlike portion of certain parts of the body."},{"definition":"A manifestation of secondary syphilis, consisting of papular lesions along the hairline, often bordering the scalp in the manner of a crown."},{"definition":"An oval-shaped astrogeological feature, present on both the planet Venus and Uranus's moon Miranda, probably formed by upwellings of warm material below the surface."},{"definition":"A mineral zone, consisting of one or more minerals, which surrounds another mineral or lies at the interface of two minerals, typically in a radial arrangement; a reaction rim."},{"definition":"A coronavirus, especially SARS-CoV-2.","example":"The recent surge of deaths due to corona reveals the shortcomings of our current healthcare system."},{"definition":"A coronavirus disease, especially COVID-19.","example":"She caught corona last week."},{"definition":"A series of sonnets linked together in a particular manner."},{"definition":"A long, straight-sided cigar with a roundly blunt end."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To surround with a luminous or crownlike ring as if by the solar corona."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kəˈɹoʊnə/"},{"audio":"corona-uk"}]},{"word":"HEAP","idx":14363,"count":2806006,"meanings":[{"definitions":[{"definition":"A crowd; a throng; a multitude or great number of people."},{"definition":"A pile or mass; a collection of things laid in a body, or thrown together so as to form an elevation.","example":"a heap of earth or stones"},{"definition":"A great number or large quantity of things."},{"definition":"A data structure consisting of trees in which each node is greater than all its children."},{"definition":"Memory that is dynamically allocated.","example":"You should move these structures from the stack to the heap to avoid a potential stack overflow."},{"definition":"A dilapidated place or vehicle.","example":"My first car was an old heap."},{"definition":"A lot, a large amount","example":"Thanks a heap!"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pile in a heap.","example":"He heaped the laundry upon the bed and began folding."},{"definition":"To form or round into a heap, as in measuring."},{"definition":"To supply in great quantity.","example":"They heaped praise upon their newest hero."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(representing broken English stereotypically or comically attributed to Native Americans; may be offensive) Very."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"heap-us","text":"/hiːp/"}]},{"word":"INVESTIGATIVE","idx":14365,"count":2805050,"meanings":[{"definitions":[{"definition":"Of or pertaining to investigation"},{"definition":"Inquisitive; curious"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈvɛstɪɡeɪtɪv/"}]},{"word":"BYLAWS","idx":14367,"count":2804626,"meanings":[{"definitions":[{"definition":"A local custom or law of a settlement or district."},{"definition":"A rule made by a local authority to regulate its own affairs."},{"definition":"A law or rule governing the internal affairs of an organization (e.g., corporation or business)."}],"partOfSpeech":"n"}]},{"word":"ERECTION","idx":14368,"count":2804128,"meanings":[{"definitions":[{"definition":"The act of building or putting up or together of something."},{"definition":"Anything erected or built.","example":"The Empire State Building was once the world's tallest erection."},{"definition":"The physiological process by which erectile tissue, such as a penis or clitoris, becomes erect by being engorged with blood."},{"definition":"(of a penis or clitoris) The state or quality of being erect from engorgement with blood."},{"definition":"A penis or clitoris that is erect.","example":"He placed his newspaper on his lap to hide his erection."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"erection-us"},{"text":"/ɪˈɹɛkʃən/"}]},{"word":"QUASI","idx":14369,"count":2804115,"meanings":[{"definitions":[{"definition":"Resembling or having a likeness to something"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkwɑ.zaɪ/"},{"text":"/ˈkweɪ.zaɪ/"}]}]