[{"word":"DARTS","idx":16170,"count":2290842,"meanings":[{"definitions":[{"definition":"A pointed missile weapon, intended to be thrown by the hand, for example a short lance or javelin"},{"definition":"Any sharp-pointed missile weapon, such as an arrow."},{"definition":"(sometimes figurative) Anything resembling such a missile; something that pierces or wounds like such a weapon."},{"definition":"A small object with a pointed tip at one end and feathers at the other, which is thrown at a target in the game of darts."},{"definition":"A dart-shaped target towed behind an aircraft to train shooters."},{"definition":"A plan or scheme."},{"definition":"A sudden or fast movement."},{"definition":"A fold that is stitched on a garment."},{"definition":"A fish, the dace."},{"definition":"A cigarette."},{"definition":"(games) A game or sport in which darts are thrown at a board, and points are scored depending on where the darts land"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To throw with a sudden effort or thrust; to hurl or launch."},{"definition":"To send forth suddenly or rapidly; to emit; to shoot","example":"The sun darts forth his beams."},{"definition":"To shoot with a dart, especially a tranquilizer dart","example":"They had to dart the animal to get close enough to help"},{"definition":"To fly or pass swiftly, like a dart; to move rapidly in one direction; to shoot out quickly","example":"The flying man darted eastward."},{"definition":"To start and run with speed; to shoot rapidly along","example":"The deer darted from the thicket."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"darts-uk","text":"/ˈdɑːts/"}]},{"word":"SHIN","idx":16172,"count":2288964,"meanings":[{"definitions":[{"definition":"The front part of the leg below the knee; the front edge of the shin bone: Shinbone"},{"definition":"A fishplate for a railway."},{"definition":"The twenty-first letter of many Semitic alphabets/abjads (Phoenician, Aramaic, Hebrew, Syriac, Arabic and others): Shin (letter)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"(as \"shin up\") To climb a mast, tree, rope, or the like, by embracing it alternately with the arms and legs, without help of steps, spurs, or the like.","example":"to shin up a mast"},{"definition":"To strike with the shin."},{"definition":"To run about borrowing money hastily and temporarily, as when trying to make a payment."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"shin-us","text":"/ʃɪn/"}]},{"word":"INTRIGUING","idx":16173,"count":2288807,"meanings":[{"definitions":[{"definition":"To conceive or carry out a secret plan intended to harm; to form a plot or scheme."},{"definition":"To arouse the interest of; to fascinate."},{"definition":"To have clandestine or illicit intercourse."},{"definition":"To fill with artifice and duplicity; to complicate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An intrigue."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing a desire to know more; mysterious."},{"definition":"Having clandestine or illicit intercourse."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"intriguing-uk","text":"/ɪnˈtɹiːɡɪŋ/"}]},{"word":"KEYPAD","idx":16174,"count":2288563,"meanings":[{"definitions":[{"definition":"A small board with keys primarily used for tactile input into a machine.","example":"Many laptop computers have special function keys which turn part of the alphabetical keyboard into a numeric keypad."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkiːpæd/"}]},{"word":"FLAW","idx":16175,"count":2288130,"meanings":[{"definitions":[{"definition":"A flake, fragment, or shiver."},{"definition":"A thin cake, as of ice."},{"definition":"A crack or breach, a gap or fissure; a defect of continuity or cohesion.","example":"That vase has a flaw."},{"definition":"A defect, fault, or imperfection, especially one that is hidden."},{"definition":"A sudden burst or gust of wind of short duration; windflaw."},{"definition":"A storm of short duration."},{"definition":"A sudden burst of noise and disorder"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add a flaw to, to make imperfect or defective."},{"definition":"To become imperfect or defective; to crack or break."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"flaw-1-us","text":"/ˈflɔ/"}]},{"word":"TAILS","idx":16177,"count":2287798,"meanings":[{"definitions":[{"definition":"The caudal appendage of an animal that is attached to its posterior and near the anus.","example":"Most primates have a tail and fangs."},{"definition":"An object or part of an object resembling a tail in shape, such as the thongs on a cat-o'-nine-tails."},{"definition":"The back, last, lower, or inferior part of anything."},{"definition":"The feathers attached to the pygostyle of a bird."},{"definition":"The tail-end of an object, e.g. the rear of an aircraft's fuselage, containing the tailfin."},{"definition":"The rear structure of an aircraft, the empennage."},{"definition":"The visible stream of dust and gases blown from a comet by the solar wind."},{"definition":"The latter part of a time period or event, or (collectively) persons or objects represented in this part."},{"definition":"The part of a distribution most distant from the mode; as, a long tail."},{"definition":"One who surreptitiously follows another."},{"definition":"The lower order of batsmen in the batting order, usually specialist bowlers."},{"definition":"The lower loop of the letters in the Roman alphabet, as in g, q or y."},{"definition":"(chiefly in the plural) The side of a coin not bearing the head; normally the side on which the monetary value of the coin is indicated; the reverse."},{"definition":"All the last terms of a sequence, from some term on."},{"definition":"The buttocks or backside."},{"definition":"The penis of a person or animal."},{"definition":"Sexual intercourse.","example":"I'm gonna get me some tail tonight."},{"definition":"(kayaking) The stern; the back of the kayak."},{"definition":"A train or company of attendants; a retinue."},{"definition":"The distal tendon of a muscle."},{"definition":"A filamentous projection on the tornal section of each hind wing of certain butterflies."},{"definition":"A downy or feathery appendage of certain achens, formed of the permanent elongated style."},{"definition":"A portion of an incision, at its beginning or end, which does not go through the whole thickness of the skin, and is more painful than a complete incision; called also tailing."},{"definition":"One of the strips at the end of a bandage formed by splitting the bandage one or more times."},{"definition":"A rope spliced to the strap of a block, by which it may be lashed to anything."},{"definition":"The part of a note which runs perpendicularly upward or downward from the head; the stem."},{"definition":"A tailing."},{"definition":"The bottom or lower portion of a member or part such as a slate or tile."},{"definition":"A tailcoat."},{"definition":"A formal evening jacket with an extended back panel; a dress coat."},{"definition":"Any coat with similar tails."},{"definition":"The side of a coin that doesn't bear the picture of the head of state or similar.","example":"Tails, I win."},{"definition":"Tailings; waste"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To follow and observe surreptitiously.","example":"Tail that car!"},{"definition":"To hold by the end; said of a timber when it rests upon a wall or other support; with in or into"},{"definition":"To swing with the stern in a certain direction; said of a vessel at anchor.","example":"This vessel tails downstream."},{"definition":"To follow or hang to, like a tail; to be attached closely to, as that which can not be evaded."},{"definition":"To pull or draw by the tail."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tails-au","text":"/teɪlz/"}]},{"word":"MICROBIAL","idx":16179,"count":2287718,"meanings":[{"definitions":[{"definition":"A microbe or bacterium."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or caused by microbes or microorganisms."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/maɪˈkɹoʊb.i.əl/"}]},{"word":"DISCARDED","idx":16180,"count":2287290,"meanings":[{"definitions":[{"definition":"To throw away, to reject."},{"definition":"To make a discard; to throw out a card."},{"definition":"To dismiss from employment, confidence, or favour; to discharge."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɪsˈkɑɹdɪd/"},{"text":"/dɪsˈkɑːdɪd/"}]},{"word":"BIBLES","idx":16181,"count":2287235,"meanings":[{"definitions":[{"definition":"An exemplar of the Bible."},{"definition":"A comprehensive manual that describes something. (e.g., handyman’s bible)."},{"definition":"(at certain US universities) A compilation of problems and solutions from previous years of a given course, used by some students to cheat on tests or assignments."},{"definition":"Omasum, the third compartment of the stomach of ruminants"},{"definition":"A piece of soft sandstone used for scouring the wooden decks of ships, usually with sand and seawater."},{"definition":"A stone with a naturally-formed hole, used by Yorkshiremen for good luck."}],"partOfSpeech":"n"}]},{"word":"HANGS","idx":16182,"count":2287111,"meanings":[{"definitions":[{"definition":"To be or remain suspended.","example":"The lights hung from the ceiling."},{"definition":"To float, as if suspended.","example":"The smoke hung in the room."},{"definition":"(of a ball in cricket, tennis, etc.) To rebound unexpectedly or unusually slowly, due to backward spin on the ball or imperfections of the ground."},{"definition":"To hold or bear in a suspended or inclined manner or position instead of erect.","example":"He hung his head in shame."},{"definition":"To cause (something) to be suspended, as from a hook, hanger, hinges or the like.","example":"Hang those lights from the ceiling."},{"definition":"To execute (someone) by suspension from the neck.","example":"The culprits were hanged from the nearest tree."},{"definition":"To be executed by suspension by one's neck from a gallows, a tree, or other raised bar, attached by a rope tied into a noose.","example":"You will hang for this, my friend."},{"definition":"(used in maledictions) To damn."},{"definition":"To loiter, hang around, to spend time idly.","example":"Are you busy, or can you hang with me?  I didn't see anything, officer. I was just hanging."},{"definition":"To exhibit (an object) by hanging."},{"definition":"To apply (wallpaper or drywall to a wall).","example":"Let's hang this cute animal design in the nursery."},{"definition":"To decorate (something) with hanging objects.","example":"Let's hang the nursery with some new wallpaper."},{"definition":"To remain persistently in one's thoughts."},{"definition":"To prevent from reaching a decision, especially by refusing to join in a verdict that must be unanimous.","example":"One obstinate juror can hang a jury."},{"definition":"To stop responding to manual input devices such as keyboard and mouse.","example":"The computer has hung again. Not even pressing ++ works.  When I push this button the program hangs."},{"definition":"To cause (a program or computer) to stop responding.","example":"The program has a bug that can hang the system."},{"definition":"To cause (a piece) to become vulnerable to capture.","example":"If you move there, you'll hang your rook."},{"definition":"To be vulnerable to capture.","example":"In this standard opening position White has to be careful because the pawn on e4 hangs."},{"definition":"Of a pitcher, to throw a hittable off-speed pitch."}],"partOfSpeech":"ve"}]},{"word":"CAREGIVERS","idx":16184,"count":2286636,"meanings":[{"definitions":[{"definition":"A carer."}],"partOfSpeech":"n"}]},{"word":"JOANNA","idx":16185,"count":2286620,"meanings":[{"definitions":[{"definition":"(often \"old joanna\") A piano."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/d͡ʒəʊˈænə/"}]},{"word":"QUARK","idx":16186,"count":2286617,"meanings":[{"definitions":[{"definition":"In the Standard Model, an elementary subatomic particle that forms matter. They combine to form hadrons, such as protons and neutrons."},{"definition":"(X Window System) An integer that uniquely identifies a text string."},{"definition":"A soft creamy cheese, eaten throughout northern, central, and eastern Europe, very similar to cottage cheese except that it is usually not made with rennet."},{"definition":"(Falkland Islands) The black-crowned night heron, Nycticorax nycticorax."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kwɑɹk/"},{"text":"/kwɑːk/"}]},{"word":"SYNONYMS","idx":16188,"count":2286036,"meanings":[{"definitions":[{"definition":"(strictly) A word whose meaning is the same as that of another word."},{"definition":"A word or phrase with a meaning that is the same as, or very similar to, another word or phrase.","example":"“Happy” is a synonym of “glad”."},{"definition":"Any of the formal names for a taxon, including the valid name (i.e. the senior synonym)."},{"definition":"Any name for a taxon, usually a validly published, formally accepted one, but often also an unpublished name."},{"definition":"An alternative (often shorter) name defined for an object in a database."}],"partOfSpeech":"n"}]},{"word":"ELECTRONICA","idx":16189,"count":2285879,"meanings":[{"definitions":[{"definition":"Any of a wide range of electronic music genres."},{"definition":"Electronic items in general."},{"definition":"The data trail of an individual on the public internet."}],"partOfSpeech":"n"}]},{"word":"STRANDED","idx":16190,"count":2285325,"meanings":[{"definitions":[{"definition":"To run aground; to beach."},{"definition":"To leave (someone) in a difficult situation; to abandon or desert."},{"definition":"To cause the third out of an inning to be made, leaving a runner on base.","example":"Jones pops up; that's going to strand a pair."},{"definition":"To break a strand of (a rope)."},{"definition":"To form by uniting strands."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a person) Abandoned or marooned."},{"definition":"(of a vessel) Run aground on a shore or reef."},{"definition":"(of a piece of wire) Made by combining or bundling thinner wires."},{"definition":"(of expenses or costs) That has become unrecoverable or difficult to recover."},{"definition":"(in combination) Having the specified number or kind of strands.","example":"single-stranded, double-stranded"}],"partOfSpeech":"j"}]},{"word":"MITOCHONDRIAL","idx":16191,"count":2284771,"meanings":[{"definitions":[{"definition":"Of, or relating to mitochondria."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌmaɪ.t̬əˈkɑːn.dɹi.əl/"},{"text":"/ˌmaɪ.təˈkɒn.dɹi.əl/"}]},{"word":"DOLCE","idx":16193,"count":2283881,"meanings":[{"definitions":[{"definition":"A soft-toned organ stop."}],"partOfSpeech":"n"}]},{"word":"PANE","idx":16195,"count":2282782,"meanings":[{"definitions":[{"definition":"An individual sheet of glass in a window, door, etc."},{"definition":"A layer in the build-up of a GUI."},{"definition":"A division; a distinct piece or compartment of any surface."},{"definition":"A square of a checkered or plaid pattern."},{"definition":"One of the openings in a slashed garment, showing the bright colored silk, or the like, within; hence, the piece of colored or other stuff so shown."},{"definition":"A compartment of a surface, or a flat space; hence, one side or face of a building.","example":"An octagonal tower is said to have eight panes."},{"definition":"A subdivision of an irrigated surface between a feeder and an outlet drain."},{"definition":"One of the flat surfaces, or facets, of any object having several sides."},{"definition":"One of the eight facets surrounding the table of a brilliant-cut diamond."},{"definition":"The (often spherical) end of the head of a hammer opposite the main hammering end."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fit with panes."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pane-us","text":"/peɪn/"}]},{"word":"BROWNING","idx":16196,"count":2282546,"meanings":[{"definitions":[{"definition":"To become brown.","example":"Fry the onions until they brown."},{"definition":"To cook something until it becomes brown.","example":"Brown the onions in a large frying pan."},{"definition":"To tan.","example":"Light-skinned people tend to brown when exposed to the sun."},{"definition":"To make brown or dusky."},{"definition":"To give a bright brown colour to, as to gun barrels, by forming a thin coating of oxide on their surface."},{"definition":"(usually derogatory) To turn progressively more Middle Eastern, Hispanic or Latino, in the context of the population of a geographic region.","example":"the browning of America"},{"definition":"To treat with deference, or respect."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or operation of giving a brown colour, as to gun barrels, cooked food, etc."},{"definition":"Any of various preparations used to impart a brown colour to gravy, leather, etc."},{"definition":"A smooth coat of brown mortar, usually the second coat, and the preparation for the finishing coat of plaster."},{"definition":"A brown-skinned person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"browning-us","text":"/ˈbɹaʊ.nɪŋ/"}]},{"word":"ANGULAR","idx":16197,"count":2282356,"meanings":[{"definitions":[{"definition":"A bone in the base of the lower jaw of many birds, reptiles, and fishes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating or pertaining to an angle or angles."},{"definition":"Having an angle or angles; forming an angle or corner"},{"definition":"Sharp-cornered; pointed.","example":"an angular figure"},{"definition":"Measured by an angle.","example":"angular distance"},{"definition":"Lean, lank."},{"definition":"Ungraceful; lacking grace."},{"definition":"Sharp and stiff in character.","example":"He's remarkably angular in his habits and appearance."},{"definition":"Composed of three or more rings attached to a single carbon atom (the rings not all being in the same plane)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"angular-us","text":"/-lɑɹ/"}]},{"word":"VEINS","idx":16198,"count":2282346,"meanings":[{"definitions":[{"definition":"A blood vessel that transports blood from the capillaries back to the heart."},{"definition":"(in plural) The entrails of a shrimp."},{"definition":"In leaves, a thickened portion of the leaf containing the vascular bundle."},{"definition":"The nervure of an insect’s wing."},{"definition":"A stripe or streak of a different colour or composition in materials such as wood, cheese, marble or other rocks."},{"definition":"A topic of discussion; a train of association, thoughts, emotions, etc.","example":"in the same vein"},{"definition":"A style, tendency, or quality.","example":"The play is in a satirical vein."},{"definition":"A fissure, cleft or cavity, as in the earth or other substance."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To mark with veins or a vein-like pattern."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/veɪnz/"}]},{"word":"FOLDS","idx":16199,"count":2282227,"meanings":[{"definitions":[{"definition":"An act of folding.","example":"After two reraises in quick succession, John realised his best option was probably a fold."},{"definition":"A bend or crease."},{"definition":"Any correct move in origami."},{"definition":"(newspapers) The division between the top and bottom halves of a broadsheet: headlines above the fold will be readable in a newsstand display; usually the fold."},{"definition":"(by extension) The division between the part of a web page visible in a web browser window without scrolling; usually the fold."},{"definition":"That which is folded together, or which enfolds or envelops; embrace."},{"definition":"The bending or curving of one or a stack of originally flat and planar surfaces, such as sedimentary strata, as a result of plastic (i.e. permanent) deformation."},{"definition":"In functional programming, any of a family of higher-order functions that process a data structure recursively to build up a value."},{"definition":"A section of source code that can be collapsed out of view in an editor to aid readability."},{"definition":"A pen or enclosure for sheep or other domestic animals."},{"definition":"(collective) A group of sheep or goats."},{"definition":"Home, family."},{"definition":"A church congregation, a group of people who adhere to a common faith and habitually attend a given church; the Christian church as a whole, the flock of Christ."},{"definition":"A group of people with shared ideas or goals or who live or work together."},{"definition":"A boundary or limit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bend (any thin material, such as paper) over so that it comes in contact with itself."},{"definition":"To make the proper arrangement (in a thin material) by bending.","example":"If you fold the sheets, they'll fit more easily in the drawer."},{"definition":"To become folded; to form folds.","example":"Cardboard doesn't fold very easily."},{"definition":"To fall over; to be crushed.","example":"The chair folded under his enormous weight."},{"definition":"To enclose within folded arms (see also enfold)."},{"definition":"To give way on a point or in an argument."},{"definition":"To withdraw from betting.","example":"With no hearts in the river and no chance to hit his straight, he folded."},{"definition":"(by extension) To withdraw or quit in general."},{"definition":"To stir gently, with a folding action.","example":"Fold the egg whites into the batter."},{"definition":"Of a company, to cease to trade.","example":"The company folded after six quarters of negative growth."},{"definition":"To double or lay together, as the arms or the hands.","example":"He folded his arms in defiance."},{"definition":"To cover or wrap up; to conceal."},{"definition":"To confine animals in a fold."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"folds-us","text":"/foʊldz/"}]},{"word":"GRINDER","idx":16200,"count":2281990,"meanings":[{"definitions":[{"definition":"One who grinds something, such as the teeth."},{"definition":"(anatomical) A molar."},{"definition":"A power tool with a spinning abrasive disc, used for grinding, smoothing, and shaping materials, usually metal."},{"definition":"A sandwich made on a long, cylindrical roll.","example":"I am going to the deli to get a grinder for lunch."},{"definition":"A kitchen gadget for processing coffee, herbs etc. into small or powdered pieces"},{"definition":"The restless flycatcher (Myiagra inquieta) of Australia, which makes a noise like a scissors grinder."},{"definition":"A fan or performer of grindcore music."},{"definition":"A biohacker who uses cybernetic implants or biochemicals to enhance or change their own body."},{"definition":"A student who studies hard; a swot."},{"definition":"A person who coaches students for an upcoming examination."},{"definition":"(ice hockey slang) A hard-working, physical player with limited offensive ability."},{"definition":"A low-ranking attorney with no clients who works very hard."},{"definition":"An outdoor space for drills and parades."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡɹaɪndəɹ/"},{"text":"/ɡɹaɪn.də(ɹ)/"},{"audio":"grinder-au"}]},{"word":"SNEAK","idx":16202,"count":2280877,"meanings":[{"definitions":[{"definition":"One who sneaks; one who moves stealthily to acquire an item or information.","example":"My little brother is such a sneak; yesterday I caught him trying to look through my diary."},{"definition":"A cheat; a con artist.","example":"I can't believe I gave that sneak $50 for a ticket when they were selling for $20 at the front gate."},{"definition":"An informer; a tell-tale."},{"definition":"A ball bowled so as to roll along the ground; a daisy-cutter"},{"definition":"A sneaker; a tennis shoe."},{"definition":"A play where the quarterback receives the snap and immediately dives forward."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To creep or go stealthily; to come or go while trying to avoid detection, as a person who does not wish to be seen.","example":"He decided to sneak into the kitchen for a second cookie while his mom was on the phone."},{"definition":"To take something stealthily without permission.","example":"I went to sneak a chocolate but my dad caught me."},{"definition":"(ditransitive) To stealthily bring someone something.","example":"She asked me to sneak her a phone next month."},{"definition":"To hide, especially in a mean or cowardly manner."},{"definition":"(with on) To inform an authority of another's misdemeanours.","example":"If you sneak on me I'll bash you!"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In advance; before release to the general public.","example":"The company gave us a sneak look at their new electronic devices."},{"definition":"In a stealthy or surreptitious manner.","example":"I was able to get a sneak peek at the guest list."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"sneak-au","text":"/sniːk/"}]},{"word":"OCTET","idx":16203,"count":2280607,"meanings":[{"definitions":[{"definition":"A group or set of eight of something."},{"definition":"A group of eight musicians performing together.","example":"An octet of waiters sang her \"Happy Birthday\"."},{"definition":"A composition for such a group of musicians."},{"definition":"A byte of eight bits. Abbreviation: o"},{"definition":"A group of three bits, representing any of eight possible values."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɒkˈtɛt/"}]},{"word":"INCORRECTLY","idx":16205,"count":2280414,"meanings":[{"definitions":[{"definition":"In an incorrect manner.","example":"I lost a few marks in the test for spelling words incorrectly."}],"partOfSpeech":"v"}]},{"word":"AVOIDANCE","idx":16206,"count":2280365,"meanings":[{"definitions":[{"definition":"The act of annulling; annulment."},{"definition":"The act of becoming vacant, or the state of being vacant; – specifically used for the state of a benefice becoming void by the death, deprivation, or resignation of the incumbent."},{"definition":"A dismissing or a quitting; removal; withdrawal."},{"definition":"The act of avoiding or shunning; keeping clear of."},{"definition":"Any thing that is to be avoided"},{"definition":"The courts by which anything is carried off."}],"partOfSpeech":"n"}]},{"word":"DINOSAURS","idx":16208,"count":2279772,"meanings":[{"definitions":[{"definition":"In scientific usage, any of the animals belonging to the clade Dinosauria, especially those that existed during the Triassic, Jurassic and Cretaceous periods and are now extinct."},{"definition":"In non-scientific usage, any non-avian dinosaur."},{"definition":"Any extinct reptile, not necessarily belonging to Dinosauria, that existed between about 230 million and 65 million years ago."},{"definition":"A person or organisation that is very old, has very old-fashioned views, or is not willing to change and adapt."},{"definition":"Anything no longer in common use or practice."}],"partOfSpeech":"n"}]},{"word":"SAUCES","idx":16209,"count":2279536,"meanings":[{"definitions":[{"definition":"A liquid (often thickened) condiment or accompaniment to food.","example":"apple sauce; mint sauce"},{"definition":"Tomato sauce (similar to US tomato ketchup), as in:","example":"[meat] pie and [tomato] sauce"},{"definition":"(usually “the”) Alcohol, booze.","example":"Maybe you should lay off the sauce."},{"definition":"Anabolic steroids."},{"definition":"A soft crayon for use in stump drawing or in shading with the stump."},{"definition":"Cheek; impertinence; backtalk; sass."},{"definition":"(1800s) Vegetables."},{"definition":"Any garden vegetables eaten with meat."},{"definition":"The person, place or thing from which something (information, goods, etc.) comes or is acquired.","example":"The accused refused to reveal the source of the illegal drugs she was selling."},{"definition":"Spring; fountainhead; wellhead; any collection of water on or under the surface of the ground in which a stream originates.","example":"The main sources of the Euphrates River are the Karasu and Murat Rivers."},{"definition":"A reporter's informant."},{"definition":"Source code."},{"definition":"The name of one terminal of a field effect transistor (FET)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To add sauce to; to season."},{"definition":"To cause to relish anything, as if with a sauce; to tickle or gratify, as the palate; to please; to stimulate."},{"definition":"To make poignant; to give zest, flavour or interest to; to set off; to vary and render attractive."},{"definition":"To treat with bitter, pert, or tart language; to be impudent or saucy to."}],"partOfSpeech":"ve"}]},{"word":"CONQUER","idx":16210,"count":2279399,"meanings":[{"definitions":[{"definition":"To defeat in combat; to subjugate."},{"definition":"To acquire by force of arms, win in war.","example":"In 1453, the Ottoman Empire conquered Istanbul."},{"definition":"To overcome an abstract obstacle.","example":"Today I conquered my fear of flying by finally boarding a plane."},{"definition":"To gain, win, or obtain by effort.","example":"to conquer freedom;   to conquer a peace"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"conquer-us","text":"/ˈkɑŋkɚ/"}]},{"word":"PROBABILITIES","idx":16212,"count":2278966,"meanings":[{"definitions":[{"definition":"The state of being probable; likelihood."},{"definition":"An event that is likely to occur."},{"definition":"The relative likelihood of an event happening."},{"definition":"A number, between 0 and 1, expressing the precise likelihood of an event happening.","example":"The probability of an event A occurring is denoted P(A)."}],"partOfSpeech":"n"}]},{"word":"VIBE","idx":16213,"count":2278741,"meanings":[{"definitions":[{"definition":"A vibraphone."},{"definition":"Vibration."},{"definition":"A vibrator (sex toy)."},{"definition":"(originally New Age jargon) An atmosphere or aura felt to belong to a person, place or thing.","example":"The couple canceled their night out when they got a bad vibe from the new babysitter."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stimulate with a vibrator."},{"definition":"To relax and enjoy oneself."},{"definition":"To agree."},{"definition":"To get along; to hit it off."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/vaɪb/"}]},{"word":"IMMORTAL","idx":16214,"count":2278011,"meanings":[{"definitions":[{"definition":"One who is not susceptible to death."},{"definition":"A member of an elite regiment of the Persian army."},{"definition":"A member of the Académie française."},{"definition":"An administrator of a multi-user dungeon; a wizard."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Not susceptible to death; living forever; never dying."},{"definition":"Never to be forgotten; that merits being always remembered.","example":"his immortal words"},{"definition":"Connected with or relating to immortality."},{"definition":"Exceedingly great; excessive; grievous."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"immortal-us","text":"/ɪˈmɔɹtəl/"}]},{"word":"MARINERS","idx":16215,"count":2278010,"meanings":[{"definitions":[{"definition":"A sailor."}],"partOfSpeech":"n"}]},{"word":"SNAPSHOTS","idx":16216,"count":2278001,"meanings":[{"definitions":[{"definition":"A photograph, especially one taken quickly or in a moment of opportunity.","example":"He carried a snapshot of his daughter."},{"definition":"A glimpse of something; a portrayal of something at a moment in time.","example":"The article offered a snapshot of life in that region."},{"definition":"A file or set of files captured at a particular time, often capable of being reloaded to restore the earlier state.","example":"This game is so hard that I find myself taking a snapshot every few seconds in case I get killed."},{"definition":"A quick, unplanned or unexpected shot."},{"definition":"A quick offhand shot, made without deliberately taking aim over the sights."}],"partOfSpeech":"n"}]},{"word":"ENDEAVOR","idx":16218,"count":2277610,"meanings":[{"definitions":[{"definition":"A sincere attempt; a determined or assiduous effort towards a specific goal; assiduous or persistent activity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To exert oneself."},{"definition":"To attempt through application of effort (to do something); to try strenuously."},{"definition":"To attempt (something)."},{"definition":"To work with purpose."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"endeavor-us","text":"/ɛnˈdɛv.ɚ/"}]},{"word":"CREOLE","idx":16219,"count":2277595,"meanings":[{"definitions":[{"definition":"A descendant of white European settlers who is born in a colonized country."},{"definition":"Anyone with mixed ancestry born in a country colonized by white Europeans, now especially one who speaks a creole language."},{"definition":"Someone of black African descent who is born in the Caribbean or Americas (originally as opposed to an African immigrant)."},{"definition":"A native-born of Francophone descent in the Louisiana territory of any race, as opposed to Anglo-American and Acadian settlers."},{"definition":"A lect formed from two or more languages which has developed from a pidgin to become a first language."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"creole-us","text":"/ˈkɹioʊl/"},{"audio":"creole-uk","text":"/ˈkɹi.əʊl/"}]},{"word":"METH","idx":16221,"count":2277432,"meanings":[{"definitions":[{"definition":"Methamphetamine, especially in the form of the crystalline hydrochloride."},{"definition":"Methadone."},{"definition":"(Mancunian) A tramp."},{"definition":"A spiced mead, originally from Wales."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"meth-au","text":"/mɛθ/"}]},{"word":"TRENDY","idx":16222,"count":2277368,"meanings":[{"definitions":[{"definition":"A trendy person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or in accordance with the latest trend, fashion or hype.","example":"I hate those trendy pre-wrinkled shirts."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"trendy-au","text":"/ˈtɹɛndi/"}]},{"word":"TEAS","idx":16223,"count":2277290,"meanings":[{"definitions":[{"definition":"A drug smoked or ingested for euphoric effect, cannabis.","example":"After smoking a bowl of that fine marijuana, they ate some brownies."},{"definition":"The hemp plant itself, Cannabis sativa."},{"definition":"Food consumed before going to bed."},{"definition":"Any meal eaten in the evening; dinner eaten in the evening, rather than at noon."},{"definition":"A meal from a chip shop consisting of a deep-fried food with chips.","example":"a fish supper; a pizza supper"},{"definition":"A drinker, especially one who drinks slowly (i.e., one who sups)."},{"definition":"The tea plant (Camellia sinensis); a variety of this plant.","example":"Darjeeling tea is grown in India."},{"definition":"The dried leaves or buds of the tea plant; a variety of such leaves.","example":"Go to the supermarket and buy some Darjeeling tea."},{"definition":"The drink made by infusing these dried leaves or buds in hot water.","example":"Would you like some tea?"},{"definition":"Any similar drink made by infusing parts of various other plants.","example":"camomile tea; mint tea"},{"definition":"Meat stock served as a hot drink.","example":"beef tea"},{"definition":"A cup or (East Asia) glass of any of these drinks, often with milk, sugar, lemon, and/or tapioca pearls."},{"definition":"A light midafternoon meal, typically but not necessarily including tea."},{"definition":"The break in play between the second and third sessions.","example":"Australia were 490 for 7 at tea on the second day."},{"definition":"Information, especially gossip.","example":"Spill the tea on that drama, hon."},{"definition":"A moment, a historical unit of time from China, about the amount of time needed to quickly drink a traditional cup of tea. It is now found in Chinese-language historical fiction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drink tea."},{"definition":"To take afternoon tea (the light meal)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tiːz/"}]},{"word":"SETTLING","idx":16224,"count":2277106,"meanings":[{"definitions":[{"definition":"To conclude or resolve (something):"},{"definition":"To place or arrange in(to) a desired (especially: calm) state, or make final disposition of (something).","example":"to settle her estate"},{"definition":"To become calm, quiet, or orderly; to stop being agitated.","example":"the weather settled;  wait until the crowd settles before speaking"},{"definition":"To establish or become established in a steady position:"},{"definition":"To fix one's residence in a place; to establish a dwelling place, home, or colony. (Compare settle down.)","example":"the Saxons who settled in Britain"},{"definition":"To move (people) to (a land or territory), so as to colonize it; to cause (people) to take residence in (a place)."},{"definition":"To sink, or cause (something, or impurities within it) to sink down, especially so as to become clear or compact."},{"definition":"To make a jointure for a spouse."},{"definition":"(of an animal) To make or become pregnant."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who, or that which, settles; the act of establishing oneself, of colonizing, subsiding, adjusting, etc."},{"definition":"The reckoning or settlement of accounts."},{"definition":"(usually in the plural) Dregs; sediment."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"settling-us","text":"/ˈsɛtl̩ɪŋ/"}]},{"word":"INPATIENT","idx":16225,"count":2276012,"meanings":[{"definitions":[{"definition":"A patient whose treatment needs at least one night's residence in a hospital; a hospitalized patient."}],"partOfSpeech":"n"}]},{"word":"FILMING","idx":16226,"count":2275985,"meanings":[{"definitions":[{"definition":"To record (activity, or a motion picture) on photographic film.","example":"A Hollywood studio was filming on location in NYC."},{"definition":"To cover or become covered with a thin skin or pellicle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to film."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɪlmɪŋ/"}]},{"word":"BADGER","idx":16227,"count":2275812,"meanings":[{"definitions":[{"definition":"Any mammal of three subfamilies, which belong to the family Mustelidae: Melinae (Eurasian badgers), Mellivorinae (ratel or honey badger), and Taxideinae (American badger)."},{"definition":"A native or resident of the American state, Wisconsin."},{"definition":"A brush made of badger hair."},{"definition":"(in the plural) A crew of desperate villains who robbed near rivers, into which they threw the bodies of those they murdered."},{"definition":"An itinerant licensed dealer in commodities used for food; a hawker; a huckster; -- formerly applied especially to one who bought grain in one place and sold it in another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pester, to annoy persistently; press.","example":"He kept badgering her about her bad habits."},{"definition":"To pass gas; to fart."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"badger-us","text":"/ˈbædʒɚ/"}]},{"word":"PARTISAN","idx":16230,"count":2275007,"meanings":[{"definitions":[{"definition":"An adherent to a party or faction."},{"definition":"A fervent, sometimes militant, supporter or proponent of a party, cause, faction, person, or idea."},{"definition":"A member of a band of detached light, irregular troops acting behind occupying enemy lines in the ways of harassment or sabotage; a guerrilla fighter."},{"definition":"The commander of a body of detached light troops engaged in making forays and harassing an enemy."},{"definition":"A long-handled spear with a triangular, double-edged blade having lateral projections, in some forms also used in boar hunting."},{"definition":"A soldier armed with such a weapon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Serving as commander or member of a body of detached light troops.","example":"partisan officer, partisan corps"},{"definition":"Adherent to a party or faction; especially, having the character of blind, passionate, or unreasonable adherence to a party.","example":"They were blinded by partisan zeal."},{"definition":"Devoted to or biased in support of a party, group, or cause.","example":"partisan politics"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"partisan-us","text":"/ˈpɑɹ.ɾə.zən/"}]},{"word":"BACKEND","idx":16232,"count":2274904,"meanings":[{"definitions":[{"definition":"The rear, back, or unseen portion (of something).","example":"The back end of the operation is kept out of sight of the customers."},{"definition":"That part of a hardware or software system that is farthest from the user; the internals rather than the user interface."},{"definition":"The latter end of any given time, especially the latter part of the year; autumn; late autumn."}],"partOfSpeech":"n"}]},{"word":"GRATITUDE","idx":16234,"count":2274093,"meanings":[{"definitions":[{"definition":"The state of being grateful."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"gratitude-us","text":"/ˈɡɹætɪt(j)ud/"}]},{"word":"IMPRESS","idx":16235,"count":2274015,"meanings":[{"definitions":[{"definition":"The act of impressing."},{"definition":"An impression; an impressed image or copy of something."},{"definition":"A stamp or seal used to make an impression."},{"definition":"An impression on the mind, imagination etc."},{"definition":"Characteristic; mark of distinction; stamp."},{"definition":"A heraldic device; an impresa."},{"definition":"The act of impressing, or taking by force for the public service; compulsion to serve; also, that which is impressed."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To affect (someone) strongly and often favourably.","example":"You impressed me with your command of Urdu."},{"definition":"To make an impression, to be impressive.","example":"Henderson impressed in his first game as captain."},{"definition":"To produce a vivid impression of (something).","example":"That first view of the Eiger impressed itself on my mind."},{"definition":"To mark or stamp (something) using pressure.","example":"We impressed our footprints in the wet cement."},{"definition":"To produce (a mark, stamp, image, etc.); to imprint (a mark or figure upon something)."},{"definition":"To fix deeply in the mind; to present forcibly to the attention, etc.; to imprint; to inculcate."},{"definition":"To compel (someone) to serve in a military force.","example":"The press gang used to impress people into the Navy."},{"definition":"To seize or confiscate (property) by force.","example":"The liner was impressed as a troop carrier."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"impress-us-verb","text":"/ɪmˈpɹɛs/"},{"audio":"impress-us-noun","text":"/ˈɪmpɹɛs/"}]},{"word":"WILLY","idx":16236,"count":2273954,"meanings":[{"definitions":[{"definition":"Willing; favourable; ready; eager."},{"definition":"Self-willed; willful."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Any of various deciduous trees or shrubs in the genus Salix, in the willow family Salicaceae, found primarily on moist soils in cooler zones in the northern hemisphere."},{"definition":"The wood of these trees."},{"definition":"A cricket bat."},{"definition":"(1800s) The baseball bat."},{"definition":"A rotating spiked drum used to open and clean cotton heads."},{"definition":"A willow basket."},{"definition":"A fish basket."},{"definition":"(hypocoristic) the penis."},{"definition":"Term of abuse."},{"definition":"A person who is manipulated into serving as a useful agent without knowing it."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"willy-us","text":"/ˈwɪli/"},{"audio":"willy-au","text":"/ˈwɪli/"}]},{"word":"ANON","idx":16237,"count":2273948,"meanings":[{"definitions":[{"definition":"Straight away; at once."},{"definition":"Soon; in a little while."},{"definition":"At another time; then; again."}],"partOfSpeech":"v"},{"definitions":[{"definition":"An anonymous person, especially an author."},{"definition":"A work with an unknown author."},{"definition":"A work without a title."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Anonymous"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈnɑn/"},{"text":"/əˈnɒn/"}]},{"word":"EMINENT","idx":16238,"count":2273923,"meanings":[{"definitions":[{"definition":"High, lofty."},{"definition":"Noteworthy, remarkable, great.","example":"His eminent good sense has been a godsend to this project."},{"definition":"(of a person) distinguished, important, noteworthy.","example":"In later years, the professor became known as an eminent historian."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"eminent-us","text":"/ˈɛmɪnənt/"}]},{"word":"RIBS","idx":16239,"count":2273552,"meanings":[{"definitions":[{"definition":"Any of a series of long curved bones occurring in 12 pairs in humans and other animals and extending from the spine to or toward the sternum"},{"definition":"A part or piece, similar to a rib, and serving to shape or support something"},{"definition":"A cut of meat enclosing one or more rib bones"},{"definition":"Any of several curved members attached to a ship's keel and extending upward and outward to form the framework of the hull"},{"definition":"Any of several transverse pieces that provide an aircraft wing with shape and strength"},{"definition":"A long, narrow, usually arched member projecting from the surface of a structure, especially such a member separating the webs of a vault"},{"definition":"A raised ridge in knitted material or in cloth"},{"definition":"The main, or any of the prominent veins of a leaf"},{"definition":"A teasing joke"},{"definition":"A single strand of hair."},{"definition":"A stalk of celery."},{"definition":"(archaic, literary, humorous) A wife or woman."},{"definition":"Hound's-tongue (Cynoglossum officinale)."},{"definition":"Costmary (Tanacetum balsamita)."},{"definition":"Watercress (Nasturtium officinale)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shape, support, or provide something with a rib or ribs."},{"definition":"To tease or make fun of someone in a good-natured way.","example":"He always gets ribbed for his outrageous shirts."},{"definition":"To enclose, as if with ribs, and protect; to shut in."},{"definition":"To leave strips of undisturbed ground between the furrows in ploughing (land)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹɪbz/"}]},{"word":"COMMUNICATED","idx":16240,"count":2273387,"meanings":[{"definitions":[{"definition":"To impart"},{"definition":"To share"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"communicated-us","text":"/kəˈmjuːnɪkeɪtɪd/"}]},{"word":"EXCEPTIONALLY","idx":16241,"count":2272954,"meanings":[{"definitions":[{"definition":"To an unusual, remarkable or exceptional degree."}],"partOfSpeech":"v"}]},{"word":"QUILTS","idx":16242,"count":2272852,"meanings":[{"definitions":[{"definition":"A bed covering consisting of two layers of fabric stitched together, with insulation between, often having a decorative design.","example":"My grandmother is going to sew a quilt."},{"definition":"A roll of material with sound-absorbing properties, used in soundproofing."},{"definition":"A quilted skirt worn by women."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To construct a quilt."},{"definition":"To construct something, such as clothing, using the same technique."}],"partOfSpeech":"ve"}]},{"word":"AGEING","idx":16244,"count":2272736,"meanings":[{"definitions":[{"definition":"To cause to grow old; to impart the characteristics of age to.","example":"Grief ages us."},{"definition":"To postpone an action that would extinguish something, as a debt.","example":"Money's a little tight right now, let's age our bills for a week or so."},{"definition":"To categorize by age.","example":"One his first assignments was to age the accounts receivable."},{"definition":"To grow aged; to become old; to show marks of age.","example":"He grew fat as he aged."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of becoming older or more mature."},{"definition":"The deliberate process of making something (such as an antique) appear (or, in science fiction, become) older than it is."},{"definition":"Becoming senescent; accumulating damage to macromolecules, cells, tissues and organs with the passage of time; progressing loss of health, mobility, vibrancy and body functionality, resulting in biological death."},{"definition":"Wear, wear and tear."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Becoming elderly.","example":"The aging artist could no longer steadily hold the brush."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ageing-au"}]},{"word":"SPLITS","idx":16245,"count":2272659,"meanings":[{"definitions":[{"definition":"A crack or longitudinal fissure."},{"definition":"A breach or separation, as in a political party; a division."},{"definition":"A piece that is split off, or made thin, by splitting; a splinter; a fragment."},{"definition":"(leather manufacture) One of the sections of a skin made by dividing it into two or more thicknesses."},{"definition":"(cheerleading, usually in the phrase \"to do the splits\") A maneuver of spreading or sliding the feet apart until the legs are flat on the floor 180 degrees apart, either sideways to the body or with one leg in front and one behind, thus lowering the body completely to the floor in an upright position."},{"definition":"A workout routine as seen by its distribution of muscle groups or the extent and manner they are targetted in a microcycle."},{"definition":"A split-finger fastball.","example":"He’s got a nasty split."},{"definition":"A result of a first throw that leaves two or more pins standing with one or more pins between them knocked down."},{"definition":"A split shot or split stroke."},{"definition":"A dessert or confection resembling a banana split."},{"definition":"A unit of measure used for champagne or other spirits: 18.75 centiliters or one quarter of a standard 75-centiliter bottle. Commercially comparable to 1/20 gallon, which is 1/2 of a fifth."},{"definition":"A bottle of wine containing 37.5 centiliters, half the volume of a standard 75-centiliter bottle; a demi."},{"definition":"The elapsed time at specific intermediate points in a race.","example":"In the 3000 m race, his 800 m split was 1:45.32"},{"definition":"The elapsed time at specific intermediate points in a speedrun."},{"definition":"A tear resulting from tensile stresses."},{"definition":"A division of a stake happening when two cards of the kind on which the stake is laid are dealt in the same turn."},{"definition":"A recording containing songs by multiple artists."},{"definition":"(cheerleading) A maneuver in which the legs are extended straight out and perpendicular to the body, either to the sides or in front and behind."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of something solid, to divide fully or partly along a more or less straight line.","example":"He has split his lip."},{"definition":"Of something solid, particularly wood, to break along the grain fully or partly along a more or less straight line."},{"definition":"To share; to divide.","example":"We split the money among three people."},{"definition":"To leave.","example":"Let's split this scene and see if we can find a real party."},{"definition":"(of a couple) To separate.","example":"Did you hear Dick and Jane split? They'll probably get a divorce."},{"definition":"To (cause to) break up; to throw into discord.","example":"Accusations of bribery split the party just before the election."},{"definition":"(acts on a polynomial) To factor into linear factors."},{"definition":"To be broken; to be dashed to pieces."},{"definition":"To burst out laughing."},{"definition":"To divulge a secret; to betray confidence; to peach."},{"definition":"In athletics (especially baseball), for both teams involved in a doubleheader to win one game each and lose another game.","example":"Boston split with Philadelphia in a doubleheader, winning the first game 3-1 before losing 2-0 in the nightcap."},{"definition":"To vote for candidates of opposite parties."}],"partOfSpeech":"ve"}]},{"word":"SUBSCRIBING","idx":16246,"count":2272477,"meanings":[{"definitions":[{"definition":"To sign up to have copies of a publication, such as a newspaper or a magazine, delivered for a period of time.","example":"Would you like to subscribe or subscribe a friend to our new magazine, Lexicography Illustrated?"},{"definition":"To pay for the provision of a service, such as Internet access or a cell phone plan."},{"definition":"To believe or agree with a theory or an idea (used with to).","example":"I don’t subscribe to that theory."},{"definition":"To pay money to be a member of an organization."},{"definition":"To contribute or promise to contribute money to a common fund."},{"definition":"To promise to give, by writing one's name with the amount.","example":"Each man subscribed ten dollars."},{"definition":"To agree to buy shares in a company."},{"definition":"To sign; to mark with one's signature as a token of consent or attestation.","example":"Officers subscribe their official acts, and secretaries and clerks subscribe copies or records."},{"definition":"To write (one’s name) at the bottom of a document; to sign (one's name)."},{"definition":"To sign away; to yield; to surrender."},{"definition":"To yield; to admit to being inferior or in the wrong."},{"definition":"To declare over one's signature; to publish."},{"definition":"To indicate interest in the communications made by a person or organization.","example":"My YouTube channel has reached 100,000 subscribers."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A subscription."}],"partOfSpeech":"n"}]},{"word":"COMPANIONS","idx":16247,"count":2272408,"meanings":[{"definitions":[{"definition":"A friend, acquaintance, or partner; someone with whom one spends time or keeps company","example":"His dog has been his trusted companion for the last five years."},{"definition":"A person employed to accompany or travel with another."},{"definition":"The framework on the quarterdeck of a sailing ship through which daylight entered the cabins below."},{"definition":"The covering of a hatchway on an upper deck which leads to the companionway; the stairs themselves."},{"definition":"A knot in whose neighborhood another, specified knot meets every meridian disk."},{"definition":"A thing or phenomenon that is closely associated with another thing, phenomenon, or person."},{"definition":"An appended source of media or information, designed to be used in conjunction with and to enhance the main material.","example":"The companion guide gives an in-depth analysis of this particular translation."},{"definition":"A celestial object that is associated with another."},{"definition":"A knight of the lowest rank in certain orders.","example":"a companion of the Bath"},{"definition":"A fellow; a rogue."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"companions-us","text":"/kəmˈpænjənz/"}]},{"word":"CHEQUES","idx":16248,"count":2272318,"meanings":[{"definitions":[{"definition":"A draft directing a bank to pay money to a named person or entity.","example":"I was not carrying cash, so I wrote a cheque for the amount."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tʃɛks/"}]},{"word":"CONTAINMENT","idx":16249,"count":2272292,"meanings":[{"definitions":[{"definition":"The state of being contained."},{"definition":"The state of containing."},{"definition":"Something contained."},{"definition":"A policy of checking the expansion of a hostile foreign power by creating alliances with other states; especially the foreign policy strategy of the United States in the early years of the Cold War."},{"definition":"A physical system designed to prevent the accidental release of radioactive or other dangerous materials from a nuclear reactor or industrial plant."},{"definition":"An inclusion"}],"partOfSpeech":"n"}]},{"word":"PROTECTIONS","idx":16251,"count":2271529,"meanings":[{"definitions":[{"definition":"The process of keeping (something or someone) safe.","example":"Raincoats give protection from rain."},{"definition":"The state of being safe."},{"definition":"A means of keeping or remaining safe."},{"definition":"A means, such as a condom, of preventing pregnancy or sexually transmitted disease."},{"definition":"Coverage."},{"definition":"Immunity from harm, obtained by illegal payments, as bribery or extortion."},{"definition":"A document serving as a guarantee against harm or interference; a passport."},{"definition":"Restrictions on foreign competitors which limit their ability to compete with domestic producers of goods or services."},{"definition":"An instance of a security token associated with a resource (such as a file)."}],"partOfSpeech":"n"}]},{"word":"ALIASES","idx":16253,"count":2270764,"meanings":[{"definitions":[{"definition":"Another name; an assumed name."},{"definition":"A second or further writ which is issued after a first writ has expired without effect."},{"definition":"An abbreviation that replaces a string of commands and thereby reduces typing when performing routine actions or tasks."},{"definition":"An spurious signal generated as a technological artifact."}],"partOfSpeech":"n"}]},{"word":"MAXIMIZING","idx":16254,"count":2270543,"meanings":[{"definitions":[{"definition":"To make as large as possible"},{"definition":"To expand (a window) to fill the main display area"}],"partOfSpeech":"ve"}]},{"word":"SCREWED","idx":16255,"count":2270111,"meanings":[{"definitions":[{"definition":"To connect or assemble pieces using a screw."},{"definition":"To have sexual intercourse with."},{"definition":"To cheat someone or ruin their chances in a game or other situation."},{"definition":"To practice extortion upon; to oppress by unreasonable or extortionate exactions; to put the screws on."},{"definition":"To contort."},{"definition":"To miskick (a ball) by hitting it with the wrong part of the foot."},{"definition":"To screw back."},{"definition":"To examine (a student) rigidly; to subject to a severe examination."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fucked, beset with unfortunate circumstances that seem difficult or impossible to overcome; in imminent danger.","example":"They found out about our betrayal, so now we're screwed."},{"definition":"Intoxicated."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"screwed-us"}]},{"word":"HANDSFREE","idx":16256,"count":2270111,"meanings":[{"definitions":[{"definition":"A handsfree phone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That can be used without using the hands, hands-free.","example":"a handsfree phone"}],"partOfSpeech":"j"}]},{"word":"TOMCAT","idx":16257,"count":2269978,"meanings":[{"definitions":[{"definition":"A tom, a male cat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To prowl for sexual gratification."}],"partOfSpeech":"ve"}]},{"word":"SECTIONAL","idx":16260,"count":2269463,"meanings":[{"definitions":[{"definition":"An item of furniture composed of modular sections; usually specifically a sectional sofa"},{"definition":"A tournament or match held at the section level, typically between the regionals and the championships"},{"definition":"A band sectional, in which one section of a band or orchestra practices separately"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to a section."},{"definition":"Separating into sections.","example":"Our new sectional couch divided into pieces, but the pieces still wouldn't fit through the door."},{"definition":"Relating to conflict between areas.","example":"The U.S. civil war can be considered a sectional dispute."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɛkʃənəl/"}]},{"word":"INTERESTINGLY","idx":16261,"count":2268970,"meanings":[{"definitions":[{"definition":"In an interesting way"}],"partOfSpeech":"v"}]},{"word":"FASHIONABLE","idx":16262,"count":2268946,"meanings":[{"definitions":[{"definition":"A fashionable person; a fop"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Characteristic of or influenced by a current popular trend or style.","example":"a fashionable dress; a fashionable man"},{"definition":"Established or favoured by custom or use; current; prevailing at a particular time.","example":"the fashionable philosophy; fashionable opinions"},{"definition":"Genteel; well-bred","example":"fashionable society"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"fashionable-us","text":"/ˈfæʃənəbl̩/"}]},{"word":"TIDAL","idx":16264,"count":2268649,"meanings":[{"definitions":[{"definition":"Relating to tides"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtaɪd(ə)l/"}]},{"word":"BALLOTS","idx":16266,"count":2268477,"meanings":[{"definitions":[{"definition":"Originally, a small ball placed in a container to cast a vote; now, by extension, a piece of paper or card used for this purpose, or some other means used to signify a vote."},{"definition":"The process of voting, especially in secret; a round of voting."},{"definition":"The total of all the votes cast in an election."},{"definition":"A list of candidates running for office; a ticket."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To vote or decide by ballot.","example":"to ballot for a candidate"},{"definition":"To draw lots."}],"partOfSpeech":"ve"}]},{"word":"HOG","idx":16267,"count":2268262,"meanings":[{"definitions":[{"definition":"Any animal belonging to the Suidae family of mammals, especially the pig, the warthog, and the boar."},{"definition":"(specifically) An adult swine (contrasted with a pig, a young swine)."},{"definition":"A greedy person; one who refuses to share."},{"definition":"A large motorcycle, particularly a Harley-Davidson."},{"definition":"A young sheep that has not been shorn."},{"definition":"A rough, flat scrubbing broom for scrubbing a ship's bottom under water."},{"definition":"A device for mixing and stirring the pulp from which paper is made."},{"definition":"A shilling coin; its value, 12 old pence."},{"definition":"A tanner, a sixpence coin; its value."},{"definition":"A half-crown coin; its value, 30 old pence."},{"definition":"The effect of the middle of the hull of a ship rising while the ends droop"},{"definition":"A quahog (clam)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To greedily take more than one's share, to take precedence at the expense of another or others.","example":"Hey! Quit hogging all the blankets."},{"definition":"To clip the mane of a horse, making it short and bristly."},{"definition":"To scrub with a hog, or scrubbing broom."},{"definition":"To cause the keel of a ship to arch upwards (the opposite of sag)."},{"definition":"To process (bark, etc.) into hog fuel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hog-us","text":"/hɑɡ/"}]},{"word":"TESTIFY","idx":16269,"count":2268094,"meanings":[{"definitions":[{"definition":"To make a declaration, or give evidence, under oath."},{"definition":"To make a statement based on personal knowledge or faith."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtɛstɪfaɪ/"}]},{"word":"BOYCOTT","idx":16271,"count":2267945,"meanings":[{"definitions":[{"definition":"The act of boycotting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To abstain, either as an individual or a group, from using, buying, or dealing with someone or some organization as an expression of protest."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɔɪkɑt/"},{"text":"/ˈbɔɪkɒt/"}]},{"word":"VITALITY","idx":16273,"count":2267737,"meanings":[{"definitions":[{"definition":"The capacity to live and develop."},{"definition":"Energy or vigour."},{"definition":"That which distinguishes living from nonliving things; life, animateness."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/vaɪˈtæləti/"}]},{"word":"CLERKS","idx":16274,"count":2267600,"meanings":[{"definitions":[{"definition":"One who occupationally works with records, accounts, letters, etc.; an office worker."},{"definition":"A facilitator of a Quaker meeting for business affairs."},{"definition":"In the Church of England, the layman that assists in the church service, especially in reading the responses (also called parish clerk)."},{"definition":"A cleric or clergyman (the legal title for clergy of the Church of England is \"Clerk in Holy Orders\", still used in legal documents and cherished by some of their number)."},{"definition":"A scholar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a clerk, to perform the duties or functions of a clerk","example":"The law school graduate clerked for the supreme court judge for the summer."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/klɝks/"},{"text":"/klɑː(ɹ)ks/"}]},{"word":"CRUST","idx":16275,"count":2267452,"meanings":[{"definitions":[{"definition":"A more solid, dense or hard layer on a surface or boundary."},{"definition":"The external, hardened layer of certain foodstuffs, including most types of bread, fried meat, etc."},{"definition":"An outer layer composed of pastry"},{"definition":"The bread-like base of a pizza."},{"definition":"The outermost layer of the lithosphere of the Earth."},{"definition":"The shell of crabs, lobsters, etc."},{"definition":"Nerve, gall.","example":"You've got a lot of crust standing there saying that."},{"definition":"A living.","example":"to earn one's crust"},{"definition":"A subgenre of punk rock, derived from hardcore punk with extreme metal elements, often with pessimistic lyrics about political and social ills."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover with a crust."},{"definition":"To form a crust."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crust-uk","text":"/kɹʌst/"}]},{"word":"BOTHERED","idx":16276,"count":2267322,"meanings":[{"definitions":[{"definition":"To annoy, to disturb, to irritate.","example":"Would it bother you if I smoked?"},{"definition":"To feel care or anxiety; to make or take trouble; to be troublesome.","example":"Why do I even bother to try?"},{"definition":"To do something which is of negligible inconvenience.","example":"You didn't even bother to close the door."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Caused to show discomposure."}],"partOfSpeech":"j"}]},{"word":"TRAVERSE","idx":16277,"count":2266937,"meanings":[{"definitions":[{"definition":"A route used in mountaineering, specifically rock climbing, in which the descent occurs by a different route than the ascent."},{"definition":"A series of points, with angles and distances measured between, traveled around a subject, usually for use as \"control\" i.e. angular reference system for later surveying work."},{"definition":"A screen or partition."},{"definition":"Something that thwarts or obstructs.","example":"He will succeed, as long as there are no unlucky traverses not under his control."},{"definition":"A gallery or loft of communication from side to side of a church or other large building."},{"definition":"A formal denial of some matter of fact alleged by the opposite party in any stage of the pleadings. The technical words introducing a traverse are absque hoc (\"without this\", i.e. without what follows)."},{"definition":"The zigzag course or courses made by a ship in passing from one place to another; a compound course."},{"definition":"A line lying across a figure or other lines; a transversal."},{"definition":"In trench warfare, a defensive trench built to prevent enfilade."},{"definition":"A traverse board."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To travel across, often under difficult conditions.","example":"He will have to traverse the mountain to get to the other side."},{"definition":"To visit all parts of; to explore thoroughly.","example":"to traverse all nodes in a network"},{"definition":"To lay in a cross direction; to cross."},{"definition":"(artillery) To rotate a gun around a vertical axis to bear upon a military target.","example":"to traverse a cannon"},{"definition":", To climb or descend a steep hill at a wide angle (relative to the slope)."},{"definition":"To (make a cutting, an incline) across the gradients of a sloped face at safe rate.","example":"The last run, weary, I traversed the descents in no hurry to reach the lodge."},{"definition":"To act against; to thwart or obstruct."},{"definition":"To pass over and view; to survey carefully."},{"definition":"To plane in a direction across the grain of the wood.","example":"to traverse a board"},{"definition":"To deny formally."},{"definition":"To use the motions of opposition or counteraction."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lying across; being in a direction across something else.","example":"paths cut with traverse trenches"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Athwart; across; crosswise"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"traverse-uk","text":"/tɹəˈvɜːs/"}]},{"word":"VENGEANCE","idx":16278,"count":2266642,"meanings":[{"definitions":[{"definition":"Revenge taken for an insult, injury, or other wrong."},{"definition":"Desire for revenge."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vengeance-us","text":"/ˈvɛnˌdʒəns/"}]},{"word":"ORGANISERS","idx":16279,"count":2266464,"meanings":[{"definitions":[{"definition":"A person who arranges the details of a public event."},{"definition":"A hand-held micro-computer that will perform specific tasks; can be used as an electronic diary, alarm clock, recorder of memos and notes, a portable database etc."},{"definition":"A group of cells that, together with the evocator, control differentiation in the embryo; the inductor"}],"partOfSpeech":"n"}]},{"word":"DOLLY","idx":16280,"count":2266400,"meanings":[{"definitions":[{"definition":"A doll."},{"definition":"A contrivance for stirring:"},{"definition":"A tool with an indented head for shaping the head of a rivet."},{"definition":"In pile driving, a block interposed between the head of the pile and the ram of the driver."},{"definition":"A small truck with a single wide roller used for moving heavy beams, columns, etc., in bridge building."},{"definition":"A small truck without means of steering, to be slipped under a load."},{"definition":"A compact, narrow-gauge locomotive used for moving construction trains, switching, etc."},{"definition":"A specialized piece of film equipment resembling a little cart on which a camera is mounted."},{"definition":"A young woman, especially one who is frivolous or vapid."},{"definition":"A fashionable young woman, one who follows the latest music or clothing fashions."},{"definition":"A ball hit by a batsman such that it goes gently to a fielder for a simple catch."},{"definition":"A marker placed on the winning number by the dealer at roulette."},{"definition":"An offering of fruit or flowers."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hit a dolly."},{"definition":"To move (an object) using a dolly."},{"definition":"To wash (laundry) in a tub using the stirring device called a dolly."},{"definition":"To beat (red-hot metal) with a hammer."},{"definition":"To crush ore with a dolly."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Pretty; attractive."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdɑli/"},{"text":"/ˈdɒli/"},{"audio":"dolly-au"}]},{"word":"PISSED","idx":16281,"count":2266238,"meanings":[{"definitions":[{"definition":"To urinate.","example":"When I got home I found a drunk pissing in my doorway."},{"definition":"To discharge as or with the urine.","example":"Lately I've been pissing blood."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Drunk."},{"definition":"Annoyed, angry."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"pissed-au","text":"/pɪst/"}]},{"word":"GARRISON","idx":16282,"count":2265953,"meanings":[{"definitions":[{"definition":"A permanent military post."},{"definition":"The troops stationed at such a post."},{"definition":"(allusive) Occupants."},{"definition":"(U.S. Space Force) A military unit, nominally headed by a colonel, equivalent to a USAF support wing, or an army regiment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To assign troops to a military post."},{"definition":"To convert into a military fort."},{"definition":"To occupy with troops.","example":"'Establishing a land bridge through Mariupol to Crimea would take tens of thousands of troops. So would garrisoning eastern Ukraine.', http//www.economist.com/news/briefing/21615605-now-willing-use-russian-troops-more-or-less-openly-eastern-ukraine-vladimir-putin-has"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"garrison","text":"/ˈɡæɹɪsən/"}]},{"word":"NITE","idx":16283,"count":2265820,"meanings":[{"definitions":[{"definition":"The period between sunset and sunrise, when a location faces far away from the sun, thus when the sky is dark.","example":"How do you sleep at night when you attack your kids like that!?"},{"definition":"(Astronomy) The period of darkness beginning at the end of evening astronomical twilight when the sun is 18 degrees below the horizon, and ending at the beginning of morning astronomical twilight."},{"definition":"(Legal) Often defined in the legal system as beginning 30 minutes after sunset, and ending 30 minutes before sunrise."},{"definition":"An evening or night spent at a particular activity.","example":"a night on the town"},{"definition":"A night (and part of the days before and after it) spent in a place away from home, e.g. a hotel.","example":"I stayed my friend's house for three nights."},{"definition":"Nightfall.","example":"from noon till night"},{"definition":"Darkness (due to it being nighttime).","example":"The cat disappeared into the night."},{"definition":"A dark blue colour, midnight blue."},{"definition":"A night's worth of competitions, generally one game."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nite-us","text":"/naɪt/"}]},{"word":"SAL","idx":16284,"count":2265728,"meanings":[{"definitions":[{"definition":"Salt"},{"definition":"Shorea robusta, a dipterocarpaceous tree."}],"partOfSpeech":"n"}]},{"word":"BARB","idx":16285,"count":2265716,"meanings":[{"definitions":[{"definition":"The point that stands backward in an arrow, fishhook, etc., to prevent it from being easily extracted. Hence: Anything which stands out with a sharp point obliquely or crosswise to something else."},{"definition":"A hurtful or disparaging remark."},{"definition":"A beard, or that which resembles it, or grows in the place of it."},{"definition":"Armor for a horse, corrupted from bard."},{"definition":"A horse."},{"definition":"One of the side branches of a feather, which collectively constitute the vane."},{"definition":"Any of various species of freshwater carp-like fish that have barbels and belong to the cyprinid family."},{"definition":"Menticirrhus americanus (Carolina whiting, king whiting, southern kingcroaker, and southern kingfish), found along the Atlantic and Gulf Coasts of the United States."},{"definition":"A hair or bristle ending in a double hook."},{"definition":"A blackish or dun variety of the pigeon, originally brought from Barbary."},{"definition":"A muffler, worn by nuns and mourners."},{"definition":"Paps, or little projections, of the mucous membrane, which mark the opening of the submaxillary glands under the tongue in horses and cattle. The name is mostly applied when the barbs are inflamed and swollen. [Written also barbel and barble.]"},{"definition":"A bit for a horse."},{"definition":"A plastic fastener, shaped roughly like a capital I (with serifs), used to attach socks etc. to their packaging."},{"definition":"The Barbary horse, a superior breed introduced from Barbary into Spain by the Moors."},{"definition":"A blackish or dun variety of pigeon, originally brought from Barbary."},{"definition":"A barbiturate."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To furnish with barbs, or with that which will hold or hurt like barbs, as an arrow, fishhook, spear, etc."},{"definition":"To cover a horse in armor, corrupted from bard."},{"definition":"To cut (hair)."},{"definition":"To shave or dress the beard of."},{"definition":"To clip; to mow."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"barb-us","text":"/bɑː(ɹ)b/"}]},{"word":"HUNS","idx":16288,"count":2264946,"meanings":[{"definitions":[{"definition":"(used only to address someone) Honey, sweetheart, a term of endearment; a friendly term of address."},{"definition":"A grey partridge."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/hʌnz/"}]},{"word":"MINER","idx":16289,"count":2264812,"meanings":[{"definitions":[{"definition":"A person who works in a mine."},{"definition":"An operator of ordnance mines and similar explosives."},{"definition":"Any bird of one of four species of Australian endemic honeyeaters in the genus Manorina."},{"definition":"Any bird of one of several species of South American ovenbirds in the genus Geositta."},{"definition":"Software or hardware that mines, or creates new units of cryptocurrency."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"miner-us","text":"/ˈmaɪnə/"}]},{"word":"FASHIONS","idx":16290,"count":2264509,"meanings":[{"definitions":[{"definition":"A current (constantly changing) trend, favored for frivolous rather than practical, logical, or intellectual reasons."},{"definition":"Popular trends.","example":"Check out the latest in fashion."},{"definition":"A style or manner in which something is done."},{"definition":"The make or form of anything; the style, shape, appearance, or mode of structure; pattern, model; workmanship; execution.","example":"the fashion of the ark, of a coat, of a house, of an altar, etc."},{"definition":"Polite, fashionable, or genteel life; social position; good breeding.","example":"men of fashion"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make, build or construct, especially in a crude or improvised way."},{"definition":"To make in a standard manner; to work."},{"definition":"To fit, adapt, or accommodate to."},{"definition":"To forge or counterfeit."}],"partOfSpeech":"ve"}]},{"word":"GENITAL","idx":16292,"count":2264034,"meanings":[{"definitions":[{"definition":"The genitalia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, or relating to biological reproduction."},{"definition":"Of, or relating to the genitalia."},{"definition":"Of, or relating to psychosexual development during puberty."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"genital-us","text":"/ˈdʒɛnətəl/"}]},{"word":"ANALOGY","idx":16295,"count":2263449,"meanings":[{"definitions":[{"definition":"A relationship of resemblance or equivalence between two situations, people, or objects, especially when used as a basis for explanation or extrapolation."},{"definition":"The proportion or the equality of ratios."},{"definition":"(grammar) The correspondence of a word or phrase with the genius of a language, as learned from the manner in which its words and phrases are ordinarily formed; similarity of derivative or inflectional processes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"analogy-us","text":"/əˈnæləd͡ʒi/"}]},{"word":"INSOMNIA","idx":16296,"count":2263184,"meanings":[{"definitions":[{"definition":"A sleeping disorder that is known for its symptoms of unrest and the inability to sleep."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"insomnia-us","text":"/ɪnˈsɒmniə/"}]},{"word":"CONSTITUENT","idx":16297,"count":2263143,"meanings":[{"definitions":[{"definition":"A part, or component of a whole"},{"definition":"A person or thing which constitutes, determines, or constructs"},{"definition":"A resident of an area represented by an elected official"},{"definition":"A voter of an area represented by an elected official"},{"definition":"A voter of a [political] candidate. A supporter of a cause"},{"definition":"One who appoints another to act for him as attorney in fact"},{"definition":"(grammar) A functional element of a phrase or clause"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Being a part, or component of a whole"},{"definition":"Authorized to make a constitution"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"constituent-us"},{"audio":"constituent-uk"}]},{"word":"AURA","idx":16298,"count":2263012,"meanings":[{"definitions":[{"definition":"Distinctive atmosphere or quality associated with something."},{"definition":"An invisible force surrounding a living creature."},{"definition":"Perceptual disturbance experienced by some migraine sufferers before a migraine headache."},{"definition":"Telltale sensation experienced by some people with epilepsy before a seizure."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"aura-uk","text":"/ˈɔːɹə/"}]},{"word":"SPONGE","idx":16300,"count":2262717,"meanings":[{"definitions":[{"definition":"Any of various marine invertebrates, mostly of the phylum Porifera, that have a porous skeleton often of silica."},{"definition":"A piece of porous material used for washing (originally made from the invertebrates, now often made of plastic)."},{"definition":"A porous material such as sponges consist of."},{"definition":"A heavy drinker."},{"definition":"A type of light cake."},{"definition":"A type of steamed pudding."},{"definition":"A person who takes advantage of the generosity of others (abstractly imagined to absorb or soak up the money or efforts of others like a sponge)."},{"definition":"A form of contraception that is inserted vaginally; a contraceptive sponge."},{"definition":"Any sponge-like substance."},{"definition":"A mop for cleaning the bore of a cannon after a discharge. It consists of a cylinder of wood, covered with sheepskin with the wool on, or cloth with a heavy looped nap, and having a handle, or staff."},{"definition":"The extremity, or point, of a horseshoe, corresponding to the heel."},{"definition":"A nuclear power plant worker routinely exposed to radiation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take advantage of the kindness of others.","example":"He has been sponging off his friends for a month now."},{"definition":"To get by imposition; to scrounge.","example":"to sponge a breakfast"},{"definition":"To deprive (somebody) of something by imposition."},{"definition":"To clean, soak up, or dab with a sponge."},{"definition":"To suck in, or imbibe, like a sponge."},{"definition":"To wipe out with a sponge, as letters or writing; to efface; to destroy all trace of."},{"definition":"To be converted, as dough, into a light, spongy mass by the agency of yeast or leaven."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sponge-us","text":"/spʌnd͡ʒ/"}]},{"word":"CAJUN","idx":16301,"count":2262690,"meanings":[{"definitions":[{"definition":"Relating to the Cajun people or their culture."},{"definition":"Of spicy food prepared in the style of the Cajun cuisine."}],"partOfSpeech":"j"}]},{"word":"ALGEBRAIC","idx":16303,"count":2262216,"meanings":[{"definitions":[{"definition":"Of, or relating to, algebra."},{"definition":"(of an expression, equation or function) Containing only numbers, letters and arithmetic operators."},{"definition":"(of a number) Which is a root of some polynomial whose coefficients are rational."},{"definition":"(of a field) Whose every element is a root of some polynomial whose coefficients are rational."},{"definition":"(of notation) Describing squares by file (referred to in intrinsic order rather than by the piece starting on that file) and rank, both with reference to a fixed point rather than a player-dependent perspective."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌældʒɪˈbɹeɪɪk/"}]},{"word":"SECT","idx":16304,"count":2262094,"meanings":[{"definitions":[{"definition":"An offshoot of a larger religion; a group sharing particular (often unorthodox) political and/or religious beliefs.","example":"A religious sect."},{"definition":"A group following a specific ideal or a leader."},{"definition":"A cutting; a scion."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sect-us","text":"/sɛkt/"}]},{"word":"DINER","idx":16306,"count":2261961,"meanings":[{"definitions":[{"definition":"One who dines."},{"definition":"A dining car in a railroad train."},{"definition":"A typically small restaurant, usually modeled after a railroad dining car, that serves lower-class fare, normally having a counter with stools along one side and booths on the other, and often decorated in 50s and 60s pop culture themes and playing popular music from those decades."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"diner-uk","text":"/ˈdaɪnə(ɹ)/"}]},{"word":"ANTICIPATION","idx":16307,"count":2261724,"meanings":[{"definitions":[{"definition":"The act of anticipating, taking up, placing, or considering something beforehand, or before the proper time in natural order.","example":"Often the anticipation of a shot is worse than the pain of the stick."},{"definition":"The eagerness associated with waiting for something to occur.","example":"He waited with great anticipation for Christmas to arrive."},{"definition":"Prepayment of a debt, generally in order to pay less interest."},{"definition":"Prolepsis."},{"definition":"A non-harmonic tone that is lower or higher than a note in the previous chord and a unison to a note in the next chord."},{"definition":"Hasty notion; intuitive preconception."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æn.tɪs.əˈpe.ʃən/"}]},{"word":"ENDURING","idx":16308,"count":2261346,"meanings":[{"definitions":[{"definition":"To continue or carry on, despite obstacles or hardships; to persist.","example":"The singer's popularity endured for decades."},{"definition":"To tolerate or put up with something unpleasant."},{"definition":"To last.","example":"Our love will endure forever."},{"definition":"To remain firm, as under trial or suffering; to suffer patiently or without yielding; to bear up under adversity; to hold out."},{"definition":"To suffer patiently.","example":"He endured years of pain."},{"definition":"To indurate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Endurance"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Long-lasting without significant alteration; continuing through time in the same relative state.","example":"an enduring belief in democracy"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɪnˈdɝɪŋ/"},{"text":"/ɪnˈdjɔːɹɪŋ/"}]},{"word":"WINTERS","idx":16313,"count":2260458,"meanings":[{"definitions":[{"definition":"Traditionally the fourth of the four seasons, typically regarded as being from December 23 to March 20 in continental regions of the Northern Hemisphere or the months of June, July and August in the Southern Hemisphere. It is the time when the sun is lowest in the sky, resulting in short days, and the time of year with the lowest atmospheric temperatures for the region."},{"definition":"The period of decay, old age, death, or the like."},{"definition":"Someone with dark skin, eyes and hair, seen as best suited to certain colors of clothing."},{"definition":"An appliance to be fixed on the front of a grate, to keep a kettle warm, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To spend the winter (in a particular place).","example":"When they retired, they hoped to winter in Florida."},{"definition":"To store something (for instance animals) somewhere over winter to protect it from cold."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In the winter.","example":"They ski winters in the Laurentians."}],"partOfSpeech":"v"}]},{"word":"NOUS","idx":16314,"count":2259869,"meanings":[{"definitions":[{"definition":"The mind or intellect, reason, both rational and emotional"},{"definition":"In Neoplatonism, the divine reason, regarded as first divine emanation."},{"definition":"Common sense; practical intelligence."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/naʊs/"}]},{"word":"EXPLOSIVES","idx":16315,"count":2259785,"meanings":[{"definitions":[{"definition":"Any explosive substance."}],"partOfSpeech":"n"}]},{"word":"MOUND","idx":16316,"count":2259654,"meanings":[{"definitions":[{"definition":"An artificial hill or elevation of earth; a raised bank; an embankment thrown up for defense"},{"definition":"A natural elevation appearing as if thrown up artificially; a regular and isolated hill, hillock, or knoll."},{"definition":"Elevated area of dirt upon which the pitcher stands to pitch."},{"definition":"A ball or globe forming part of the regalia of an emperor or other sovereign. It is encircled with bands, enriched with precious stones, and surmounted with a cross."},{"definition":"The mons veneris."},{"definition":"(measurement) A hand."},{"definition":"A protection; restraint; curb."},{"definition":"A helmet."},{"definition":"Might; size."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To fortify with a mound; add a barrier, rampart, etc. to."},{"definition":"To force or pile into a mound or mounds.","example":"He mounded up his mashed potatoes so they left more space on the plate for the meat."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mound-au","text":"/maʊnd/"}]},{"word":"BACKGAMMON","idx":16318,"count":2259134,"meanings":[{"definitions":[{"definition":"A board game for two players in which each has 15 stones which move between 24 triangular points according to the roll of a pair of dice; the object is to move all of one's pieces around, and bear them off the board."},{"definition":"A victory in the game when the loser has not borne off a stone, and still has one or more stones in the winner's inner home row or on the bar."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To win at a backgammon game with the opponent having one or more pieces in the winner’s inner home row or on the bar."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbæk.ɡæm.ən/"}]},{"word":"OX","idx":16320,"count":2258722,"meanings":[{"definitions":[{"definition":"An adult castrated male of cattle (B. taurus)."},{"definition":"Any bovine animal (genus Bos). A neat, a beef."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɑks/"},{"text":"/ˈɒks/"},{"audio":"ox-ca"}]},{"word":"CHROMATOGRAPHY","idx":16321,"count":2258524,"meanings":[{"definitions":[{"definition":"Any of various techniques for the qualitative or quantitative separation of the components of mixtures of compounds; all characterised by the use of a mobile phase (gas or liquid) moving relative to a stationary phase (liquid or solid) - the differences between the rates of migration of the compounds between the two phases effects the separation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌkɹəʊ.məˈtɒɡɹə.fi/"}]},{"word":"OVERDOSE","idx":16322,"count":2258473,"meanings":[{"definitions":[{"definition":"An excessive and dangerous dose of a drug.","example":"die of a heroin overdose."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dose excessively, to take an overdose.","example":"Be careful not to overdose on those pills."},{"definition":"To indulge in something excessively."},{"definition":"To dose to excess; to give an overdose, or too many doses, to."}],"partOfSpeech":"ve"}]},{"word":"NAD","idx":16323,"count":2257673,"meanings":[{"definitions":[{"definition":"Noun animate dependent"},{"definition":"(mostly plural) testicle"}],"partOfSpeech":"n"}]},{"word":"SNATCH","idx":16325,"count":2256983,"meanings":[{"definitions":[{"definition":"A quick grab or catch.","example":"The leftfielder makes a nice snatch to end the inning."},{"definition":"A competitive weightlifting event in which a barbell is lifted from the platform to locked arms overhead in a smooth continuous movement."},{"definition":"A piece of some sound, usually music or conversation.","example":"I heard a snatch of Mozart as I passed the open window."},{"definition":"The vulva."},{"definition":"A brief period of exertion."},{"definition":"A catching of the voice."},{"definition":"A hasty snack; a bite to eat."},{"definition":"A quibble."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grasp and remove quickly.","example":"He snatched up the phone."},{"definition":"To attempt to seize something suddenly.","example":"to snatch at a rope"},{"definition":"To take or seize hastily, abruptly, or without permission or ceremony.","example":"to snatch a kiss"},{"definition":"To steal.","example":"Someone has just snatched my purse!"},{"definition":"(by extension) To take (a victory) at the last moment."},{"definition":"To do something quickly in the limited time available.","example":"He snatched a glimpse of her while her mother had her back turned."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"snatch-us","text":"/snætʃ/"}]},{"word":"MOLE","idx":16327,"count":2256537,"meanings":[{"definitions":[{"definition":"A pigmented spot on the skin, a naevus, slightly raised, and sometimes hairy."},{"definition":"Any of several small, burrowing insectivores of the family Talpidae."},{"definition":"Any of the burrowing rodents also called mole rats."},{"definition":"An internal spy, a person who involves himself or herself with an enemy organisation, especially an intelligence or governmental organisation, to determine and betray its secrets from within."},{"definition":"A kind of self-propelled excavator used to form underground drains, or to clear underground pipelines"},{"definition":"A type of underground drain used in farm fields, in which a mole plow creates an unlined channel through clay subsoil."},{"definition":"A moll, a bitch, a slut."},{"definition":"A massive structure, usually of stone, used as a pier, breakwater or junction between places separated by water."},{"definition":"A haven or harbour, protected with such a breakwater."},{"definition":"An Ancient Roman mausoleum."},{"definition":"In the International System of Units, the base unit of amount of substance; the amount of substance of a system which contains as many elementary entities (atoms, ions, molecules, etc.) as there are atoms in 0.012 kg of carbon-12. Symbol: mol. The number of atoms is known as Avogadro’s number."},{"definition":"A hemorrhagic mass of tissue in the uterus caused by a dead ovum."},{"definition":"One of several spicy sauces typical of the cuisine of Mexico and neighboring Central America, especially the sauce which contains chocolate and which is used in cooking main dishes, not desserts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"mole-1-us","text":"/mol/"}]},{"word":"OBS","idx":16328,"count":2256448,"meanings":[{"definitions":[{"definition":"Observation(s) (blood pressure, temperature, etc)."},{"definition":"Police observation"},{"definition":"An observation hut."},{"definition":"A halfpenny"},{"definition":"An objection"},{"definition":"The obese gene"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Abbreviation of observed"},{"definition":"(of words, equipment, etc.) No longer in use; gone into disuse; disused or neglected (often by preference for something newer, which replaces the subject).","example":"It is speculated that, within a few years, the Internet's speedy delivery of news worldwide will make newspapers obsolete."},{"definition":"Imperfectly developed; not very distinct."}],"partOfSpeech":"j"}]},{"word":"OWED","idx":16329,"count":2256361,"meanings":[{"definitions":[{"definition":"To be under an obligation to give something back to someone or to perform some action for someone."},{"definition":"To have debt; to be in debt."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That owes."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"owed-us","text":"/oʊd/"}]},{"word":"LADYBOYS","idx":16332,"count":2256044,"meanings":[{"definitions":[{"definition":"A trans woman or transfeminine person in or from Asia."}],"partOfSpeech":"n"}]},{"word":"ORGASMS","idx":16333,"count":2254938,"meanings":[{"definitions":[{"definition":"A spasm or sudden contraction."},{"definition":"A rush of sexual excitement; now specifically, the climax or peak of sexual pleasure, which occurs during sexual activity and which in males may include ejaculation and in females vaginal contractions.","example":"If you want to get an orgasm, I recommend buying a vibrator."},{"definition":"A creamy white alcoholic cocktail containing amaretto, Irish cream, and coffee liqueur."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have an orgasm."}],"partOfSpeech":"ve"}]},{"word":"KISSED","idx":16336,"count":2254272,"meanings":[{"definitions":[{"definition":"To touch with the lips or press the lips against, usually to show love or affection or passion, or as part of a greeting."},{"definition":"To (cause to) touch lightly or slightly; to come into contact.","example":"His ball kissed the black into the corner pocket."},{"definition":"Of two or more people, to touch each other's lips together, usually to express love or affection or passion."},{"definition":"To treat with fondness."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"kissed-us","text":"/kɪst/"}]},{"word":"BUFF","idx":16337,"count":2254017,"meanings":[{"definitions":[{"definition":"Undyed leather from the skin of buffalo or similar animals."},{"definition":"A tool, often one covered with buff leather, used for polishing."},{"definition":"A brownish yellow colour."},{"definition":"A military coat made of buff leather."},{"definition":"A person who is very interested in a particular subject; an enthusiast."},{"definition":"An effect that makes a character or item stronger.","example":"I just picked up an epic damage buff! Let's go gank the other team!"},{"definition":"Compressive coupler force that occurs during a slack bunched condition."},{"definition":"The bare skin.","example":"to strip to the buff"},{"definition":"The greyish viscid substance constituting the buffy coat."},{"definition":"A substance used to dilute (street) drugs in order to increase profits."},{"definition":"A buffet; a blow."},{"definition":"A buffalo, or the meat of a buffalo."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To polish and make shiny by rubbing.","example":"He was already buffing the car's hubs."},{"definition":"To make a character or an item stronger.","example":"I noticed that the pistols were buffed in the update."},{"definition":"To modify a medical chart, especially in a dishonest manner."},{"definition":"To strike."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of the color of buff leather, a brownish yellow."},{"definition":"Unusually muscular. (also buffed or buffed out)","example":"The bouncer was a big, buff dude with tattoos, a shaved head, and a serious scowl."},{"definition":"Physically attractive."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"buff-au","text":"/bʌf/"}]},{"word":"FREEZERS","idx":16338,"count":2253962,"meanings":[{"definitions":[{"definition":"An appliance or room used to store food or other perishable items at temperatures below 0° Celsius (32° Fahrenheit)."},{"definition":"The section of a refrigerator used to store food or other perishable items at a temperature below 0° Celsius (32° Fahrenheit)."},{"definition":"(Parkinson's disease) A Parkinson's disease patient that experiences freezing of gait (FOG) episodes."}],"partOfSpeech":"n"}]},{"word":"BUTCHER","idx":16339,"count":2253885,"meanings":[{"definitions":[{"definition":"A person who prepares and sells meat (and sometimes also slaughters the animals)."},{"definition":"A brutal or indiscriminate killer."},{"definition":"(from butcher's hook) A look."},{"definition":"A person who sells candy, drinks, etc. in theatres, trains, circuses, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To slaughter (animals) and prepare (meat) for market."},{"definition":"To kill brutally."},{"definition":"To ruin (something), often to the point of defamation.","example":"The band at that bar really butchered \"Hotel California\"."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(originally Polari) Very masculine, with a masculine appearance or attitude."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"butcher-us","text":"/ˈbʊt͡ʃ.ɚ/"}]},{"word":"PSALMS","idx":16340,"count":2253800,"meanings":[{"definitions":[{"definition":"A sacred song; a poetical composition for use in the praise or worship of God."},{"definition":"One of the hymns by David and others, collected into one book of the Old Testament, or a modern metrical version of such a hymn for public worship."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɑlmz/"},{"text":"/sɑːmz/"}]},{"word":"RUM","idx":16341,"count":2253411,"meanings":[{"definitions":[{"definition":"A distilled spirit derived from fermented cane sugar and molasses.","example":"The Royal Navy used to issue a rum ration to sailors."},{"definition":"A serving of rum.","example":"Jake tossed down three rums."},{"definition":"A kind or brand of rum."},{"definition":"A queer or odd person or thing."},{"definition":"A country parson."},{"definition":"Any odd person or thing."},{"definition":"The card game rummy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Fine, excellent, valuable.","example":"having a rum time"},{"definition":"Strange, peculiar.","example":"a rum idea; a rum fellow"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"rum-us","text":"/ɹʌm/"}]},{"word":"CHEFS","idx":16344,"count":2252629,"meanings":[{"definitions":[{"definition":"The presiding cook in the kitchen of a large household."},{"definition":"The head cook of a restaurant or other establishment."},{"definition":"Any cook.","example":"Kiss the chef. (slogan on aprons used by home barbecue enthusiasts)"},{"definition":"One who manufactures illegal drugs; a cook."},{"definition":"A reliquary in the shape of a head."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ʃɛfs/"}]},{"word":"ENGRAVING","idx":16345,"count":2252004,"meanings":[{"definitions":[{"definition":"To carve text or symbols into (something), usually for the purposes of identification or art.","example":"He engraved the plaque with his name."},{"definition":"To carve (something) into a material.","example":"He engraved his name."},{"definition":"To put in a grave, to bury."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The practice of incising a design onto a hard, flat surface, by cutting grooves into it."},{"definition":"The art of producing an image from an engraved printing form, typically made of copper."},{"definition":"A print produced from an engraving."},{"definition":"The art of drawing music notation at high quality, particularly on a computer."}],"partOfSpeech":"n"}]},{"word":"CONSTITUTED","idx":16347,"count":2251515,"meanings":[{"definitions":[{"definition":"To set up; to establish; to enact."},{"definition":"To make up; to compose; to form."},{"definition":"To appoint, depute, or elect to an office; to make and empower."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkɑnstɪtutɪd/"},{"text":"/ˈkɒnstɪtjuːtɪd/"}]},{"word":"GASTROINTESTINAL","idx":16348,"count":2251383,"meanings":[{"definitions":[{"definition":"Of or pertaining to the stomach and intestines, and thus to digestion."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɡæstɹoʊɪnˈtɛstɪnəl/"}]},{"word":"HAMLET","idx":16349,"count":2251257,"meanings":[{"definitions":[{"definition":"A small village or a group of houses."},{"definition":"A village that does not have its own church."},{"definition":"Any of the fish of the genus Hypoplectrus in the family Serranidae."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hamlet-uk","text":"/ˈhæm.lət/"}]},{"word":"PAGERANK","idx":16351,"count":2250150,"meanings":[{"definitions":[{"definition":"Any of several ranks assigned to a webpage by a search engine"}],"partOfSpeech":"n"}]},{"word":"CLAD","idx":16355,"count":2247938,"meanings":[{"definitions":[{"definition":"(past tense clad) To clothe."},{"definition":"(past tense clad or cladded) To cover (with insulation or another material); to surround, envelop."},{"definition":"(figuratively) To imbue (with a specified quality)"},{"definition":"To adorn or cover with clothing; to dress; to supply clothes or clothing.","example":"to feed and clothe a family; to clothe oneself extravagantly"},{"definition":"To cover or invest, as if with a garment.","example":"to clothe somebody with authority or power"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(in compounds) Wearing clothing of a specified type."},{"definition":"(in compounds) Covered, enveloped in or surrounded by a specified material or substance."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"clad-uk","text":"/klæd/"}]},{"word":"EXCURSION","idx":16356,"count":2247674,"meanings":[{"definitions":[{"definition":"A brief recreational trip; a journey out of the usual way.","example":"While driving home I took an excursion and saw some deer."},{"definition":"A wandering from the main subject: a digression."},{"definition":"A deviation in pitch, for example in the syllables of enthusiastic speech."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To go on a recreational trip or excursion."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"excursion-us","text":"/ɛks.kɜː(ɹ).ʃən/"}]},{"word":"ORB","idx":16360,"count":2247433,"meanings":[{"definitions":[{"definition":"A spherical body; a globe; especially, one of the celestial spheres; a sun, planet, or star"},{"definition":"One of the azure transparent spheres conceived by the ancients to be enclosed one within another, and to carry the heavenly bodies in their revolutions"},{"definition":"A circle; especially, a circle, or nearly circular orbit, described by the revolution of a heavenly body; an orbit"},{"definition":"A period of time marked off by the revolution of a heavenly body."},{"definition":"The eye, as luminous and spherical"},{"definition":"A revolving circular body; a wheel"},{"definition":"A sphere of action."},{"definition":"A globus cruciger; a ceremonial sphere used to represent royal power"},{"definition":"A translucent sphere appearing in flash photography (Orb (optics))"},{"definition":"A body of soldiers drawn up in a circle, as for defence, especially infantry to repel cavalry."},{"definition":"A blank window or panel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into an orb or circle."},{"definition":"To become round like an orb."},{"definition":"To encircle; to surround; to enclose."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"orb-uk","text":"/ɔː(ɹ)b/"}]},{"word":"GRANGE","idx":16361,"count":2247323,"meanings":[{"definitions":[{"definition":"A granary."},{"definition":"A farm, with its associated buildings; a farmhouse or manor."},{"definition":"A lodge of the Patrons of Husbandry, a fraternal organization."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɡɹeɪndʒ/"}]},{"word":"MEGAPIXELS","idx":16364,"count":2246607,"meanings":[{"definitions":[{"definition":"One million pixels, used as a unit of resolution of digital cameras.","example":"This camera has a resolution of three megapixels."}],"partOfSpeech":"n"}]},{"word":"RESIGNED","idx":16365,"count":2246288,"meanings":[{"definitions":[{"definition":"To sign again; to provide one's signature again."},{"definition":"(by extension) To sign a contract renewing or restarting a professional relationship, such as that of a professional athlete with a sports team."},{"definition":"To give up; to relinquish ownership of."},{"definition":"To hand over (something to someone), place into the care or control of another."},{"definition":"To quit (a job or position).","example":"He resigned the crown to follow his heart."},{"definition":"To submit passively; to give up as hopeless or inevitable.","example":"After fighting for so long, she finally resigned to her death."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Characterized by resignation or acceptance."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹɪˈzaɪnd/"}]},{"word":"RETRIEVER","idx":16366,"count":2245974,"meanings":[{"definitions":[{"definition":"One who retrieves something."},{"definition":"A type of gun dog that retrieves game for a hunter."},{"definition":"A tool for retrieving materials from the body after an operation."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹiˈtɹivəɹ/"}]},{"word":"FLED","idx":16367,"count":2245856,"meanings":[{"definitions":[{"definition":"To run away; to escape.","example":"The prisoner tried to flee, but was caught by the guards."},{"definition":"To escape from.","example":"Many people fled the country as war loomed."},{"definition":"To disappear quickly; to vanish.","example":"Ethereal products flee once freely exposed to air."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fled-us","text":"/ˈflɛd/"}]},{"word":"ENRICHED","idx":16369,"count":2245731,"meanings":[{"definitions":[{"definition":"To enhance."},{"definition":"To make (someone or something) rich or richer.","example":"Hobbies enrich lives."},{"definition":"To adorn, ornate more richly."},{"definition":"To add nutrients or fertilizer to the soil; to fertilize."},{"definition":"To increase the amount of one isotope in a mixture of isotopes, especially in a nuclear fuel."},{"definition":"To add nutrients to foodstuffs; to fortify"},{"definition":"To make to rise the proportion of a given constituent."},{"definition":"To add new elements, to complete."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"enriched-us"}]},{"word":"BRANDY","idx":16371,"count":2245535,"meanings":[{"definitions":[{"definition":"An alcoholic liquor distilled from wine or fermented fruit juice."},{"definition":"Any variety of brandy."},{"definition":"A glass of brandy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To preserve, flavour, or mix with brandy."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈbɹændi/"}]},{"word":"SWINGS","idx":16372,"count":2245409,"meanings":[{"definitions":[{"definition":"The manner in which something is swung.","example":"Door swing indicates direction the door opens."},{"definition":"The sweep or compass of a swinging body."},{"definition":"A line, cord, or other thing suspended and hanging loose, upon which anything may swing."},{"definition":"A hanging seat in a children's playground, for acrobats in a circus, or on a porch for relaxing."},{"definition":"A dance style."},{"definition":"The genre of music associated with this dance style."},{"definition":"The amount of change towards or away from something."},{"definition":"Sideways movement of the ball as it flies through the air."},{"definition":"Capacity of a turning lathe, as determined by the diameter of the largest object that can be turned in it."},{"definition":"In a musical theater production, a performer who understudies several roles."},{"definition":"A basic dance step in which a pair link hands and turn round together in a circle."},{"definition":"Free course; unrestrained liberty."},{"definition":"Influence or power of anything put in motion."},{"definition":"A type of hook with the arm more extended."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To rotate about an off-centre fixed point.","example":"The plant swung in the breeze."},{"definition":"To dance."},{"definition":"To ride on a swing.","example":"The children laughed as they swung."},{"definition":"To participate in the swinging lifestyle; to participate in wife-swapping."},{"definition":"To hang from the gallows."},{"definition":"(of a ball) to move sideways in its trajectory."},{"definition":"To fluctuate or change.","example":"It wasn't long before the crowd's mood swung towards restless irritability."},{"definition":"To move (an object) backward and forward; to wave.","example":"He swung his sword as hard as he could."},{"definition":"To change (a numerical result); especially to change the outcome of an election."},{"definition":"To make (something) work; especially to afford (something) financially.","example":"If it’s not too expensive, I think we can swing it."},{"definition":"To play notes that are in pairs by making the first of the pair slightly longer than written (augmentation) and the second shorter, resulting in a bouncy, uneven rhythm."},{"definition":"(of a bowler) to make the ball move sideways in its trajectory."},{"definition":"To move one's arm in a punching motion."},{"definition":"In dancing, to turn around in a small circle with one's partner, holding hands or arms.","example":"\"to swing one's partner\", or simply \"to swing\""},{"definition":"To admit or turn something for the purpose of shaping it; said of a lathe.","example":"The lathe can swing a pulley of 12 inches diameter."},{"definition":"To put (a door, gate, etc.) on hinges so that it can swing or turn."},{"definition":"To turn round by action of wind or tide when at anchor.","example":"A ship swings with the tide."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/swɪŋz/"}]},{"word":"SCION","idx":16374,"count":2245350,"meanings":[{"definitions":[{"definition":"A descendant, especially a first-generation descendant of a distinguished family."},{"definition":"The heir to a throne."},{"definition":"A guardian."},{"definition":"A detached shoot or twig containing buds from a woody plant, used in grafting; a shoot or twig in a general sense."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"scion-us","text":"/ˈsaɪ.ɑn/"}]},{"word":"REPTILES","idx":16376,"count":2245176,"meanings":[{"definitions":[{"definition":"A cold-blooded vertebrate of the class Reptilia."},{"definition":"A mean or grovelling person."}],"partOfSpeech":"n"}]},{"word":"VORTEX","idx":16378,"count":2244809,"meanings":[{"definitions":[{"definition":"A whirlwind, whirlpool, or similarly moving matter in the form of a spiral or column."},{"definition":"Anything that involves constant violent or chaotic activity around some centre.","example":"2004: the consumer vortex that is East Hampton — The New Yorker, 30 August 2004, p.38"},{"definition":"Anything that inevitably draws surrounding things into its current."},{"definition":"A supposed collection of particles of very subtle matter, endowed with a rapid rotary motion around an axis which was also the axis of a sun or planet; part of a Cartesian theory accounting for the formation of the universe, and the movements of the bodies composing it."},{"definition":"Any of numerous species of small Turbellaria belonging to Vortex and allied genera."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"vortex-us","text":"/ˈvɔɹtɛks/"}]},{"word":"SWALLOWING","idx":16379,"count":2244613,"meanings":[{"definitions":[{"definition":"To cause (food, drink etc.) to pass from the mouth into the stomach; to take into the stomach through the throat."},{"definition":"To take (something) in so that it disappears; to consume, absorb."},{"definition":"To take food down into the stomach; to make the muscular contractions of the oesophagus to achieve this, often taken as a sign of nervousness or strong emotion.","example":"My throat was so sore that I was unable to swallow."},{"definition":"To accept easily or without questions; to believe, accept."},{"definition":"To engross; to appropriate; usually with up."},{"definition":"To retract; to recant.","example":"to swallow one's opinions"},{"definition":"To put up with; to bear patiently or without retaliation.","example":"to swallow an affront or insult"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of swallowing."}],"partOfSpeech":"n"}]},{"word":"PURSES","idx":16381,"count":2244577,"meanings":[{"definitions":[{"definition":"A small bag for carrying money."},{"definition":"A handbag (small bag usually used by women for carrying various small personal items)"},{"definition":"A quantity of money given for a particular purpose."},{"definition":"A specific sum of money in certain countries: formerly 500 piastres in Turkey or 50 tomans in Persia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To press (one's lips) in and together so that they protrude."},{"definition":"To draw up or contract into folds or wrinkles; to pucker; to knit."},{"definition":"To put into a purse."},{"definition":"To steal purses; to rob."}],"partOfSpeech":"ve"}]},{"word":"BODILY","idx":16382,"count":2243749,"meanings":[{"definitions":[{"definition":"Of, relating to, or concerning the body.","example":"His bodily deficiencies were a heavy burden to him."},{"definition":"Having a body or material form; physical; corporeal."},{"definition":"Real; actual; put into execution."}],"partOfSpeech":"j"},{"definitions":[{"definition":"In bodily form; physically, corporally."},{"definition":"Pertaining to the whole body or mass; wholly."},{"definition":"Forcefully, vigorously.","example":"He was thrown bodily out of the house."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"bodily-us","text":"/ˈbɑdɪli/"}]},{"word":"AWE","idx":16385,"count":2241800,"meanings":[{"definitions":[{"definition":"A feeling of fear and reverence."},{"definition":"A feeling of amazement."},{"definition":"Power to inspire awe."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To inspire fear and reverence in."},{"definition":"To control by inspiring dread."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɔ/"}]},{"word":"STANDALONE","idx":16388,"count":2241569,"meanings":[{"definitions":[{"definition":"A device that can operate on its own, rather than as an accessory for another device."},{"definition":"(by extension) Something that is not a part of some series or sequence."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Operating, functioning, or existing without additions or assistance; independent; able to be separate or separated.","example":"They offer an inexpensive add-on for a computer, or a stand-alone system with all the functions built in."}],"partOfSpeech":"j"}]},{"word":"HOODS","idx":16391,"count":2240850,"meanings":[{"definitions":[{"definition":"A covering for the head attached to a larger garment such as a jacket or cloak."},{"definition":"A distinctively coloured fold of material, representing a university degree."},{"definition":"An enclosure that protects something, especially from above."},{"definition":"A soft top of a convertible car or carriage."},{"definition":"The hinged cover over the engine of a motor vehicle: known as a bonnet in other countries."},{"definition":"A metal covering that leads to a vent to suck away smoke or fumes."},{"definition":"Gangster, thug."},{"definition":"Neighborhood.","example":"What’s goin’ down in the hood?"},{"definition":"Person wearing a hoodie."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover something with a hood."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hʊdz/"}]},{"word":"ANTITRUST","idx":16392,"count":2240438,"meanings":[{"definitions":[{"definition":"Opposed to or against the establishment or existence of trusts (monopolies), usually referring to legislation.","example":"The regulators used antitrust laws to block the merger, believing it would eliminate competition."}],"partOfSpeech":"j"}]},{"word":"EQUINE","idx":16393,"count":2240303,"meanings":[{"definitions":[{"definition":"Any horse or horse-like animal, especially one of the genus Equus."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or relating to a horse or horses."},{"definition":"Of or relating to any member or members of the genus Equus."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈiːkwaɪn/"}]},{"word":"BROS","idx":16394,"count":2240209,"meanings":[{"definitions":[{"definition":"Brother; a male sibling"},{"definition":"Brother; a male comrade or friend; one who shares one’s ideals."},{"definition":"Brother; usually used to address a male"},{"definition":"Fratboy or someone that espouses the fraternity bro culture"}],"partOfSpeech":"n"}]},{"word":"FIREPLACES","idx":16395,"count":2240184,"meanings":[{"definitions":[{"definition":"An open hearth for holding a fire at the base of a chimney."}],"partOfSpeech":"n"}]},{"word":"PROTO","idx":16396,"count":2240138,"meanings":[{"definitions":[{"definition":"Prototypical; preceding the proper beginning of something"}],"partOfSpeech":"j"}]},{"word":"REQUISITE","idx":16398,"count":2239862,"meanings":[{"definitions":[{"definition":"An indispensable item; a requirement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Essential, indispensable, required.","example":"Please submit the requisite papers before the end of the financial year."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"requisite-us","text":"/ˈɹɛkwɪzɪt/"}]},{"word":"RETROSPECTIVE","idx":16399,"count":2239656,"meanings":[{"definitions":[{"definition":"An exhibition of works from an extended period of an artist's activity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or contemplating the past."},{"definition":"Looking backwards."},{"definition":"Affecting or influencing past things; retroactive."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɹɛtɹə(ʊ)ˈspɛktɪv/"}]},{"word":"EMPHASIZES","idx":16400,"count":2238517,"meanings":[{"definitions":[{"definition":"To stress, give emphasis or extra weight to (something).","example":"His two-fingered gesture emphasized what he had told his boss to do with his job."}],"partOfSpeech":"ve"}]},{"word":"LIZARD","idx":16401,"count":2238343,"meanings":[{"definitions":[{"definition":"Any reptile of the order Squamata that is not a snake, usually having four legs, external ear openings, movable eyelids and a long slender body and tail."},{"definition":"(chiefly in attributive use) Lizard skin, the skin of these reptiles."},{"definition":"An unctuous person."},{"definition":"A coward."},{"definition":"(rock paper scissors) A hand forming a \"D\" shape with the tips of the thumb and index finger touching (a handshape resembling a lizard), that beats paper and Spock and loses to rock and scissors in rock-paper-scissors-lizard-Spock."},{"definition":"(in compounds) A person who idly spends time in a specified place, especially a promiscuous female.","example":"lounge lizard; lot lizard; beach lizard; truck stop lizard"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"lizard-us","text":"/ˈlɪz.ɚd/"}]},{"word":"BOUQUETS","idx":16404,"count":2237840,"meanings":[{"definitions":[{"definition":"A bunch of cut flowers.","example":"For my birthday I received two bouquets."},{"definition":"The scent of a particular wine.","example":"This Bordeaux has an interesting bouquet."},{"definition":"The heart note of a perfume.","example":"The remarkable flower bouquet lasts for hours until it dissolves into a sweet vanilla smell."},{"definition":"A compliment or expression of praise."},{"definition":"A bouquet of circles."},{"definition":"The reserve of cards in the game of Flower Garden and variations."},{"definition":"The ninth Lenormand card, sometimes called Flowers instead."}],"partOfSpeech":"n"}]},{"word":"DAL","idx":16405,"count":2237668,"meanings":[{"definitions":[{"definition":"Any of many dried husked pulses (legume), including peas, beans and lentils."},{"definition":"A dish made from lentils, cooked with spices, tomatoes and onions etc."},{"definition":"A tropical herb with yellow flowers; the pigeon pea."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dal-uk","text":"/dɑːl/"}]},{"word":"WEARS","idx":16406,"count":2237421,"meanings":[{"definitions":[{"definition":"To carry or have equipped on or about one's body, as an item of clothing, equipment, decoration, etc.","example":"He's wearing some nice pants today.  She wore her medals with pride.  Please wear your seatbelt.  Can you wear makeup and sunscreen at the same time?  He was wearing his lunch after tripping and falling into the buffet."},{"definition":"To have or carry on one's person habitually, consistently; or, to maintain in a particular fashion or manner.","example":"He wears eyeglasses.  She wears her hair in braids."},{"definition":"To bear or display in one's aspect or appearance.","example":"She wore a smile all day.  He walked out of the courtroom wearing an air of satisfaction."},{"definition":"(with \"it\") To overcome one's reluctance and endure a (previously specified) situation.","example":"I know you don't like working with him, but you'll just have to wear it."},{"definition":"To eat away at, erode, diminish, or consume gradually; to cause a gradual deterioration in; to produce (some change) through attrition, exposure, or constant use.","example":"You're going to wear a hole in the bottom of those shoes.  The water has slowly worn a channel into these rocks.  Long illness had worn the bloom from her cheeks.  Exile had worn the man to a shadow."},{"definition":"To undergo gradual deterioration; become impaired; be reduced or consumed gradually due to any continued process, activity, or use.","example":"The tiles were wearing thin due to years of children's feet."},{"definition":"To exhaust, fatigue, expend, or weary.","example":"His neverending criticism has finally worn my patience.  Toil and care soon wear the spirit.  Our physical advantage allowed us to wear the other team out and win."},{"definition":"To last or remain durable under hard use or over time; to retain usefulness, value, or desirable qualities under any continued strain or long period of time; sometimes said of a person, regarding the quality of being easy or difficult to tolerate.","example":"Don't worry, this fabric will wear. These pants will last you for years.  This color wears so well. I must have washed this sweater a thousand times.  I have to say, our friendship has worn pretty well.  It's hard to get to know him, but he wears well."},{"definition":"(in the phrase \"wearing on (someone)\") To cause annoyance, irritation, fatigue, or weariness near the point of an exhaustion of patience.","example":"Her high pitched voice is really wearing on me lately."},{"definition":"(of time) To pass slowly, gradually or tediously.","example":"wear on, wear away.  As the years wore on, we seemed to have less and less in common."},{"definition":"To bring (a sailing vessel) onto the other tack by bringing the wind around the stern (as opposed to tacking when the wind is brought around the bow); to come round on another tack by turning away from the wind. Also written \"ware\". Past: weared, or wore/worn."},{"definition":"To guard; watch; keep watch, especially from entry or invasion."},{"definition":"To defend; protect."},{"definition":"To ward off; prevent from approaching or entering; drive off; repel.","example":"to wear the wolf from the sheep"},{"definition":"To conduct or guide with care or caution, as into a fold or place of safety."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An adjustable dam placed across a river to regulate the flow of water downstream."},{"definition":"A fence placed across a river to catch fish."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"wears-us","text":"/wɛɹz/"}]},{"word":"ANESTHESIA","idx":16407,"count":2237242,"meanings":[{"definitions":[{"definition":"An artificial method of preventing sensation, used to eliminate pain without causing loss of vital functions, by the administration of one or more agents which block pain impulses before transmitted to the brain."},{"definition":"The loss or prevention of sensation, as caused by anesthesia, lesion in the nervous system or other physical abnormality."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌæn.əsˈti.ʒə/"},{"text":"/ˌæn.əsˈθiːz.i.ə/"}]},{"word":"REGAL","idx":16411,"count":2236787,"meanings":[{"definitions":[{"definition":"Of or relating to royalty.","example":"regal authority;   the regal title"},{"definition":"Befitting a king, queen, emperor, or empress."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A small, portable organ whose sound is produced by beating reeds without amplifying resonators. Its tone is keen and rich in harmonics. The regal was common in the sixteenth and seventeenth centuries; today it has been revived for the performance of music from those times."},{"definition":"An organ stop of the reed family, furnished with a normal beating reed, but whose resonator is a fraction of its natural length. In the sixteenth and seventeenth centuries these stops took a multitude of forms. Today only one survives that is of universal currency, the so-called Vox Humana."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"regal-uk","text":"/ˈɹiːɡəl/"}]},{"word":"SAFEGUARDS","idx":16412,"count":2236324,"meanings":[{"definitions":[{"definition":"Something that serves as a guard or protection; a defense.","example":"Getting a flu shot is a good safeguard against illness."},{"definition":"One who, or that which, defends or protects; defence; protection."},{"definition":"A safe-conduct or passport, especially in time of war."},{"definition":"The monitor lizard."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To protect, to keep safe.","example":"She kept a savings to safeguard against debt and emergencies."},{"definition":"To escort safely."}],"partOfSpeech":"ve"}]},{"word":"CABBAGE","idx":16413,"count":2235882,"meanings":[{"definitions":[{"definition":"An edible plant (Brassica oleracea var. capitata) having a head of green leaves."},{"definition":"The leaves of this plant eaten as a vegetable.","example":"Cabbage is good for you."},{"definition":"A person with severely reduced mental capacities due to brain damage.","example":"After the car crash, he became a cabbage."},{"definition":"Used as a term of endearment."},{"definition":"Money."},{"definition":"Marijuana leaf, the part that is not smoked but from which cannabutter can be extracted."},{"definition":"The terminal bud of certain palm trees, used for food."},{"definition":"The cabbage palmetto (Sabal palmetto), a palm of the southeastern US coasts and nearby islands."},{"definition":"Scraps of cloth which are left after a garment has been cut out, which tailors traditionally kept."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a head like that of the cabbage.","example":"to make lettuce cabbage"},{"definition":"To do nothing; to idle; veg out."},{"definition":"To purloin or embezzle; to pilfer, to steal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cabbage-us","text":"/ˈkæbɪdʒ/"},{"audio":"cabbage-uk","text":"/ˈkæbɪdʒ/"}]},{"word":"CUB","idx":16414,"count":2235775,"meanings":[{"definitions":[{"definition":"A young fox."},{"definition":"(by extension) The young of certain other animals, including the bear, wolf, lion and tiger."},{"definition":"A child, especially an awkward, rude, ill-mannered boy."},{"definition":"A young man who seeks relationships with older women, or \"cougars\"."},{"definition":"A stall for cattle."},{"definition":"A cupboard."},{"definition":"A young, inexperienced reporter employed by a newspaper or magazine."},{"definition":"A person who is unsophisticated or of a lower class background but achieving a high salary, who spends money on flashy or trashy items to fulfil their aspirations of higher social status. The stereotype includes having speech and mannerisms that are considered to denote poor education and uncultured upbringing, which is reflected in their bad taste possessions and lifestyles."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give birth to cubs"},{"definition":"To hunt fox cubs"},{"definition":"To shut up or confine."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"cub-us"},{"text":"/kʌb/"}]},{"word":"WRONGFUL","idx":16416,"count":2235339,"meanings":[{"definitions":[{"definition":"Wrong or unjust"},{"definition":"Unlawful or illegal"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹɒŋfəl/"}]},{"word":"SPECTATOR","idx":16417,"count":2235338,"meanings":[{"definitions":[{"definition":"One who watches an event; especially, one held outdoors.","example":"The cheering spectators watched the fireworks."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"spectator-us","text":"/ˈspɛkteɪtɚ/"}]},{"word":"ARRESTS","idx":16418,"count":2235121,"meanings":[{"definitions":[{"definition":"A check, stop, an act or instance of arresting something."},{"definition":"The condition of being stopped, standstill."},{"definition":"The process of arresting a criminal, suspect etc."},{"definition":"A confinement, detention, as after an arrest."},{"definition":"A device to physically arrest motion."},{"definition":"The judicial detention of a ship to secure a financial claim against its operators."},{"definition":"Any seizure by power, physical or otherwise."},{"definition":"A scurfiness of the back part of the hind leg of a horse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stop the motion of (a person or animal)."},{"definition":"To stay, remain."},{"definition":"To stop or slow (a process, course etc.)."},{"definition":"To seize (someone) with the authority of the law; to take into legal custody.","example":"The police have arrested a suspect in the murder inquiry."},{"definition":"To catch the attention of."},{"definition":"To undergo cardiac arrest."}],"partOfSpeech":"ve"}]},{"word":"CIRCUMSTANCE","idx":16419,"count":2235074,"meanings":[{"definitions":[{"definition":"That which attends, or relates to, or in some way affects, a fact or event; an attendant thing or state of things."},{"definition":"An event; a fact; a particular incident."},{"definition":"Circumlocution; detail."},{"definition":"Condition in regard to worldly estate; state of property; situation; surroundings."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place in a particular situation, especially with regard to money or other resources."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"circumstance-us","text":"/ˈsɝ.kəm.ˌstæns/"}]},{"word":"SIGNAGE","idx":16420,"count":2234537,"meanings":[{"definitions":[{"definition":"Signs, particularly those imparting commercial, directional, or road traffic information, taken collectively.","example":"The signage at the airport is designed to point the way clearly to important locations."},{"definition":"A sign, a signboard."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"signage-uk","text":"/ˈsaɪnɪdʒ/"}]},{"word":"NUMBERING","idx":16421,"count":2233841,"meanings":[{"definitions":[{"definition":"To label (items) with numbers; to assign numbers to (items).","example":"Number the baskets so that we can find them easily."},{"definition":"To total or count; to amount to.","example":"I don’t know how many books are in the library, but they must number in the thousands."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A sequence of numbers indicating order or otherwise used for identification."},{"definition":"The action of creating or assigning such a sequence for identification."},{"definition":"The action of counting or ordering with numbers."}],"partOfSpeech":"n"}]},{"word":"ENCODE","idx":16423,"count":2233497,"meanings":[{"definitions":[{"definition":"To convert (plain text) into code."},{"definition":"(communication) To convert source information into another form."},{"definition":"To constitute the code necessary for the biosynthesis of a protein by means of a matrix so as to transcribe DNA material."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪnˈkoʊd/"},{"text":"/ɪnˈkəʊd/"}]},{"word":"MOC","idx":16425,"count":2233182,"meanings":[{"definitions":[{"definition":"Moccasin (type of shoe)"}],"partOfSpeech":"n"}]},{"word":"ACCOLADES","idx":16428,"count":2232640,"meanings":[{"definitions":[{"definition":"An expression of approval; praise."},{"definition":"A special acknowledgment; an award."},{"definition":"An embrace of greeting or salutation."},{"definition":"A salutation marking the conferring of knighthood, consisting of an embrace or a kiss, and a slight blow on the shoulders with the flat of a sword."},{"definition":"A brace used to join two or more staves."},{"definition":"Written Presidential certificate recognizing service by personnel who died or were wounded in action between 1917 and 1918, or who died in service between 1941 and 1947, or died of wounds received in Korea between June 27, 1950 and July 27, 1954. Service of civilians who died overseas or as a result of injury or disease contracted while serving in a civilian capacity with the United States Armed Forces during the dates and/or in areas prescribed is in like manner recognized."},{"definition":"An ornament composed of two ogee curves meeting in the middle, each concave toward its outer extremity and convex toward the point at which it meets the other. Such accolades are either plain or adorned with rich moldings, and are a frequent motive of decoration on the lintels of doors and windows of the fifteenth and sixteenth centuries, especially in secular architecture."},{"definition":"Either of the two characters { and }, i.e., left curly bracket left curly bracket and right curly bracket right curly bracket, with the shape of a curved, pointed line, having various uses in math, music, and computer programming."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To embrace or kiss in salutation."},{"definition":"To confer a knighthood on."},{"definition":"To confer praise or awards on.","example":"an accoladed novel"}],"partOfSpeech":"ve"}]},{"word":"SLICED","idx":16430,"count":2232434,"meanings":[{"definitions":[{"definition":"To cut into slices.","example":"Slice the cheese thinly."},{"definition":"To cut with an edge utilizing a drawing motion.","example":"The knife left sliced his arm."},{"definition":"To clear (e.g. a fire, or the grate bars of a furnace) by means of a slice bar."},{"definition":"To hit the shuttlecock with the racket at an angle, causing it to move sideways and downwards."},{"definition":"To hit a shot that slices (travels from left to right for a right-handed player)."},{"definition":"To angle the blade so that it goes too deeply into the water when starting to take a stroke."},{"definition":"To kick the ball so that it goes in an unintended direction, at too great an angle or too high."},{"definition":"To hit the ball with a stroke that causes a spin, resulting in the ball swerving or staying low after a bounce."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That has been cut into slices.","example":"sliced bread"}],"partOfSpeech":"j"}]},{"word":"REPRODUCTIONS","idx":16431,"count":2232254,"meanings":[{"definitions":[{"definition":"The act of reproducing new individuals biologically."},{"definition":"The act of making copies.","example":"Unauthorized reproduction of this article is prohibited."},{"definition":"A copy of something, as in a piece of art; a duplicate.","example":"Jim was proud of the Rembrandt reproduction he owned."}],"partOfSpeech":"n"}]},{"word":"INFERTILITY","idx":16433,"count":2231925,"meanings":[{"definitions":[{"definition":"The condition of being infertile; of having poor fertility.","example":"Soil infertility is a major problem for farmers."},{"definition":"The inability to conceive children.","example":"Infertility is a considerable obstacle for women wishing to make a family."}],"partOfSpeech":"n"}]},{"word":"SIDEWALK","idx":16435,"count":2231882,"meanings":[{"definitions":[{"definition":"A footpath, usually paved, at the side of a road for the use of pedestrians; a pavement (UK) or footpath (Australia, New Zealand)"},{"definition":"(by extension) any paved footpath, even if not located at the side of a road"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sidewalk-us","text":"/ˈsaɪdwɔːk/"}]},{"word":"PROB","idx":16436,"count":2231681,"meanings":[{"definitions":[{"definition":"In all likelihood."}],"partOfSpeech":"v"},{"definitions":[{"definition":"A difficulty that has to be resolved or dealt with.","example":"She's leaving because she faced numerous problems to do with racism."},{"definition":"A question to be answered, schoolwork exercise."},{"definition":"A puzzling circumstance."},{"definition":"Objection.","example":"You got a problem with that?"},{"definition":"A set of moves required to complete a climb"}],"partOfSpeech":"n"}]},{"word":"BREAKER","idx":16437,"count":2231387,"meanings":[{"definitions":[{"definition":"Something that breaks."},{"definition":"A machine for breaking rocks, or for breaking coal at the mines"},{"definition":"The building in which such a machine is placed."},{"definition":"A person who specializes in breaking things."},{"definition":"(chiefly in the plural) A wave breaking into foam against the shore, or against a sandbank, or a rock or reef near the surface, considered a useful warning to ships of an underwater hazard"},{"definition":"A breakdancer."},{"definition":"A user of CB radio."},{"definition":"One who works in shipbreaking."},{"definition":"A small cask of liquid kept permanently in a ship's boat in case of shipwreck."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɹeɪkɚ/"},{"text":"/ˈbɹeɪkə/"}]},{"word":"CURLY","idx":16438,"count":2231026,"meanings":[{"definitions":[{"definition":"A person or animal with curly hair."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having curls."},{"definition":"Curling in a direction, as opposed to straight (quotation marks or apostrophes)"},{"definition":"Complicated and difficult; knotty."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"curly-uk","text":"/ˈkɜːli/"}]},{"word":"SERVLET","idx":16439,"count":2230813,"meanings":[{"definitions":[{"definition":"(server) A Java program running on an Internet server that generates web content dynamically in response to requests from clients."}],"partOfSpeech":"n"}]},{"word":"COLLAGE","idx":16441,"count":2230355,"meanings":[{"definitions":[{"definition":"A picture made by sticking other pictures onto a surface."},{"definition":"A composite object or collection (abstract or concrete) created by the assemblage of various media; especially for a work of art such as text, film, etc."},{"definition":"The technique of producing a work of art of this kind."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make into a collage."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"collage-us","text":"/koʊˈlɑʒ/"}]},{"word":"ASSERTED","idx":16442,"count":2230343,"meanings":[{"definitions":[{"definition":"To declare with assurance or plainly and strongly; to state positively.","example":"He would often assert that there was life on other planets."},{"definition":"To use or exercise and thereby prove the existence of.","example":"Salman Rushdie has asserted his right to be identified as the author of this work."},{"definition":"To maintain or defend, as a cause or a claim, by words or measures; to vindicate a claim or title to","example":"to assert our rights and liberties"},{"definition":"To specify that a condition or expression is true at a certain point in the code."},{"definition":"To set a signal on a line using a voltage or electric current."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Stated, declared or alleged, especially with confidence but no proof"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"asserted-us","text":"/əˈsɝtɪd/"}]},{"word":"ACES","idx":16443,"count":2229921,"meanings":[{"definitions":[{"definition":"A single point or spot on a playing card or die."},{"definition":"A card or die face so marked.","example":"I have the ace of diamonds."},{"definition":"The ball marked with the number 1 in pool and related games."},{"definition":"A very small quantity or degree; a particle; an atom; a jot."},{"definition":"A serve won without the opponent hitting the ball."},{"definition":"A single point won by a stroke, as in handball, rackets, etc."},{"definition":"The best pitcher on the team."},{"definition":"(19th century) A run."},{"definition":"A hole in one."},{"definition":"An expert at something."},{"definition":"A military aircraft pilot who is credited with shooting down many enemy aircraft, typically five or more."},{"definition":"A perfect score on a school exam."},{"definition":"Any of various hesperiid butterflies."},{"definition":"A quark."},{"definition":"A person who is asexual."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(US) To pass (a test, interviews etc.) perfectly."},{"definition":"To win a point by an ace."},{"definition":"To make an ace (hole in one)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈeɪ.sɪz/"}]},{"word":"BENCHMARKING","idx":16445,"count":2229563,"meanings":[{"definitions":[{"definition":"To measure the performance or quality of (an item) relative to another similar item in an impartial scientific manner."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A performance measurement according to a benchmark."}],"partOfSpeech":"n"}]},{"word":"JEALOUS","idx":16446,"count":2229501,"meanings":[{"definitions":[{"definition":"Suspecting rivalry in love; troubled by worries that one might have been replaced in someone's affections; suspicious of a lover's or spouse's fidelity."},{"definition":"Protective, zealously guarding, careful in the protection of something one has or appreciates.","example":"For you must not worship any other god, for the Lord, whose name is Jehovah, is a jealous God. —Exodus 34:14 (NET)"},{"definition":"Envious; feeling resentful or angered toward someone for a perceived advantage or success, material or otherwise."},{"definition":"Suspecting, suspicious."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"jealous-us","text":"/ˈdʒɛləs/"}]},{"word":"REFINEMENT","idx":16447,"count":2229226,"meanings":[{"definitions":[{"definition":"The act, or the result of refining; the removal of impurities, or a purified material"},{"definition":"High-class style; cultivation."},{"definition":"A fine or subtle distinction."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹəˈfaɪnmənt/"}]},{"word":"LEARNT","idx":16449,"count":2228719,"meanings":[{"definitions":[{"definition":"To acquire, or attempt to acquire knowledge or an ability to do something."},{"definition":"To attend a course or other educational activity."},{"definition":"To gain knowledge from a bad experience so as to improve.","example":"learn from one's mistakes"},{"definition":"To study.","example":"I learn medicine."},{"definition":"To come to know; to become informed of; to find out.","example":"He just learned that he will be sacked."},{"definition":"To teach.","example":"Give him a clip round the ear. That'll learn him!"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"learnt-uk","text":"/ˈlɜːnt/"},{"audio":"learnt-au","text":"/ˈlɜːnt/"}]},{"word":"HOUND","idx":16451,"count":2228633,"meanings":[{"definitions":[{"definition":"A dog, particularly a breed with a good sense of smell developed for hunting other animals."},{"definition":"Any canine animal."},{"definition":"(by extension) Someone who seeks something."},{"definition":"(by extension) A male who constantly seeks the company of desirable women."},{"definition":"A despicable person."},{"definition":"A houndfish."},{"definition":"(in the plural) Projections at the masthead, serving as a support for the trestletrees and top to rest on."},{"definition":"A side bar used to strengthen portions of the running gear of a vehicle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To persistently harass.","example":"He hounded me for weeks, but I was simply unable to pay back his loan."},{"definition":"To urge on against; to set (dogs) upon in hunting."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hound-us","text":"/haʊnd/"}]},{"word":"SQUIRREL","idx":16452,"count":2228308,"meanings":[{"definitions":[{"definition":"Any of the rodents of the family Sciuridae distinguished by their large bushy tail."},{"definition":"A person, usually a freezoner, who applies L. Ron Hubbard's technology in a heterodox manner."},{"definition":"One of the small rollers of a carding machine which work with the large cylinder."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To store in a secretive manner, to hide something for future use"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"squirrel-ca","text":"/ˈskwɝl/"}]},{"word":"CONCEALED","idx":16454,"count":2228233,"meanings":[{"definitions":[{"definition":"To hide something from view or from public knowledge, to try to keep something secret.","example":"He tried to conceal the truth about his health."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"concealed-us","text":"/kənˈsiːld/"}]},{"word":"BANKRUPTCIES","idx":16455,"count":2228091,"meanings":[{"definitions":[{"definition":"A legally declared or recognized condition of insolvency of a person or organization."}],"partOfSpeech":"n"}]},{"word":"GAUGES","idx":16456,"count":2227826,"meanings":[{"definitions":[{"definition":"A measure; a standard of measure; an instrument to determine dimensions, distance, or capacity; a standard"},{"definition":"An act of measuring."},{"definition":"An estimate."},{"definition":"Any instrument for ascertaining or regulating the level, state, dimensions or forms of things"},{"definition":"A thickness of sheet metal or wire designated by any of several numbering schemes."},{"definition":"The distance between the rails of a railway."},{"definition":"A semi-norm; a function that assigns a non-negative size to all vectors in a vector space."},{"definition":"The number of stitches per inch, centimetre, or other unit of distance."},{"definition":"Relative positions of two or more vessels with reference to the wind.","example":"A vessel has the weather gauge of another when on the windward side of it, and the lee gauge when on the lee side of it."},{"definition":"The depth to which a vessel sinks in the water."},{"definition":"(plastering) The quantity of plaster of Paris used with common plaster to make it set more quickly."},{"definition":"That part of a shingle, slate, or tile, which is exposed to the weather, when laid; also, one course of such shingles, slates, or tiles."},{"definition":"A unit of measurement which describes how many spheres of bore diameter of a shotgun can be had from one pound of lead; 12 gauge is roughly equivalent to .75 caliber."},{"definition":"(by extension) A shotgun (synecdoche for 12 gauge shotgun, the most common chambering for combat and hunting shotguns)."},{"definition":"A tunnel-like ear piercing consisting of a hollow ring embedded in the lobe."}],"partOfSpeech":"n"}]},{"word":"BLUEPRINT","idx":16457,"count":2227312,"meanings":[{"definitions":[{"definition":"A type of paper-based reproduction process producing white-on-blue images, used primarily for technical and architecture's drawings, now largely replaced by other technologies."},{"definition":"A print produced with this process."},{"definition":"(by extension) A detailed technical drawing (now often in some electronically storable and transmissible form)."},{"definition":"(by extension) Any detailed plan, whether literal or figurative."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a blueprint for.","example":"The architect blueprinted the renovation plan once the client had signed off."},{"definition":"To make a detailed operational plan for.","example":"They blueprinted every aspect of the first phase of the operation."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"blueprint-us","text":"/ˈbluːˌpɹɪnt/"}]},{"word":"SPIDERMAN","idx":16459,"count":2227007,"meanings":[{"definitions":[{"definition":"A steeplejack."},{"definition":"A free climber."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"spiderman-au"}]},{"word":"BRIDGING","idx":16460,"count":2226960,"meanings":[{"definitions":[{"definition":"To be or make a bridge over something.","example":"With enough cable, we can bridge this gorge."},{"definition":"To span as if with a bridge.","example":"The two groups were able to bridge their differences."},{"definition":"To transition from one piece or section of music to another without stopping."},{"definition":"(communication) To connect two or more computer buses, networks etc. with a bridge."},{"definition":"To go to the bridge position."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The system of bracing used between floor or other timbers to distribute the weight."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That acts as a bridge (in many contexts)"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈbɹɪdʒɪŋ/"}]},{"word":"WHARF","idx":16461,"count":2226856,"meanings":[{"definitions":[{"definition":"A man-made landing place for ships on a shore or river bank."},{"definition":"The bank of a river, or the shore of the sea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To secure by a wharf."},{"definition":"To place on a wharf."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/wɔɹf/"},{"text":"/wɔːf/"}]},{"word":"RHYTHMS","idx":16462,"count":2226659,"meanings":[{"definitions":[{"definition":"The variation of strong and weak elements (such as duration, accent) of sounds, notably in speech or music, over time; a beat or meter.","example":"Dance to the rhythm of the music."},{"definition":"A specifically defined pattern of such variation.","example":"Most dances have a rhythm as distinctive as the Iambic verse in poetry"},{"definition":"A flow, repetition or regularity.","example":"Once you get the rhythm of it, the job will become easy."},{"definition":"The tempo or speed of a beat, song or repetitive event.","example":"We walked with a quick, even rhythm."},{"definition":"The musical instruments which provide rhythm (mainly; not or less melody) in a musical ensemble.","example":"The Baroque term basso continuo is virtually equivalent to rhythm"},{"definition":"A regular quantitative change in a variable (notably natural) process.","example":"The rhythm of the seasons dominates agriculture as well as wildlife"},{"definition":"Controlled repetition of a phrase, incident or other element as a stylistic figure in literature and other narrative arts; the effect it creates.","example":"The running gag is a popular rhythm in motion pictures and theater comedy"}],"partOfSpeech":"n"}]},{"word":"DEPARTURES","idx":16463,"count":2226525,"meanings":[{"definitions":[{"definition":"The act of departing or something that has departed.","example":"The departure was scheduled for noon."},{"definition":"A deviation from a plan or procedure.","example":"There are several significant departures, however, from current practice."},{"definition":"A death."},{"definition":"The distance due east or west made by a ship in its course reckoned in plane sailing as the product of the distance sailed and the sine of the angle made by the course with the meridian."},{"definition":"The difference in easting between the two ends of a line or curve.","example":"The area is computed by latitudes and departures."},{"definition":"The desertion by a party to any pleading of the ground taken by him in his last antecedent pleading, and the adoption of another."},{"definition":"Division; separation; putting away."}],"partOfSpeech":"n"}]},{"word":"FLICK","idx":16464,"count":2226500,"meanings":[{"definitions":[{"definition":"A short, quick movement, especially a brush, sweep, or flip.","example":"He removed the speck of dust with a flick of his finger."},{"definition":"A motion picture; (in plural, usually preceded by \"the\") movie theater, cinema.","example":"My all-time favorite flick is \"Gone with the Wind.\""},{"definition":"A cut that lands with the point, often involving a whip of the foible of the blade to strike at a concealed target."},{"definition":"A powerful underarm volley shot."},{"definition":"The act of pressing a place on a touch screen device."},{"definition":"A flitch.","example":"a flick of bacon"},{"definition":"A unit of time, equal to 1/705,600,000 of a second"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move or hit (something) with a short, quick motion.","example":"flick one's hair"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"flick-us","text":"/flɪk/"}]},{"word":"DATUM","idx":16465,"count":2226219,"meanings":[{"definitions":[{"definition":"(plural: data) A measurement of something on a scale understood by both the recorder (a person or device) and the reader (another person or device). The scale is arbitrarily defined, such as from 1 to 10 by ones, 1 to 100 by 0.1, or simply true or false, on or off, yes, no, or maybe, etc."},{"definition":"(plural: data) A fact known from direct observation."},{"definition":"(plural: data) A premise from which conclusions are drawn."},{"definition":"(plural: datums) A fixed reference point, or a coordinate system."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide missing data points by using a mathematical model to extrapolate values that are outside the range of a measuring device."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈdeɪtəm/"}]},{"word":"SHOTGUN","idx":16466,"count":2225854,"meanings":[{"definitions":[{"definition":"A gun which fires loads typically consisting of small metal balls, called shot, from a cartridge.","example":"Meat was cooked up within hours after the hunter killed the deer with his shotgun."},{"definition":"The front passenger seat in a vehicle, next to the driver; so called because the position of the shotgun-armed guard on a horse-drawn stage-coach, wagon train, or gold transport was next to the driver on a forward-mounted bench seat.","example":"I call shotgun! (I claim the right to sit in the passenger seat.)"},{"definition":"A one-story dwelling with no hallways or corridors, with the rooms arranged in a straight line.","example":"Elvis Presley was born in a two-bedroom shotgun in Tupelo, Mississippi."},{"definition":"An offensive formation in which the quarterback receives the snap at a distance behind the center, often with a running back set to one or both sides of him."},{"definition":"(as a modifier) Relating to shotguns, either in a present or past sense: e.g. shotgun cartridges, shotgun seat."},{"definition":"(as a modifier) Relating to the threat of force or dubious means: e.g. shotgun wedding, shotgun diplomacy."},{"definition":"(as a modifier) Relating to the use of numerous, diverse or indiscriminate means to achieve a particular result: e.g. shotgun marketing, a shotgun approach."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(smoking) To inhale from a pipe or other smoking device, followed shortly by an exhalation into someone else’s mouth."},{"definition":"To verbally lay claim to (something)","example":"I got a day off because I shotgunned it."},{"definition":"To hit the ball directly back at the pitcher."},{"definition":"To rapidly drink a beverage from a can by making a hole in the bottom of the can, placing the hole above one's mouth, and opening the top."},{"definition":"To send out many (requests, answers to a question, etc), especially in the hope that one obtains a positive result (i.e. reveals useful information, is correct, etc), in the manner of a shotgun firing many balls of shot such that one may hit a target."},{"definition":"To employ the technique of shotgun debugging."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈʃɑtɡʌn/"},{"text":"/ˈʃɒtɡʌn/"},{"audio":"shotgun-au"}]},{"word":"STIMULATED","idx":16467,"count":2225851,"meanings":[{"definitions":[{"definition":"To encourage into action."},{"definition":"To arouse an organism to functional activity."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In a condition or state of stimulation."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈstɪmjʊleɪtɪd/"}]},{"word":"CHICKENS","idx":16468,"count":2225835,"meanings":[{"definitions":[{"definition":"A domestic fowl, Gallus gallus, especially when young."},{"definition":"The meat from this bird eaten as food."},{"definition":"The young of any bird; a chick."},{"definition":"A coward."},{"definition":"A young or inexperienced person."},{"definition":"A young, attractive, slim man, usually having little body hair; compare chickenhawk."},{"definition":"The game of dare."},{"definition":"A simple dance in which the movements of a chicken are imitated."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To avoid a situation one is afraid of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chickens-us","text":"/ˈt͡ʃɪkənz/"}]},{"word":"CANCELED","idx":16469,"count":2225251,"meanings":[{"definitions":[{"definition":"To cross out something with lines etc."},{"definition":"To invalidate or annul something.","example":"He cancelled his order on their website."},{"definition":"To mark something (such as a used postage stamp) so that it can't be reused.","example":"This machine cancels the letters that have a valid zip code."},{"definition":"To offset or equalize something.","example":"The corrective feedback mechanism cancels out the noise."},{"definition":"To remove a common factor from both the numerator and denominator of a fraction, or from both sides of an equation."},{"definition":"To stop production of a programme."},{"definition":"To suppress or omit; to strike out, as matter in type."},{"definition":"To shut out, as with a railing or with latticework; to exclude."},{"definition":"To kill."},{"definition":"To cease to provide financial or moral support to (someone deemed unacceptable). Compare cancel culture."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"No longer planned or scheduled.","example":"The cancelled show would have drawn 5,000 fans."},{"definition":"(of a mail item) Marked over the stamp, to show that the stamp has been used."}],"partOfSpeech":"j"}]},{"word":"EMPOWERING","idx":16473,"count":2224072,"meanings":[{"definitions":[{"definition":"To give permission, power, or the legal right to do something."},{"definition":"To give someone more confidence and/or strength to do something, often by enabling them to increase their control over their own life or situation.","example":"John found that starting up his own business empowered him greatly in social situations."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That empowers."}],"partOfSpeech":"j"}]},{"word":"LUG","idx":16474,"count":2223791,"meanings":[{"definitions":[{"definition":"The act of hauling or dragging.","example":"a hard lug"},{"definition":"That which is hauled or dragged.","example":"The pack is a heavy lug."},{"definition":"Anything that moves slowly."},{"definition":"A lug nut."},{"definition":"A device for terminating an electrical conductor to facilitate the mechanical connection; to the conductor it may be crimped to form a cold weld, soldered or have pressure from a screw."},{"definition":"A part of something which sticks out, used as a handle or support."},{"definition":"A fool, a large man."},{"definition":"An ear or ear lobe.","example":"While shaving, the poor sod had a fit and cut part of a lug off."},{"definition":"A wood box used for transporting fruit or vegetables."},{"definition":"A request for money, as for political purposes.","example":"They put the lug on him at the courthouse."},{"definition":"A rod or pole."},{"definition":"A measure of length equal to 16 1/2 feet."},{"definition":"A lugsail."},{"definition":"(harness) The leather loop or ear by which a shaft is held up."},{"definition":"A loop (or protuberance) found on both arms of a hinge, featuring a hole for the axis of the hinge."},{"definition":"A ridge or other protuberance on the surface of a body to increase traction or provide a hold for holding and moving it."},{"definition":"A lugworm."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(sometimes figurative) To haul or drag along (especially something heavy); to carry; to pull.","example":"Why do you always lug around so many books?"},{"definition":"To run at too slow a speed.","example":"When driving up a hill, choose a lower gear so you don't lug the engine."},{"definition":"To carry an excessive amount of sail for the conditions prevailing."},{"definition":"To pull toward the inside rail (\"lugging in\") or the outside rail (\"lugging out\") during a race."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/lʌɡ/"},{"audio":"lug-au"}]},{"word":"SURVEYOR","idx":16476,"count":2222995,"meanings":[{"definitions":[{"definition":"A person occupied with surveying -- the process of determining positions on the earth's surface."},{"definition":"A person charged with inspecting something for the purpose of determining its condition, value, etc.","example":"Other costs associated with selling a home include surveyor's fees, legal fees, estate agent's commission, stamp duty and the VAT."}],"partOfSpeech":"n"}]},{"word":"FACILITATOR","idx":16477,"count":2222990,"meanings":[{"definitions":[{"definition":"A person who helps a group to have an effective dialog without taking any side of the argument, especially in order to reach a consensus."}],"partOfSpeech":"n"}]},{"word":"MAIZE","idx":16481,"count":2222076,"meanings":[{"definitions":[{"definition":"Corn; a type of grain of the species Zea mays."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"maize-us","text":"/meɪz/"}]},{"word":"EXTINCTION","idx":16483,"count":2221990,"meanings":[{"definitions":[{"definition":"The action of making or becoming extinct; annihilation."},{"definition":"The absorption or scattering of electromagnetic radiation emitted by astronomical objects by intervening dust and gas before it reaches the observer."},{"definition":"The inability to perceive multiple stimuli simultaneously"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪkˈstɪŋkʃ(ə)n/"}]},{"word":"UNAWARE","idx":16484,"count":2221929,"meanings":[{"definitions":[{"definition":"Not aware or informed; lacking knowledge.","example":"I'm unaware of the answer to that question."},{"definition":"Not noticing; paying no heed; thoughtless; inattentive."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unaware-us","text":"/ˌʌnəˈwɛɚ/"}]},{"word":"DISCRETIONARY","idx":16487,"count":2221521,"meanings":[{"definitions":[{"definition":"Available at one's discretion; able to be used as one chooses; left to or regulated by one's own discretion or judgment.","example":"discretionary income"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪsˈkɹɛʃəˌnɛɹi/"},{"text":"/dɪˈskɹɛʃən(ə)ɹi/"}]},{"word":"PSALM","idx":16491,"count":2220027,"meanings":[{"definitions":[{"definition":"A sacred song; a poetical composition for use in the praise or worship of God."},{"definition":"One of the hymns by David and others, collected into one book of the Old Testament, or a modern metrical version of such a hymn for public worship."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To extol in psalms; to make music; to sing","example":"to psalm his praises."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"psalm-us","text":"/sɑlm/"}]},{"word":"SCENTED","idx":16495,"count":2218936,"meanings":[{"definitions":[{"definition":"To detect the scent of; to discern by the sense of smell.","example":"The hounds scented the fox in the woods."},{"definition":"To have a suspicion of.","example":"I scented trouble when I saw them running down the hill towards me."},{"definition":"To impart an odour to.","example":"Scent the air with burning sage before you begin your meditation."},{"definition":"To have a smell."},{"definition":"To hunt animals by means of the sense of smell."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a pleasant aroma."},{"definition":"(chiefly in combination) Having a smell of any kind.","example":"a plant with skunk-scented leaves"},{"definition":"Having perfume added.","example":"a scented soap"}],"partOfSpeech":"j"}]},{"word":"TIMESTAMP","idx":16497,"count":2218211,"meanings":[{"definitions":[{"definition":"A variable containing the date and time at which an event occurred, often included in a log to track the sequence of events."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To record the date and time of (an event, etc)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"timestamp-uk","text":"/ˈtaɪmˌstæmp/"}]},{"word":"BIB","idx":16499,"count":2217795,"meanings":[{"definitions":[{"definition":"An item of clothing for people (especially babies) tied around their neck to protect their clothes from getting dirty when eating."},{"definition":"Similar items of clothing such as the Chinese dudou and Vietnamese yem."},{"definition":"A rectangular piece of material, carrying a bib number, worn as identification by entrants in a race."},{"definition":"A colourful polyester or plastic vest worn over one's clothes, usually to mark one's team during group activities."},{"definition":"The upper part of an apron or overalls."},{"definition":"A patch of colour around an animal's upper breast and throat."},{"definition":"A north Atlantic fish (Trisopterus luscus), allied to the cod."},{"definition":"A bibcock."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dress (somebody) in a bib."},{"definition":"To drink heartily; to tipple."},{"definition":"To beep (e.g. a car horn)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bib-us","text":"/bɪb/"}]},{"word":"GOWNS","idx":16500,"count":2217657,"meanings":[{"definitions":[{"definition":"A loose, flowing upper garment."},{"definition":"A woman's ordinary outer dress, such as a calico or silk gown."},{"definition":"The official robe of certain professional men and scholars, such as university students and officers, barristers, judges, etc."},{"definition":"(by metonymy) The university community.","example":"In the perennial town versus gown battles, townies win some violent battles, but the collegians are winning the war."},{"definition":"A loose wrapper worn by gentlemen within doors; a dressing gown."},{"definition":"Any sort of dress or garb."},{"definition":"The robe worn by a surgeon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To dress in a gown, to don or garb with a gown."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡaʊnz/"}]},{"word":"SPYING","idx":16502,"count":2216698,"meanings":[{"definitions":[{"definition":"To act as a spy.","example":"During the Cold War, Russia and America would each spy on each other for recon."},{"definition":"To spot; to catch sight of.","example":"I think I can spy that hot guy coming over here."},{"definition":"To search narrowly; to scrutinize."},{"definition":"To explore; to see; to view; inspect and examine secretly, as a country."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Espionage"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"spying-us","text":"/ˈspaɪ.ɪŋ/"}]},{"word":"DERMATOLOGY","idx":16505,"count":2215849,"meanings":[{"definitions":[{"definition":"The study of the skin and its diseases"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌdɜːməˈtɒlədʒi/"}]},{"word":"LIED","idx":16506,"count":2215843,"meanings":[{"definitions":[{"definition":"An art song, sung in German and accompanied on the piano."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give false information intentionally with intent to deceive.","example":"If you are found to have lied in court, you could face a penalty."},{"definition":"To convey a false image or impression.","example":"Photographs often lie."},{"definition":"To be mistaken or unintentionally spread false information.","example":"Sorry, I haven't seen your keys anywhere...wait, I lied! They're right there on the coffee table."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lied-1-uk","text":"/liːd/"}]},{"word":"SANDBOX","idx":16508,"count":2215370,"meanings":[{"definitions":[{"definition":"A children's play area consisting of a box filled with sand."},{"definition":"A box filled with sand that is shaped to form a mould for metal casting."},{"definition":"A container for sand or pounce, used historically before blotting paper."},{"definition":"An animal's litter box."},{"definition":"A box carried on locomotives, from which sand runs onto the rails in front of the driving wheels, to prevent slipping."},{"definition":"An isolated area where a program can be executed with a restricted portion of the resources available.","example":"Running a program in a sandbox can prevent it from doing any damage to the system."},{"definition":"(Wiktionary and WMF jargon) A page on a wiki where users are free to experiment without destroying or damaging any legitimate content."},{"definition":"(usually \"The Sandbox\") The Middle East."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To restrict (a program, etc.) by placing it in a sandbox."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sandbox-us","text":"/ˈsændbɑks/"}]},{"word":"BLOC","idx":16509,"count":2215168,"meanings":[{"definitions":[{"definition":"A group of voters or politicians who share common goals."},{"definition":"A group of countries acting together for political or economic goals, an alliance: e.g., the eastern bloc, the western bloc, a trading bloc, the Eurozone, the European Union.","example":"Climate change a security risk for EU, say bloc's foreign policy chiefs (EUobserver)"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bloc-us","text":"/blɑk/"}]},{"word":"PREMIERSHIP","idx":16513,"count":2214457,"meanings":[{"definitions":[{"definition":"The office of a premier or prime minister."},{"definition":"(sporting) The position held by the champion team at the end of a particular season (especially as used in Australian rules football)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"premiership-au"}]},{"word":"RECURRENT","idx":16515,"count":2214373,"meanings":[{"definitions":[{"definition":"Recurring; happening time after time.","example":"The patient complained of recurrent chest pain."},{"definition":"(stochastic processes, of a state) Non-transient."},{"definition":"Running back toward its origin.","example":"a recurrent nerve or artery"},{"definition":"Turned back toward the base."}],"partOfSpeech":"j"}]},{"word":"TALBOT","idx":16516,"count":2214323,"meanings":[{"definitions":[{"definition":"An mks unit of luminous energy, exactly corresponding to the SI lumen second."},{"definition":"A type of hound with broad mouth and large ears, once used for hunting and tracking."}],"partOfSpeech":"n"}]},{"word":"LEAKS","idx":16518,"count":2214133,"meanings":[{"definitions":[{"definition":"A crack, crevice, fissure, or hole which admits water or other fluid, or lets it escape.","example":"a leak in a boat"},{"definition":"The entrance or escape of a fluid through a crack, fissure, or other aperture.","example":"The babies' diapers had big leaks."},{"definition":"A divulgation, or disclosure, of information previously held secret.","example":"The leaks by Chelsea Manning showed the secrets of the US military."},{"definition":"The person through whom such divulgation, or disclosure, occurs.","example":"The press must have learned about the plan through a leak."},{"definition":"A loss of electricity through imperfect insulation, or the point where it occurs."},{"definition":"The gradual loss of a system resource caused by failure to deallocate previously reserved portions.","example":"memory leak"},{"definition":"(especially with the verb \"take\") An act of urination.","example":"I have to take a leak."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To allow fluid or gas to pass through an opening that should be sealed.","example":"The faucet has been leaking since last month."},{"definition":"(of a fluid or gas) To pass through an opening that should be sealed.","example":"No one realized that propane gas was leaking from a rusty tank in the concession area, slowly filling the unventilated room."},{"definition":"To disclose secret information surreptitiously or anonymously.","example":"Someone must have leaked it to our competitors that the new product will be out soon."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/liːks/"}]},{"word":"TAM","idx":16519,"count":2214121,"meanings":[{"definitions":[{"definition":"A type of woolen hat developed in Scotland, a toorie bunnet. Originally they were worn by both genders, but now they are mostly worn by men and boys."},{"definition":"A traditional South and East Asian unit of weight, based upon the load of a shoulder pole and varying by place and over time but usually standardized at about 60 kg."}],"partOfSpeech":"n"}]},{"word":"RECURSIVE","idx":16520,"count":2213452,"meanings":[{"definitions":[{"definition":"Drawing upon itself, referring back.","example":"The recursive nature of stories which borrow from each other"},{"definition":"Of an expression, each term of which is determined by applying a formula to preceding terms"},{"definition":"Of a program or function that calls itself"},{"definition":"(of a function) which can be computed by a theoretical model of a computer, in a finite amount of time"},{"definition":"(of a set) whose characteristic function is recursive (4)"}],"partOfSpeech":"j"}]},{"word":"SWELL","idx":16521,"count":2213445,"meanings":[{"definitions":[{"definition":"To become bigger, especially due to being engorged."},{"definition":"To cause to become bigger.","example":"Rains and dissolving snow swell the rivers in spring."},{"definition":"To grow gradually in force or loudness.","example":"The organ music swelled."},{"definition":"To raise to arrogance; to puff up; to inflate.","example":"to be swelled with pride or haughtiness"},{"definition":"To be raised to arrogance."},{"definition":"To be elated; to rise arrogantly."},{"definition":"To be turgid, bombastic, or extravagant.","example":"swelling words  a swelling style"},{"definition":"To protuberate; to bulge out.","example":"A cask swells in the middle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of swelling; increase in size."},{"definition":"A bulge or protuberance."},{"definition":"Increase of power in style, or of rhetorical force."},{"definition":"A long series of ocean waves, generally produced by wind, and lasting after the wind has ceased."},{"definition":"A gradual crescendo followed by diminuendo."},{"definition":"A device for controlling the volume of a pipe organ."},{"definition":"A division in a pipe organ, usually the largest enclosed division."},{"definition":"A hillock or similar raised area of terrain."},{"definition":"An upward protrusion of strata from whose central region the beds dip quaquaversally at a low angle."},{"definition":"A person who dresses in a fancy or elegant manner."},{"definition":"A person of high social standing; an important person."},{"definition":"The front brow of a saddle bow, connected in the tree by the two saddle bars to the cantle on the other end."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Fashionable, like a swell or dandy."},{"definition":"Excellent."}],"partOfSpeech":"j"},{"definitions":[{"definition":"Very well."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"swell-uk","text":"/swɛl/"}]},{"word":"OBSTACLE","idx":16522,"count":2213426,"meanings":[{"definitions":[{"definition":"Something that impedes, stands in the way of, or holds up progress","example":"A big obstacle to understanding the manual was that it had been poorly translated from the Japanese."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"obstacle-us","text":"/ˈɑbstəkl̩/"}]},{"word":"FLUORESCENCE","idx":16525,"count":2212938,"meanings":[{"definitions":[{"definition":"The emission of light (or other electromagnetic radiation) by a material when stimulated by the absorption of radiation or of a subatomic particle."},{"definition":"The light so emitted."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/floʊ-/"}]},{"word":"KOSHER","idx":16526,"count":2212803,"meanings":[{"definitions":[{"definition":"To kasher; to prepare (for example, meat) in conformity with the requirements of the Jewish law."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fit for use or consumption, in accordance with Jewish law (especially relating to food).","example":"David's mother kept a kosher kitchen, with separate sets of dishes for meat and for dairy."},{"definition":"(by extension) In accordance with standards or usual practice.","example":"Is what I have done kosher with Mr. Smith?"}],"partOfSpeech":"j"},{"definitions":[{"definition":"In a kosher manner; in accordance with kashrut."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"kosher-au","text":"/ˈkɑʃə(ɹ)/"}]},{"word":"MANTLE","idx":16527,"count":2212731,"meanings":[{"definitions":[{"definition":"The shelf above a fireplace which may be also a structural support for the masonry of the chimney."},{"definition":"A maneuver to surmount a ledge, involving pushing down on the ledge to bring up the body. Also called a mantelshelf."},{"definition":"A piece of clothing somewhat like an open robe or cloak, especially that worn by Orthodox bishops. (Compare mantum.)"},{"definition":"A figurative garment representing authority or status, capable of affording protection.","example":"At the meeting, she finally assumed the mantle of leadership of the party."},{"definition":"Anything that covers or conceals something else; a cloak."},{"definition":"The body wall of a mollusc, from which the shell is secreted."},{"definition":"The back of a bird together with the folded wings."},{"definition":"The zone of hot gases around a flame."},{"definition":"A gauzy fabric impregnated with metal nitrates, used in some kinds of gas and oil lamps and lanterns, which forms a rigid but fragile mesh of metal oxides when heated during initial use and then produces white light from the heat of the flame below it. (So called because it is hung above the lamp's flame like a mantel.)"},{"definition":"The outer wall and casing of a blast furnace, above the hearth."},{"definition":"A penstock for a water wheel."},{"definition":"The cerebral cortex."},{"definition":"The layer between the Earth's core and crust."},{"definition":"A mantling."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover or conceal (something); to cloak; to disguise."},{"definition":"To become covered or concealed."},{"definition":"To spread like a mantle (especially of blood in the face and cheeks when a person flushes)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"mantle-us","text":"/ˈmæn.təl/"},{"audio":"mantle-au","text":"/ˈmæn.təl/"}]},{"word":"ADDITIVES","idx":16528,"count":2212673,"meanings":[{"definitions":[{"definition":"A substance added to another substance or product to produce specific properties in the combined substance.","example":"Oil may be used as an additive in gasoline to improve the lubrication of a small engine."},{"definition":"(grammar) A word or phrase that adds something, such as also, even, or nor."}],"partOfSpeech":"n"}]},{"word":"DRIVEWAY","idx":16530,"count":2212347,"meanings":[{"definitions":[{"definition":"Short private road that leads to a house or garage."}],"partOfSpeech":"n"}]},{"word":"IRONY","idx":16531,"count":2212193,"meanings":[{"definitions":[{"definition":"A statement that, when taken in context, may actually mean something different from, or the opposite of, what is written literally; the use of words expressing something other than their literal intention, often in a humorous context."},{"definition":"Dramatic irony: a theatrical effect in which the meaning of a situation, or some incongruity in the plot, is understood by the audience, but not by the characters in the play."},{"definition":"Ignorance feigned for the purpose of confounding or provoking an antagonist; Socratic irony."},{"definition":"The state of two usually unrelated entities, parties, actions, etc. being related through a common connection in an uncommon way."},{"definition":"Contradiction between circumstances and expectations; condition contrary to what might be expected."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to the metal iron.","example":"The food had an irony taste to it."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"irony-1-us","text":"/ˈaɪ.ɚ.ni/"}]},{"word":"GESTURE","idx":16532,"count":2211952,"meanings":[{"definitions":[{"definition":"A motion of the limbs or body, especially one made to emphasize speech.","example":"The middle-finger gesture is really a nonverbal swear."},{"definition":"An act or a remark made as a formality or as a sign of attitude.","example":"We took flowers as a gesture of sympathy."},{"definition":"The manner of carrying the body; position of the body or limbs; posture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a gesture or gestures.","example":"My dad said to never gesture with my hands when I talk."},{"definition":"To express something by a gesture or gestures.","example":"He gestured his disgust."},{"definition":"To accompany or illustrate with gesture or action."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gesture-us","text":"/ˈdʒɛs.tʃɚ/"}]},{"word":"PARFUM","idx":16534,"count":2211114,"meanings":[{"definitions":[{"definition":"Fragrance; perfume"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɑɹˈfum/"}]},{"word":"MARKETED","idx":16535,"count":2210881,"meanings":[{"definitions":[{"definition":"To make (products or services) available for sale and promote them.","example":"We plan to market an ecology model by next quarter."},{"definition":"To sell","example":"We marketed more this quarter already than all last year!"},{"definition":"To deal in a market; to buy or sell; to make bargains for provisions or goods."}],"partOfSpeech":"ve"}]},{"word":"ARMIES","idx":16536,"count":2210841,"meanings":[{"definitions":[{"definition":"A large, highly organized military force, concerned mainly with ground (rather than air or naval) operations.","example":"The army was sent in to quell the uprising."},{"definition":"The governmental agency in charge of a state's army.","example":"The army opposed the legislature's involvement."},{"definition":"A large group of people working toward the same purpose.","example":"It took an army of accountants to uncover the fraud."},{"definition":"A large group of social animals working toward the same purpose.","example":"Our house is being attacked by an army of ants."},{"definition":"Any multitude.","example":"There was an army of construction cranes working on building the skyscraper."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"armies-us","text":"/ˈɑɹ.miz/"}]},{"word":"HUGS","idx":16538,"count":2209967,"meanings":[{"definitions":[{"definition":"A close embrace, especially when charged with such an emotion as represented by: affection, joy, relief, lust, anger, agression, compassion, and the like, as opposed to being characterized by formality, equivocation or ambivalence (a half-embrace or \"little hug\")."},{"definition":"A particular grip in wrestling."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To crouch; huddle as with cold."},{"definition":"To cling closely together."},{"definition":"To embrace by holding closely, especially in the arms.","example":"Billy hugged Danny until he felt better."},{"definition":"To stay close to (the shore etc.)"},{"definition":"To hold fast; to cling to; to cherish."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hʌɡz/"}]},{"word":"GREENFIELD","idx":16539,"count":2209164,"meanings":[{"definitions":[{"definition":"A site, to be used for housing or commerce, whose previous use (if any) was agricultural"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Being a completely new development, without the need to integrate with legacy systems etc.","example":"a greenfield project"},{"definition":"Previously untapped; free for the taking.","example":"a greenfield market"}],"partOfSpeech":"j"}]},{"word":"OWLS","idx":16541,"count":2208765,"meanings":[{"definitions":[{"definition":"Any of various birds of prey of the order Strigiformes that are primarily nocturnal and have forward-looking, binocular vision, limited eye movement, and good hearing."},{"definition":"(by extension) A person seen as having owl-like characteristics, especially appearing wise or serious, or being nocturnally active."},{"definition":"The owl pigeon."},{"definition":"A politician with moderate views that are neither hawkish nor dovish."},{"definition":"Any of various nymphalid butterflies having large eyespots on the wings."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/æwlz/"}]},{"word":"MANDRAKE","idx":16542,"count":2208765,"meanings":[{"definitions":[{"definition":"A mandragora, a kind of tiny demon immune to fire."},{"definition":"Any plant of the genus Mandragora, certain of which are said to have medicinal properties; the root of these plants often resembles the shape of a small person, hence occasioning various mythic, magical, or occult uses."},{"definition":"A root of a mandrake plant that resembled human form, especially one kept or used for magic or occult purposes."},{"definition":"The drug methaqualone."}],"partOfSpeech":"n"}]},{"word":"CUTTERS","idx":16543,"count":2208709,"meanings":[{"definitions":[{"definition":"A person or device that cuts (in various senses).","example":"a stone cutter; a die cutter"},{"definition":"A single-masted, fore-and-aft rigged, sailing vessel with at least two headsails, and a mast set further aft than that of a sloop."},{"definition":"A foretooth; an incisor."},{"definition":"A heavy-duty motor boat for official use."},{"definition":"A ship's boat, used for transport ship-to-ship or ship-to-shore."},{"definition":"A ball that moves sideways in the air, or off the pitch, because it has been cut."},{"definition":"A cut fastball."},{"definition":"A ten-pence piece. So named because it is the coin most often sharpened by prison inmates to use as a weapon."},{"definition":"A person who practices self-injury."},{"definition":"A surgeon."},{"definition":"An animal yielding inferior meat, with little or no external fat and marbling."},{"definition":"An officer in the exchequer who notes by cutting on the tallies the sums paid."},{"definition":"A ruffian; a bravo; a destroyer."},{"definition":"A kind of soft yellow brick, easily cut, and used for facework."},{"definition":"A light sleigh drawn by one horse."}],"partOfSpeech":"n"}]},{"word":"CAMPER","idx":16544,"count":2208353,"meanings":[{"definitions":[{"definition":"Theatrical; making exaggerated gestures."},{"definition":"(of a man) Ostentatiously effeminate."},{"definition":"Intentionally tasteless or vulgar, self-parodying."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A person who camps, especially in a tent etc.","example":"There were thousands of campers at the music festival."},{"definition":"A motor vehicle with a rear compartment for living and sleeping in."},{"definition":"A person who stays in one spot during a first-person shooting game, to guard an item etc."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"camper-us","text":"/ˈkæmpə(ɹ)/"}]},{"word":"ACQUIRES","idx":16545,"count":2207920,"meanings":[{"definitions":[{"definition":"To get."},{"definition":"To gain, usually by one's own exertions; to get as one's own","example":"He acquired a title."},{"definition":"To contract."},{"definition":"To sample signals and convert them into digital values."}],"partOfSpeech":"ve"}]},{"word":"CEASED","idx":16547,"count":2207677,"meanings":[{"definitions":[{"definition":"To stop.","example":"And with that, his twitching ceased."},{"definition":"To stop doing (something).","example":"And with that, he ceased twitching."},{"definition":"To be wanting; to fail; to pass away."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ceased-us","text":"/siːst/"}]},{"word":"MERGING","idx":16548,"count":2207630,"meanings":[{"definitions":[{"definition":"To combine into a whole.","example":"Headquarters merged the operations of the three divisions."},{"definition":"To combine into a whole.","example":"The two companies merged."},{"definition":"To blend gradually into something else.","example":"The lanes of traffic merged."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act, or the result, of being merged."}],"partOfSpeech":"n"}]},{"word":"PLAQUES","idx":16549,"count":2207525,"meanings":[{"definitions":[{"definition":"Any flat, thin piece of clay, ivory, metal, etc., used for ornament, or for painting pictures upon, as a dish, plate, slab, etc., hung upon a wall; also, a smaller decoration worn by a person, such as a brooch."},{"definition":"A piece of flat metal with writing on it, attached to a building, monument, or other structure to remind people of a person or an event."},{"definition":"A small card representing an amount of money, used for betting in casinos; a sort of gaming chip."},{"definition":"A clearing in a bacterial lawn caused by a virus."},{"definition":"In the Hornbostel–Sachs classification system: any flat, thin musical instrument.","example":"blown plaques  concussion plaques"},{"definition":"A broad patch of abnormal tissue distinguishable from surrounding tissue, especially a broad papule on the skin."},{"definition":"An abnormal accumulation of material in or on an organ of the body, often associated with disease.","example":"amyloid plaque  pleural plaque  senile plaque"}],"partOfSpeech":"n"}]},{"word":"BREADTH","idx":16550,"count":2207395,"meanings":[{"definitions":[{"definition":"The extent or measure of how broad or wide something is."},{"definition":"A piece of fabric of standard width."},{"definition":"Scope or range, especially of knowledge or skill."},{"definition":"A style in painting in which details are strictly subordinated to the harmony of the whole composition."},{"definition":"The length of the longest path between two vertices in a graph."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"breadth-us","text":"/bɹɛdθ/"}]},{"word":"MAMMOTH","idx":16551,"count":2207269,"meanings":[{"definitions":[{"definition":"Any species of the extinct genus Mammuthus, of large, usually hairy, elephant-like mammals with long curved tusks and an inclined back, which became extinct with the last retreat of ice age glaciers during the late Pleistocene period, and are known from fossils, frozen carcasses, and Paleolithic cave paintings found in North America and Eurasia."},{"definition":"A mastodon."},{"definition":"Something very large of its kind."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Comparable to a mammoth in its size; very large, huge, gigantic."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmæməθ/"}]},{"word":"LIQUIDITY","idx":16552,"count":2207213,"meanings":[{"definitions":[{"definition":"The degree of which something is in high supply and demand, making it easily convertible to cash","example":"My Picasso painting is not very liquid, it would take me months to sell it. Gold on the other hand is convertible to cash at any moment, making it a very liquid commodity."},{"definition":"The state or property of being liquid."},{"definition":"An asset's property of being able to be sold without affecting its value; the degree to which it can be easily converted into cash.","example":"Some stocks are traded so rarely that they lack liquidity."},{"definition":"Availability of cash over short term: ability to service short-term debt."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/lɪkˈwɪdəti/"}]},{"word":"CONVICTIONS","idx":16553,"count":2206377,"meanings":[{"definitions":[{"definition":"A firmly held belief."},{"definition":"A judgement of guilt in a court of law."},{"definition":"The state of being found or proved guilty."},{"definition":"The state of being wholly convinced."}],"partOfSpeech":"n"}]},{"word":"INTENTIONAL","idx":16555,"count":2206039,"meanings":[{"definitions":[{"definition":"Intended or planned; done deliberately or voluntarily."},{"definition":"Done with intent."}],"partOfSpeech":"j"}]},{"word":"GALACTIC","idx":16556,"count":2205825,"meanings":[{"definitions":[{"definition":"Of or pertaining to milk, or the secretion of milk.","example":"galactic acid"},{"definition":"Relating to a galaxy."},{"definition":"Enormous (in size or impact)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"galactic-us","text":"/ɡəˈlæktɪk/"}]},{"word":"MERCHANDISING","idx":16558,"count":2205545,"meanings":[{"definitions":[{"definition":"To engage in trade; to carry on commerce."},{"definition":"To engage in in-store promotion of the sale of goods, as by display and arrangement of goods.","example":"He started his career merchandising in a small clothing store chain."},{"definition":"To engage in the trade of."},{"definition":"To engage in in-store promotion of the sale of.","example":"He got hired to merchandise some new sporting goods lines."},{"definition":"To promote as if for sale.","example":"The record companies don't get as good a return on merchandising artists under contract."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Trade in merchandise"}],"partOfSpeech":"n"}]},{"word":"PROHIBITS","idx":16559,"count":2204849,"meanings":[{"definitions":[{"definition":"To forbid, disallow, or proscribe officially; to make illegal or illicit.","example":"The restaurant prohibits smoking on the patio."}],"partOfSpeech":"ve"}]},{"word":"OMBUDSMAN","idx":16560,"count":2204623,"meanings":[{"definitions":[{"definition":"An appointed official whose duty is to investigate complaints, generally on behalf of individuals such as consumers or taxpayers, against institutions such as companies and government departments."},{"definition":"A designated internal mediator in an organization whose duty is to assist members with conflict resolution and other problems and to serve as an independent consultant to recommend changes to policies or procedures to improve organization effectiveness, efficiency, and humaneness."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ombudsman-us","text":"/ˈɑmbədzmən/"},{"audio":"ombudsman-au","text":"/ɔmˈbʊdzmən/"}]},{"word":"INNINGS","idx":16561,"count":2204569,"meanings":[{"definitions":[{"definition":"One side's (from when the first player begins to bat, until the last player is out) or individual player's turn to bat or the runs scored during those durations."},{"definition":"The time during which any party is in possession of power, or enjoying good luck, etc.; a turn of any kind."},{"definition":"A person's lifespan."},{"definition":"A period of play in which members of a visiting baseball team attempt to hit a baseball pitched by the opposing home team until three players are called out, followed by a similar attempt by members of the home baseball team against the visiting team's pitching. There are nine or more innings in a regulation baseball game.","example":"It is a baseball tradition to sing \"Take Me Out To the Ball Game\" during the seventh inning stretch."},{"definition":"A similar period of play.","example":"We batted around in our half of the inning."},{"definition":"A player (or team)'s turn at the table to make shots until ended by a miss or a foul."},{"definition":"A chance or opportunity to perform some deed or act.","example":"We are in just the second inning of our quest to enter this new market."},{"definition":"The gathering of a crop; harvesting."},{"definition":"Lands recovered from the sea."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪn.ɪŋz/"},{"audio":"innings-au"}]},{"word":"REGISTRANT","idx":16562,"count":2204494,"meanings":[{"definitions":[{"definition":"One who registers something or is registered"}],"partOfSpeech":"n"}]},{"word":"REORGANIZATION","idx":16563,"count":2204091,"meanings":[{"definitions":[{"definition":"The act or process of rearranging. See reorganize."},{"definition":"The end result of such an act."}],"partOfSpeech":"n"}]},{"word":"PRONUNCIATION","idx":16564,"count":2203941,"meanings":[{"definitions":[{"definition":"The formal or informal way in which a word is made to sound when spoken.","example":"What is the pronunciation of \"hiccough\"?"},{"definition":"The way in which the words of a language are made to sound when speaking.","example":"His Italian pronunciation is terrible."},{"definition":"The act of pronouncing or uttering something."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pronunciation-us","text":"/pɹəˌnaʊn.siˈeɪ.ʃən/"}]},{"word":"FIREFIGHTERS","idx":16565,"count":2203597,"meanings":[{"definitions":[{"definition":"A person who puts out fires."}],"partOfSpeech":"n"}]},{"word":"PLACEMENTS","idx":16566,"count":2202980,"meanings":[{"definitions":[{"definition":"The act of placing or putting in place; the act of locating or positioning; the state of being placed."},{"definition":"A location or position.","example":"It seems to me that the placement of that poster could be better."},{"definition":"The act of matching a person with a job","example":"The agency does not guarantee placement, but they work on commission."}],"partOfSpeech":"n"}]},{"word":"CONCESSION","idx":16568,"count":2202890,"meanings":[{"definitions":[{"definition":"The act of conceding."},{"definition":"An act of conceding, particularly:"},{"definition":"A gift freely given or act freely made as a token of respect or to curry favor."},{"definition":"A franchise: a business operated as a concession (see above)."},{"definition":"(usually in the plural) An item sold within a concession (see above) or from a concessions stand."},{"definition":"A person eligible for a concession price (see above)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To grant or approve by means of a concession agreement."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kənˈsɛʃən/"}]},{"word":"MEASURABLE","idx":16569,"count":2202880,"meanings":[{"definitions":[{"definition":"That which can be measured; a metric."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Able to be measured."},{"definition":"Of significant importance."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmɛʒəɹəbəl/"}]},{"word":"PARCELS","idx":16572,"count":2202732,"meanings":[{"definitions":[{"definition":"A package wrapped for shipment.","example":"I saw a brown paper parcel on my doorstep."},{"definition":"An individual consignment of cargo for shipment, regardless of size and form."},{"definition":"A division of land bought and sold as a unit.","example":"I own a small parcel of land between the refinery and the fish cannery."},{"definition":"A group of birds."},{"definition":"An indiscriminate or indefinite number, measure, or quantity; a collection; a group."},{"definition":"A small amount of food that has been wrapped up, for example a pastry."},{"definition":"A portion of anything taken separately; a fragment of a whole; a part.","example":"A certain piece of land is part and parcel of another piece."},{"definition":"(plural) A parcels train, normally carrying nothing but parcels."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wrap something up into the form of a package."},{"definition":"To wrap a strip around the end of a rope."},{"definition":"To divide and distribute by parts or portions; often with out or into."},{"definition":"To add a parcel or item to; to itemize."}],"partOfSpeech":"ve"}]},{"word":"PASTRY","idx":16573,"count":2202621,"meanings":[{"definitions":[{"definition":"A baked food item made from flour and fat pastes such as pie crust; also tarts, bear claws, napoleons, puff pastries, etc.","example":"That pastry shop sells not just pastries, but all kinds of baked goods."},{"definition":"The food group formed by the various kinds of pastries.","example":"That pastry shop sells not just pastry, but all kinds of baked goods."},{"definition":"The type of light flour-based dough used in pastries."},{"definition":"A place where pastry is made."},{"definition":"The act or art of making pastry.","example":"He learned pastry from the great Gaston Lenôtre."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pastry-us","text":"/ˈpeɪstɹi/"}]},{"word":"MANNERS","idx":16574,"count":2202352,"meanings":[{"definitions":[{"definition":"Mode of action; way of performing or doing anything"},{"definition":"Characteristic mode of acting or behaving; bearing","example":"His natural manner makes him seem like the boss."},{"definition":"One's customary method of acting; habit.","example":"These people have strange manners."},{"definition":"Good, polite behaviour"},{"definition":"The style of writing or thought of an author; the characteristic peculiarity of an artist."},{"definition":"A certain degree or measure.","example":"It is in a manner done already."},{"definition":"Sort; kind; style.","example":"All manner of persons participate."},{"definition":"Standards of conduct cultured and product of mind."},{"definition":"Etiquette.","example":"Political correctness is tyranny with manners. ― Charlton Heston"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"manners-us","text":"/ˈmæn.ɚz/"}]},{"word":"LEVIN","idx":16575,"count":2202321,"meanings":[{"definitions":[{"definition":"Lightning; a bolt of lightning; also, a bright flame or light."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈlɛvɪn/"}]},{"word":"ACADEMIA","idx":16576,"count":2202285,"meanings":[{"definitions":[{"definition":"(collective) The scientific and cultural community engaged in higher education and research, taken as a whole.","example":"Academia continues to provide scientific education, despite attempts to turn it into a system of professional schooling."},{"definition":"Continuous study at higher education institutions; scholarship.","example":"Not every university graduate wishes to pursue academia."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌæk.əˈdi.mi.ə/"},{"text":"/ˌæ.kəˈdiː.mɪ.ə/"}]},{"word":"PHOSPHORUS","idx":16578,"count":2201635,"meanings":[{"definitions":[{"definition":"A chemical element (symbol P) with an atomic number of 15, that exists in several allotropic forms."},{"definition":"Any substance exhibiting phosphorescence; a phosphor"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"phosphorus-us","text":"/ˈfɑsfɚəs/"}]},{"word":"VIPER","idx":16579,"count":2201559,"meanings":[{"definitions":[{"definition":"A venomous snake in the family Viperidae."},{"definition":"A dangerous, treacherous, or malignant person."},{"definition":"A person who smokes marijuana."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"viper-us","text":"/ˈvaɪpɚ/"}]},{"word":"DESCRIPTOR","idx":16580,"count":2201540,"meanings":[{"definitions":[{"definition":"That which describes; a word, phrase, etc. serving as a description."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈskɹɪptə(ɹ)/"}]},{"word":"HID","idx":16581,"count":2201472,"meanings":[{"definitions":[{"definition":"To put (something) in a place where it will be harder to discover or out of sight.","example":"He hides his magazines under the bed."},{"definition":"To put oneself in a place where one will be harder to find or out of sight."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hid-us","text":"/hɪd/"}]},{"word":"VOLCANIC","idx":16582,"count":2201241,"meanings":[{"definitions":[{"definition":"A volcanic rock.","example":"The Ellesmere Island Volcanics are a Late Cretaceous volcanic group of volcanoes and lava flows in the Qikiqtaaluk Region of northern Ellesmere Island, Nunavut, Canada."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to a volcano or volcanoes","example":"volcanic activity."},{"definition":"Produced by a volcano, or, more generally, by igneous agencies"},{"definition":"Changed or affected by the heat of a volcano."},{"definition":"Reminiscent of a volcano; explosive, violent, full of suppressed anger, energy etc."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/vɒlˈkanɪk/"}]},{"word":"GYPSY","idx":16583,"count":2201227,"meanings":[{"definitions":[{"definition":"(sometimes offensive) A member of the Romani people, or one of the sub-groups (Roma, Sinti, Romanichal, etc)."},{"definition":"An itinerant person or any person, not necessarily Romani; a tinker, a traveller or a carny."},{"definition":"(sometimes offensive) A move in contra dancing in which two dancers walk in a circle around each other while maintaining eye contact (but not touching as in a swing). (Compare whole gyp, half gyp, and gypsy meltdown, in which this step precedes a swing.)"},{"definition":"A member of a Broadway musical chorus line."},{"definition":"A person with a dark complexion."},{"definition":"A sly, roguish woman."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(sometimes offensive) Of or belonging to the Romani people or one of it sub-groups (Roma, Sinti, Romanichel, etc)."},{"definition":"Of or having the qualities of an itinerant person or group with qualities traditionally ascribed to Romani people; making a living from dishonest practices or theft etc."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To roam around the country like a gypsy."},{"definition":"To perform the gypsy step in contra dancing."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"gypsy-us","text":"/ˈd͡ʒɪp.si/"}]},{"word":"THIEVES","idx":16584,"count":2201031,"meanings":[{"definitions":[{"definition":"One who carries out a theft."},{"definition":"One who steals another person's property, especially by stealth and without using force or violence."},{"definition":"A waster in the snuff of a candle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To commit theft."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"thieves-us","text":"/θiːvz/"}]},{"word":"PREACHING","idx":16585,"count":2200846,"meanings":[{"definitions":[{"definition":"To give a sermon.","example":"A learned local Muslim used to preach in the small mosque every Friday."},{"definition":"To proclaim by public discourse; to utter in a sermon or a formal religious harangue."},{"definition":"To advise or recommend earnestly."},{"definition":"To teach or instruct by preaching; to inform by preaching."},{"definition":"To give advice in an offensive or obtrusive manner."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of delivering a sermon or similar moral instruction."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"preaching-us","text":"/ˈpɹiːtʃɪŋ/"}]},{"word":"PIMP","idx":16586,"count":2200611,"meanings":[{"definitions":[{"definition":"Someone who solicits customers for prostitution and acts as manager for a group of prostitutes; a pander."},{"definition":"A man who can easily attract women."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a procurer of prostitutes; to pander."},{"definition":"To prostitute someone.","example":"The smooth-talking, tall man with heavy gold bracelets claimed he could pimp anyone."},{"definition":"To excessively customize something, especially a vehicle, according to ghetto standards (also pimp out).","example":"You pimped out that motorcycle f'real, dawg."},{"definition":"To ask progressively harder and ultimately unanswerable questions of a resident or medical student (said of a senior member of the medical staff)."},{"definition":"To promote, to tout.","example":"I gotta show you this sweet website where you can pimp your blog and get more readers."},{"definition":"To persuade, smooth talk or trick another into doing something for your benefit.","example":"I pimped her out of $2,000 and she paid for the entire stay at the Bahamas."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Excellent, fashionable, stylish"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Five in Cumbrian and Welsh sheep counting"}],"partOfSpeech":"nu"}],"phonetics":[{"text":"/pɪmp/"},{"audio":"pimp-ca"}]},{"word":"REPEAL","idx":16587,"count":2200528,"meanings":[{"definitions":[{"definition":"An act or instance of repealing."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cancel, invalidate, annul.","example":"to repeal a law"},{"definition":"To recall; to summon (a person) again; to bring (a person) back from exile or banishment."},{"definition":"To suppress; to repel."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"repeal-us","text":"/ɹəˈpiːl/"}]},{"word":"GIMP","idx":16588,"count":2200267,"meanings":[{"definitions":[{"definition":"A narrow ornamental fabric or braid of silk, wool, or cotton, often stiffened with metallic wire or coarse cord running through it, used as trimming for dresses, curtains, furniture, etc. Also guimpe."},{"definition":"Any coarse or reinforced thread, such as a glazed thread employed in lacemaking to outline designs, or silk thread used as a fishing leader, protected from the bite of fish by a wrapping of fine wire."},{"definition":"The plastic cord used in the plaiting and knotting craft Scoubidou (lanyard making); or, the process itself."},{"definition":"(chiefly North Eastern US) Gumption"},{"definition":"A person who is lame due to a crippling of the legs or feet."},{"definition":"A crippled leg."},{"definition":"A limp or a limping gait."},{"definition":"A name-calling word, generally for a person who is perceived to be inept, deficient or peculiar"},{"definition":"(BDSM) A sexual submissive, almost always male, dressed generally in a black leather suit. See Gimp (sadomasochism) in Wikipedia."},{"definition":"A character or ability that is underpowered."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of yarn, cord, thread, etc.) To wrap or wind (surround) with another length of yarn or wire in a tight spiral, often by means of a gimping machine, creating 'gimped yarn', etc. Also, generally, to wrap or twist with string or wire. See gimped."},{"definition":"To notch or indent; to jag or make jagged; to edge with serrations or grooves."},{"definition":"To limp; to hobble."},{"definition":"To make underpowered; to limit or restrict the useful effects of."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(Scotland and N England) Neat; trim; delicate; slender; handsome; spruce; elegant."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"gimp-1-au","text":"/ɡɪmp/"}]},{"word":"UNCOVERED","idx":16589,"count":2200137,"meanings":[{"definitions":[{"definition":"To remove a cover from.","example":"The model railway was uncovered."},{"definition":"To reveal the identity of.","example":"The murderer has finally been uncovered."},{"definition":"To show openly; to disclose; to reveal."},{"definition":"To remove one's hat or cap as a mark of respect."},{"definition":"To expose the genitalia."},{"definition":"To expose (lines of formation of troops) successively by the wheeling to right or left of the lines in front."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not covered or protected from the weather, etc."},{"definition":"Lacking insurance or security."},{"definition":"Bareheaded."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈkʌvɚd/"},{"text":"/ʌnˈkʌvəd/"}]},{"word":"HEMP","idx":16590,"count":2200098,"meanings":[{"definitions":[{"definition":"A tall annual herb, Cannabis sativa, native to Asia."},{"definition":"Various products of this plant, including fibres and the drug cannabis."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/hɛmp/"}]},{"word":"PROFICIENT","idx":16592,"count":2199374,"meanings":[{"definitions":[{"definition":"An expert."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Good at something; skilled; fluent; practiced, especially in relation to a task or skill.","example":"He was a proficient writer with an interest in human nature."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"proficient-us","text":"/pɹoʊˈfɪʃ.ənt/"}]},{"word":"PELICAN","idx":16593,"count":2199254,"meanings":[{"definitions":[{"definition":"Any of various seabirds of the family Pelecanidae, having a long bill with a distendable pouch."},{"definition":"A native or resident of the American state of Louisiana."},{"definition":"A retort or still having a curved tube or tubes leading back from the head to the body for continuous condensation and redistillation."},{"definition":"A set of forceps used to force overcrowded teeth apart."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"pelican-us","text":"/ˈpɛl.ə.kən/"}]},{"word":"CYCLIC","idx":16594,"count":2199045,"meanings":[{"definitions":[{"definition":"Characterized by, or moving in cycles, or happening at regular intervals.","example":"The weather had a cyclic pattern of rain and sun."},{"definition":"(of a compound) Having chains of atoms arranged in a ring.","example":"Benzene and cyclohexane are both cyclic compounds."},{"definition":"Having parts arranged in a whorl."},{"definition":"(of a group) Being generated by only one element."},{"definition":"(of a polygon) Able to be inscribed in a circle."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsaɪklɪk/"}]},{"word":"SWIMSUIT","idx":16595,"count":2199038,"meanings":[{"definitions":[{"definition":"A garment worn for swimming.","example":"Put on your swimsuit and let's go for a swim."},{"definition":"A tight-fitting one-piece garment worn by women and girls.","example":"Jade refused to go swimming with her brother until he helped her find her favorite swimsuit."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"swimsuit-us"}]},{"word":"APOCALYPSE","idx":16596,"count":2198730,"meanings":[{"definitions":[{"definition":"A revelation.","example":"The early development of Perl 6 was punctuated by a series of apocalypses by Larry Wall."},{"definition":"The unveiling of events prophesied in the Revelation; the second coming and the end of life on Earth; global destruction."},{"definition":"The Book of Revelation."},{"definition":"A disaster; a cataclysmic event."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈpɑkəlɪps/"},{"text":"/əˈpɒkəlɪps/"}]},{"word":"MORPHOLOGY","idx":16597,"count":2198704,"meanings":[{"definitions":[{"definition":"A scientific study of form and structure, usually without regard to function. Especially:"},{"definition":"The form and structure of something."},{"definition":"A description of the form and structure of something."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/mɔɹˈfɑlədʒi/"}]},{"word":"COUSINS","idx":16600,"count":2197809,"meanings":[{"definitions":[{"definition":"The child of a person's uncle or aunt; a first cousin.","example":"I think my cousin is a good man."},{"definition":"Any relation who is not a direct ancestor or descendant but part of one's extended family; one more distantly related than an uncle, aunt, granduncle, grandaunt, nephew, niece, grandnephew, grandniece, etc."},{"definition":"A title formerly given by a king to a nobleman, particularly to those of the council. In English writs, etc., issued by the crown, it signifies any earl."},{"definition":"Something kindred or related to something else."},{"definition":"(chiefly in the plural) A member of the British intelligence services (from an American perspective) or of the American intelligence services (from a British perspective)."}],"partOfSpeech":"n"}]},{"word":"DISCHARGES","idx":16601,"count":2197331,"meanings":[{"definitions":[{"definition":"Pus or exudate (other than blood) from a wound or orifice, usually due to infection or pathology."},{"definition":"The act of accomplishing (an obligation) or repaying a debt etc.; performance."},{"definition":"The act of expelling or letting go."},{"definition":"The act of firing a projectile, especially from a firearm."},{"definition":"The process of unloading something."},{"definition":"The process of flowing out."},{"definition":"The act of releasing an accumulated charge."},{"definition":"The act of releasing an inpatient from hospital."},{"definition":"The act of releasing a member of the armed forces from service."},{"definition":"The volume of water transported by a river in a certain amount of time, usually in units of m3/s (cubic meters per second)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To accomplish or complete, as an obligation."},{"definition":"To free of a debt, claim, obligation, responsibility, accusation, etc.; to absolve; to acquit; to forgive; to clear."},{"definition":"To send away (a creditor) satisfied by payment; to pay one's debt or obligation to."},{"definition":"To set aside; to annul; to dismiss."},{"definition":"To expel or let go."},{"definition":"To let fly, as a missile; to shoot."},{"definition":"To release (an accumulated charge)."},{"definition":"To relieve of an office or employment; to send away from service; to dismiss."},{"definition":"To release legally from confinement; to set at liberty.","example":"to discharge a prisoner"},{"definition":"To operate (any weapon that fires a projectile, such as a shotgun or sling)."},{"definition":"To release (an auxiliary assumption) from the list of assumptions used in arguments, and return to the main argument."},{"definition":"To unload a ship or another means of transport."},{"definition":"To put forth, or remove, as a charge or burden; to take out, as that with which anything is loaded or filled.","example":"to discharge a cargo"},{"definition":"To give forth; to emit or send out.","example":"A pipe discharges water."},{"definition":"To let fly; to give expression to; to utter.","example":"He discharged a horrible oath."},{"definition":"To bleach out or to remove or efface, as by a chemical process.","example":"to discharge the colour from a dyed fabric in order to form light figures on a dark background"},{"definition":"To prohibit; to forbid."}],"partOfSpeech":"ve"}]},{"word":"CONDOM","idx":16603,"count":2196416,"meanings":[{"definitions":[{"definition":"A flexible sleeve made of latex or other impermeable material such as sheepskin, worn over an erect penis during intercourse as a contraceptive or as a way to prevent the spread of STDs."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"condom-us","text":"/ˈkɑn.dəm/"}]},{"word":"ADMIRE","idx":16604,"count":2196307,"meanings":[{"definitions":[{"definition":"To be amazed at; to view with surprise; to marvel at."},{"definition":"To regard with wonder and delight."},{"definition":"To look upon with an elevated feeling of pleasure, as something which calls out approbation, esteem, love or reverence."},{"definition":"To estimate or value highly; to hold in high esteem.","example":"He had always admired the work ethos and family values of his friend."},{"definition":"To be enthusiastic about (doing something); to want or like (to do something). (Sometimes followed by to.)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"admire-us","text":"/ədˈmaɪɹ/"}]},{"word":"WESTERNS","idx":16605,"count":2196151,"meanings":[{"definitions":[{"definition":"A film, or some other dramatic work, set in, the historic (c. 1850-1910) American West (west of the Mississippi river) focusing on conflict between whites and Indians, lawmen and outlaws, ranchers and farmers, or industry (railroads, mining) and agriculture."}],"partOfSpeech":"n"}]},{"word":"DODGERS","idx":16607,"count":2195501,"meanings":[{"definitions":[{"definition":"Someone who dodges."},{"definition":"A frame-supported canvas over the companionway (entrance) of a sailboat providing the on-deck crew partial cover from the splashes of the seas that break against the hull of the boat."},{"definition":"An advertising leaflet; a flyer."},{"definition":"Bread."}],"partOfSpeech":"n"}]},{"word":"LITRE","idx":16608,"count":2195204,"meanings":[{"definitions":[{"definition":"The metric unit of fluid measure, equal to one cubic decimetre. Symbols: l, L, ℓ","example":"You should be able to fill four cups with one litre of water."},{"definition":"A measure of volume equivalent to a litre."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"litre-uk","text":"/ˈliː.tə/"}]},{"word":"POURED","idx":16609,"count":2195144,"meanings":[{"definitions":[{"definition":"To cause (liquid, or liquid-like substance) to flow in a stream, either out of a container or into it.","example":"pour water from a jug"},{"definition":"To send out as in a stream or a flood; to cause (an emotion) to come out; to cause to escape."},{"definition":"To send forth from, as in a stream; to discharge uninterruptedly."},{"definition":"To flow, pass or issue in a stream; to fall continuously and abundantly.","example":"the rain poured down."},{"definition":"To rain hard.","example":"It's pouring outside."},{"definition":"Of a beverage, to be on tap or otherwise available for serving to customers."},{"definition":"To move in a throng, as a crowd.","example":"The people poured out of the theater."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"poured-us","text":"/pɔɹd/"}]},{"word":"USEFULNESS","idx":16610,"count":2194801,"meanings":[{"definitions":[{"definition":"The quality or degree of being useful.","example":"The usefulness of his latest reorganisation has been disputed."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈjuːsfəlnəs/"}]},{"word":"UNSOLICITED","idx":16611,"count":2194503,"meanings":[{"definitions":[{"definition":"Not requested, welcome or invited.","example":"People have become very frustrated with unsolicited sales calls."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unsolicited-us","text":"/ˌʌnsəˈlɪsɪtɪd/"}]},{"word":"BINDS","idx":16612,"count":2193939,"meanings":[{"definitions":[{"definition":"That which binds or ties."},{"definition":"A troublesome situation; a problem; a predicament or quandary."},{"definition":"Any twining or climbing plant or stem, especially a hop vine; a bine."},{"definition":"A ligature or tie for grouping notes."},{"definition":"A strong grip or stranglehold on a position that is difficult for the opponent to break.","example":"the Maróczy Bind"},{"definition":"The indurated clay of coal mines."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To tie; to confine by any ligature."},{"definition":"To cohere or stick together in a mass.","example":"Just to make the cheese more binding"},{"definition":"To be restrained from motion, or from customary or natural action, as by friction.","example":"I wish I knew why the sewing machine binds up after I use it for a while."},{"definition":"To exert a binding or restraining influence.","example":"These are the ties that bind."},{"definition":"To tie or fasten tightly together, with a cord, band, ligature, chain, etc.","example":"to bind grain in bundles  to bind a prisoner"},{"definition":"To confine, restrain, or hold by physical force or influence of any kind.","example":"Frost binds the earth."},{"definition":"To couple."},{"definition":"To oblige, restrain, or hold, by authority, law, duty, promise, vow, affection, or other social tie.","example":"to bind the conscience  to bind by kindness  bound by affection  commerce binds nations to each other"},{"definition":"To put (a person) under definite legal obligations, especially, under the obligation of a bond or covenant."},{"definition":"To place under legal obligation to serve.","example":"to bind an apprentice  bound out to service"},{"definition":"To protect or strengthen by applying a band or binding, as the edge of a carpet or garment."},{"definition":"To make fast (a thing) about or upon something, as by tying; to encircle with something.","example":"to bind a belt about one  to bind a compress upon a wound"},{"definition":"To cover, as with a bandage.","example":"to bind up a wound"},{"definition":"To prevent or restrain from customary or natural action, as by producing constipation.","example":"Certain drugs bind the bowels."},{"definition":"To put together in a cover, as of books.","example":"The three novels were bound together."},{"definition":"To make two or more elements stick together."},{"definition":"To associate an identifier with a value; to associate a variable name, method name, etc. with the content of a storage location."},{"definition":"To complain; to whine about something."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/baɪndz/"}]},{"word":"UNVEILED","idx":16613,"count":2193279,"meanings":[{"definitions":[{"definition":"To remove a veil from; to uncover; to reveal something hidden."},{"definition":"To remove a veil; to reveal oneself."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not wearing, or not covered by, a veil."}],"partOfSpeech":"j"}]},{"word":"CORRELATIONS","idx":16614,"count":2193131,"meanings":[{"definitions":[{"definition":"A reciprocal, parallel or complementary relationship between two or more comparable objects."},{"definition":"One of the several measures of the linear statistical relationship between two random variables, indicating both the strength and direction of the relationship."},{"definition":"An isomorphism from a projective space to the dual of a projective space, often to the dual of itself."}],"partOfSpeech":"n"}]},{"word":"TEXTUAL","idx":16617,"count":2192863,"meanings":[{"definitions":[{"definition":"Of, or pertaining to text."},{"definition":"Pertaining to text messages, by analogy with sexual: textual harassment, textual intercourse; compare sexting."},{"definition":"Contrast with libel"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɛk.stju.əl/"}]},{"word":"SUFFIX","idx":16618,"count":2192739,"meanings":[{"definitions":[{"definition":"(grammar) A morpheme added at the end of a word to modify the word's meaning.","example":"The suffix \"-able\" changes \"sing\" into \"singable\"."},{"definition":"A subscript."},{"definition":"A final segment of a string of characters.","example":"The string \"abra\" is both a prefix and a suffix of the string \"abracadabra\"."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To append (something) to the end of something else."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"suffix-us"}]},{"word":"HANDSETS","idx":16619,"count":2192653,"meanings":[{"definitions":[{"definition":"The part of a landline telephone containing both receiver and transmitter (and sometimes dial), held in the hand."},{"definition":"A mobile phone."}],"partOfSpeech":"n"}]}]