[{"word":"COHABITING","idx":77634,"count":154651,"meanings":[{"definitions":[{"definition":"To live together with someone else, especially in a romantic and sexual relationship but without being married."},{"definition":"To coexist in common environs with."},{"definition":"To engage in sexual intercourse; see coition."}],"partOfSpeech":"ve"}]},{"word":"BREASTPLATE","idx":77636,"count":154648,"meanings":[{"definitions":[{"definition":"A piece of armor that covers the chest."},{"definition":"A piece of horse tack designed to prevent the saddle slipping backwards."},{"definition":"A piece of silicone in the shape of women's breasts worn by drag queens and other female impersonators to simulate a female body shape."},{"definition":"An embroidered square of linen worn on the breast of the Jewish high priest, bearing twelve precious stones, each inscribed with the name of one of the tribes of Israel."}],"partOfSpeech":"n"}]},{"word":"DRAUGHTS","idx":77637,"count":154636,"meanings":[{"definitions":[{"definition":"A current of air, usually coming into a room or vehicle."},{"definition":"Draw through a flue of gasses (smoke) resulting from a combustion process."},{"definition":"An act of drinking."},{"definition":"The quantity of liquid (such as water, alcohol, or medicine) drunk in one swallow.","example":"She took a deep draft from the bottle of water."},{"definition":"A dose (of medicine, alcohol, etc.)"},{"definition":"Beer drawn from a cask or keg rather than a bottle or can."},{"definition":"Depth of water needed to float a ship; depth below the water line to the bottom of a vessel's hull; depth of water drawn by a vessel."},{"definition":"An early version of a written work (such as a book or e-mail) or drawing.","example":"His first drafts were better than most authors' final products."},{"definition":"A preliminary sketch or outline for a plan."},{"definition":"A cheque, an order for money to be paid."},{"definition":"Conscription, the system of forcing people to serve in the military.","example":"He left the country to avoid the draft."},{"definition":"A system of forcing or convincing people to take an elected position."},{"definition":"A system of assigning rookie players to professional sports teams."},{"definition":"The pulling force (tension) on couplers and draft gear during a slack stretched condition."},{"definition":"The bevel given to the pattern for a casting, so that it can be drawn from the sand without damaging the mould."},{"definition":"(possibly obsolete) The action or an act (especially of a beast of burden or vehicle) of pulling something along or back.","example":"using oxen for draft   shot forth an arrow with a mighty draft"},{"definition":"(possibly obsolete) The act of drawing in a net for fish."},{"definition":"(possibly obsolete) That which is drawn in; a catch, a haul.","example":"he cast his net, which brought him a very great draft"},{"definition":"A quantity that is requisitioned or drawn out from a larger population."},{"definition":"A checker: a game piece used in the game of draughts."},{"definition":"Ale: a type of beer brewed using top-fermenting yeast."},{"definition":"A mild vesicatory."},{"definition":"An outhouse: an outbuilding used as a lavatory."},{"definition":"Any picture or drawing."},{"definition":"A sudden attack upon an enemy."},{"definition":"A board game for two players in which the players each have a set number of pieces (typically 12 or 20, depending on the rule set), known as men, and the object is to capture each of the opponent's pieces by jumping one's own pieces over the opponent's pieces."},{"definition":"A mild vesicatory."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To write a first version, make a preliminary sketch."},{"definition":"To draw in outline; to make a draught, sketch, or plan of, as in architectural and mechanical drawing."},{"definition":"To write a law."},{"definition":"To conscript a person, force a person to serve in some capacity, especially in the military.","example":"He was drafted during the Vietnam War."},{"definition":"To select someone (or something) for a particular role or purpose.","example":"There was a campaign to draft Smith to run for President."},{"definition":"To select and separate an animal or animals from a group.","example":"The calves were drafted from the cows."},{"definition":"To select a rookie player onto a professional sports team.","example":"After his last year of college football, he was drafted by the Miami Dolphins."},{"definition":"To follow very closely (behind another vehicle), thereby providing an aerodynamic advantage to both lead and follower and conserving energy or increasing speed."},{"definition":"To draw out; to call forth."},{"definition":"To draw fibers out of a clump, for spinning in the production of yarn."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"draughts-us","text":"/dɹæfts/"}]},{"word":"RESUPPLY","idx":77644,"count":154606,"meanings":[{"definitions":[{"definition":"The act of supplying again."},{"definition":"(backpacking) A package of materials used to replenish supplies."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply again."}],"partOfSpeech":"ve"}]},{"word":"AUXIN","idx":77645,"count":154606,"meanings":[{"definitions":[{"definition":"A class of plant growth substance (often called phytohormones or plant hormones) which play an essential role in coordination of many growth and behavioral processes in the plant life cycle."}],"partOfSpeech":"n"}]},{"word":"HEAVED","idx":77650,"count":154596,"meanings":[{"definitions":[{"definition":"To lift with difficulty; to raise with some effort; to lift (a heavy thing).","example":"We heaved the chest-of-drawers on to the second-floor landing."},{"definition":"To throw, cast.","example":"The cap'n hove the body overboard."},{"definition":"To rise and fall.","example":"Her chest heaved with emotion."},{"definition":"To utter with effort.","example":"She heaved a sigh and stared out of the window."},{"definition":"To pull up with a rope or cable.","example":"Heave up the anchor there, boys!"},{"definition":"To lift (generally); to raise, or cause to move upwards (particularly in ships or vehicles) or forwards."},{"definition":"To be thrown up or raised; to rise upward, as a tower or mound."},{"definition":"To displace (a vein, stratum)."},{"definition":"To cause to swell or rise, especially in repeated exertions.","example":"The wind heaved the waves."},{"definition":"To move in a certain direction or into a certain position or situation.","example":"to heave the ship ahead"},{"definition":"To retch, to make an effort to vomit; to vomit.","example":"The smell of the old cheese was enough to make you heave."},{"definition":"To make an effort to raise, throw, or move anything; to strain to do something difficult."},{"definition":"To rob; to steal from; to plunder."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hiːvd/"}]},{"word":"INDIVIDUALIST","idx":77654,"count":154588,"meanings":[{"definitions":[{"definition":"Someone who believes in individualism as a sociopolitical system."},{"definition":"Someone who believes in the philosophy of individualism; a solipsist."},{"definition":"Someone who does as they wish, unconstrained by external influences."}],"partOfSpeech":"n"}]},{"word":"FASHIONING","idx":77659,"count":154581,"meanings":[{"definitions":[{"definition":"To make, build or construct, especially in a crude or improvised way."},{"definition":"To make in a standard manner; to work."},{"definition":"To fit, adapt, or accommodate to."},{"definition":"To forge or counterfeit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process of fashioning something; manufacture."}],"partOfSpeech":"n"}]},{"word":"BUSHWALKING","idx":77662,"count":154563,"meanings":[{"definitions":[{"definition":"To undertake an off-road walk in the countryside."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The activity of hiking or backpacking."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"bushwalking-au"}]},{"word":"CHURNED","idx":77664,"count":154553,"meanings":[{"definitions":[{"definition":"To agitate rapidly and repetitively, or to stir with a rowing or rocking motion; generally applies to liquids, notably cream.","example":"Now the cream is churned to make butter."},{"definition":"To produce excessive and sometimes undesirable or unproductive activity or motion."},{"definition":"To move rapidly and repetitively with a rocking motion; to tumble, mix or shake.","example":"I was so nervous that my stomach was churning."},{"definition":"(of a customer) To stop using a company's product or service."},{"definition":"(travel) To repeatedly cancel and rebook a reservation in order to refresh ticket time limits or other fare rule restrictions."},{"definition":"(travel) To continually sign up for new credit cards in order to earn signup bonuses, airline miles, and other benefits."}],"partOfSpeech":"ve"}]},{"word":"PISTACHIOS","idx":77665,"count":154548,"meanings":[{"definitions":[{"definition":"A deciduous tree (Pistacia vera) grown in parts of Asia for its drupaceous fruit."},{"definition":"The nutlike fruit of this tree."},{"definition":"(color) A pale green colour, like that of a pistachio seed."}],"partOfSpeech":"n"}]},{"word":"IRONIES","idx":77671,"count":154533,"meanings":[{"definitions":[{"definition":"A statement that, when taken in context, may actually mean something different from, or the opposite of, what is written literally; the use of words expressing something other than their literal intention, often in a humorous context."},{"definition":"Dramatic irony: a theatrical effect in which the meaning of a situation, or some incongruity in the plot, is understood by the audience, but not by the characters in the play."},{"definition":"Ignorance feigned for the purpose of confounding or provoking an antagonist; Socratic irony."},{"definition":"The state of two usually unrelated entities, parties, actions, etc. being related through a common connection in an uncommon way."},{"definition":"Contradiction between circumstances and expectations; condition contrary to what might be expected."}],"partOfSpeech":"n"}]},{"word":"BORIC","idx":77673,"count":154527,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or containing the element boron."}],"partOfSpeech":"j"}]},{"word":"MICROSITES","idx":77674,"count":154515,"meanings":[{"definitions":[{"definition":"A self-contained page or group of pages meant to supplement a larger website.","example":"The movie site has a microsite where fans can speculate about the ending."},{"definition":"A small area with distinctive ecological characteristics.","example":"This species was found only in the microsite at the foot of the bluff."}],"partOfSpeech":"n"}]},{"word":"RELIVING","idx":77682,"count":154499,"meanings":[{"definitions":[{"definition":"To experience (something) again; to live over again.","example":"I relive that horrible accident every night and wake screaming."},{"definition":"To bring back to life; to revive, resuscitate."},{"definition":"To come back to life."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act by which something is relived."}],"partOfSpeech":"n"}]},{"word":"FUSEBOX","idx":77684,"count":154495,"meanings":[{"definitions":[{"definition":"A compartment containing the fuses or circuit breakers for a domestic electricity power supply."}],"partOfSpeech":"n"}]},{"word":"ACROBATS","idx":77686,"count":154489,"meanings":[{"definitions":[{"definition":"An athlete who performs acts requiring skill, agility and coordination."}],"partOfSpeech":"n"}]},{"word":"TRIBALS","idx":77687,"count":154486,"meanings":[{"definitions":[{"definition":"A design or image that has been influenced by indigenous peoples; especially such a tattoo."}],"partOfSpeech":"n"}]},{"word":"ENDORPHIN","idx":77690,"count":154477,"meanings":[{"definitions":[{"definition":"Any of a group of peptide hormones found in the brain that act as neurotransmitters and have properties similar to morphine."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɛnˈdɔ(ɹ)fɪn/"},{"text":"/ɛnˈdɔːfɪn/"}]},{"word":"DAPPLED","idx":77692,"count":154476,"meanings":[{"definitions":[{"definition":"To mark or become marked with mottling or spots."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a mottled or spotted skin or coat, dapple."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[ˈdæpəɫd]"}]},{"word":"GALLIC","idx":77693,"count":154472,"meanings":[{"definitions":[{"definition":"Of, pertaining to, or derived from galls."},{"definition":"Of or pertaining to gallic acid or its derivatives."},{"definition":"Relating to, or containing, gallium."}],"partOfSpeech":"j"}]},{"word":"PHOBIC","idx":77696,"count":154464,"meanings":[{"definitions":[{"definition":"A person who has a phobia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to a phobia.","example":"Anything can become a phobic stimulus."},{"definition":"Experiencing or expressing phobia (strong fear and/or dislike).","example":"The mail carrier was phobic of dogs."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfoʊbɪk/"},{"text":"/ˈfəʊbɪk/"}]},{"word":"TUBULE","idx":77701,"count":154450,"meanings":[{"definitions":[{"definition":"A small pipe or fistular body; a little tube.","example":"renal tubule"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtubjul/"},{"text":"/ˈtjuːbjuːl/"}]},{"word":"KAYO","idx":77705,"count":154447,"meanings":[{"definitions":[{"definition":"A knockout (in boxing)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To knock someone out, or render them unconscious or senseless."}],"partOfSpeech":"ve"}]},{"word":"AZALEAS","idx":77709,"count":154434,"meanings":[{"definitions":[{"definition":"A plant of the obsolete genus Azalea."}],"partOfSpeech":"n"}]},{"word":"PATRIARCHATE","idx":77710,"count":154433,"meanings":[{"definitions":[{"definition":"The term of office of a Christian patriarch.","example":"The patriarchate of Pope John Paul II as Patriarch of the West was more than 25 years."},{"definition":"The office or ecclesial jurisdiction of such a patriarch.","example":"The Patriarchate of Constantinople has primacy over the whole of the Orthodox world."},{"definition":"The office-space occupied by a patriarch and his staff.","example":"The Latin patriarchate in Jerusalem is, by modern standards, a very cramped space."}],"partOfSpeech":"n"}]},{"word":"WALTZING","idx":77712,"count":154418,"meanings":[{"definitions":[{"definition":"To dance the waltz (with).","example":"They waltzed for twenty-one hours and seventeen minutes straight, setting a record."},{"definition":"(usually with in, into, around, etc.) To move briskly and unhesitatingly, especially in an inappropriately casual manner, or when unannounced or uninvited.","example":"He waltzed into the room like he owned the place."},{"definition":"To accomplish a task with little effort.","example":"Don't worry about the interview — you'll waltz it."},{"definition":"To move with fanfare."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The motion of one who waltzes."}],"partOfSpeech":"n"}]},{"word":"THERMONUCLEAR","idx":77714,"count":154413,"meanings":[{"definitions":[{"definition":"Of, or relating to the fusion of atomic nuclei at high temperatures."},{"definition":"Of, or relating to the use of atomic weapons based on such fusion, especially as distinguished from those based on fission."}],"partOfSpeech":"j"}]},{"word":"TACKING","idx":77716,"count":154404,"meanings":[{"definitions":[{"definition":"To nail with a tack (small nail with a flat head)."},{"definition":"To sew/stich with a tack (loose seam used to temporarily fasten pieces of cloth)."},{"definition":"To maneuver a sailing vessel so that its bow turns through the wind, i.e. the wind changes from one side of the vessel to the other."},{"definition":"To add something as an extra item.","example":"to tack (something) onto (something)"},{"definition":"Often paired with \"up\", to place the tack on a horse."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Loose temporary stitches in dressmaking etc."},{"definition":"The act of changing tack."},{"definition":"A union of securities given at different times, all of which must be redeemed before an intermediate purchaser can interpose a claim."},{"definition":"The joining together of consecutive periods of possession of property, especially between squatters in cases of adverse possession."}],"partOfSpeech":"n"}]},{"word":"POLEMICS","idx":77719,"count":154385,"meanings":[{"definitions":[{"definition":"A person who writes in support of one opinion, doctrine, or system, in opposition to another; one skilled in polemics; a controversialist; a disputant."},{"definition":"An argument or controversy."},{"definition":"A strong verbal or written attack on someone or something."},{"definition":"The art or practice of making arguments or controversies."},{"definition":"The refutation of errors in theological doctrine."}],"partOfSpeech":"n"}]},{"word":"FEIGNED","idx":77721,"count":154380,"meanings":[{"definitions":[{"definition":"To make a false show or pretence of; to counterfeit or simulate.","example":"The pupil feigned sickness on the day of his exam."},{"definition":"To imagine; to invent; to pretend.","example":"He feigned that he had gone home at the appointed time."},{"definition":"To make an action as if doing one thing, but actually doing another, for example to trick an opponent."},{"definition":"To hide or conceal.","example":"Jessica feigned the fact that she had not done her homework."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Being a pretense, a counterfeit, or something false or fraudulent."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfeɪnd/"}]},{"word":"QUESO","idx":77722,"count":154373,"meanings":[{"definitions":[{"definition":"Melted cheese, used for instance as a dipping sauce."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkeɪsoʊ/"},{"text":"/ˈkeɪsəʊ/"}]},{"word":"ESOPHAGITIS","idx":77726,"count":154365,"meanings":[{"definitions":[{"definition":"Inflammation of the oesophagus."}],"partOfSpeech":"n"}]},{"word":"ARMRESTS","idx":77729,"count":154348,"meanings":[{"definitions":[{"definition":"Part of the seat of a chair that is designed to support the arm."}],"partOfSpeech":"n"}]},{"word":"DROSS","idx":77730,"count":154345,"meanings":[{"definitions":[{"definition":"Waste or impure matter."},{"definition":"Residue that forms on the surface of a metal from oxidation."},{"definition":"The impurities in metal."},{"definition":"A waste product from working with metal."},{"definition":"Worthless or trivial matter."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove dross from."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dɹɔs/"},{"text":"/dɹɒs/"},{"text":"/dɹɑs/"}]},{"word":"SOLIDITY","idx":77733,"count":154323,"meanings":[{"definitions":[{"definition":"The state or quality of being solid."},{"definition":"Moral firmness; validity; truth; certainty."},{"definition":"The solid contents of a body; volume; amount of enclosed space."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"solidity-uk","text":"/səˈlɪdɪti/"}]},{"word":"DOGE","idx":77735,"count":154318,"meanings":[{"definitions":[{"definition":"The chief magistrate in the republics of Venice and Genoa."},{"definition":"A dog."},{"definition":"Specifically, a Shiba Inu, as in the doge meme."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"doge-1-us","text":"/doʊdʒ/"}]},{"word":"HOSPITALISATION","idx":77739,"count":154308,"meanings":[{"definitions":[{"definition":"The hospitalizing of a patient, the condition of being hospitalized, or the period a patient stays in hospital."},{"definition":"Insurance that pays a patient's expenses."}],"partOfSpeech":"n"}]},{"word":"DOCKYARD","idx":77740,"count":154302,"meanings":[{"definitions":[{"definition":"A place where ships are repaired or outfitted."}],"partOfSpeech":"n"}]},{"word":"OPPORTUNIST","idx":77744,"count":154278,"meanings":[{"definitions":[{"definition":"Someone who takes advantage of any opportunity to advance their own situation, placing expediency above principle."}],"partOfSpeech":"n"}]},{"word":"INDECISIVE","idx":77746,"count":154278,"meanings":[{"definitions":[{"definition":"(of a person) Not decisive; not marked by promptness or decision.","example":"They were all being very indecisive about what to wear to the party."},{"definition":"(of a contest etc.) inconclusive or uncertain","example":"The outcome of the race was so indecisive."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"indecisive-au","text":"/ˌɪndɪˈsaɪsɪv/"}]},{"word":"YUCKY","idx":77748,"count":154277,"meanings":[{"definitions":[{"definition":"Of something highly offensive; causing aversion or disgust."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈjʌki/"},{"text":"/ˈjʌkɪ/"}]},{"word":"RECURS","idx":77750,"count":154276,"meanings":[{"definitions":[{"definition":"To have recourse (to) someone or something for assistance, support etc."},{"definition":"To happen again.","example":"The theme of the prodigal son recurs later in the third act."},{"definition":"To recurse."}],"partOfSpeech":"ve"}]},{"word":"DRIPPED","idx":77751,"count":154273,"meanings":[{"definitions":[{"definition":"To fall one drop at a time.","example":"Listening to the tap next door drip all night drove me mad!"},{"definition":"To leak slowly.","example":"Does the sink drip, or have I just spilt water over the floor?"},{"definition":"To let fall in drops.","example":"After putting oil on the side of the salad, the chef should drip a little vinegar in the oil."},{"definition":"(usually with with) To have a superabundance of valuable things.","example":"The Old Hall simply drips with masterpieces of the Flemish painters."},{"definition":"(of the weather) To rain lightly.","example":"The weather isn't so bad. I mean, it's dripping, but you're not going to get so wet."},{"definition":"To be wet, to be soaked."},{"definition":"To whine or complain consistently; to grumble."}],"partOfSpeech":"ve"}]},{"word":"REFUEL","idx":77763,"count":154235,"meanings":[{"definitions":[{"definition":"An act or instance of refilling with fuel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To refill with fuel."}],"partOfSpeech":"ve"}]},{"word":"REDEVELOPED","idx":77764,"count":154231,"meanings":[{"definitions":[{"definition":"To develop again or differently.","example":"to redevelop an unsuccessful product for relaunch"},{"definition":"To intensify by a second process."},{"definition":"To convert a neighbourhood by demolishing old buildings and building new ones, or by renovating existing ones."}],"partOfSpeech":"ve"}]},{"word":"EPICURE","idx":77767,"count":154227,"meanings":[{"definitions":[{"definition":"A person who takes particular pleasure in fine food and drink."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"epicure-us","text":"/ˈɛpɪkjʊɹ/"}]},{"word":"SORBENT","idx":77774,"count":154192,"meanings":[{"definitions":[{"definition":"A substance that can enable sorption."}],"partOfSpeech":"n"}]},{"word":"REMEDIATE","idx":77776,"count":154189,"meanings":[{"definitions":[{"definition":"To correct or improve (a deficiency or problem)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Intended to correct or improve deficient skills in some subject."},{"definition":"Remedial."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɹəˈmiːdi.ət/"}]},{"word":"CINNABAR","idx":77779,"count":154180,"meanings":[{"definitions":[{"definition":"A deep red mineral, mercuric sulfide, HgS; the principal ore of mercury; such ore used as the pigment vermilion."},{"definition":"A bright red colour tinted with orange."},{"definition":"A species of moth, Tyria jacobaeae, having red patches on its predominantly black wings."},{"definition":"(in “Cinnabar Panacea”) The Elixir of Life."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a bright red colour tinted with orange."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɪ.nə.bɑɹ/"},{"text":"/ˈsɪ.nə.baː(ɹ)/"}]},{"word":"PHOTOELECTRON","idx":77782,"count":154172,"meanings":[{"definitions":[{"definition":"An electron ejected from the surface of a material by the photoelectric effect."}],"partOfSpeech":"n"}]},{"word":"LEVITY","idx":77785,"count":154149,"meanings":[{"definitions":[{"definition":"Lightness of manner or speech, frivolity; lack of appropriate seriousness; inclination to make a joke of serious matters."},{"definition":"Lack of steadiness."},{"definition":"The state or quality of being light, buoyancy."},{"definition":"A lighthearted or frivolous act."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"levity-uk","text":"/ˈlɛ.vɪ.ti/"}]},{"word":"REGULARITIES","idx":77786,"count":154148,"meanings":[{"definitions":[{"definition":"The condition or quality of being regular","example":"I have been watching that show with regularity."},{"definition":"A particular regular occurrence"}],"partOfSpeech":"n"}]},{"word":"MAMMARIES","idx":77788,"count":154140,"meanings":[{"definitions":[{"definition":"A mamma (milk-secreting organ of a woman or a female animal)."}],"partOfSpeech":"n"}]},{"word":"ADJUDICATING","idx":77790,"count":154135,"meanings":[{"definitions":[{"definition":"To settle a legal case or other dispute."},{"definition":"To act as a judge."}],"partOfSpeech":"ve"}]},{"word":"SEROTYPES","idx":77791,"count":154134,"meanings":[{"definitions":[{"definition":"A group of microorganisms characterised by a specific set of antigens."}],"partOfSpeech":"n"}]},{"word":"LUREX","idx":77795,"count":154129,"meanings":[{"definitions":[{"definition":"A form of yarn (or fabric made from it) that incorporates a glittering metallic thread."}],"partOfSpeech":"n"}]},{"word":"JOURNEYING","idx":77796,"count":154129,"meanings":[{"definitions":[{"definition":"To travel, to make a trip or voyage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Travel, travelling"}],"partOfSpeech":"n"}]},{"word":"SPELLER","idx":77797,"count":154122,"meanings":[{"definitions":[{"definition":"A person who spells.","example":"I'm a slow reader but a good speller."},{"definition":"A participant in a spelling bee."},{"definition":"A book used to learn how to spell properly."},{"definition":"A spell checker."}],"partOfSpeech":"n"}]},{"word":"OPPRESSOR","idx":77802,"count":154097,"meanings":[{"definitions":[{"definition":"Someone who oppresses another or others."}],"partOfSpeech":"n"}]},{"word":"METRICAL","idx":77804,"count":154092,"meanings":[{"definitions":[{"definition":"Relating to poetic meter"},{"definition":"Having a regular rhythm"},{"definition":"Of or pertaining to measurement"}],"partOfSpeech":"j"}]},{"word":"SIERRAS","idx":77805,"count":154089,"meanings":[{"definitions":[{"definition":"A rugged range of mountains."},{"definition":"The letter S in the ICAO spelling alphabet."},{"definition":"A scombroid fish."},{"definition":"A relatively low-quality grade of Spanish saffron."}],"partOfSpeech":"n"}]},{"word":"TAMALES","idx":77808,"count":154085,"meanings":[{"definitions":[{"definition":"Mexican dish of cornmeal dough shell filled with various ingredients (e.g. chopped beef, pork, sweet filling) then steamed in corn husks."}],"partOfSpeech":"n"}]},{"word":"HAULS","idx":77812,"count":154079,"meanings":[{"definitions":[{"definition":"To transport by drawing or pulling, as with horses or oxen, or a motor vehicle.","example":"to haul logs to a sawmill"},{"definition":"To draw or pull something heavy."},{"definition":"To carry or transport something, with a connotation that the item is heavy or otherwise difficult to move."},{"definition":"To drag, to pull, to tug."},{"definition":"Followed by up: to summon to be disciplined or held answerable for something."},{"definition":"To pull apart, as oxen sometimes do when yoked."},{"definition":"To steer (a vessel) closer to the wind."},{"definition":"Of the wind: to shift fore (more towards the bow)."},{"definition":"To haul ass.","example":"“How fast was he goin’?” / “I don’t know exactly, but he must’ve been haulin’, given where he landed.”"}],"partOfSpeech":"ve"}]},{"word":"IMMEASURABLY","idx":77825,"count":154042,"meanings":[{"definitions":[{"definition":"In a manner that is not measurable, in a way that can not be measured","example":"The sky seems immeasurably large at night."}],"partOfSpeech":"v"}]},{"word":"HYGROMETER","idx":77826,"count":154033,"meanings":[{"definitions":[{"definition":"An instrument that measures the humidity of the air or other gases, especially the relative humidity."}],"partOfSpeech":"n"}]},{"word":"HAGGLING","idx":77827,"count":154032,"meanings":[{"definitions":[{"definition":"To argue for a better deal, especially over prices with a seller.","example":"I haggled for a better price because the original price was too high."},{"definition":"To hack (cut crudely)"},{"definition":"To stick at small matters; to chaffer; to higgle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of one who haggles."}],"partOfSpeech":"n"}]},{"word":"TUSSLE","idx":77835,"count":154015,"meanings":[{"definitions":[{"definition":"A physical fight or struggle."},{"definition":"A conflict, an argument, a disagreement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have a tussle.","example":"The two sets of fans were tussling before the game."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈtʌsəl/"}]},{"word":"UROLOGIST","idx":77836,"count":154012,"meanings":[{"definitions":[{"definition":"A doctor of urology."}],"partOfSpeech":"n"}]},{"word":"TOUGHENED","idx":77838,"count":154011,"meanings":[{"definitions":[{"definition":"To make tough."},{"definition":"To become tough."}],"partOfSpeech":"ve"}]},{"word":"FIENDISH","idx":77841,"count":153995,"meanings":[{"definitions":[{"definition":"Sinister; evil; like a fiend."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈfiːndɪʃ/"}]},{"word":"DIAPHRAGMS","idx":77842,"count":153978,"meanings":[{"definitions":[{"definition":"In mammals, a sheet of muscle separating the thorax from the abdomen, contracted and relaxed in respiration to draw air into and expel air from the lungs; also called thoracic diaphragm."},{"definition":"Any of various membranes or sheets of muscle or ligament which separate one cavity from another."},{"definition":"A contraceptive device consisting of a flexible cup, used to cover the cervix during intercourse."},{"definition":"A flexible membrane separating two chambers and fixed around its periphery that distends into one or other chamber as the difference in the pressure in the chambers varies."},{"definition":"(acoustics) In a speaker, the thin, semi-rigid membrane which vibrates to produce sound."},{"definition":"A thin opaque structure with a central aperture, used to limit the passage of light into a camera or similar device."},{"definition":"A permeable or semipermeable membrane."},{"definition":"A floor slab, metal wall panel, roof panel or the like, having a sufficiently large in-plane shear stiffness and sufficient strength to transmit horizontal forces to resisting systems."}],"partOfSpeech":"n"}]},{"word":"GLORIFICATION","idx":77844,"count":153972,"meanings":[{"definitions":[{"definition":"The act of glorifying or the state of being glorified."},{"definition":"Specifically, the ascension (of Christ or humans) to the glory of heaven."},{"definition":"The worshiping of a deity; extolment or laudation."},{"definition":"The portrayal of something as being ideal; idealization."}],"partOfSpeech":"n"}]},{"word":"MOTHERSHIP","idx":77845,"count":153970,"meanings":[{"definitions":[{"definition":"A vessel or aircraft that serves or carries a smaller vessel or vessels that operate independently from it."},{"definition":"Fond term of address for one's mother."},{"definition":"The state of being a mother; motherhood"}],"partOfSpeech":"n"}]},{"word":"WAYFARER","idx":77846,"count":153962,"meanings":[{"definitions":[{"definition":"A traveller, especially one on foot."},{"definition":"A type of glasses, with pointed ends and rounded bottoms."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈweɪˌfɛəɹ.ə(ɹ)/"}]},{"word":"FOREBRAIN","idx":77851,"count":153939,"meanings":[{"definitions":[{"definition":"The anterior part of the brain, including the cerebrum, thalamus, and hypothalamus."}],"partOfSpeech":"n"}]},{"word":"REAMER","idx":77852,"count":153931,"meanings":[{"definitions":[{"definition":"A tool for boring a hole wider."},{"definition":"A device for rendering citrus juice."},{"definition":"A tool used to scrape carbon deposit from the bowl of a pipe."},{"definition":"A Stone Age prehistoric lithic stone tool, used in archeology nomenclature."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹi.məɹ/"}]},{"word":"EXPANSES","idx":77854,"count":153929,"meanings":[{"definitions":[{"definition":"A wide stretch, usually of sea, sky, or land."},{"definition":"An amount of spread or stretch."}],"partOfSpeech":"n"}]},{"word":"ANTICONVULSANTS","idx":77864,"count":153896,"meanings":[{"definitions":[{"definition":"An agent that prevents, stops, or lessens convulsions."}],"partOfSpeech":"n"}]},{"word":"DORKY","idx":77866,"count":153891,"meanings":[{"definitions":[{"definition":"Like a dork."}],"partOfSpeech":"j"}]},{"word":"SATSUMA","idx":77868,"count":153888,"meanings":[{"definitions":[{"definition":"A seedless and easy-peeling cultivar of mandarin orange of Japanese origin; Citrus unshiu."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sætˈsu.mə/"},{"text":"/sætˈsuː.mə/"}]},{"word":"HYPOTHETICALLY","idx":77870,"count":153886,"meanings":[{"definitions":[{"definition":"In a hypothetical way; as a hypothesis.","example":"He offered the proposition hypothetically."},{"definition":"Used to introduce a proposition to discussion without commitment to its truth","example":"Hypothetically, what would you say if I proposed marriage to you?"}],"partOfSpeech":"v"}]},{"word":"HEMS","idx":77876,"count":153874,"meanings":[{"definitions":[{"definition":"An utterance or sound of the voice like \"hem\", often indicative of hesitation or doubt, sometimes used to call attention."},{"definition":"The border of an article of clothing doubled back and stitched together to finish the edge and prevent it from fraying."},{"definition":"A rim or margin of something."},{"definition":"In sheet metal design, a rim or edge folded back on itself to create a smooth edge and to increase strength or rigidity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make the sound expressed by the word hem; to hesitate in speaking."},{"definition":"(in sewing) To make a hem."},{"definition":": To put hem on an article of clothing, to edge or put a border on something."},{"definition":": To surround something or someone in a confining way.","example":"A small yard hemmed about by a tall hedge."}],"partOfSpeech":"ve"}]},{"word":"DERVISH","idx":77879,"count":153858,"meanings":[{"definitions":[{"definition":"A member of the Dervish fraternity of Sufism, known for spinning."},{"definition":"A citizen or inhabitant of Darawiish (circa 1895–1920 C.E.), the Dhulbahante anti-colonial polity geographically corresponding with Khaatumo."},{"definition":"One of the fanatical followers of the Mahdi, in the Sudan, in the 1880s."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɜːvɪʃ/"}]},{"word":"IRREPRESSIBLE","idx":77880,"count":153844,"meanings":[{"definitions":[{"definition":"Not containable or controllable."},{"definition":"(of a person) Especially high-spirited, outspoken, or insistent."}],"partOfSpeech":"j"}]},{"word":"INTERROGATING","idx":77884,"count":153832,"meanings":[{"definitions":[{"definition":"To question or quiz, especially in a thorough and/or aggressive manner","example":"The police interrogated the suspect at some length before they let him go."},{"definition":"To query; to request information from.","example":"to interrogate a database"},{"definition":"To examine critically."}],"partOfSpeech":"ve"}]},{"word":"MONADNOCK","idx":77885,"count":153822,"meanings":[{"definitions":[{"definition":"A hill or mountain standing isolated above a predominantly flat plain."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/məˈnædˌnɒk/"}]},{"word":"GENERALIZES","idx":77886,"count":153820,"meanings":[{"definitions":[{"definition":"To speak in generalities, or in vague terms."},{"definition":"To infer or induce from specific cases to more general cases or principles."},{"definition":"To derive or deduce (a general concept or principle) from particular facts."}],"partOfSpeech":"ve"}]},{"word":"READYING","idx":77887,"count":153815,"meanings":[{"definitions":[{"definition":"To prepare; to make ready for action."}],"partOfSpeech":"ve"}]},{"word":"SIGINT","idx":77890,"count":153801,"meanings":[{"definitions":[{"definition":"Information gained from intercepted signals, including traffic analysis."},{"definition":"An Earth-orbiting satellite used to intercept signals."},{"definition":"A signal sent to a process by its controlling terminal when a user wishes to interrupt the process."}],"partOfSpeech":"n"}]},{"word":"KAON","idx":77891,"count":153800,"meanings":[{"definitions":[{"definition":"Any of four unstable subatomic particles, mesons, they are a combination of a strange quark or antiquark and either an up or down quark or antiquark"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkeɪˌɑn/"}]},{"word":"BALER","idx":77892,"count":153800,"meanings":[{"definitions":[{"definition":"A machine for creating bales, e.g., of hay or cotton.","example":"Farmer Jones is in straits because his baler is broken down and he's got three fields of hay ready to bale."},{"definition":"A person who creates bales, either by operating or feeding such a machine, or by creating the bales by hand.","example":"Hank worked as a baler for Farmer Jones part time, to make ends meet."}],"partOfSpeech":"n"}]},{"word":"TEMPOS","idx":77894,"count":153785,"meanings":[{"definitions":[{"definition":"A frequency or rate."},{"definition":"A move which is part of one's own plan or strategy and forces, e.g. by means of a check or attacking a piece, the opponent to make a move which is not bad but of no use for him (the player gains a tempo, the opponent loses a tempo), or equivalently a player achieves the same result in fewer moves by one approach rather than another."},{"definition":"The timing advantage of being on lead, thus being first to initiate a strategy to develop tricks for one's side."},{"definition":"The timing of a particular event – earlier or later than in an alternative situation (as in chess example)"},{"definition":"The number of beats per minute in a piece of music; also, an indicative term denoting approximate rate of speed in written music (examples: allegro, andante)"},{"definition":"The steady pace set by the frontmost riders."},{"definition":"A small truck or cargo van with three or four wheels, commonly used for commercial transport and deliveries (particularly in Asian and African countries): a genericized trademark, originally associated with the manufacturer Vidal & Sohn Tempo-Werke GmbH."},{"definition":"A rapid rate of play by the offense resulting from reducing the amount of time which elapses after one play ends and the next starts."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtɛmpoʊz/"},{"text":"/ˈtɛmpəʊz/"}]},{"word":"WILTED","idx":77895,"count":153782,"meanings":[{"definitions":[{"definition":"To droop or become limp and flaccid (as a dying leaf or flower)."},{"definition":"To fatigue; to lose strength."},{"definition":"To cause to droop or become limp and flaccid (as a flower)."},{"definition":"To cause to fatigue; to exhaust."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of plants) Drooping, typically due to lack of water."}],"partOfSpeech":"j"}]},{"word":"EMOLUMENTS","idx":77899,"count":153778,"meanings":[{"definitions":[{"definition":"Payment for an office or employment; compensation for a job, which is usually monetary."}],"partOfSpeech":"n"}]},{"word":"CONNED","idx":77902,"count":153760,"meanings":[{"definitions":[{"definition":"To study or examine carefully, especially in order to gain knowledge of; to learn, or learn by heart."},{"definition":"To know, understand, acknowledge."},{"definition":"To trick or defraud, usually for personal gain."},{"definition":"To direct a ship; to superintend the steering of (a vessel); to watch the course of (a vessel) and direct the helmsman how to steer (especially through a channel, etc, rather than steer a compass direction).","example":"The pilot conned the ship safely into the harbor."}],"partOfSpeech":"ve"}]},{"word":"TANGRAM","idx":77903,"count":153749,"meanings":[{"definitions":[{"definition":"A Chinese puzzle made of a square that is cut up into different triangular pieces which can then be reassembled to make designs."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈtænˌɡɹæm/"}]},{"word":"TINFOIL","idx":77907,"count":153732,"meanings":[{"definitions":[{"definition":"A thin, pliable sheet of tin or an alloy of tin and lead, used as a protective wrapping."},{"definition":"Aluminium foil"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cover in tinfoil."}],"partOfSpeech":"ve"}]},{"word":"HOODLUM","idx":77909,"count":153729,"meanings":[{"definitions":[{"definition":"A gangster; a hired thug."},{"definition":"A rough or violent youth."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhuːdləm/"}]},{"word":"DIVS","idx":77910,"count":153729,"meanings":[{"definitions":[{"definition":"A supernatural entity of disagreeable nature."},{"definition":"A function, implemented in many programming languages, that returns the result of a division of two integers."},{"definition":"A section of a web page, or the div element that represents it in HTML code."},{"definition":"(Eton College, public school slang) A division; a lesson."},{"definition":"A division."},{"definition":"A foolish person; an idiot."}],"partOfSpeech":"n"}]},{"word":"SKYBOX","idx":77913,"count":153721,"meanings":[{"definitions":[{"definition":"A seating area for VIPs in a stadium."},{"definition":"A cube with textures on its inner faces, used to simulate the sky or similar backdrop around a three-dimensional playfield."}],"partOfSpeech":"n"}]},{"word":"CHELATE","idx":77914,"count":153715,"meanings":[{"definitions":[{"definition":"A chelate compound"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a chelate compound by combining a metal atom to form a ring"},{"definition":"To remove heavy metals from the bloodstream using a chelate (such as EDTA)"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having chelae, or in the form of a chela"},{"definition":"Relating to chelation"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkiːˌleɪt/"}]},{"word":"TYPHOONS","idx":77915,"count":153714,"meanings":[{"definitions":[{"definition":"A weather phenomenon in the northwestern Pacific that is precisely equivalent to a hurricane, which results in wind speeds of 64 knots (118 km/h) or above. Equivalent to a cyclone in the Indian Ocean and Indonesia/Australia."}],"partOfSpeech":"n"}]},{"word":"MUTES","idx":77918,"count":153707,"meanings":[{"definitions":[{"definition":"A stopped consonant; a stop."},{"definition":"An actor who does not speak; a mime performer."},{"definition":"A person who does not have the power of speech."},{"definition":"A hired mourner at a funeral; an undertaker's assistant."},{"definition":"An object for dulling the sound of an instrument, especially a brass instrument, or damper for pianoforte; a sordine."},{"definition":"An electronic switch or control that mutes the sound."},{"definition":"A mute swan."},{"definition":"The faeces of a hawk or falcon."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To silence, to make quiet."},{"definition":"To turn off the sound of.","example":"Please mute the music while I make a call."},{"definition":"Of a bird: to defecate."},{"definition":"To cast off; to moult."}],"partOfSpeech":"ve"}]},{"word":"ACCOMPANIST","idx":77920,"count":153694,"meanings":[{"definitions":[{"definition":"The performer in music who takes the accompanying part."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əˈ.kʌm.pə.nɪst/"}]},{"word":"OUTWIT","idx":77924,"count":153676,"meanings":[{"definitions":[{"definition":"To get the better of; to outsmart, to beat in a competition of wits."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/aʊtˈwɪt/"}]},{"word":"MIDYEAR","idx":77925,"count":153676,"meanings":[{"definitions":[{"definition":"The middle part of a year."},{"definition":"An examination taken in the middle part of an academic year."}],"partOfSpeech":"n"}]},{"word":"UNMEDIATED","idx":77926,"count":153673,"meanings":[{"definitions":[{"definition":"Not mediated"}],"partOfSpeech":"j"}]},{"word":"SIDETRACKED","idx":77927,"count":153669,"meanings":[{"definitions":[{"definition":"To divert (a locomotive or train) on to a lesser used track in order to allow other trains to pass."},{"definition":"To divert or distract (someone) from a main issue or course of action with an alternate or less relevant topic or activity; or, to use deliberate trickery or sly wordplay when talking to (a person) in order to avoid discussion of a subject.","example":"I hope you can sidetrack the teacher with questions so we don't have to take the exam."},{"definition":"To sideline; to push aside; to divert or distract from, reducing (something) to a secondary or subordinate position.","example":"He has sidetracked this debate for far too long."},{"definition":"To deviate briefly from the topic at hand.","example":"Just to sidetrack a little bit from the subject I will explain my reasoning."}],"partOfSpeech":"ve"}]},{"word":"MAGNESIA","idx":77932,"count":153659,"meanings":[{"definitions":[{"definition":"Magnesium oxide"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌmæɡˈniʒə/"}]},{"word":"PATRONIZE","idx":77935,"count":153653,"meanings":[{"definitions":[{"definition":"To act as a patron of; to defend, protect, or support."},{"definition":"To make oneself a customer of a business, especially a regular customer."},{"definition":"To assume a tone of unjustified superiority toward; to talk down to, to treat condescendingly."},{"definition":"To blame, to reproach."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpeɪt(ʃ)ɹənaɪz/"},{"audio":"patronize-au"}]},{"word":"IMPASSABLE","idx":77938,"count":153633,"meanings":[{"definitions":[{"definition":"(of a route, terrain, etc.) Incapable of being passed over, crossed, or negotiated."},{"definition":"(of an obstacle) Incapable of being overcome or surmounted."},{"definition":"(of currency) Not usable as legal tender."}],"partOfSpeech":"j"}]},{"word":"IPSILATERAL","idx":77942,"count":153626,"meanings":[{"definitions":[{"definition":"On the same side of the body.","example":"The stroke was characterised by ipsilateral paralysis."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɪpsɪˈlætəɹəl/"}]},{"word":"SERF","idx":77943,"count":153620,"meanings":[{"definitions":[{"definition":"A partially free peasant of a low hereditary class, attached like a slave to the land owned by a feudal lord and required to perform labour, enjoying minimal legal or customary rights"},{"definition":"A similar agricultural labourer in 18th and 19th century Europe"},{"definition":"(strategy games) a worker unit"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/sɝf/"},{"text":"/sɜːf/"}]},{"word":"BURIES","idx":77954,"count":153598,"meanings":[{"definitions":[{"definition":"To ritualistically inter in a grave or tomb."},{"definition":"To place in the ground.","example":"bury a bone;  bury the embers"},{"definition":"To hide or conceal as if by covering with earth or another substance.","example":"she buried her face in the pillow;  they buried us in paperwork"},{"definition":"To suppress and hide away in one's mind.","example":"secrets kept buried; she buried her shame and put on a smiling face."},{"definition":"To put an end to; to abandon.","example":"They buried their argument and shook hands."},{"definition":"To score a goal."},{"definition":"To kill or murder."},{"definition":"To render imperceptible by other, more prominent stimuli; drown out.","example":"vocals buried in the mix"}],"partOfSpeech":"ve"}]},{"word":"BOOZER","idx":77957,"count":153589,"meanings":[{"definitions":[{"definition":"One who drinks habitually; a drunkard."},{"definition":"A public house, pub.","example":"During the week, the players were just as likely to be spotted out together in a local pub such as the Four in Hand. It was even known for them to frequent the Marksman off Carters Green, one of the town’s roughest boozers."},{"definition":"A World War II fighter radar detector, fitted to British bombers."},{"definition":"A vehicle equipped with tanks for supplying water to remote locations."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbuː.zə(ɹ)/"},{"audio":"boozer-au"}]},{"word":"REVAMPS","idx":77959,"count":153586,"meanings":[{"definitions":[{"definition":"To renovate, revise, improve or renew.","example":"They plan to revamp the historical theater in the old downtown."}],"partOfSpeech":"ve"}]},{"word":"NICOTIANA","idx":77962,"count":153583,"meanings":[{"definitions":[{"definition":"Any ornamental plant of the genus Nicotiana"},{"definition":"Literature dealing with tobacco-smoking"}],"partOfSpeech":"n"}]},{"word":"SIGNOR","idx":77965,"count":153580,"meanings":[{"definitions":[{"definition":"A courtesy title for a man of Italian origin."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈsiːnjɔː/"}]},{"word":"PHLEGM","idx":77966,"count":153580,"meanings":[{"definitions":[{"definition":"One of the four humors making up the body in ancient and mediaeval medicine; said to be cold and moist, and often identified with mucus."},{"definition":"Viscid mucus produced by the body, later especially mucus expelled from the bronchial passages by coughing."},{"definition":"A watery distillation, especially one obtained from plant matter; an aqueous solution."},{"definition":"Calmness of temperament, composure; also seen negatively, sluggishness, indifference."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"phlegm-uk","text":"/flɛm/"}]},{"word":"SUBATOMIC","idx":77976,"count":153556,"meanings":[{"definitions":[{"definition":"Relating to particles that are constituents of the atom, or are smaller than an atom; such as proton, neutron, electron, etc."},{"definition":"Relating to any length or mass that is smaller in scale than a the diameter of a hydrogen atom.","example":"The electron microscope is able to resolve detail at the subatomic level."}],"partOfSpeech":"j"}]},{"word":"SCRUFF","idx":77978,"count":153549,"meanings":[{"definitions":[{"definition":"Someone with an untidy appearance.","example":"That candidate will never get the job: he's a right scruff."},{"definition":"Stubble, facial hair (on males)."},{"definition":"Crust."},{"definition":"Scurf."},{"definition":"The loose skin at the back of the neck of some animals."},{"definition":"The back of the neck, nape; also scruff of the neck.","example":"He grabbed his unruly kid by the scruff of the neck, and took him home."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To lift or carry by the scruff."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/skɹʌf/"}]},{"word":"FLANKER","idx":77979,"count":153548,"meanings":[{"definitions":[{"definition":"A player who plays in the back row of the scrum."},{"definition":"A wide receiver who lines up behind the line of scrimmage."},{"definition":"A fortification or soldier projecting so as to defend another work or to command the flank of an assailing body."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To defend by lateral fortifications."},{"definition":"To attack sideways."}],"partOfSpeech":"ve"}]},{"word":"FREEDMEN","idx":77981,"count":153544,"meanings":[{"definitions":[{"definition":"A man who has been released from a condition of slavery."}],"partOfSpeech":"n"}]},{"word":"OBLIGING","idx":77988,"count":153517,"meanings":[{"definitions":[{"definition":"To constrain someone by force or by social, moral or legal means.","example":"I am obliged to report to the police station every week."},{"definition":"To do (someone) a service or favour (hence, originally, creating an obligation).","example":"He obliged me by not parking his car in the drive."},{"definition":"To be indebted to someone.","example":"I am obliged to you for your recent help."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The imposition of an obligation."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Happy and ready to do favours for others."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/əˈblaɪd͡ʒɪŋ/"}]},{"word":"HERMETICALLY","idx":77991,"count":153509,"meanings":[{"definitions":[{"definition":"With a hermetic seal; so as to be airtight."},{"definition":"In a hermetic manner; isolatedly."}],"partOfSpeech":"v"}]},{"word":"GRAVESTONES","idx":77993,"count":153506,"meanings":[{"definitions":[{"definition":"A stone slab set at the head of a grave."}],"partOfSpeech":"n"}]},{"word":"DECRYPTING","idx":77994,"count":153495,"meanings":[{"definitions":[{"definition":"To convert (an encrypted or coded message) back into plain text."}],"partOfSpeech":"ve"}]},{"word":"UNCOMMONLY","idx":77995,"count":153489,"meanings":[{"definitions":[{"definition":"To an uncommon degree; unusually or extremely."},{"definition":"Not often; on rare occasions.","example":"Not uncommonly, I find that I have arrived too late to catch my train."}],"partOfSpeech":"v"}]},{"word":"NUDGED","idx":77999,"count":153475,"meanings":[{"definitions":[{"definition":"To push against gently, especially in order to gain attention or give a signal."},{"definition":"To near or come close to something."}],"partOfSpeech":"ve"}]},{"word":"INHOSPITABLE","idx":78002,"count":153464,"meanings":[{"definitions":[{"definition":"(of a person) Not inclined to hospitality; unfriendly,"},{"definition":"(of a place) Not offering shelter; barren or forbidding."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɪnhɒsˈpɪtəbəl/"}]},{"word":"DISSENSION","idx":78004,"count":153459,"meanings":[{"definitions":[{"definition":"An act of expressing dissent, especially spoken."},{"definition":"Strong disagreement; a contention or quarrel; discord."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪˈsɛnʃən/"}]},{"word":"HALLUCINOGENIC","idx":78005,"count":153451,"meanings":[{"definitions":[{"definition":"A substance that is a hallucinogen.","example":"hallucinogenics are sometimes used in indigenous people's religious rites."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Producing hallucinations","example":"After eating some hallucinogenic mushrooms, he said he saw a lot of pretty colors."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/həˌlusənəˈdʒenɪk/"},{"text":"/ˌhæluːˈsɪnədʒənɪk/"}]},{"word":"LOOSELEAF","idx":78006,"count":153441,"meanings":[{"definitions":[{"definition":"(mass noun) Lined paper, usually collected in a binder."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Consisting of loose leaves (pages), often collected in a binder, rather than being bound like a book or stapled.","example":"All the pages fell out of my looseleaf notebook."}],"partOfSpeech":"j"}]},{"word":"COLESLAW","idx":78013,"count":153416,"meanings":[{"definitions":[{"definition":"A salad of finely shredded raw cabbage and sometimes shredded carrots, dressed with mayonnaise (white slaw) or a vinaigrette (red slaw)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"coleslaw-ca","text":"/ˈkəʊlslɔː/"}]},{"word":"INTERMINGLED","idx":78017,"count":153401,"meanings":[{"definitions":[{"definition":"To mix or become mixed together."}],"partOfSpeech":"ve"}]},{"word":"KOOKY","idx":78024,"count":153380,"meanings":[{"definitions":[{"definition":"Eccentric, strange, or foolish; crazy or insane; kookish.","example":"His kooky behavior seemed charming at first, but soon got on our nerves."},{"definition":"Behaving like a kook (a person with poor style or skill); kook-like."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkuki/"},{"text":"/ˈkuːki/"},{"audio":"kooky-au"}]},{"word":"DWARFED","idx":78025,"count":153380,"meanings":[{"definitions":[{"definition":"To render (much) smaller, turn into a dwarf (version)."},{"definition":"To make appear (much) smaller, puny, tiny.","example":"The newly-built skyscraper dwarfs all older buildings in the downtown skyline."},{"definition":"To make appear insignificant.","example":"Bach dwarfs all other composers."},{"definition":"To become (much) smaller."},{"definition":"To hinder from growing to the natural size; to make or keep small; to stunt."}],"partOfSpeech":"ve"}]},{"word":"OVERPRODUCTION","idx":78031,"count":153356,"meanings":[{"definitions":[{"definition":"The production of more of a commodity than can be used or sold."}],"partOfSpeech":"n"}]},{"word":"ASTERS","idx":78039,"count":153326,"meanings":[{"definitions":[{"definition":"Any of several plants of the genus Aster; one of its flowers."},{"definition":"A star-shaped structure formed during the mitosis of a cell."},{"definition":"A star."}],"partOfSpeech":"n"}]},{"word":"NECROPOLIS","idx":78046,"count":153299,"meanings":[{"definitions":[{"definition":"A cemetery; especially a large one in or near a city."},{"definition":"An ancient site used for burying the dead, particularly if consisting of elaborate grave monuments."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"necropolis-us","text":"/nə-/"}]},{"word":"QUINONES","idx":78047,"count":153298,"meanings":[{"definitions":[{"definition":"Any of a class of aromatic compounds having two carbonyl functional groups in the same six-membered ring."}],"partOfSpeech":"n"}]},{"word":"DISREGARDS","idx":78049,"count":153297,"meanings":[{"definitions":[{"definition":"To ignore; pay no attention to."}],"partOfSpeech":"ve"}]},{"word":"BOXY","idx":78050,"count":153294,"meanings":[{"definitions":[{"definition":"Box-like or box-shaped."}],"partOfSpeech":"j"}]},{"word":"GROSGRAIN","idx":78052,"count":153291,"meanings":[{"definitions":[{"definition":"A silk fabric having narrow, horizontal ribs."},{"definition":"A close-woven fabric (usually made from silk or rayon) having narrow horizontal ribs."},{"definition":"A ribbon made of this fabric."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹəʊɡɹeɪn/"}]},{"word":"RITUALISTIC","idx":78055,"count":153283,"meanings":[{"definitions":[{"definition":"In the manner of a ritual."},{"definition":"Of or relating to habitual behavior."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˌɹɪt͡ʃuəˈlɪstɪk/"}]},{"word":"SURMOUNTED","idx":78056,"count":153275,"meanings":[{"definitions":[{"definition":"To get over; to overcome."},{"definition":"To cap; to sit on top off."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of an arch or dome: rising higher than a semicircle."},{"definition":"Denoting a figure when another is laid over it."}],"partOfSpeech":"j"}]},{"word":"VERBIAGE","idx":78059,"count":153263,"meanings":[{"definitions":[{"definition":"Overabundance of words."},{"definition":"The manner in which something is expressed in words.","example":"Bureaucratic verbiage."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"verbiage-uk","text":"/ˈvɜː(ɹ).bi.ɪdʒ/"}]},{"word":"MOONSET","idx":78062,"count":153256,"meanings":[{"definitions":[{"definition":"The setting of the moon below the horizon"}],"partOfSpeech":"n"}]},{"word":"TAWAS","idx":78065,"count":153252,"meanings":[{"definitions":[{"definition":"A frying pan or griddle."},{"definition":"Beilschmiedia tawa, a New Zealand broadleaf tree."}],"partOfSpeech":"n"}]},{"word":"BUNDT","idx":78067,"count":153250,"meanings":[{"definitions":[{"definition":"A baking pan with a hollow, circular, raised area in the middle."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bʌnt/"}]},{"word":"NONDISCLOSURE","idx":78068,"count":153246,"meanings":[{"definitions":[{"definition":"An act or policy of not disclosing."}],"partOfSpeech":"n"}]},{"word":"IMPELLED","idx":78069,"count":153246,"meanings":[{"definitions":[{"definition":"To urge a person; to press on; to incite to action or motion via intrinsic motivation."},{"definition":"To drive forward; to propel an object, to provide an impetus for motion or action."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪmˈpɛld/"}]},{"word":"SALUTARY","idx":78071,"count":153239,"meanings":[{"definitions":[{"definition":"Effecting or designed to effect an improvement; remedial: salutary advice."},{"definition":"Promoting good health and physical well-being; wholesome; curative."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsæljətɛɹi/"},{"text":"/ˈsaljʊtəɹi/"}]},{"word":"DEFORM","idx":78073,"count":153220,"meanings":[{"definitions":[{"definition":"To change the form of, usually negatively; to give (something) an unusual or abnormal shape."},{"definition":"To change the looks of, usually negatively; to give something an unusual or abnormal appearance.","example":"a face deformed by bitterness"},{"definition":"To mar the character of.","example":"a marriage deformed by jealousy"},{"definition":"To alter the shape of by stress."},{"definition":"To become misshapen or changed in shape."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having an unusual and unattractive shape."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/dɪˈfɔːm/"}]},{"word":"UMWELT","idx":78076,"count":153211,"meanings":[{"definitions":[{"definition":"One's surroundings or environment; the outer world as perceived by organisms within it."}],"partOfSpeech":"n"}]},{"word":"DAYPACKS","idx":78079,"count":153190,"meanings":[{"definitions":[{"definition":"A small backpack, suitable for a one-day hike or for carrying books around campus."}],"partOfSpeech":"n"}]},{"word":"CHEMISTRIES","idx":78080,"count":153184,"meanings":[{"definitions":[{"definition":"The branch of natural science that deals with the composition and constitution of substances and the changes that they undergo as a consequence of alterations in the constitution of their molecules."},{"definition":"An application of chemical theory and method to a particular substance."},{"definition":"The mutual attraction between two people; rapport."}],"partOfSpeech":"n"}]}]