[{"word":"EMPLOYS","idx":13920,"count":2964062,"meanings":[{"definitions":[{"definition":"To hire (somebody for work or a job).","example":"Yesterday our local garage employed a new mechanic."},{"definition":"To use (somebody for a job, or something for a task).","example":"The burglar employed a jemmy to get in."},{"definition":"To make busy."}],"partOfSpeech":"ve"}]},{"word":"BUBBLES","idx":13922,"count":2963701,"meanings":[{"definitions":[{"definition":"A spherically contained volume of air or other gas, especially one made from soapy liquid."},{"definition":"A small spherical cavity in a solid material.","example":"bubbles in window glass, or in a lens"},{"definition":"(by extension) Anything resembling a hollow sphere."},{"definition":"Anything lacking firmness or solidity; a cheat or fraud; an empty project."},{"definition":"A period of intense speculation in a market, causing prices to rise quickly to irrational levels as the metaphorical bubble expands, and then fall even more quickly as the bubble bursts.","example":"dot-com bubble"},{"definition":"The emotional and/or physical atmosphere in which the subject is immersed."},{"definition":"An officer's station in a prison dormitory, affording views on all sides."},{"definition":"Someone who has been ‘bubbled’ or fooled; a dupe."},{"definition":"A small, hollow, floating bead or globe, formerly used for testing the strength of spirits."},{"definition":"The globule of air in the chamber of a spirit level."},{"definition":"A laugh.","example":"Are you having a bubble?!"},{"definition":"A Greek."},{"definition":"Any of the small magnetized areas that make up bubble memory."},{"definition":"The point in a poker tournament when the last player without a prize loses all their chips and leaves the game, leaving only players that are going to win prizes. (e.g., if the last remaining 9 players win prizes, then the point when the 10th player leaves the tournament)","example":"Many players tend to play timidly (not play many hands) around the bubble, to keep their chips and last longer in the game."},{"definition":"A group of people who are in quarantine together."},{"definition":"Sparkling wine; champagne."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To produce bubbles, to rise up in bubbles (such as in foods cooking or liquids boiling)."},{"definition":"To churn or foment, as if wishing to rise to the surface.","example":"Rage bubbled inside him."},{"definition":"To rise through a medium or system, similar to the way that bubbles rise in liquid."},{"definition":"To cheat, delude."},{"definition":"To cry, weep."},{"definition":"To pat a baby on the back so as to cause it to belch."},{"definition":"To cause to feel as if bubbling or churning."},{"definition":"To express in a bubbly or lively manner."},{"definition":"To form into a protruding round shape."},{"definition":"To cover with bubbles."},{"definition":"To bubble in; to mark a response on a form by filling in a circular area (‘bubble’)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bubbles-au"}]},{"word":"PITCHER","idx":13924,"count":2963438,"meanings":[{"definitions":[{"definition":"One who pitches anything, as hay, quoits, a ball, etc."},{"definition":", the player who delivers the ball to the batter."},{"definition":"The top partner in a homosexual relationship or penetrator in a sexual encounter between two men."},{"definition":"A sort of crowbar for digging."},{"definition":"A wide-mouthed, deep vessel for holding liquids, with a spout or protruding lip and a handle; a water jug or jar with a large ear or handle."},{"definition":"A tubular or cuplike appendage or expansion of the leaves of certain plants. See pitcher plant."},{"definition":"A representation of anything (as a person, a landscape, a building) upon canvas, paper, or other surface, by drawing, painting, printing, photography, etc."},{"definition":"An image; a representation as in the imagination."},{"definition":"A painting.","example":"There was a picture hanging above the fireplace."},{"definition":"A photograph.","example":"I took a picture of the church."},{"definition":"A motion picture.","example":"Casablanca is my all-time favorite picture."},{"definition":"(in the plural) (\"the pictures\") Cinema (as a form of entertainment).","example":"Let's go to the pictures."},{"definition":"A paragon, a perfect example or specimen (of a category).","example":"She's the very picture of health."},{"definition":"An attractive sight.","example":"The garden is a real picture at this time of year."},{"definition":"The art of painting; representation by painting."},{"definition":"A figure; a model."},{"definition":"Situation.","example":"The employment picture for the older middle class is not so good."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpɪtʃɚ/"},{"text":"/ˈpɪtʃə/"}]},{"word":"STANDBY","idx":13926,"count":2963191,"meanings":[{"definitions":[{"definition":"To wait in expectation of some event; to make ready.","example":"Please stand by for more instructions."},{"definition":"To remain loyal or faithful to.","example":"Even though money is scarce sometimes, Ann stands by her decision to be a full-time mother."},{"definition":"To support; to continue to support despite things being bad.","example":"They stood by us all along and it's awesome to see them out here to support us today."},{"definition":"To do nothing. To be inactive in a situation.","example":"I can't simply stand by and watch you ruin your life."},{"definition":"To be ready to provide assistance if required.","example":"The tug stood by in case it was needed."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A state of readiness without immediate involvement; remaining in preparation for (a sudden or unforeseen event or situation).","example":"The troops were on standby in case of an attack."},{"definition":"Sleep mode"},{"definition":"(travel) Waiting at the airport in the hope of getting a seat on a flight that is already booked out."},{"definition":"Something that is standard, well-tested, or frequently used.","example":"That recipe is an old standby, and she keeps the ingredients around in case of unexpected guests."}],"partOfSpeech":"n"}]},{"word":"JUDGMENTS","idx":13927,"count":2961977,"meanings":[{"definitions":[{"definition":"The act of judging."},{"definition":"The power or faculty of performing such operations; especially, when unqualified, the faculty of judging or deciding rightly, justly, or wisely","example":"a man of judgment"},{"definition":"The conclusion or result of judging; an opinion; a decision."},{"definition":"The act of determining, as in courts of law, what is conformable to law and justice; also, the determination, decision, or sentence of a court, or of a judge."},{"definition":"The final award; the last sentence."}],"partOfSpeech":"n"}]},{"word":"MUSCULAR","idx":13928,"count":2961759,"meanings":[{"definitions":[{"definition":"Of, relating to, or connected with muscles."},{"definition":"Brawny, thewy, having strength."},{"definition":"Having large, well-developed muscles."},{"definition":"Robust, strong."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈmʌs.kju.lɚ/"},{"text":"/ˈmʌs.kjə.lə/"}]},{"word":"MOTIF","idx":13929,"count":2961524,"meanings":[{"definitions":[{"definition":"A recurring or dominant element; a theme.","example":"See how the artist repeats the scroll motif throughout the work?"},{"definition":"A short melodic passage that is repeated in several parts of a work."},{"definition":"A decorative figure that is repeated in a design or pattern."},{"definition":"A decorative appliqué design or figure, as of lace or velvet, used in trimming."},{"definition":"The physical object or objects repeated at each point of a lattice. Usually atoms or molecules."},{"definition":"A basic element of a move in terms of why the piece moves and how it supports the fulfilment of a stipulation."},{"definition":"In a nucleotide or amino-acid sequence, pattern that is widespread and has, or is conjectured to have, a biological significance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"motif-us","text":"/moʊˈtiːf/"}]},{"word":"ILLNESSES","idx":13930,"count":2961377,"meanings":[{"definitions":[{"definition":"An instance of a disease or poor health.","example":"Her grandmother had passed away after a long illness."},{"definition":"A state of bad health or disease.","example":"Many working days this year have been lost through illness."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪl.nəsɪz/"}]},{"word":"PLUM","idx":13931,"count":2961363,"meanings":[{"definitions":[{"definition":"The fruit and its tree."},{"definition":"Extended senses."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a dark bluish-red colour."},{"definition":"Choice; especially lavish or preferred.","example":"She landed a plum position as an executive for the firm."},{"definition":"Plumb"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To plumb."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Completely; utterly.","example":"You're going to think I'm plum crazy for this, but I want to adopt all seven kittens."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"plum-us","text":"/plʌm/"}]},{"word":"SALOON","idx":13932,"count":2961006,"meanings":[{"definitions":[{"definition":"A large room, especially one used to receive and entertain guests."},{"definition":"A gathering of people for a social or intellectual meeting."},{"definition":"An art gallery or exhibition; especially the Paris salon or autumn salon."},{"definition":"A beauty salon or similar establishment."},{"definition":"A tavern, especially in an American Old West setting."},{"definition":"A lounge bar in an English public house, contrasted with the public bar.","example":"A pint of beer in the saloon bar costs a penny more than in the public bar."},{"definition":"The most common body style for modern cars, with a boot or trunk."},{"definition":"The cabin area of a boat or yacht devoted to seated relaxation, often combined with dining table."},{"definition":"The part of a rail carriage or multiple unit containing seating for passengers."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"saloon-us","text":"/səˈlun/"}]},{"word":"PROPHECY","idx":13933,"count":2960788,"meanings":[{"definitions":[{"definition":"A prediction, especially one made by a prophet or under divine inspiration.","example":"French writer Nostradamus made a prophecy in his book."},{"definition":"The public interpretation of Scripture."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To speak or write with divine inspiration; to act as prophet."},{"definition":"To predict, to foretell (with or without divine inspiration)."},{"definition":"To foreshow; to herald; to prefigure."},{"definition":"To speak out on the Bible as an expression of holy inspiration; to preach."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"prophecy-us","text":"/ˈpɹɑfəsi/"}]},{"word":"LOFT","idx":13934,"count":2959995,"meanings":[{"definitions":[{"definition":"(except in derivatives) air, the air; the sky, the heavens."},{"definition":"An attic or similar space (often used for storage) in the roof of a house or other building."},{"definition":"The thickness of a soft object when not under pressure."},{"definition":"A gallery or raised apartment in a church, hall, etc.","example":"an organ loft"},{"definition":"The pitch or slope of the face of a golf club (tending to drive the ball upward)."},{"definition":"A floor or room placed above another."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To propel high into the air."},{"definition":"To fly or travel through the air, as though propelled"},{"definition":"To throw the ball erroneously through the air instead of releasing it on the lane's surface."},{"definition":"To furnish with a loft space."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lofty; proud; haughty"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"loft-uk","text":"/lɒft/"}]},{"word":"UNISEX","idx":13936,"count":2959687,"meanings":[{"definitions":[{"definition":"Designed to be suitable for any sex or gender.","example":"a unisex name"},{"definition":"Not distinguished on the basis of sex or gender."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"unisex-uk","text":"[ˈjuːnɪˌsɛks]"}]},{"word":"HISTORIAN","idx":13937,"count":2958034,"meanings":[{"definitions":[{"definition":"A writer of history; a chronicler; an annalist."},{"definition":"One who studies or researches history."},{"definition":"One who recounts their own medical history."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/hɪˈstɔɹi.ən/"},{"text":"/hɪˈstɔəɹɪən/"}]},{"word":"WALLETS","idx":13938,"count":2957696,"meanings":[{"definitions":[{"definition":"A small case, often flat and often made of leather, for keeping money (especially paper money), credit cards, etc.","example":"The thief stole all the money and credit cards out of the old man's wallet."},{"definition":"(by extension) A person's bank account or assets.","example":"It's unknown if the pro running back's recent sex scandal will hit him in the wallet or not."},{"definition":"A thick case or folder with plastic sleeves in which compact discs may be stored.","example":"I won an auction online for a cheap CD wallet."},{"definition":"A bag or pouch.","example":"He brought with him a large wallet with some provisions for the road."},{"definition":"A person's buttocks (the area of the body nearest where one keeps one's wallet).","example":"He fell down and landed on his wallet."}],"partOfSpeech":"n"}]},{"word":"IDENTIFIABLE","idx":13939,"count":2957577,"meanings":[{"definitions":[{"definition":"Capable of being distinguished and named.","example":"I don't know where he was from because he had no identifiable accent."}],"partOfSpeech":"j"}]},{"word":"ELM","idx":13940,"count":2957553,"meanings":[{"definitions":[{"definition":"A tree of the genus Ulmus of the family Ulmaceae, large deciduous trees with alternate stipulate leaves and small apetalous flowers."},{"definition":"(usually attributive) Wood from an elm tree."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɛlm/"}]},{"word":"FACSIMILE","idx":13941,"count":2956598,"meanings":[{"definitions":[{"definition":"A copy or reproduction."},{"definition":"A fax, a machine for making and sending copies of printed material and images via radio or telephone network."},{"definition":"The image sent by the machine itself."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To send via a facsimile machine; to fax."},{"definition":"To make a copy of; to reproduce."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"facsimile-us","text":"/fækˈsɪm.ə.li/"}]},{"word":"HURTS","idx":13942,"count":2956264,"meanings":[{"definitions":[{"definition":"An emotional or psychological humiliation or bad experience.","example":"how to overcome old hurts of the past"},{"definition":"A bodily injury causing pain; a wound or bruise."},{"definition":"Injury; damage; detriment; harm"},{"definition":"A roundel azure (blue circular spot)."},{"definition":"A band on a trip-hammer helve, bearing the trunnions."},{"definition":"A husk."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be painful.","example":"Does your leg still hurt? / It is starting to feel better."},{"definition":"To cause (a creature) physical pain and/or injury.","example":"If anybody hurts my little brother, I will get upset."},{"definition":"To cause (somebody) emotional pain."},{"definition":"To undermine, impede, or damage.","example":"This latest gaffe hurts the legislator’s reelection prospects still further."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/hɝts/"},{"text":"/hɜːts/"}]},{"word":"ETHANOL","idx":13943,"count":2955612,"meanings":[{"definitions":[{"definition":"A simple aliphatic alcohol formally derived from ethane by replacing one hydrogen atom with a hydroxyl group: CH3-CH2-OH."},{"definition":"Specifically, this alcohol as a fuel."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"ethanol-us","text":"/ˈɛ.θə.nɑl/"}]},{"word":"CANNABIS","idx":13944,"count":2954641,"meanings":[{"definitions":[{"definition":"A tall annual dioecious plant (Cannabis, especially Cannabis sativa), native to central Asia and having alternate, palmately divided leaves and tough bast fibers."},{"definition":"A mildly euphoriant or sedating, intoxicating hallucinogenic drug prepared from various parts of this plant."},{"definition":"The purified and decarboxylated resin of the cannabis plant used for medicinal purposes rather than for any intoxicating effects."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cannabis-uk","text":"/ˈkænəbɪs/"}]},{"word":"FOLDED","idx":13945,"count":2954459,"meanings":[{"definitions":[{"definition":"To bend (any thin material, such as paper) over so that it comes in contact with itself."},{"definition":"To make the proper arrangement (in a thin material) by bending.","example":"If you fold the sheets, they'll fit more easily in the drawer."},{"definition":"To become folded; to form folds.","example":"Cardboard doesn't fold very easily."},{"definition":"To fall over; to be crushed.","example":"The chair folded under his enormous weight."},{"definition":"To enclose within folded arms (see also enfold)."},{"definition":"To give way on a point or in an argument."},{"definition":"To withdraw from betting.","example":"With no hearts in the river and no chance to hit his straight, he folded."},{"definition":"(by extension) To withdraw or quit in general."},{"definition":"To stir gently, with a folding action.","example":"Fold the egg whites into the batter."},{"definition":"Of a company, to cease to trade.","example":"The company folded after six quarters of negative growth."},{"definition":"To double or lay together, as the arms or the hands.","example":"He folded his arms in defiance."},{"definition":"To cover or wrap up; to conceal."},{"definition":"To confine animals in a fold."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"folded-us","text":"/ˈfoʊldɪd/"}]},{"word":"RSVP","idx":13946,"count":2954410,"meanings":[{"definitions":[{"definition":"To reply to an invitation."},{"definition":"(restaurants, events) To reserve a place"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"rsvp-uk"}]},{"word":"DYNAMICALLY","idx":13948,"count":2953678,"meanings":[{"definitions":[{"definition":"Of a dynamic nature; variable or constantly changing nature."}],"partOfSpeech":"v"}]},{"word":"COMPRISE","idx":13949,"count":2953455,"meanings":[{"definitions":[{"definition":"To be made up of; to consist of (especially a comprehensive list of parts).","example":"The parts are comprised by the whole."},{"definition":"To contain or embrace.","example":"Our committee comprises a president, secretary, treasurer and five other members."},{"definition":"(sometimes proscribed, usually in the passive) To compose, to constitute. See usage note below.","example":"A team is comprised of its members."},{"definition":"To include, contain, or be made up of, defining the minimum elements, whether essential or inessential, to define an invention. (\"Open-ended\", doesn't limit to the items listed; cf. compose, which is \"closed\" and limits to the items listed.)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"comprise-us","text":"/kəmˈpɹaɪz/"}]},{"word":"GRENADINES","idx":13950,"count":2952943,"meanings":[{"definitions":[{"definition":"A cordial syrup made from pomegranates."},{"definition":"A dilute drink made from this syrup."},{"definition":"A thin gauzy fabric of silk or wool, used for women's clothing and men's woven luxury ties."},{"definition":"(formerly a trade name) A dyestuff consisting essentially of impure fuchsine."}],"partOfSpeech":"n"}]},{"word":"LUMP","idx":13951,"count":2952774,"meanings":[{"definitions":[{"definition":"Something that protrudes, sticks out, or sticks together; a cluster or blob; a mound or mass of no particular shape.","example":"Stir the gravy until there are no more lumps."},{"definition":"A group, set, or unit.","example":"The money arrived all at once as one big lump sum payment."},{"definition":"A small, shaped mass of sugar, typically about a teaspoonful.","example":"Do you want one lump or two with your coffee?"},{"definition":"A dull or lazy person.","example":"Don't just sit there like a lump."},{"definition":"(as plural) A beating or verbal abuse.","example":"He's taken his lumps over the years."},{"definition":"A projection beneath the breech end of a gun barrel."},{"definition":"A kind of fish, the lumpsucker."},{"definition":"Food given to a tramp to be eaten on the road."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To treat as a single unit; to group together in a casual or chaotic manner (as if forming an ill-defined lump of the items).","example":"People tend to lump turtles and tortoises together, when in fact they are different creatures."},{"definition":"To bear a heavy or awkward burden; to carry something unwieldy from one place to another."},{"definition":"To hit or strike (a person)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lump-us","text":"/lʌmp/"}]},{"word":"DISPOSED","idx":13953,"count":2952327,"meanings":[{"definitions":[{"definition":"(used with \"of\") To eliminate or to get rid of something.","example":"I dispose of my trash in the garbage can."},{"definition":"To distribute or arrange; to put in place."},{"definition":"To deal out; to assign to a use."},{"definition":"To incline.","example":"In these uncertain times, I am disposed towards caution."},{"definition":"To bargain; to make terms."},{"definition":"To regulate; to adjust; to settle; to determine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Inclined; minded."},{"definition":"(in combination) Having a certain disposition.","example":"well-disposed; ill-disposed"},{"definition":"Inclined to mirth; jolly."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disposed-us","text":"/dɪˈspoʊzd/"}]},{"word":"SUBTITLE","idx":13954,"count":2951333,"meanings":[{"definitions":[{"definition":"(authorship) A heading below or after a title."},{"definition":"Textual versions of the dialog in films, usually displayed at the bottom of the screen."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create subtitles for the dialog in a film."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsʌbtaɪtəl/"}]},{"word":"CHESTNUT","idx":13955,"count":2951306,"meanings":[{"definitions":[{"definition":"A tree or shrub of the genus Castanea."},{"definition":"The nut of this tree or shrub."},{"definition":"A dark, reddish-brown colour, as seen on the fruit of the chestnut tree."},{"definition":"A reddish-brown horse."},{"definition":"The wood of a chestnut tree."},{"definition":"An old joke; a worn-out meme, phrase, ploy, etc. so often repeated as to have grown tiresome or ineffective (often in the phrase \"old chestnut\")."},{"definition":"A round or oval horny plate found on the inner side of the leg of a horse or other animal, similar to a birthmark on a human."},{"definition":"The horse-chestnut."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a deep reddish-brown colour, like that of a chestnut."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"chestnut-us","text":"/ˈtʃɛs.nʌt/"}]},{"word":"LIBRARIANS","idx":13956,"count":2950852,"meanings":[{"definitions":[{"definition":"The keeper, manager of a library."},{"definition":"One who cares for the publications, files etc. in a library, whether staff or volunteer."},{"definition":"A person who processes and organizes information."}],"partOfSpeech":"n"}]},{"word":"ENGRAVED","idx":13957,"count":2950835,"meanings":[{"definitions":[{"definition":"To carve text or symbols into (something), usually for the purposes of identification or art.","example":"He engraved the plaque with his name."},{"definition":"To carve (something) into a material.","example":"He engraved his name."},{"definition":"To put in a grave, to bury."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Made by engraving"},{"definition":"Decorated with engravings"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"engraved-us","text":"/ɪnˈɡɹeɪvd/"}]},{"word":"HALT","idx":13958,"count":2950571,"meanings":[{"definitions":[{"definition":"To limp; move with a limping gait."},{"definition":"To stand in doubt whether to proceed, or what to do; hesitate; be uncertain; linger; delay; mammer."},{"definition":"To be lame, faulty, or defective, as in connection with ideas, or in measure, or in versification."},{"definition":"To waver."},{"definition":"To falter."},{"definition":"To stop marching."},{"definition":"To stop either temporarily or permanently."},{"definition":"To bring to a stop."},{"definition":"To cause to discontinue.","example":"The contract negotiations halted operations for at least a week."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A cessation, either temporary or permanent.","example":"The contract negotiations put a halt to operations."},{"definition":"A minor railway station (usually unstaffed) in the United Kingdom.","example":"The halt itself never achieved much importance, even with workers coming to and from the adjacent works."},{"definition":"Lameness; a limp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Lame, limping."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"halt-uk","text":"/hɔːlt/"}]},{"word":"ALTA","idx":13959,"count":2950434,"meanings":[{"definitions":[{"definition":"Rose bengal dye worn by Indian women on the feet during festivals"}],"partOfSpeech":"n"}]},{"word":"PASTORAL","idx":13962,"count":2946809,"meanings":[{"definitions":[{"definition":"A poem describing the life and manners of shepherds; a poem in which the speakers assume the character of shepherds; an idyll; a bucolic."},{"definition":"A cantata relating to rural life; a composition for instruments characterized by simplicity and sweetness; a lyrical composition the subject of which is taken from rural life."},{"definition":"A letter of a pastor to his charge; specifically, a letter addressed by a bishop to his diocese."},{"definition":"A letter of the House of Bishops, to be read in each parish."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to shepherds or herders of other livestock"},{"definition":"Relating to rural life and scenes","example":"We were living a pastoral life."},{"definition":"Relating to the care of souls, to the pastor of a church or to any local religious leader charged with the service of individual parishioners, i.e. a priest or rabbi.","example":"pastoral duties; a pastoral letter"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpæs.tə.ɹəl/"}]},{"word":"UNPAID","idx":13963,"count":2946577,"meanings":[{"definitions":[{"definition":"Not paid for.","example":"an unpaid bill"},{"definition":"Of work: done without agreed payment, usually voluntarily.","example":"an unpaid position"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈpeɪd/"},{"audio":"unpaid-au"}]},{"word":"GHOSTS","idx":13964,"count":2946325,"meanings":[{"definitions":[{"definition":"The spirit; the soul of man."},{"definition":"The disembodied soul; the soul or spirit of a deceased person; a spirit appearing after death","example":"Everyone believed that the ghost of an old lady haunted the crypt."},{"definition":"Any faint shadowy semblance; an unsubstantial image","example":"not a ghost of a chance; the ghost of an idea"},{"definition":"A false image formed in a telescope, camera, or other optical device by reflection from the surfaces of one or more lenses."},{"definition":"An unwanted image similar to and overlapping or adjacent to the main one on a television screen, caused by the transmitted image being received both directly and via reflection."},{"definition":"A ghostwriter."},{"definition":"An unresponsive user on IRC, resulting from the user's client disconnecting without notifying the server."},{"definition":"An image of a file or hard disk."},{"definition":"An understudy."},{"definition":"A covert (and deniable) agent."},{"definition":"The faint image that remains after an attempt to remove graffiti."},{"definition":"An opponent in a racing game that follows a previously recorded route, allowing players to compete against previous best times."},{"definition":"A dead person whose identity is stolen by another. See ghosting."},{"definition":"(in names of species) White or pale.","example":"ghost slug; ghostberry; ghostflower; ghost crab; ghost bat"},{"definition":"(in names of species) Transparent or translucent.","example":"ghost ant; ghost catfish; ghost nipper; ghost nudibranch"},{"definition":"Abandoned.","example":"ghost town; ghost net; ghost ramp; ghost ship"},{"definition":"Remnant; the remains of a(n).","example":"ghost cell; ghost crater; ghost image"},{"definition":"Perceived or listed but not real.","example":"ghost pain; ghost cellphone vibration; ghost island; ghost voter"},{"definition":"Of cryptid, supernatural or extraterrestrial nature.","example":"ghost rocket; ghost deer; ghost cat"},{"definition":"Substitute.","example":"ghost writer; ghost band; ghost singer"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To haunt; to appear to in the form of an apparition."},{"definition":"To die; to expire."},{"definition":"To ghostwrite."},{"definition":"To sail seemingly without wind."},{"definition":"To copy a file or hard drive image."},{"definition":"To gray out (a visual item) to indicate that it is unavailable."},{"definition":"To forcibly disconnect an IRC user who is using one's reserved nickname."},{"definition":"To appear without warning; to move quickly and quietly; to slip."},{"definition":"To kill."},{"definition":"To break up with someone without warning or explanation; to perform an act of ghosting."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"ghosts-us","text":"/ɡoʊsts/"}]},{"word":"DOUBTS","idx":13966,"count":2945460,"meanings":[{"definitions":[{"definition":"Disbelief or uncertainty (about something); a particular instance of such disbelief or uncertainty.","example":"I have doubts about how to convert this code to JavaScript."},{"definition":"A point of uncertainty; a query."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be undecided about; to lack confidence in; to disbelieve, to question.","example":"He doubted that was really what you meant."},{"definition":"To harbour suspicion about; suspect."},{"definition":"To anticipate with dread or fear; to apprehend."},{"definition":"To fill with fear; to affright."},{"definition":"To dread, to fear."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"doubts-us","text":"/daʊts/"}]},{"word":"LOCALITY","idx":13967,"count":2945277,"meanings":[{"definitions":[{"definition":"The fact or quality of having a position in space."},{"definition":"The features or surroundings of a particular place."},{"definition":"The condition of being local."},{"definition":"The situation or position of an object."},{"definition":"An area or district considered as the site of certain activities; a neighbourhood."},{"definition":"Limitation to a county, district, or place.","example":"locality of trial"},{"definition":"The perceptive faculty concerned with the ability to remember the relative positions of places."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"locality-us","text":"/loʊˈkælɪti/"}]},{"word":"SUBSTANTIVE","idx":13968,"count":2944502,"meanings":[{"definitions":[{"definition":"(grammar) a word that names a person, place, thing or idea; a noun (sensu stricto)"},{"definition":"Part of a text that carries the meaning, such as words and their ordering."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(grammar) to make a word belonging to another part of speech into a substantive (that is, a noun) or use it as a noun"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of the essence or essential element of a thing; as, \"substantive information\""},{"definition":"Having substance; enduring; solid; firm; substantial"},{"definition":"Applying to essential legal principles and rules of right; as, \"substantive law\""},{"definition":"Of a dye that does not need the use of a mordant to be made fast to that which is being dyed"},{"definition":"Depending on itself; independent."},{"definition":"(grammar) used like a noun substantive"},{"definition":"(of a rank or appointment) actually and legally held, as distinct from an acting, temporary or honorary rank or appointment"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/səbˈstæntɪv/"}]},{"word":"BULLETINS","idx":13969,"count":2943858,"meanings":[{"definitions":[{"definition":"A short report, especially one released through official channels to be broadcast or publicized."},{"definition":"A short news report."},{"definition":"A short printed publication, especially one produced by an organization."}],"partOfSpeech":"n"}]},{"word":"WORRIES","idx":13970,"count":2943471,"meanings":[{"definitions":[{"definition":"A strong feeling of anxiety.","example":"I'm afflicted by worry throughout the night."},{"definition":"An instance or cause of such a feeling.","example":"My main worry is that I'll miss the train."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be troubled; to give way to mental anxiety or doubt.","example":"Stop worrying about your test, it’ll be fine."},{"definition":"Disturb the peace of mind of; afflict with mental agitation or distress.","example":"Your tone of voice worries me."},{"definition":"To harass; to irritate or distress.","example":"The President was worried into military action by persistent advisors."},{"definition":"To seize or shake by the throat, especially of a dog or wolf.","example":"Your dog’s been worrying sheep again."},{"definition":"To touch repeatedly, to fiddle with."},{"definition":"To strangle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"worries-us"},{"text":"/ˈwʌɹiz/"}]},{"word":"HUG","idx":13971,"count":2943073,"meanings":[{"definitions":[{"definition":"A close embrace, especially when charged with such an emotion as represented by: affection, joy, relief, lust, anger, agression, compassion, and the like, as opposed to being characterized by formality, equivocation or ambivalence (a half-embrace or \"little hug\")."},{"definition":"A particular grip in wrestling."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To crouch; huddle as with cold."},{"definition":"To cling closely together."},{"definition":"To embrace by holding closely, especially in the arms.","example":"Billy hugged Danny until he felt better."},{"definition":"To stay close to (the shore etc.)"},{"definition":"To hold fast; to cling to; to cherish."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hug-us","text":"/hʌɡ/"}]},{"word":"REJECTS","idx":13972,"count":2942672,"meanings":[{"definitions":[{"definition":"Something that is rejected."},{"definition":"An unpopular person."},{"definition":"A rejected defective product in a production line"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To refuse to accept.","example":"She even rejected my improved offer."},{"definition":"To block a shot, especially if it sends the ball off the court."},{"definition":"To refuse a romantic advance.","example":"I've been rejected three times this week."}],"partOfSpeech":"ve"}]},{"word":"SPEAR","idx":13973,"count":2942538,"meanings":[{"definitions":[{"definition":"A long stick with a sharp tip used as a weapon for throwing or thrusting, or anything used to make a thrusting motion."},{"definition":"A soldier armed with such a weapon; a spearman."},{"definition":"A lance with barbed prongs, used by fishermen to retrieve fish."},{"definition":"An illegal maneuver using the end of a hockey stick to strike into another hockey player."},{"definition":"In professional wrestling, a running tackle in which the wrestler's shoulder is driven into the opponent's midsection."},{"definition":"A shoot, as of grass; a spire."},{"definition":"The feather of a horse."},{"definition":"The rod to which the bucket, or plunger, of a pump is attached; a pump rod."},{"definition":"A long, thin strip from a vegetable.","example":"asparagus and broccoli spears"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pierce with a spear."},{"definition":"(by extension) To penetrate or strike with, or as if with, any long narrow object; to make a thrusting motion that catches an object on the tip of a long device."},{"definition":"To shoot into a long stem, as some plants do."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Male.","example":"a spear counterpart"},{"definition":"Pertaining to male family members.","example":"the spear side of the family"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"spear-us","text":"/spɪɹ/"}]},{"word":"REFEREE","idx":13975,"count":2941934,"meanings":[{"definitions":[{"definition":"An umpire or judge; an official who makes sure the rules are followed during a game.","example":"The referee kicked Jim out of the game for fighting."},{"definition":"A person who settles a dispute."},{"definition":"A person who writes a letter of reference or provides a reference by phone call for someone.","example":"Your application, along with letters from three referees, should be received by January 31."},{"definition":"An expert who judges the manuscript of an article or book to decide if it should be published."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To act as a referee.","example":"He has to referee three hockey games this weekend."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"referee-us","text":"/ˌɹɛfəˈɹiː/"}]},{"word":"TRANSPORTER","idx":13976,"count":2941706,"meanings":[{"definitions":[{"definition":"One who, or that which transports."},{"definition":"A carrier."}],"partOfSpeech":"n"}]},{"word":"SWINGER","idx":13978,"count":2941608,"meanings":[{"definitions":[{"definition":"One who swings."},{"definition":"A person who practices swinging (sex with different partners)."},{"definition":"A bet in which the bettor must correctly pick two runners to finish in any of the places in any order."},{"definition":"A performer of swing music or whose style is influenced by swing."},{"definition":"A swing voter."},{"definition":"One who swinges."},{"definition":"Anything very large, forcible, or astonishing."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"swinger-1-au"}]},{"word":"BROADLY","idx":13979,"count":2941435,"meanings":[{"definitions":[{"definition":"Widely and openly."},{"definition":"In a wide manner; liberally; in a loose sense."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"broadly-us"}]},{"word":"ETHEREAL","idx":13980,"count":2941063,"meanings":[{"definitions":[{"definition":"Pertaining to the hypothetical upper, purer air, or to the higher regions beyond the earth or beyond the atmosphere; celestial; otherworldly.","example":"ethereal space ethereal regions"},{"definition":"Consisting of ether; hence, exceedingly light or airy; tenuous; spiritlike; characterized by extreme delicacy, as form, manner, thought, etc."},{"definition":"Delicate, light and airy."},{"definition":"To do with ether.","example":"an ethereal solution"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"ethereal-us","text":"/əˈθɪɹ.i.əl/"}]},{"word":"CROSSROADS","idx":13981,"count":2940390,"meanings":[{"definitions":[{"definition":"A crossroads (place where one road crosses another)."},{"definition":"A road that crosses another."}],"partOfSpeech":"n"}]},{"word":"AERO","idx":13982,"count":2940313,"meanings":[{"definitions":[{"definition":"Aerodynamics."},{"definition":"An airplane or airship."},{"definition":"Aerospace."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to aviation.","example":"We've seen a lot of growth in the aero sector."},{"definition":"Aerodynamic; having an aerodynamic appearance.","example":"It's a very aero design, with smooth lines."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"aero-au","text":"/ˈɛəɹəʊ/"}]},{"word":"CONSTRUCTING","idx":13983,"count":2940002,"meanings":[{"definitions":[{"definition":"To build or form (something) by assembling parts.","example":"We constructed the radio from spares."},{"definition":"To build (a sentence, an argument, etc.) by arranging words or ideas.","example":"A sentence may be constructed with a subject, verb and object."},{"definition":"To draw (a geometric figure) by following precise specifications and using geometric tools and techniques.","example":"Construct a circle that touches each vertex of the given triangle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of construction."}],"partOfSpeech":"n"}]},{"word":"SMOOTHLY","idx":13984,"count":2939650,"meanings":[{"definitions":[{"definition":"In a smooth manner"}],"partOfSpeech":"v"}],"phonetics":[{"audio":"smoothly-us","text":"/ˈsmuːðli/"}]},{"word":"PARSONS","idx":13985,"count":2939565,"meanings":[{"definitions":[{"definition":"An Anglican cleric having full legal control of a parish under ecclesiastical law; a rector."},{"definition":"A Protestant minister."}],"partOfSpeech":"n"}]},{"word":"BURY","idx":13986,"count":2938393,"meanings":[{"definitions":[{"definition":"A burrow."},{"definition":"A borough; a manor"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To ritualistically inter in a grave or tomb."},{"definition":"To place in the ground.","example":"bury a bone;  bury the embers"},{"definition":"To hide or conceal as if by covering with earth or another substance.","example":"she buried her face in the pillow;  they buried us in paperwork"},{"definition":"To suppress and hide away in one's mind.","example":"secrets kept buried; she buried her shame and put on a smiling face."},{"definition":"To put an end to; to abandon.","example":"They buried their argument and shook hands."},{"definition":"To score a goal."},{"definition":"To kill or murder."},{"definition":"To render imperceptible by other, more prominent stimuli; drown out.","example":"vocals buried in the mix"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"bury-us","text":"/ˈbɛ.ɹi/"}]},{"word":"BLANC","idx":13988,"count":2937810,"meanings":[{"definitions":[{"definition":"A white cosmetic."},{"definition":"A white sauce of fat, broth, and vegetables, used especially for braised meat."}],"partOfSpeech":"n"}]},{"word":"AUTONOMY","idx":13989,"count":2937673,"meanings":[{"definitions":[{"definition":"Self-government; freedom to act or function independently."},{"definition":"The capacity to make an informed, uncoerced decision."},{"definition":"The capacity of a system to make a decision about its actions without the involvement of another system or operator."},{"definition":"The status of a church whose highest-ranking bishop is appointed by the patriarch of the mother church, but which is self-governing in all other respects. Compare autocephaly."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"autonomy-us","text":"/ɔˈtɑnəmi/"}]},{"word":"BOUNDED","idx":13990,"count":2936998,"meanings":[{"definitions":[{"definition":"To surround a territory or other geographical entity.","example":"France, Portugal, Gibraltar and Andorra bound Spain."},{"definition":"To be the boundary of."},{"definition":"To leap, move by jumping.","example":"The rabbit bounded down the lane."},{"definition":"To cause to leap.","example":"to bound a horse"},{"definition":"To rebound; to bounce.","example":"a rubber ball bounds on the floor"},{"definition":"To cause to rebound; to throw so that it will rebound; to bounce.","example":"to bound a ball on the floor"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(of a set) That can be enclosed within a ball of finite radius.","example":"A compact set must be bounded."},{"definition":"(of a poset X with partial order ≤) That contains a least element, a, and a greatest element, b, such that for all x ∈ X, a ≤ x ≤ b."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bounded-us","text":"/ˈbaʊndɪd/"}]},{"word":"PPL","idx":13991,"count":2936623,"meanings":[{"definitions":[{"definition":"(grammar) A form of a verb that may function as an adjective or noun. English has two types of participles: the present participle and the past participle. In other languages, there are others, such as future, perfect, and future perfect participles."},{"definition":"People"},{"definition":"Initialism of parts per litre."}],"partOfSpeech":"n"}]},{"word":"INSIST","idx":13993,"count":2936535,"meanings":[{"definitions":[{"definition":"(with on or upon or (that + ordinary verb form)) To hold up a claim emphatically.","example":"I insist that my secretary dresses nicely."},{"definition":"(sometimes with on or upon or (that + subjunctive)) To demand continually that something happen or be done.","example":"I insist that my secretary dress nicely."},{"definition":"To stand (on); to rest (upon); to lean (upon)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"insist-us","text":"/ɪnˈsɪst/"}]},{"word":"BIRCH","idx":13994,"count":2936180,"meanings":[{"definitions":[{"definition":"Any of various trees of the genus Betula, native to countries in the Northern Hemisphere."},{"definition":"A hard wood taken from the birch tree, typically used to make furniture."},{"definition":"A stick, rod or bundle of twigs made from birch wood, used for punishment."},{"definition":"A birch-bark canoe."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To punish with a stick, bundle of twigs, or rod made of birch wood."},{"definition":"To punish as though one were using a stick, bundle of twigs, or rod made of birch wood."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"birch-us","text":"/bɝtʃ/"}]},{"word":"SLASH","idx":13996,"count":2935535,"meanings":[{"definitions":[{"definition":"A slashing action or motion, particularly:"},{"definition":"A mark made by a slashing motion, particularly:"},{"definition":"Something resembling such a mark, particularly:"},{"definition":"The loose woody debris remaining from a slash, (particularly forestry) the trimmings left while preparing felled trees for removal.","example":"Slash generated during logging may constitute a fire hazard."},{"definition":"Slash fiction."},{"definition":"A drink of something; a draft."},{"definition":"A piss: an act of urination."},{"definition":"A swampy area; a swamp."},{"definition":"A large quantity of watery food such as broth."},{"definition":"The period of a transitory breeze."},{"definition":"An interval of good weather."},{"definition":"The loose part of a rope; slack."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cut or attempt to cut, particularly:"},{"definition":"To strike violently and randomly, particularly:"},{"definition":"To move quickly and violently."},{"definition":"To crack a whip with a slashing motion."},{"definition":"To clear land, (particularly forestry) with violent action such as logging or brushfires or through grazing.","example":"The province's traditional slash-and-burn agriculture was only sustainable with a much smaller population."},{"definition":"To write slash fiction."},{"definition":"To piss, to urinate."},{"definition":"To work in wet conditions."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Used to note the sound or action of a slash."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Used to connect two or more identities in a list."},{"definition":"Used to list alternatives."}],"partOfSpeech":"c"}],"phonetics":[{"text":"/slæʃ/"},{"text":"/slaʃ/"},{"audio":"slash-au"}]},{"word":"BUDGETING","idx":13998,"count":2935069,"meanings":[{"definitions":[{"definition":"To construct or draw up a budget.","example":"Budgeting is even harder in times of recession"},{"definition":"To provide funds, allow for in a budget.","example":"The PM’s pet projects are budgeted rather generously"},{"definition":"To plan for the use of in a budget.","example":"The prestigious building project is budgeted in great detail, from warf facilities to the protocollary opening."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The activity of constructing a budget."}],"partOfSpeech":"n"}]},{"word":"EXERCISED","idx":13999,"count":2935026,"meanings":[{"definitions":[{"definition":"To exert for the sake of training or improvement; to practice in order to develop.","example":"to exercise troops or horses;  to exercise one's brain with a puzzle"},{"definition":"To perform physical activity for health or training.","example":"I exercise at the gym every day."},{"definition":"To use (a right, an option, etc.); to put into practice.","example":"She is going to exercise her right to vote."},{"definition":"(now often in passive) To occupy the attention and effort of; to task; to tax, especially in a painful or vexatious manner; harass; to vex; to worry or make anxious.","example":"exercised with pain"},{"definition":"To set in action; to cause to act, move, or make exertion; to give employment to."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɛk.sɚ.saɪzd/"},{"text":"/ˈɛk.sə.saɪzd/"}]},{"word":"BACKPACKS","idx":14000,"count":2934944,"meanings":[{"definitions":[{"definition":"A knapsack, sometimes mounted on a light frame, but always supported by straps, worn on a person’s back for the purpose of carrying things, especially when hiking, or on a student's back when carrying books."},{"definition":"A similarly placed item containing a parachute or other life-support equipment."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hike and camp overnight in backcountry with one's gear carried in a backpack"},{"definition":"To engage in low-cost, generally urban, travel with minimal luggage and frugal accommodations"},{"definition":"To place or carry (an item or items) in a backpack"}],"partOfSpeech":"ve"}]},{"word":"DETECTING","idx":14001,"count":2934762,"meanings":[{"definitions":[{"definition":"To discover or find by careful search, examination, or probing"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An act of detection."}],"partOfSpeech":"n"}]},{"word":"RESALE","idx":14002,"count":2934694,"meanings":[{"definitions":[{"definition":"The action of selling something previously bought, usually at a higher price for profit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to selling on.","example":"The resale value was high as the items were quite rare."}],"partOfSpeech":"j"}]},{"word":"MIKES","idx":14003,"count":2933878,"meanings":[{"definitions":[{"definition":"A microphone."},{"definition":"A minute.","example":"We'll be there in one zero mikes [i.e. ten minutes]."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To microphone; to place one or more microphones (mikes) on."},{"definition":"To measure using a micrometer."}],"partOfSpeech":"ve"}]},{"word":"DIGESTIVE","idx":14005,"count":2933689,"meanings":[{"definitions":[{"definition":"A substance that aids digestion."},{"definition":"A digestive biscuit.","example":"I bought a packet of chocolate digestives."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or functioning in digestion."},{"definition":"That causes or promotes digestion."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"digestive-uk","text":"/daɪˈdʒɛstɪv/"}]},{"word":"SCALAR","idx":14006,"count":2933537,"meanings":[{"definitions":[{"definition":"A quantity that has magnitude but not direction; compare vector"},{"definition":"An amplifier whose output is a constant multiple of its input"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Having magnitude but not direction"},{"definition":"Consisting of a single value (e.g. integer or string) rather than multiple values (e.g. array)"},{"definition":"Of, or relating to scale"},{"definition":"Of or pertaining to a musical scale."}],"partOfSpeech":"j"}]},{"word":"ENTERTAIN","idx":14007,"count":2933389,"meanings":[{"definitions":[{"definition":"Entertainment; pleasure."},{"definition":"Reception of a guest; welcome."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To amuse (someone); to engage the attention of agreeably.","example":"The motivational speaker not only instructed but also entertained the audience."},{"definition":"To have someone over at one's home for a party or visit.","example":"They enjoy entertaining a lot."},{"definition":"To receive and take into consideration; to have a thought in mind.","example":"The committee would like to entertain the idea of reducing the budget figures."},{"definition":"To take or keep in one's service; to maintain; to support; to harbour; to keep."},{"definition":"To meet or encounter, as an enemy."},{"definition":"To lead on; to bring along; to introduce."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"entertain-us","text":"/ˌɛntɚˈteɪn/"}]},{"word":"UNRESOLVED","idx":14009,"count":2932746,"meanings":[{"definitions":[{"definition":"To undo a resolution."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not resolved.","example":"The psychotherapist encouraged patients to describe their unresolved emotional problems."}],"partOfSpeech":"j"}]},{"word":"SESAME","idx":14010,"count":2932722,"meanings":[{"definitions":[{"definition":"A tropical Asian plant (Sesamum indicum) bearing small flat seeds used as food and as a source of oil."},{"definition":"The seed of this plant."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sesame-us","text":"/ˈsɛsəmi/"}]},{"word":"HEP","idx":14011,"count":2932339,"meanings":[{"definitions":[{"definition":"Hepatitis."},{"definition":"Abbreviation of high-energy physics."},{"definition":"A hip of a rose; a rosehip."},{"definition":"(usually reduplicated) An instance of crying hep!, especially as a call to attack Jewish people."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(US slang) To make aware of.","example":"I hepped him to the situation."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(US slang) Aware, up-to-date."},{"definition":"(US slang) Cool, hip, sophisticated."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/hɛp/"}]},{"word":"DUCT","idx":14012,"count":2931962,"meanings":[{"definitions":[{"definition":"A pipe, tube or canal which carries gas or liquid from one place to another.","example":"heating and air-conditioning ducts"},{"definition":"An enclosure or channel for electrical cable runs."},{"definition":"Guidance; direction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To channel something through a duct (or series of ducts)."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"duct-us","text":"/dʌkt/"}]},{"word":"ELECTROMAGNETIC","idx":14015,"count":2930287,"meanings":[{"definitions":[{"definition":"Relating to electromagnetism"}],"partOfSpeech":"j"}]},{"word":"HOUSEWIFE","idx":14019,"count":2928414,"meanings":[{"definitions":[{"definition":"(plural \"housewives\") A woman whose main employment is homemaking, maintaining the upkeep of her home and tending to household affairs; often, such a woman whose sole [unpaid] employment is homemaking."},{"definition":"(plural \"housewives\") The wife of a householder; the mistress of a family; the female head of a household."},{"definition":"(plural \"housewifes\") A little case or bag for materials used in sewing, and for other articles of female work."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To manage with skill and economy."}],"partOfSpeech":"ve"}]},{"word":"PURSUED","idx":14022,"count":2927218,"meanings":[{"definitions":[{"definition":"To follow urgently, originally with intent to capture or harm; to chase."},{"definition":"To follow, travel down (a particular way, course of action etc.).","example":"Her rival pursued a quite different course."},{"definition":"To aim for, go after (a specified objective, situation etc.)."},{"definition":"To participate in (an activity, business etc.); to practise, follow (a profession)."},{"definition":"To act as a legal prosecutor."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pursued-us","text":"/pɚˈsud/"}]},{"word":"VALIDATED","idx":14023,"count":2926787,"meanings":[{"definitions":[{"definition":"To render valid."},{"definition":"To check or prove the validity of; verify."},{"definition":"To have its validity successfully proven.","example":"The data file cannot be imported because it doesn't validate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Declared or made valid."},{"definition":"Having experienced emotional validation."}],"partOfSpeech":"j"}]},{"word":"LEND","idx":14024,"count":2926360,"meanings":[{"definitions":[{"definition":"The lumbar region; loin."},{"definition":"(of a person or animal) The loins; flank; buttocks."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To allow to be used by someone temporarily, on condition that it or its equivalent will be returned.","example":"I lent her 10 euros to pay for the train tickets, and she paid me back the next day."},{"definition":"To make a loan."},{"definition":"To be suitable or applicable, to fit.","example":"Poems do not lend themselves to translation easily."},{"definition":"To afford; to grant or furnish in general.","example":"Can you lend me some assistance?"},{"definition":"To borrow."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"lend-us","text":"/lɛnd/"}]},{"word":"CORVETTE","idx":14026,"count":2925839,"meanings":[{"definitions":[{"definition":"A flush-decked warship of the 17th-18th centuries having a single tier of guns; it ranked next below a frigate; – called in the United States navy a sloop of war."},{"definition":"In a modern navy, a lightly armed and armoured blue water warship, smaller than a frigate, capable of transoceanic duty."}],"partOfSpeech":"n"}]},{"word":"YACHTS","idx":14027,"count":2925303,"meanings":[{"definitions":[{"definition":"A slick and light ship for making pleasure trips or racing on water, having sails but often motor-powered. At times used as a residence offshore on a dock.","example":"Would you like to go sailing on my uncle’s yacht?"},{"definition":"Any vessel used for private, noncommercial purposes."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sail, voyage, or race in a yacht."}],"partOfSpeech":"ve"}]},{"word":"CHRISTIE","idx":14029,"count":2923926,"meanings":[{"definitions":[{"definition":"A high-speed ski turn in which the skis are kept parallel."}],"partOfSpeech":"n"}]},{"word":"UNRELATED","idx":14030,"count":2923407,"meanings":[{"definitions":[{"definition":"Not connected or associated","example":"The holiday started with two unrelated mishaps."},{"definition":"Not related by kinship","example":"He had the same surname as me, but we were unrelated."}],"partOfSpeech":"j"}]},{"word":"ANNOTATE","idx":14033,"count":2923120,"meanings":[{"definitions":[{"definition":"To add annotation to."}],"partOfSpeech":"ve"}]},{"word":"STIMULATING","idx":14034,"count":2923056,"meanings":[{"definitions":[{"definition":"To encourage into action."},{"definition":"To arouse an organism to functional activity."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a manner that stimulates."}],"partOfSpeech":"j"}]},{"word":"MONT","idx":14035,"count":2922608,"meanings":[{"definitions":[{"definition":"Mount; mountain."}],"partOfSpeech":"n"}]},{"word":"MISUSE","idx":14037,"count":2922159,"meanings":[{"definitions":[{"definition":"An incorrect, improper or unlawful use of something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To use (something) incorrectly."},{"definition":"To abuse or mistreat (something or someone)."},{"definition":"To rape (a woman); later more generally, to sexually abuse (someone)."},{"definition":"To abuse verbally, to insult."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/mɪsˈjuːs/"}]},{"word":"HELIX","idx":14038,"count":2921411,"meanings":[{"definitions":[{"definition":"A curve on the surface of a cylinder or cone such that its angle to a plane perpendicular to the axis is constant; the three-dimensional curve seen in a screw or a spiral staircase."},{"definition":"A small volute under the abacus of a Corinthian capital."},{"definition":"The incurved rim of the external ear."},{"definition":"An upside down midair 360° spin in playboating."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form or cause to form a helix."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"helix-us","text":"/ˈhiːlɪks/"}]},{"word":"COSMOS","idx":14039,"count":2921384,"meanings":[{"definitions":[{"definition":"The universe."},{"definition":"An ordered, harmonious whole."},{"definition":"Any of various mostly Mexican herbs of the genus Cosmos having radiate heads of variously coloured flowers and pinnate leaves."},{"definition":"A cosmopolitan, a cocktail containing vodka, triple sec, lime juice and cranberry juice."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"cosmos-1-uk","text":"/ˈkɒz.mɒs/"}]},{"word":"SPECULATION","idx":14040,"count":2921087,"meanings":[{"definitions":[{"definition":"The process of thinking or meditating on a subject."},{"definition":"The act or process of reasoning a priori from premises given or assumed."},{"definition":"A conclusion to which the mind comes by speculating; mere theory; notion; conjecture."},{"definition":"An investment involving higher-than-normal risk in order to obtain a higher-than-normal return."},{"definition":"The act or practice of buying land, goods, shares, etc., in expectation of selling at a higher price, or of selling with the expectation of repurchasing at a lower price; a trading on anticipated fluctuations in price, as distinguished from trading in which the profit expected is the difference between the retail and wholesale prices, or the difference of price in different markets."},{"definition":"Examination by the eye; view."},{"definition":"Power of sight."},{"definition":"A card game in which the players buy from one another trumps or whole hands, upon a chance of getting the highest trump dealt, which entitles the holder to the pool of stakes."},{"definition":"The process of anticipating which branch of code will be chosen and executing it in advance."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"speculation-us","text":"/ˌspɛkjəˈleɪʃən/"}]},{"word":"DIXIE","idx":14042,"count":2920964,"meanings":[{"definitions":[{"definition":"A large iron pot, used in the army."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɪk.si/"}]},{"word":"PANS","idx":14043,"count":2920624,"meanings":[{"definitions":[{"definition":"A wide, flat receptacle used around the house, especially for cooking."},{"definition":"The contents of such a receptacle."},{"definition":"A cylindrical receptacle about as tall as it is wide, with one long handle, usually made of metal, used for cooking in the home."},{"definition":"A deep plastic receptacle, used for washing or food preparation; a basin."},{"definition":"A wide receptacle in which gold grains are separated from gravel by washing the contents with water."},{"definition":"An expanse of level land located in a depression, especially"},{"definition":"Short for hardpan: a hard substrate such as is formed in pans."},{"definition":"Strong adverse criticism."},{"definition":"A loaf of bread."},{"definition":"The chamber pot in a close stool; the base of a toilet, consisting of the bowl and its support."},{"definition":"A human face, a mug."},{"definition":"(roofing) The bottom flat part of a roofing panel that is between the ribs of the panel."},{"definition":"A closed vessel for boiling or evaporating as part of manufacture; a vacuum pan."},{"definition":"The part of a flintlock that holds the priming."},{"definition":"The skull, considered as a vessel containing the brain; the brainpan."},{"definition":"The brain, seen as one's intellect"},{"definition":"A recess, or bed, for the leaf of a hinge."},{"definition":"A part; a portion."},{"definition":"(fortifications) The distance comprised between the angle of the epaule and the flanked angle."},{"definition":"A leaf of gold or silver."},{"definition":"Meanings relating to a wind instrument."},{"definition":"Meanings relating to a hollow conduit."},{"definition":"Meanings relating to a container."},{"definition":"Meanings relating to something resembling a tube."},{"definition":"Meanings relating to computing."},{"definition":"Meanings relating to a smoking implement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wash in a pan (of earth, sand etc. when searching for gold)."},{"definition":"To disparage; to belittle; to put down; to criticise severely."},{"definition":"With \"out\" (to pan out), to turn out well; to be successful."},{"definition":"(of a contest) To beat one's opposition convincingly."},{"definition":"To criticize harshly a work (like a book, movie, etc.)"},{"definition":"Of a camera, etc.: to turn horizontally."},{"definition":"To move the camera lens angle while continuing to expose the film, enabling a contiguous view and enrichment of context. In still-photography large-group portraits the film usually remains on a horizontal fixed plane as the lens and/or the film holder moves to expose the film laterally. The resulting image may extend a short distance laterally or as great as 360 degrees from the point where the film first began to be exposed."},{"definition":"(audio) To spread a sound signal into a new stereo or multichannel sound field, typically giving the impression that it is moving across the sound stage."},{"definition":"To join or fit together; to unite."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/pænz/"}]},{"word":"ENFORCED","idx":14044,"count":2920500,"meanings":[{"definitions":[{"definition":"To keep up, impose or bring into effect something, not necessarily by force.","example":"The police are there to enforce the law."},{"definition":"To give strength or force to; to affirm, to emphasize.","example":"The victim was able to enforce his evidence against the alleged perpetrator."},{"definition":"To strengthen (a castle, town etc.) with extra troops, fortifications etc."},{"definition":"To intensify, make stronger, add force to."},{"definition":"To exert oneself, to try hard."},{"definition":"To compel, oblige (someone or something); to force."},{"definition":"To make or gain by force; to force.","example":"to enforce a passage"},{"definition":"To put in motion or action by violence; to drive."},{"definition":"To give force to; to strengthen; to invigorate; to urge with energy.","example":"to enforce arguments or requests"},{"definition":"To urge; to ply hard; to lay much stress upon."},{"definition":"To prove; to evince."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɪnˈfɔɹst/"},{"text":"/ɪnˈfɔːst/"}]},{"word":"LEGION","idx":14045,"count":2920122,"meanings":[{"definitions":[{"definition":"The major unit or division of the Roman army, usually comprising 3000 to 6000 infantry soldiers and 100 to 200 cavalry troops."},{"definition":"A combined arms major military unit featuring cavalry, infantry, and artillery"},{"definition":"A large military or semi-military unit trained for combat; any military force; an army, regiment; an armed, organized and assembled militia."},{"definition":"(often Legion or the Legion) A national organization or association of former servicemen, such as the American Legion."},{"definition":"A large number of people; a multitude."},{"definition":"(often plural) A great number."},{"definition":"A group of orders inferior to a class; in scientific classification, a term occasionally used to express an assemblage of objects intermediate between an order and a class."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form into legions."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Numerous; vast; very great in number","example":"Russia’s labor and capital resources are woefully inadequate to overcome the state’s needs and vulnerabilities, which are legion."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈliːdʒən/"}]},{"word":"FULFILLMENT","idx":14047,"count":2919654,"meanings":[{"definitions":[{"definition":"The act of fulfilling."},{"definition":"The state or quality of being fulfilled; completion; realization."},{"definition":"The act of consummating a desire or promise."},{"definition":"The activities performed once an order is received to fulfill the order; packaging, distributing and shipping goods."}],"partOfSpeech":"n"}]},{"word":"BIOMASS","idx":14048,"count":2918738,"meanings":[{"definitions":[{"definition":"The total mass of a living thing or part thereof, such as a cell."},{"definition":"The total mass of all living things within a specific area, habitat etc."},{"definition":"Vegetation used as a fuel, or source of energy, especially if cultivated for that purpose."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"biomass-uk","text":"/ˈbaɪ.ə(ʊ)ˌmæs/"}]},{"word":"ASSERTION","idx":14049,"count":2917932,"meanings":[{"definitions":[{"definition":"The act of asserting; positive declaration or averment."},{"definition":"Something which is asserted; a declaration; a statement asserted.","example":"You're a man of strong assertions!"},{"definition":"A statement or declaration which lacks support or evidence.","example":"That's just a bare assertion."},{"definition":"Maintenance; vindication","example":"the assertion of one's rights or prerogatives"},{"definition":"A statement in a program asserting a condition expected to be true at a particular point, used in debugging."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"assertion-us","text":"/əˈsɜɹʃən/"},{"audio":"assertion-uk","text":"/əˈsɜːʃən/"}]},{"word":"HIERARCHICAL","idx":14051,"count":2917623,"meanings":[{"definitions":[{"definition":"Pertaining to a hierarchy."},{"definition":"Of or pertaining to an ecclesiastic or priestly order."},{"definition":"Classified or arranged according to various criteria into successive ranks or grades.","example":"It has been said that only a hierarchical society with a leisure class at the top can produce works of art."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"hierarchical-us","text":"/ˌhaɪˈɹɑːɹkɪkəl/"}]},{"word":"LESIONS","idx":14052,"count":2917531,"meanings":[{"definitions":[{"definition":"A wound or injury."},{"definition":"An infected or otherwise injured or diseased organ or part, especially such on a patch of skin."},{"definition":"Any compound formed from damage to a nucleic acid."},{"definition":"Injury or an unfair imbalance in a commutative contract wherein the consideration is less than half of the market value, which then serves as a basis for the injured party to sue to rescind the agreement."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wound or injure, especially in an experiment or other controlled procedure."}],"partOfSpeech":"ve"}]},{"word":"SHOOK","idx":14053,"count":2917411,"meanings":[{"definitions":[{"definition":"A set of pieces for making a cask or box, usually wood."},{"definition":"The parts of a piece of house furniture, as a bedstead, packed together."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pack (staves, etc.) in a shook."},{"definition":"To cause (something) to move rapidly in opposite directions alternatingly.","example":"He shook the can of soda for thirty seconds before delivering it to me, so that, when I popped it open, soda went everywhere."},{"definition":"To move (one's head) from side to side, especially to indicate refusal, reluctance or disapproval.","example":"Shaking his head, he kept repeating \"No, no, no\"."},{"definition":"To move or remove by agitating; to throw off by a jolting or vibrating motion.","example":"to shake fruit down from a tree"},{"definition":"To disturb emotionally; to shock.","example":"He was shaken by what had happened."},{"definition":"To lose, evade, or get rid of (something).","example":"I can't shake the feeling that I forgot something."},{"definition":"To move from side to side.","example":"She shook with grief."},{"definition":"(usually as \"shake on\") To shake hands.","example":"OK, let's shake on it."},{"definition":"To dance.","example":"She was shaking it on the dance floor."},{"definition":"To give a tremulous tone to; to trill.","example":"to shake a note in music"},{"definition":"To threaten to overthrow.","example":"The experience shook my religious belief."},{"definition":"To be agitated; to lose firmness."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Shaken up; rattled; shocked or surprised."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shook-us","text":"/ʃʊk/"}]},{"word":"FINANCED","idx":14055,"count":2915964,"meanings":[{"definitions":[{"definition":"To conduct, or procure money for, financial operations; manage finances."},{"definition":"To pay ransom."},{"definition":"To manage financially; be financier for; provide or obtain funding for a transaction or undertaking.","example":"He financed his home purchase through a local credit union."},{"definition":"To extort ransom from."}],"partOfSpeech":"ve"}]},{"word":"DISMISSAL","idx":14056,"count":2915030,"meanings":[{"definitions":[{"definition":"The act of sending someone away."},{"definition":"Deprivation of office; the fact or process of being fired from employment or stripped of rank."},{"definition":"A written or spoken statement of such an act."},{"definition":"Release from confinement; liberation."},{"definition":"Removal from consideration; putting something out of one's mind, mentally disregarding something or someone."},{"definition":"The rejection of a legal proceeding, or a claim or charge made therein."},{"definition":"The event of a batsman getting out; a wicket."}],"partOfSpeech":"n"}],"phonetics":[{"text":"[dɪsˈmɪsəɫ]"},{"audio":"dismissal-au"}]},{"word":"SURNAMES","idx":14057,"count":2914992,"meanings":[{"definitions":[{"definition":"An additional name, particularly those derived from a birthplace, quality, or achievement; an epithet."},{"definition":"An additional name given to a person, place, or thing; a byname or nickname."},{"definition":"The name a person shares with other members of that person's family, distinguished from that person's given name or names; a family name."},{"definition":"(Classical studies) The cognomen of Roman names."},{"definition":"A clan."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To give a surname to."},{"definition":"To call by a surname."}],"partOfSpeech":"ve"}]},{"word":"RECONDITIONED","idx":14059,"count":2914457,"meanings":[{"definitions":[{"definition":"To restore to a functional state, or to a condition resembling the original.","example":"When reconditioning antique furniture, it is important to try to preserve as much of the original finish as possible."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Which has been reconditioned","example":"A reconditioned machine"}],"partOfSpeech":"j"}]},{"word":"SHOCKING","idx":14060,"count":2913791,"meanings":[{"definitions":[{"definition":"To cause to be emotionally shocked, to cause (someone) to feel surprised and upset.","example":"The disaster shocked the world."},{"definition":"To give an electric shock to."},{"definition":"To meet with a shock; to collide in a violent encounter."},{"definition":"To collect, or make up, into a shock or shocks; to stook.","example":"to shock rye"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The application of an electric shock."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Inspiring shock; startling."},{"definition":"Unusually obscene or lewd."},{"definition":"Extremely bad.","example":"What a shocking calamity!"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"shocking-us","text":"/ˈʃɑkɪŋ/"}]},{"word":"ALLERGIC","idx":14061,"count":2913453,"meanings":[{"definitions":[{"definition":"A person with a tendency to having allergies; a person with multiple or severe allergies."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to allergy."},{"definition":"Having an allergy.","example":"I am allergic to cats."},{"definition":"Excessively sensitive; susceptible."}],"partOfSpeech":"j"}],"phonetics":[{"text":"[ə.ˈlɝ.dʒɪk]"},{"text":"[ə.ˈlɜː.dʒɪk]"}]},{"word":"OVERLAND","idx":14062,"count":2913342,"meanings":[{"definitions":[{"definition":"(travel) a trip by land between the UK and the Indian Sub-continent or Australia, or between the UK and South Africa."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To transport (especially sheep or other farm animals) over land"},{"definition":"To travel across land"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"By or across land, especially of travel"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Over, across, or by land."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"overland-au"}]},{"word":"PROLONGED","idx":14063,"count":2913107,"meanings":[{"definitions":[{"definition":"To extend in space or length."},{"definition":"To lengthen in time; to extend the duration of"},{"definition":"To put off to a distant time; to postpone.","example":"The government shouldn't prolong deciding on this issue any further."},{"definition":"To become longer; lengthen."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Lengthy in duration; extended; protracted."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/pɹoʊˈlɔŋd/"},{"text":"/pɹəʊˈlɒŋd/"},{"text":"/pɹoʊˈlɑŋd/"}]},{"word":"BACKBONE","idx":14065,"count":2912486,"meanings":[{"definitions":[{"definition":"The series of vertebrae, separated by disks, that encloses and protects the spinal cord, and runs down the middle of the back in vertebrate animals."},{"definition":"Any fundamental support, structure, or infrastructure.","example":"Before automobiles, railroads were a backbone of commerce."},{"definition":"Courage, fortitude, or strength.","example":"He would make a good manager, if he had a little more backbone."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"backbone-us","text":"/ˈbækˌboʊn/"}]},{"word":"UNANIMOUSLY","idx":14068,"count":2911356,"meanings":[{"definitions":[{"definition":"In a unanimous manner; without objection.","example":"The jury decided unanimously to convict the defendant."}],"partOfSpeech":"v"}]},{"word":"ELIMINATES","idx":14069,"count":2910830,"meanings":[{"definitions":[{"definition":"To completely remove, get rid of, put an end to."},{"definition":"To kill (a person or animal).","example":"a ruthless mobster who eliminated his enemies"},{"definition":"To excrete (waste products)."},{"definition":"To exclude (from investigation or from further competition).","example":"Bill was eliminated as a suspect when the police interviewed witnesses."},{"definition":"To record amounts in a consolidation statement to remove the effects of inter-company transactions."}],"partOfSpeech":"ve"}]},{"word":"SAUSAGE","idx":14070,"count":2910814,"meanings":[{"definitions":[{"definition":"A food made of ground meat (or meat substitute) and seasoning, packed in a section of the animal's intestine, or in a similarly cylindrical shaped synthetic casing; a length of this food."},{"definition":"A sausage-shaped thing."},{"definition":"Penis."},{"definition":"A term of endearment.","example":"my little sausage"},{"definition":"A saucisse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a sausage-like shape, with a non-uniform cross section."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"sausage-us","text":"/ˈsɔsɪd͡ʒ/"}]},{"word":"ADDICT","idx":14071,"count":2910117,"meanings":[{"definitions":[{"definition":"A person who is addicted, especially to a harmful drug","example":"He is an addict when it comes to chocolate cookies."},{"definition":"An adherent or fan (of something)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deliver (someone or something) following a judicial decision."},{"definition":"To devote (oneself) to a given activity, occupation, thing etc."},{"definition":"To bind (a person or thing) to the service of something."},{"definition":"To devote or pledge (oneself) to a given person, cause etc."},{"definition":"To devote (one's mind, talent etc.) to a given activity, occupation, thing etc."},{"definition":"To make (someone) become devoted to a given thing or activity; to cause to be addicted."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"addict-uk-verb","text":"/əˈ.dɪkt/"},{"audio":"addict-uk-noun","text":"/ˈæ.dɪkt/"}]},{"word":"MATTE","idx":14072,"count":2909215,"meanings":[{"definitions":[{"definition":"A decorative border around a picture used to inset and center the contents of a frame.","example":"The image is a perfect square of 8 cm (with white matte border the total dimensions are 14 cm tall by 11 cm wide)."},{"definition":"A background, often painted or created with computers","example":"Matte painting is a tool that filmmakers can use to create a scene that is impossible to achieve with conventional cinematographic means."},{"definition":"(pyrometallurgy) The molten metal sulfide phases typically formed during smelting of copper, nickel, and other base metals."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Dull; not reflective of light.","example":"Flat or matte paint allows a deep color expression on the walls while also hiding flaws that may be inherent on the painted surface."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/mæt/"}]},{"word":"NEIGHBORING","idx":14073,"count":2909095,"meanings":[{"definitions":[{"definition":"Situated or living nearby or adjacent to."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To be adjacent to","example":"Though France neighbours Germany, its culture is significantly different."},{"definition":"(followed by \"on\"; figurative) To be similar to, to be almost the same as.","example":"That sort of talk is neighbouring on treason."},{"definition":"To associate intimately with; to be close to."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"neighboring-us","text":"/ˈneɪbəɹɪŋ/"}]},{"word":"UNCOMMON","idx":14074,"count":2909018,"meanings":[{"definitions":[{"definition":"Rare; not readily found; unusual.","example":"Bald eagles are an uncommon sighting in this state"},{"definition":"Remarkable; exceptional.","example":"The diamond was of uncommon size"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Exceedingly, exceptionally."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ʌnˈkɒmən/"}]},{"word":"CENTRALIZED","idx":14075,"count":2908996,"meanings":[{"definitions":[{"definition":"To move things physically towards the centre; to consolidate or concentrate"},{"definition":"To move power to a single, central authority"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having things physically towards the center; consolidated or concentrated"},{"definition":"Having power concentrated in a single, central authority"}],"partOfSpeech":"j"}]},{"word":"OBJECTIONS","idx":14079,"count":2906693,"meanings":[{"definitions":[{"definition":"The act of objecting."},{"definition":"A statement expressing opposition, or a reason or cause for expressing opposition (generally followed by the adposition to).","example":"I have no objection to any person's religion."},{"definition":"An official protest raised in a court of law during a legal trial over a violation of the rules of the court by the opposing party."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/əbˈdʒɛkʃənz/"}]},{"word":"UNPUBLISHED","idx":14080,"count":2905962,"meanings":[{"definitions":[{"definition":"Not published.","example":"an unpublished author"}],"partOfSpeech":"j"}]},{"word":"SLAUGHTER","idx":14082,"count":2905481,"meanings":[{"definitions":[{"definition":"The killing of animals, generally for food."},{"definition":"A massacre; the killing of a large number of people."},{"definition":"A rout or decisive defeat."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To butcher animals, generally for food"},{"definition":"To massacre people in large numbers"},{"definition":"To kill in a particularly brutal manner"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈslɔtɚ/"},{"text":"/ˈslɔːtə/"}]},{"word":"ENLIGHTENMENT","idx":14083,"count":2905016,"meanings":[{"definitions":[{"definition":"An act of enlightening, or the state of being enlightened or instructed."},{"definition":"A concept in spirituality, philosophy and psychology related to achieving clarity of perception, reason and knowledge."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/-laɪtmənt/"}]},{"word":"PISTOL","idx":14084,"count":2904815,"meanings":[{"definitions":[{"definition":"A handgun, typically with a chamber integrated in the barrel, a semi-automatic action and a box magazine."},{"definition":"The mechanical component of a fuse in a bomb or torpedo responsible for firing the detonator."},{"definition":"A creative and unpredictable jokester, a constant source of entertainment and surprises."},{"definition":"A small boy who is bright, alert and very active."},{"definition":"An offensive formation in which the quarterback receives the snap at a distance behind the center, but closer than in a shotgun formation, with a running back lined up behind him."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To shoot (at) a target with a pistol."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"pistol-us","text":"/ˈpɪstəl/"}]},{"word":"JUNIORS","idx":14085,"count":2904014,"meanings":[{"definitions":[{"definition":"A younger person.","example":"four years his junior"},{"definition":"A name suffix used after a son's name when his father has the same name (abbreviations: Jnr., Jr., Jun.)."},{"definition":"A third-year student at a high school or university."},{"definition":"A junior barrister."}],"partOfSpeech":"n"}]},{"word":"ROCKETS","idx":14086,"count":2903678,"meanings":[{"definitions":[{"definition":"A rocket engine."},{"definition":"A non-guided missile propelled by a rocket engine."},{"definition":"A vehicle propelled by a rocket engine."},{"definition":"A rocket propelled firework, a skyrocket"},{"definition":"An ace (the playing card)."},{"definition":"An angry communication (such as a letter or telegram) to a subordinate."},{"definition":"A blunt lance head used in jousting."},{"definition":"Something that shoots high in the air."},{"definition":"A stupid or crazy person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To accelerate swiftly and powerfully"},{"definition":"To fly vertically"},{"definition":"To rise or soar rapidly"},{"definition":"To carry something in a rocket"},{"definition":"To attack something with rockets"}],"partOfSpeech":"ve"}]},{"word":"METERING","idx":14088,"count":2903055,"meanings":[{"definitions":[{"definition":"To measure with a metering device."},{"definition":"To imprint a postage mark with a postage meter."},{"definition":"To regulate the flow of or to deliver in regulated amounts (usually of fluids but sometimes of other things such as anticipation or breath)."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process of marking a stamp with a meter"},{"definition":"The marking itself; franking"},{"definition":"The act of using a meter for measurement - light metering."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Used to meter something","example":"The museum curator went to the shelf and pulled down an ancient metering device."}],"partOfSpeech":"j"}]},{"word":"GENETICALLY","idx":14090,"count":2902834,"meanings":[{"definitions":[{"definition":"In terms of origin or development."},{"definition":"In a manner relating to genes or genetics.","example":"Genetically modified crops."},{"definition":"By being members of the same linguistic family.","example":"German and Danish are genetically related."}],"partOfSpeech":"v"}]},{"word":"ZEBRA","idx":14091,"count":2902469,"meanings":[{"definitions":[{"definition":"Any of three species of genus Equus: E. grevyi, E. quagga, or E. zebra, all with black and white stripes and native to Africa."},{"definition":"A referee."},{"definition":"An unlikely diagnosis, especially for symptoms probably caused by a common ailment. (Originates in the advice often given to medical students: \"when you hear hoofbeats, think of horses, not zebras\".)"},{"definition":"A biracial person, specifically one born to a member of the Sub-Saharan African race and a Caucasian."},{"definition":"A fish, the zebra cichlid."},{"definition":"Any of various papilionid butterflies of the subgenus Paranticopsis of the genus Graphium, having black and white markings."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"zebra-uk","text":"/ˈziːbɹə/"}]},{"word":"RUNWAY","idx":14092,"count":2901389,"meanings":[{"definitions":[{"definition":"A defined, narrow section of land or an artificial structure used for access."},{"definition":"The usual path taken by deer or other wild animals, such as from a forest to a water source."},{"definition":"A narrow walkway (often on a platform) extending from a stage on which people walk, especially one used by models during fashion shows."},{"definition":"In javelin, long jump, and similar events: a short track along which athletes can accelerate themselves for their jumps or throws."},{"definition":"A section of land, usually paved, for airplanes to land on or take off from."},{"definition":"Hence, the number of months that a startup company can operate on its cash reserves."},{"definition":"A stream bed."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"runway-us","text":"/ˈɹən-/"},{"audio":"runway-au","text":"/ˈɹən-/"}]},{"word":"ARITHMETIC","idx":14093,"count":2900993,"meanings":[{"definitions":[{"definition":"The mathematics of numbers (integers, rational numbers, real numbers, or complex numbers) under the operations of addition, subtraction, multiplication, and division."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of, relating to, or using arithmetic; arithmetical.","example":"arithmetic geometry"},{"definition":"Of a progression, mean, etc, computed solely using addition.","example":"arithmetic progression"}],"partOfSpeech":"j"}]},{"word":"SUPPOSEDLY","idx":14094,"count":2900944,"meanings":[{"definitions":[{"definition":"As a matter of supposition; in the beliefs or according to the claims of some people.","example":"According to your testimony, you were supposedly at home watching TV when the murder occurred."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"supposedly-us"}]},{"word":"ADMITS","idx":14095,"count":2899936,"meanings":[{"definitions":[{"definition":"To allow to enter; to grant entrance (to), whether into a place, into the mind, or into consideration","example":"A ticket admits one into a playhouse."},{"definition":"To allow (someone) to enter a profession or to enjoy a privilege; to recognize as qualified for a franchise.","example":"the prisoner was admitted to bail"},{"definition":"To concede as true; to acknowledge or assent to, as an allegation which it is impossible to deny","example":"he admitted his guilt"},{"definition":"To be capable of; to permit. In this sense, \"of\" may be used after the verb, or may be omitted.","example":"the words do not admit such a construction."},{"definition":"To give warrant or allowance, to grant opportunity or permission (+ of).","example":"circumstances do not admit of this"},{"definition":"To allow to enter a hospital or similar facility for treatment."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ədˈmɪts/"}]},{"word":"ORIGINALS","idx":14097,"count":2899525,"meanings":[{"definitions":[{"definition":"An object or other creation (e.g. narrative work) from which all later copies and variations are derived","example":"This manuscript is the original."},{"definition":"A person with a unique and interesting personality and/or creative talent","example":"You’re a real original."},{"definition":"An eccentric"}],"partOfSpeech":"n"}]},{"word":"ENRICHMENT","idx":14098,"count":2898868,"meanings":[{"definitions":[{"definition":"The act of enriching or something enriched."},{"definition":"The process of making enriched uranium."},{"definition":"The addition of sugar to grape juice used to make wine; chaptalization."},{"definition":"Extracurricular activities for students."}],"partOfSpeech":"n"}]},{"word":"BUCKLE","idx":14101,"count":2898037,"meanings":[{"definitions":[{"definition":"To distort or collapse under physical pressure; especially, of a slender structure in compression."},{"definition":"To make bend; to cause to become distorted."},{"definition":"To give in; to react suddenly or adversely to stress or pressure (of a person).","example":"It is amazing that he has never buckled after so many years of doing such urgent work."},{"definition":"To yield; to give way; to cease opposing."},{"definition":"To enter upon some labour or contest; to join in close fight; to contend."},{"definition":"To buckle down; to apply oneself."},{"definition":"To fasten using a buckle."},{"definition":"To unite in marriage."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A clasp used for fastening two things together, such as the ends of a belt, or for retaining the end of a strap."},{"definition":"The brisure of an eighth daughter."},{"definition":"(roofing) An upward, elongated displacement of a roof membrane frequently occurring over insulation or deck joints. A buckle may be an indication of movement with the roof assembly."},{"definition":"A distortion, bulge, bend, or kink, as in a saw blade or a plate of sheet metal."},{"definition":"A curl of hair, especially a kind of crisp curl formerly worn; also, the state of being curled."},{"definition":"A contorted expression, as of the face."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"buckle-us","text":"/ˈbʌk(ə)l/"}]},{"word":"FETCH","idx":14103,"count":2897593,"meanings":[{"definitions":[{"definition":"An act of fetching, of bringing something from a distance."},{"definition":"The object of fetching; the source of an attraction; a force, propensity, or quality which attracts."},{"definition":"A stratagem or trick; an artifice."},{"definition":"(originally Ireland) The apparition of a living person; a person's double, the sight of which is supposedly a sign that they are fated to die soon, a doppelganger; a wraith."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To retrieve; to bear towards; to go and get."},{"definition":"To obtain as price or equivalent; to sell for.","example":"If you put some new tyres on it, and clean it up a bit, the car should fetch about $5,000"},{"definition":"To bring or get within reach by going; to reach; to arrive at; to attain; to reach by sailing.","example":"to fetch headway or sternway"},{"definition":"To bring oneself; to make headway; to veer; as, to fetch about; to fetch to windward."},{"definition":"To take (a breath), to heave (a sigh)"},{"definition":"To cause to come; to bring to a particular state."},{"definition":"To recall from a swoon; to revive; sometimes with to.","example":"to fetch a man to"},{"definition":"To reduce; to throw."},{"definition":"To bring to accomplishment; to achieve; to make; to perform, with certain objects.","example":"to fetch a compass;  to fetch a leap"},{"definition":"To make (a pump) draw water by pouring water into the top and working the handle."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fetch-us","text":"/fɛtʃ/"},{"audio":"fetch-uk","text":"/fɛtʃ/"}]},{"word":"KITCHENS","idx":14104,"count":2897588,"meanings":[{"definitions":[{"definition":"A room or area for preparing food."},{"definition":"Cuisine."},{"definition":"The nape of a person's hairline, often referring to its uncombed or \"nappy\" look."},{"definition":"The percussion section of an orchestra."},{"definition":"A utensil for roasting meat."},{"definition":"A domesticated or uneducated form of a language."},{"definition":"A public gaming room in a casino."},{"definition":"Anything eaten as a relish with bread, potatoes, etc."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To do kitchen work; to prepare food."},{"definition":"To embellish a basic food; to season, add condiments, etc."},{"definition":"(by extension) To embellish; to dress up."}],"partOfSpeech":"ve"}]},{"word":"IONS","idx":14105,"count":2896976,"meanings":[{"definitions":[{"definition":"An atom or group of atoms bearing an electrical charge, such as the sodium and chlorine atoms in a salt solution."}],"partOfSpeech":"n"}]},{"word":"ASSHOLE","idx":14106,"count":2896770,"meanings":[{"definitions":[{"definition":"The anus."},{"definition":"A jerk; an inappropriately or objectionably mean, inconsiderate, contemptible, obnoxious, intrusive, stupid, and/or rude person."},{"definition":"An unpleasant or uninviting place."},{"definition":"By extension, anything unpleasant or undesirable. Often used appositionally."},{"definition":"A receptacle under a fire grate for collecting ashes."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"asshole-1-us","text":"/ˈæsˌhoʊl/"}]},{"word":"WAT","idx":14107,"count":2896705,"meanings":[{"definitions":[{"definition":"A Buddhist temple in Southeast Asia.","example":"Angkor Wat"},{"definition":"A kind of stew or curry eaten in Ethiopia and Eritrea."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(Singlish) Used to contradict an underlying assumption held by the interlocutor."},{"definition":"(usually followed by \"with,\" but also sometimes \"would\" or \"might,\" especially in finance) In some manner or degree; in part; partly. See also what with","example":"The market will calculate these higher risks in their funding costs what might result in higher lending rates."},{"definition":"Such.","example":"What a beautiful day!"},{"definition":"Why."},{"definition":"Used to introduce each of two coordinate phrases or concepts; both…and."},{"definition":"(Singlish) Used to contradict an underlying assumption held by the interlocutor."}],"partOfSpeech":"v"},{"definitions":[{"definition":"(interrogative) Which thing, event, circumstance, etc.: used interrogatively in asking for the specification of an identity, quantity, quality, etc."},{"definition":"That which; those that; the thing that.","example":"He knows what he wants."},{"definition":"(relative) That; which; who."},{"definition":"Whatever.","example":"I will do what I can to help you."}],"partOfSpeech":"p"}],"phonetics":[{"text":"/wat/"}]},{"word":"DIVERS","idx":14109,"count":2896551,"meanings":[{"definitions":[{"definition":"Someone who dives, especially as a sport."},{"definition":"Someone who works underwater; a frogman."},{"definition":"The loon (bird)."},{"definition":"The New Zealand sand diver."},{"definition":"The long-finned sand diver."},{"definition":"A passenger carrying vehicle using an underground route; specially, a diver tram, one using the former Kingsway tramway subway (1906-1952)."},{"definition":"A pickpocket."},{"definition":"A competitor in certain sports who is known to regularly imitate being fouled, with the purpose of getting his/her opponent penalised."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Consisting of many different elements; various."},{"definition":"Different; dissimilar; distinct; not the same"},{"definition":"Capable of various forms; multiform."},{"definition":"Composed of people with a variety of different demographic characteristics in terms of, for example, ethnicity, gender, sexual orientation, socioeconomic status, etc., and having a sizeable representation of people that are minorities in a given area."},{"definition":"Belonging to a minority group.","example":"Idris Elba was a diverse hire for the franchise"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdaɪ̯vəɹz/"},{"text":"/ˈdaɪ̯vəz/"}]},{"word":"SPEEDWAY","idx":14114,"count":2896052,"meanings":[{"definitions":[{"definition":"A form of motorcycle racing on flat (without camber) oval dirt tracks using motorcycles with neither brakes nor gears."},{"definition":"A form of bicycle racing on flat (non-banked) oval dirt tracks."},{"definition":"A racetrack venue designated especially for the sport of auto racing."},{"definition":"A road for high speed traffic; an expressway."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈspiːdweɪ/"}]},{"word":"FOUNDERS","idx":14115,"count":2895564,"meanings":[{"definitions":[{"definition":"One who founds or establishes (especially said of a company, project, organisation, state)","example":"the founder of Facebook, Mark Zuckerberg"},{"definition":"Someone for whose parents one has no data."},{"definition":"The iron worker in charge of the blast furnace and the smelting operation."},{"definition":"One who casts metals in various forms; a caster.","example":"a founder of cannon, bells, hardware, or printing types"},{"definition":"A severe laminitis of a horse, caused by untreated internal inflammation in the hooves."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a ship, to fill with water and sink."},{"definition":"To fall; to stumble and go lame, as a horse."},{"definition":"To fail; to miscarry."},{"definition":"To cause to fill and sink, as a ship."},{"definition":"To disable or lame (a horse) by causing internal inflammation and soreness in the feet or limbs."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"founders-us"}]},{"word":"SWEATSHIRTS","idx":14116,"count":2895332,"meanings":[{"definitions":[{"definition":"A loose shirt, usually made of a knit fleece, for athletic wear and now often used as casual apparel."},{"definition":"A shirt worn against the skin, usually under other clothing, to absorb sweat."}],"partOfSpeech":"n"}]},{"word":"UPSIDE","idx":14118,"count":2894930,"meanings":[{"definitions":[{"definition":"The highest or uppermost side or portion of something"},{"definition":"A favourable aspect of something that also has an unfavourable aspect"},{"definition":"An upward tendency, especially in a financial market etc"}],"partOfSpeech":"n"},{"definitions":[{"definition":"On the top of."}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"upside-us","text":"/ˈʌpˌsaɪd/"}]},{"word":"ADMIRAL","idx":14119,"count":2894800,"meanings":[{"definitions":[{"definition":"A naval officer of the highest rank; the commander of a country's naval forces."},{"definition":"A naval officer of high rank, immediately below Admiral of the Fleet; the commander of a fleet or squadron."},{"definition":"A flag officer in the United States Navy or Coast Guard of a grade superior to vice admiral and junior to admiral of the fleet (when that grade is used). An admiral is equal in grade or rank to a four-star general."},{"definition":"The ship which carries the admiral, the flagship; also, the most considerable ship of a fleet."},{"definition":"A prince or Saracen leader under the Sultan."},{"definition":"Any of various nymphalid butterflies of the genera Kaniska and Vanessa, especially a red admiral or white admiral."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"admiral-us","text":"/ˈæd.mə.ɹəl/"}]},{"word":"YAY","idx":14120,"count":2893326,"meanings":[{"definitions":[{"definition":"An expression of happiness.","example":"Yay! I have finally finished my work!"}],"partOfSpeech":"i"},{"definitions":[{"definition":"Yes."},{"definition":"Thus, so (now often accompanied by a hand gesture).","example":"The pony was yea high."}],"partOfSpeech":"v"},{"definitions":[{"definition":"The letter for the y sound in Pitman shorthand."},{"definition":"Cocaine (powder or crack)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"yay-us","text":"/jeɪ/"}]},{"word":"PATRON","idx":14121,"count":2892996,"meanings":[{"definitions":[{"definition":"One who protects or supports; a defender or advocate."},{"definition":"An influential, wealthy person who supported an artist, craftsman, a scholar or a noble."},{"definition":"A customer, as of a certain store or restaurant.","example":"This car park is for patrons only."},{"definition":"(Roman law) A protector of a dependent, especially a master who had freed a slave but still retained some paternal rights."},{"definition":"One who has gift and disposition of a benefice."},{"definition":"A padrone."},{"definition":"A property owner, a landlord, a master. (Compare patroon.)"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be a patron of; to patronize; to favour."},{"definition":"To treat as a patron."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"patron-us","text":"/ˈpeɪ.tɹən/"}]},{"word":"SANDWICHES","idx":14122,"count":2892868,"meanings":[{"definitions":[{"definition":"A dish or foodstuff where two or more slices of bread serve as the wrapper or container of some other food."},{"definition":"(by extension) Any combination formed by layering one type of material between two layers of some other material."},{"definition":"A layer cake or sandwich cake."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place one item between two other, usually flat, items"},{"definition":"To put or set something between two others, in time."}],"partOfSpeech":"ve"}]},{"word":"BOILER","idx":14124,"count":2892727,"meanings":[{"definitions":[{"definition":"A person who boils something."},{"definition":"A steam boiler."},{"definition":"An apparatus for heating circulating water or other heat transferring liquid."},{"definition":"A device consisting of a heat source and a tank for storing hot water, typically for space heating, domestic hot water etc., disregarding the source of heat."},{"definition":"A kitchen vessel for steaming, boiling or heating food."},{"definition":"A sunken reef, especially a coral reef, on which the sea breaks heavily."},{"definition":"A tough old chicken only suitable for cooking by boiling."},{"definition":"Boilerplate."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɔɪlɚ/"},{"text":"/ˈbɔɪlə/"}]},{"word":"ANTICIPATE","idx":14125,"count":2892087,"meanings":[{"definitions":[{"definition":"To act before (someone), especially to prevent an action."},{"definition":"To take up or introduce (something) prematurely.","example":"The advocate plans to anticipate a part of her argument."},{"definition":"To know of (something) before it happens; to expect.","example":"Please anticipate a journey of an hour from your house to the airport"},{"definition":"To eagerly wait for (something)","example":"Little Johnny started to anticipate the arrival of Santa Claus a week before Christmas."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"anticipate-us","text":"/ænˈtɪs.ə.peɪt/"}]},{"word":"LOGON","idx":14127,"count":2891286,"meanings":[{"definitions":[{"definition":"A combination of a user's identification and password used to enter a computer.","example":"Using the same logon for different systems can be a security risk."},{"definition":"The process of logging on.","example":"The user's desktop is displayed shortly after logon."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"logon-uk"}]},{"word":"INDUCE","idx":14128,"count":2891148,"meanings":[{"definitions":[{"definition":"To lead by persuasion or influence; incite or prevail upon."},{"definition":"To cause, bring about, lead to.","example":"His meditation induced a compromise.   Opium induces sleep."},{"definition":"To cause or produce (electric current or a magnetic state) by a physical process of induction."},{"definition":"To infer by induction."},{"definition":"To lead in, bring in, introduce."},{"definition":"To draw on, place upon."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"induce-us","text":"/ɪnˈduːs/"}]},{"word":"PADDING","idx":14130,"count":2890936,"meanings":[{"definitions":[{"definition":"To stuff."},{"definition":"To furnish with a pad or padding."},{"definition":"To increase the size of, especially by adding undesirable filler.","example":"May 21, 2008, Austin American-Statesman"},{"definition":"To imbue uniformly with a mordant.","example":"to pad cloth"},{"definition":"To deliberately play the ball with the leg pad instead of the bat."},{"definition":"To travel along (a road, path etc.)."},{"definition":"To travel on foot."},{"definition":"To wear a path by walking."},{"definition":"To walk softly, quietly or steadily, especially without shoes."},{"definition":"To practise highway robbery."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Soft filling material used in cushions etc."},{"definition":"Extra characters such as spaces added to a record to fill it out to a fixed length."},{"definition":"Extraneous text added to a message for the purpose of concealing its beginning, ending, or length."},{"definition":"Anything of little value used to fill up space.","example":"That magazine is mostly advertisements; the rest is padding."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpædɪŋ/"}]},{"word":"RECRUITER","idx":14131,"count":2890675,"meanings":[{"definitions":[{"definition":"Agent noun of recruit; one who recruits, particularly one employed to recruit others.","example":"The army recruiter promised that I'd see the world and learn useful skills if I enlisted."}],"partOfSpeech":"n"}]}]