[{"word":"HAUNTING","idx":21595,"count":1401138,"meanings":[{"definitions":[{"definition":"To inhabit, or visit frequently (most often used in reference to ghosts).","example":"A couple of ghosts haunt the old, burnt-down house."},{"definition":"To make uneasy, restless.","example":"The memory of his past failures haunted him."},{"definition":"To stalk, to follow","example":"The policeman haunted him, following him everywhere."},{"definition":"To live habitually; to stay, to remain."},{"definition":"To accustom; habituate; make accustomed to."},{"definition":"To practise; to devote oneself to."},{"definition":"To persist in staying or visiting."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A particular instance of haunting; a ghostly habitation.","example":"During the haunting, strange voices and noises were heard and objects flew off tables."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Remaining in the mind; not easily forgotten.","example":"He had a haunting gaze."}],"partOfSpeech":"j"}]},{"word":"MANIPULATING","idx":21596,"count":1401011,"meanings":[{"definitions":[{"definition":"To move, arrange or operate something using the hands"},{"definition":"To influence, manage, direct, control or tamper with something"},{"definition":"To handle and move a body part, either as an examination or for a therapeutic purpose"},{"definition":"To influence or control someone in order to achieve a specific purpose, especially one that is unknown to the one being manipulated and beneficial to the manipulator; to use"},{"definition":"To use the hands, especially in scientific experiments."}],"partOfSpeech":"ve"}]},{"word":"TANGENT","idx":21597,"count":1400698,"meanings":[{"definitions":[{"definition":"A straight line touching a curve at a single point without crossing it there."},{"definition":"A function of an angle that gives the ratio of the sine to the cosine, in either the real or complex numbers. Symbols: tan, tg."},{"definition":"A topic nearly unrelated to the main topic, but having a point in common with it.","example":"I believe we went off onto a tangent when we started talking about monkeys on unicycles at his retirement party."},{"definition":"A small metal blade in a clavichord that strikes the strings to produce sound."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Touching a curve at a single point but not crossing it at that point."},{"definition":"Of a topic, only loosely related to a main topic."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtæn.dʒənt/"}]},{"word":"TEMPEST","idx":21598,"count":1400397,"meanings":[{"definitions":[{"definition":"A storm, especially one with severe winds."},{"definition":"Any violent tumult or commotion."},{"definition":"A fashionable social gathering; a drum."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To storm."},{"definition":"To disturb, as by a tempest."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tempest-us","text":"/ˈtɛmpəst/"}]},{"word":"APPRAISERS","idx":21599,"count":1400100,"meanings":[{"definitions":[{"definition":"One who performs appraisals."}],"partOfSpeech":"n"}]},{"word":"XENON","idx":21601,"count":1400039,"meanings":[{"definitions":[{"definition":"The chemical element (symbol Xe) with an atomic number of 54. It is a colorless, odorless, unreactive noble gas, used notably in camera flash technology."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"xenon-us","text":"/zinən/"}]},{"word":"HYBRIDIZATION","idx":21603,"count":1399809,"meanings":[{"definitions":[{"definition":"The act of hybridizing, or the state of being hybridized."},{"definition":"The conversion of a fleet of vehicles to hybrids."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/haɪ.bɹɪd.aɪˈzeɪ.ʃən/"}]},{"word":"WAVING","idx":21604,"count":1399803,"meanings":[{"definitions":[{"definition":"To relinquish (a right etc.); to give up claim to; to forego.","example":"If you waive the right to be silent, anything you say can be used against you in a court of law."},{"definition":"To put aside, avoid."},{"definition":"To outlaw (someone)."},{"definition":"To abandon, give up (someone or something)."},{"definition":"To move from side to side; to sway."},{"definition":"To stray, wander."},{"definition":"To move back and forth repeatedly and somewhat loosely.","example":"The flag waved in the gentle breeze."},{"definition":"To move one’s hand back and forth (generally above the shoulders) in greeting or departure."},{"definition":"(metonymic) To call attention to, or give a direction or command to, by a waving motion, as of the hand; to signify by waving; to beckon; to signal; to indicate.","example":"I waved goodbye from across the room."},{"definition":"To have an undulating or wavy form."},{"definition":"To raise into inequalities of surface; to give an undulating form or surface to."},{"definition":"To produce waves to the hair."},{"definition":"To swing and miss at a pitch.","example":"Jones waves at strike one."},{"definition":"To cause to move back and forth repeatedly.","example":"The starter waved the flag to begin the race."},{"definition":"(metonymic) To signal (someone or something) with a waving movement."},{"definition":"To fluctuate; to waver; to be in an unsettled state."},{"definition":"To move like a wave, or by floating; to waft."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The motion of something that waves."},{"definition":"Repeated moving of arms or hands to signal."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"waving-us","text":"/ˈweɪvɪŋ/"}]},{"word":"DAI","idx":21609,"count":1399309,"meanings":[{"definitions":[{"definition":"(Bangladesh) A wet nurse; a midwife."}],"partOfSpeech":"n"}]},{"word":"UNEVEN","idx":21611,"count":1399055,"meanings":[{"definitions":[{"definition":"To make uneven."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Not even"},{"definition":"Not level or smooth"},{"definition":"Not uniform"},{"definition":"Varying in quality"},{"definition":"Odd"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈivən/"}]},{"word":"PLURALITY","idx":21614,"count":1398870,"meanings":[{"definitions":[{"definition":"The state of being plural."},{"definition":"The holding of multiple benefices."},{"definition":"A state of being numerous."},{"definition":"A number or part of a whole which is greater than any other number or part, but not necessarily a majority."},{"definition":"A number of votes for a single candidate or position which is greater than the number of votes gained by any other single candidate or position voted for, but which is less than a majority of valid votes cast."},{"definition":"A margin by which a number exceeds another number, especially of votes."},{"definition":"A group of many entities: a large number.","example":"A plurality of ideas were put forth at the meeting, most of which were rejected out of hand."},{"definition":"A group composed of more than one entity."},{"definition":"(of spouses) Polygamy."}],"partOfSpeech":"n"}]},{"word":"ADVENTUROUS","idx":21618,"count":1398567,"meanings":[{"definitions":[{"definition":"(of a person) Inclined to adventure; willing to incur risks; prone to embark in hazardous enterprise; rashly daring."},{"definition":"(of an act or product) Full of hazard; attended with risk; exposing to danger; requiring courage; rash."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"adventurous-us","text":"/ædˈvɛn.tʃɚ.ʌs/"}]},{"word":"ROCKERS","idx":21619,"count":1398547,"meanings":[{"definitions":[{"definition":"A curved piece of wood attached to the bottom of a rocking chair or cradle that enables it to rock back and forth."},{"definition":"A rocking chair."},{"definition":"The lengthwise curvature of a surfboard. (More rocker is a more curved board.)","example":"All modern surfboards share a similar rocker design — Bruce Jones https//web.archive.org/web/20051212041317/http://www.brucejones.com/longboar.htm"},{"definition":"The breve below as in ḫ."},{"definition":"Someone passionate about rock music."},{"definition":"A musician who plays rock music."},{"definition":"A rock music song."},{"definition":"One who rocks something."},{"definition":"A member of a British subculture of the 1960s, opposed to the mods, who dressed in black leather and were interested in 1950s music."},{"definition":"Any implement or machine working with a rocking motion, such as a trough mounted on rockers for separating gold dust from gravel, etc., by agitation in water."},{"definition":"A tool with small teeth that roughens a metal plate to produce tonality in mezzotints."},{"definition":"A rocking horse."},{"definition":"A rocker board."},{"definition":"A skate with a curved blade, somewhat resembling in shape the rocker of a cradle."},{"definition":"A rock shaft."}],"partOfSpeech":"n"}]},{"word":"PALLIATIVE","idx":21620,"count":1398546,"meanings":[{"definitions":[{"definition":"Something that palliates, particularly a palliative medicine.","example":"The radiation and chemotherapy were only palliatives."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Serving to palliate; serving to extenuate or mitigate."},{"definition":"Minimising the progression of a disease and relieving undesirable symptoms for as long as possible, rather than attempting to cure the (usually incurable) disease."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"palliative-us","text":"/ˈpæli.eɪtɪv/"}]},{"word":"BAYOU","idx":21623,"count":1397958,"meanings":[{"definitions":[{"definition":"A slow-moving, often stagnant creek or river."},{"definition":"A swamp, a marshy (stagnant) body of water."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbaɪ.oʊ/"}]},{"word":"CUFFLINKS","idx":21625,"count":1397899,"meanings":[{"definitions":[{"definition":"A button or stud used to hold a sleeve cuff together.","example":"Every gentleman needs at least one pair of cufflinks."}],"partOfSpeech":"n"}]},{"word":"QUEUES","idx":21626,"count":1397894,"meanings":[{"definitions":[{"definition":"An animal's tail."},{"definition":"A men's hairstyle whose primary attribute is a braid or ponytail at the back of the head, such as that worn by men in Imperial China."},{"definition":"A line of people, vehicles or other objects, in which one at the front end is dealt with first, the one behind is dealt with next, and so on, and which newcomers join at the opposite end (the back)."},{"definition":"A waiting list or other means of organizing people or objects into a first-come-first-served order."},{"definition":"A data structure in which objects are added to one end, called the tail, and removed from the other, called the head (- a FIFO queue). The term can also refer to a LIFO queue or stack where these ends coincide."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To put oneself or itself at the end of a waiting line."},{"definition":"To arrange themselves into a physical waiting queue."},{"definition":"To add to a queue data structure."},{"definition":"To fasten the hair into a queue."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/kjuːz/"}]},{"word":"RELISTED","idx":21627,"count":1397754,"meanings":[{"definitions":[{"definition":"To list again.","example":"We relisted our house after it failed to sell."}],"partOfSpeech":"ve"}]},{"word":"BEEP","idx":21628,"count":1397739,"meanings":[{"definitions":[{"definition":"The sound produced by the horn of a car, or any similar sound."},{"definition":"A short, electronically produced tone."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sound (something that makes a beep).","example":"The motorists in the traffic jam were getting more and more frustrated and started beeping their horns."},{"definition":"To have sexual intercourse (with) - referring to the bleep tone used to censor obscene words in broadcasts","example":"Jason beeped Sharlene after they had drunk a few beers."},{"definition":"To produce a beep."},{"definition":"To contact (someone via) a pager device."},{"definition":"Telephoning a person, but only allowing the phone to ring once, in order to request a call back.","example":"Susan beeped Jessica, and then Jessica called her back, because Susan didn't have enough credit on her phone to make the call."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"beep-uk","text":"/biːp/"}]},{"word":"CONFLUENCE","idx":21631,"count":1396948,"meanings":[{"definitions":[{"definition":"The place where two rivers, streams, or other continuously flowing bodies of water meet and become one, especially where a tributary joins a river.","example":"We encountered an abandoned boat at the confluence of the Mississippi and Ohio Rivers."},{"definition":"The act of combining which occurs at the place where rivers and the lake meet.","example":"The confluence of the rivers produced a great rush of water."},{"definition":"A convergence or combination of forces, people, or things.","example":"The confluence of our skills resulted in a successful home renovation project."},{"definition":"The proportion of cells, in a culture medium, that adhere to each other"},{"definition":"In rewriting systems, property describing which terms can be rewritten with other, equivalent terms."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkɒnfluəns/"}]},{"word":"STAFFED","idx":21632,"count":1396548,"meanings":[{"definitions":[{"definition":"To supply (a business, volunteer organization, etc.) with employees or staff members."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Occupied by staff, having members of staff."}],"partOfSpeech":"j"}]},{"word":"BLOSSOMS","idx":21633,"count":1396310,"meanings":[{"definitions":[{"definition":"A flower, especially one indicating that a fruit tree is fruiting; a mass of such flowers.","example":"The blossom has come early this year."},{"definition":"The state or season of producing such flowers.","example":"The orchard is in blossom."},{"definition":"A blooming period or stage of development; something lovely that gives rich promise."},{"definition":"The colour of a horse that has white hairs intermixed with sorrel and bay hairs."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have, or open into, blossoms; to bloom."},{"definition":"To begin to thrive or flourish."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"blossoms-us","text":"/ˈblɑ.səms/"}]},{"word":"SUCCEEDS","idx":21634,"count":1396163,"meanings":[{"definitions":[{"definition":"To follow in order; to come next after; hence, to take the place of.","example":"Autumn succeeds summer."},{"definition":"To obtain the object desired; to accomplish what is attempted or intended; to have a prosperous issue or termination; to be successful.","example":"The persecution of any righteous practice has never succeeded in the face of history; in fact, it can expedite the collapse of the persecutory regime."},{"definition":"To fall heir to; to inherit.","example":"So, if the issue of the elder son succeed before the younger, I am king."},{"definition":"To come after; to be subsequent or consequent to; to follow; to pursue."},{"definition":"To support; to prosper; to promote."},{"definition":"To come in the place of another person, thing, or event; to come next in the usual, natural, or prescribed course of things; to follow; hence, to come next in the possession of anything; -- often with to."},{"definition":"To descend, as an estate or an heirloom, in the same family; to devolve."},{"definition":"To go under cover."}],"partOfSpeech":"ve"}]},{"word":"ORPHANS","idx":21635,"count":1396159,"meanings":[{"definitions":[{"definition":"A person, especially a minor, both or (rarely) one of whose parents have died."},{"definition":"A person, especially a minor, whose parents have permanently abandoned them."},{"definition":"A young animal with no mother."},{"definition":"Anything that is unsupported, as by its source, provider or caretaker, by reason of the supporter's demise or decision to abandon."},{"definition":"A single line of type, beginning a paragraph, at the bottom of a column or page."},{"definition":"Any unreferenced object."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To deprive of parents (used almost exclusively in the passive)","example":"What do you do when you come across two orphaned polar bear cubs?"},{"definition":"To make unavailable, as by removing the last remaining pointer or reference to.","example":"Removing categories orphans pages from the main category tree."}],"partOfSpeech":"ve"}]},{"word":"LOUDER","idx":21636,"count":1396143,"meanings":[{"definitions":[{"definition":"(of a sound) Of great intensity.","example":"Turn that music down; it's too loud."},{"definition":"(of a person, thing, event, etc.) Noisy.","example":"a loud party that went on all night"},{"definition":"(of a person, event, etc.) Not subtle or reserved, brash."},{"definition":"(of clothing, decorations, etc.) Having unpleasantly and tastelessly contrasting colours or patterns; gaudy.","example":"a loud style of dress;  loud colors"},{"definition":"(of marijuana) High-quality; premium; (by extension) having a strong or pungent odour indicating good quality"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"louder-us","text":"/ˈlaʊdɚ/"}]},{"word":"GRILLING","idx":21638,"count":1395994,"meanings":[{"definitions":[{"definition":"To cook (food) on a grill; to barbecue.","example":"Why don't we get together Saturday and grill some burgers?"},{"definition":"To cook food under the element of a stove or only under the top element of an oven – broil, salamander."},{"definition":"To interrogate; to question aggressively or harshly.","example":"The police grilled him about his movements at the time of the crime."},{"definition":"To feel very hot; to swelter."},{"definition":"To stamp or mark with a grill."},{"definition":"To make angry; provoke; incite."},{"definition":"To terrify; make tremble."},{"definition":"To tremble; shiver."},{"definition":"To snarl; snap."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A thorough interrogation."},{"definition":"The act or process of grilling, or broiling."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɡɹɪlɪŋ/"}]},{"word":"BOILERS","idx":21640,"count":1395953,"meanings":[{"definitions":[{"definition":"A person who boils something."},{"definition":"A steam boiler."},{"definition":"An apparatus for heating circulating water or other heat transferring liquid."},{"definition":"A device consisting of a heat source and a tank for storing hot water, typically for space heating, domestic hot water etc., disregarding the source of heat."},{"definition":"A kitchen vessel for steaming, boiling or heating food."},{"definition":"A sunken reef, especially a coral reef, on which the sea breaks heavily."},{"definition":"A tough old chicken only suitable for cooking by boiling."}],"partOfSpeech":"n"}]},{"word":"BPS","idx":21642,"count":1395862,"meanings":[{"definitions":[{"definition":"One hundredth of one percentage point."},{"definition":"Initialism of bits per second, a measure of speed of digital communication."},{"definition":"Baud rate"}],"partOfSpeech":"n"}]},{"word":"REUNIONS","idx":21643,"count":1395828,"meanings":[{"definitions":[{"definition":"The process or act of reuniting.","example":"It was a tearful and heartfelt reunion as the trapped miners finally saw their dear loved ones again."},{"definition":"A planned event at which members of a dispersed group meet together.","example":"Are you going to the reunion this year?"}],"partOfSpeech":"n"}]},{"word":"CAMO","idx":21644,"count":1395772,"meanings":[{"definitions":[{"definition":"A pattern on clothing consisting of irregularly shaped patches that are either greenish/brownish, brownish/whitish, or bluish/whitish, as used by ground combat forces."},{"definition":"Clothes made from camouflage fabric, for concealment in combat or hunting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To camouflage."},{"definition":"To put on camouflage clothing."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkæ.moʊ/"}]},{"word":"TOMS","idx":21646,"count":1395597,"meanings":[{"definitions":[{"definition":"A flat gong (without knob) that is struck with a felt-covered hammer."},{"definition":"The male of the domesticated cat."},{"definition":"The male of the turkey."},{"definition":"The male of the orangutan."},{"definition":"The male of certain other animals."},{"definition":"Prostitutes"},{"definition":"A lesbian."},{"definition":"The jack of trumps in the card game gleek."},{"definition":"A close-stool."},{"definition":"A tomato (the fruit).","example":"Toms 90p a pound"},{"definition":"A small joined pair of drums, beaten with the hands."},{"definition":"(usually as a pair) Any cylindrical drum, with no snare; part of a drum kit."}],"partOfSpeech":"n"}]},{"word":"YELLING","idx":21647,"count":1395556,"meanings":[{"definitions":[{"definition":"Shout; holler; make a loud sound with the voice."},{"definition":"To convey by shouting","example":"He yelled directions to the party from the car."},{"definition":"To tell someone off (in a loud and angry manner)","example":"If I come home late again, my dad is gonna yell at me."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of producing a yell."}],"partOfSpeech":"n"}]},{"word":"HOMESCHOOL","idx":21648,"count":1395527,"meanings":[{"definitions":[{"definition":"A school within a private domestic place, rather than in a public facility or private institution."},{"definition":"A boarding school."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To educate children at home, that is, at a private domestic place, in lieu of sending them to a public school or private educational institution.","example":"I chose to home school my children."},{"definition":"To be educated at home.","example":"I only started regular school when I was ten; before that I home schooled."}],"partOfSpeech":"ve"}]},{"word":"WINDSURFING","idx":21651,"count":1395104,"meanings":[{"definitions":[{"definition":"To ride a surfboard that has an attached sail"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A marine sport in which one stands on a floating board (typically 2 - 3 meters in length) to which a sail is attached. The board is steered by tilting the sail or banking the board. Some windsurfers use large waves to perform jumps and other stunts."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"windsurfing-us"}]},{"word":"TROUGH","idx":21652,"count":1395096,"meanings":[{"definitions":[{"definition":"A long, narrow container, open on top, for feeding or watering animals.","example":"One of Hank's chores was to slop the pigs' trough each morning and evening."},{"definition":"Any similarly shaped container."},{"definition":"A short, narrow canal designed to hold water until it drains or evaporates.","example":"There was a small trough that the sump pump emptied into; it was filled with mosquito larvae."},{"definition":"A gutter under the eaves of a building; an eaves trough.","example":"The troughs were filled with leaves and needed clearing."},{"definition":"A channel for conveying water or other farm liquids (such as milk) from place to place by gravity; any ‘U’ or ‘V’ cross-sectioned irrigation channel."},{"definition":"A long, narrow depression between waves or ridges; the low portion of a wave cycle.","example":"The buoy bobbed between the crests and troughs of the waves moving across the bay."},{"definition":"A linear atmospheric depression associated with a weather front."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To eat in a vulgar style, as if from a trough.","example":"he troughed his way through three meat pies."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɹɔf/"},{"text":"/tɹɒf/"},{"text":"/tɹɑf/"}]},{"word":"LEANED","idx":21653,"count":1394618,"meanings":[{"definitions":[{"definition":"To incline, deviate, or bend, from a vertical position; to be in a position thus inclining or deviating.","example":"She leaned out of the window."},{"definition":"To incline in opinion or desire; to conform in conduct; often with to, toward, etc.","example":"I’m leaning towards voting Conservative in the next election.  The Hispanic vote leans Democratic."},{"definition":"Followed by against, on, or upon: to rest or rely, for support, comfort, etc."},{"definition":"To hang outwards."},{"definition":"To press against."},{"definition":"To thin out (a fuel-air mixture): to reduce the fuel flow into the mixture so that there is more air or oxygen."},{"definition":"To conceal."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"leaned-us","text":"/liːnd/"}]},{"word":"QUADRANT","idx":21654,"count":1394521,"meanings":[{"definitions":[{"definition":"One of the four sections made by dividing an area with two perpendicular lines."},{"definition":"One of the four regions of the Cartesian plane bounded by the x-axis and y-axis."},{"definition":"One fourth of a circle or disc; a sector with an angle of 90°."},{"definition":"A measuring device with a graduated arc of 90° used in locating an altitude."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkwɑd.ɹənt/"}]},{"word":"DISCREPANCY","idx":21655,"count":1394502,"meanings":[{"definitions":[{"definition":"An inconsistency between facts or sentiments.","example":"They found a discrepancy between the first set of test results and the second, and they're still trying to figure out why."},{"definition":"The state or quality of being discrepant."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"discrepancy-us","text":"/dɪsˈkɹɛpənsi/"},{"audio":"discrepancy-au","text":"/dɪsˈkɹɛpənsi/"}]},{"word":"SLID","idx":21656,"count":1394401,"meanings":[{"definitions":[{"definition":"To (cause to) move in continuous contact with a surface","example":"He slid the boat across the grass."},{"definition":"To move on a low-friction surface.","example":"The car slid on the ice."},{"definition":"To drop down and skid into a base.","example":"Jones slid into second."},{"definition":"To lose one’s balance on a slippery surface.","example":"He slid while going around the corner."},{"definition":"To pass or put imperceptibly; to slip.","example":"to slide in a word to vary the sense of a question"},{"definition":"To pass inadvertently."},{"definition":"To pass along smoothly or unobservedly; to move gently onward without friction or hindrance.","example":"A ship or boat slides through the water."},{"definition":"To pass from one note to another with no perceptible cessation of sound."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"slid-us","text":"/ˈslɪd/"}]},{"word":"RELOCATED","idx":21658,"count":1394184,"meanings":[{"definitions":[{"definition":"To move (something) from one place to another.","example":"We had to relocate the magazine rack because we bruised our shins on it too frequently when it was near the door."},{"definition":"To change one's domicile or place of business.","example":"Alfred relocated to Colorado Springs to take advantage of the boom in the defense industry."}],"partOfSpeech":"ve"}]},{"word":"UNTREATED","idx":21660,"count":1394151,"meanings":[{"definitions":[{"definition":"Not treated."}],"partOfSpeech":"j"}]},{"word":"DIVISIONAL","idx":21663,"count":1393818,"meanings":[{"definitions":[{"definition":"A playoff determining the winning team from a particular division."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to a division."},{"definition":"Of or pertaining to the process of division."}],"partOfSpeech":"j"}]},{"word":"CHIHUAHUA","idx":21664,"count":1393574,"meanings":[{"definitions":[{"definition":"The smallest breed of dog in the world, originating in Mexico and having large erect ears."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tʃɪˈwɑːwɑː/"},{"text":"/tʃɪ.waʊ(w).ə/"}]},{"word":"TONIC","idx":21666,"count":1393402,"meanings":[{"definitions":[{"definition":"A substance with medicinal properties intended to restore or invigorate.","example":"We used to brew a tonic from a particular kind of root."},{"definition":"Tonic water."},{"definition":"(Massachusetts) Any of various carbonated, non-alcoholic beverages; soda pop."},{"definition":"Someone or something that revitalises or reinvigorates."},{"definition":"The first note of a diatonic scale; the keynote."},{"definition":"The triad built on the tonic note."},{"definition":"A tonic element or letter; a vowel or a diphthong."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Pertaining to tension, especially of muscles."},{"definition":"Restorative, curative or invigorating.","example":"The arrival of the new members had a tonic effect on the team."},{"definition":"Pertaining to or based upon the first note of a diatonic scale."},{"definition":"Pertaining to the accent or stress in a word or in speech."},{"definition":"Of or relating to tones or sounds; specifically being or relating to a speech sound made with tone unmixed and undimmed by obstruction, i.e. a vowel or diphthong."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈtɒnɪk/"}]},{"word":"RESELL","idx":21667,"count":1393254,"meanings":[{"definitions":[{"definition":"To sell again."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹiːˈsɛl/"}]},{"word":"BURNOUT","idx":21672,"count":1392731,"meanings":[{"definitions":[{"definition":"The experience of long-term exhaustion and diminished interest, especially in one's career."},{"definition":"A marijuana addict; one whose brains have been burned out."},{"definition":"The shutoff of a rocket motor following the complete exhaustion of its fuel supply, or having been irreversibly throttled after the application of a planned delta-v."},{"definition":"The failure of an electrical device, usually through overheating due to the application of excessive power."},{"definition":"Using the throttle to spin the wheels of a vehicle being held stationary, causing the spinning tires to produce smoke and burn rubber."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"burnout-au"}]},{"word":"DESIGNATIONS","idx":21674,"count":1392625,"meanings":[{"definitions":[{"definition":"The act of designating; a pointing out or showing; indication."},{"definition":"Selection and appointment for a purpose or office; allotment; direction.","example":"His designation as chief justice was controversial."},{"definition":"That which designates; a distinguishing mark or name; distinctive title; appellation."},{"definition":"Use or application; import; intention; signification, as of a word or phrase."}],"partOfSpeech":"n"}]},{"word":"HARROW","idx":21675,"count":1392535,"meanings":[{"definitions":[{"definition":"A device consisting of a heavy framework having several disks or teeth in a row, which is dragged across ploughed land to smooth or break up the soil, to remove weeds or cover seeds; a harrow plow."},{"definition":"An obstacle formed by turning an ordinary harrow upside down, the frame being buried."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To drag a harrow over; to break up with a harrow."},{"definition":"To traumatize or disturb; to frighten or torment."},{"definition":"To break or tear, as if with a harrow; to wound; to lacerate; to torment or distress; to vex."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A call for help, or of distress, alarm etc."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"harrow-us","text":"/ˈhæɹoʊ/"}]},{"word":"JIG","idx":21676,"count":1392504,"meanings":[{"definitions":[{"definition":"A light, brisk musical movement; a gigue."},{"definition":"A lively dance in 6/8 (double jig), 9/8 (slip jig) or 12/8 (single jig) time; a tune suitable for such a dance. By extension, a lively traditional tune in any of these time signatures. Unqualified, the term is usually taken to refer to a double (6/8) jig.","example":"They danced a jig."},{"definition":"(traditional English Morris dancing) A dance performed by one or sometimes two individual dancers, as opposed to a dance performed by a set or team."},{"definition":"A type of lure consisting of a hook molded into a weight, usually with a bright or colorful body."},{"definition":"A device in manufacturing, woodworking, or other creative endeavors for controlling the location, path of movement, or both of either a workpiece or the tool that is operating upon it. Subsets of this general class include machining jigs, woodworking jigs, welders' jigs, jewelers' jigs, and many others.","example":"Cutting circles out of pinewood is best done with a compass-style jig."},{"definition":"An apparatus or machine for jigging ore."},{"definition":"A light, humorous piece of writing, especially in rhyme; a farce in verse; a ballad."},{"definition":"A trick; a prank."},{"definition":"A black person."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move briskly, especially as a dance.","example":"The guests were jigging around on the dance floor."},{"definition":"To move with a skip or rhythm; to move with vibrations or jerks."},{"definition":"To fish with a jig."},{"definition":"To sing to the tune of a jig."},{"definition":"To trick or cheat; to cajole; to delude."},{"definition":"To sort or separate, as ore in a jigger or sieve."},{"definition":"To cut or form, as a piece of metal, in a jigging machine."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"jig-au","text":"/d͡ʒɪɡ/"}]},{"word":"RECKLESS","idx":21678,"count":1392393,"meanings":[{"definitions":[{"definition":"Careless or heedless; headstrong or rash."},{"definition":"Indifferent to danger or the consequences."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹɛkləs/"}]},{"word":"MICROWAVES","idx":21679,"count":1392298,"meanings":[{"definitions":[{"definition":"An electromagnetic wave with wavelength between that of infrared light and radio waves."},{"definition":"An oven that uses microwave energy to heat food or other items placed within it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cook (something) in a microwave oven."}],"partOfSpeech":"ve"}]},{"word":"RAINING","idx":21680,"count":1392293,"meanings":[{"definitions":[{"definition":"To have rain fall from the sky.","example":"It will rain today."},{"definition":"To fall as or like rain.","example":"Bombs rained from the sky."},{"definition":"To issue (something) in large quantities.","example":"The boxer rained punches on his opponent's head."},{"definition":"To reign."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A fall of rain."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɹeɪnɪŋ/"}]},{"word":"PEASANT","idx":21681,"count":1392268,"meanings":[{"definitions":[{"definition":"A member of the lowly social class that toils on the land, constituted by small farmers and tenants, sharecroppers, farmhands and other laborers on the land where they form the main labor force in agriculture and horticulture."},{"definition":"A country person."},{"definition":"An uncouth, crude or ill-bred person."},{"definition":"(strategy games) A worker unit."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"peasant-us","text":"/ˈpɛzənt/"}]},{"word":"COLISEUM","idx":21683,"count":1392116,"meanings":[{"definitions":[{"definition":"A large theatre, cinema, or stadium.","example":"the London Coliseum"},{"definition":"A large, often circular building, for indoor sporting events, exhibitions, concerts, etc.; arena."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kɒl.əˈsiː.əm/"},{"text":"/ˌkɑləˈsi.əm/"}]},{"word":"EPHEDRA","idx":21684,"count":1392069,"meanings":[{"definitions":[{"definition":"Any plant of the genus Ephedra of gymnosperm shrubs."},{"definition":"A stimulant derived from the plant Ephedra sinica used in traditional Chinese herbal medicine and in over-the-counter weight-loss aids."}],"partOfSpeech":"n"}]},{"word":"QUA","idx":21685,"count":1392046,"meanings":[{"definitions":[{"definition":"As; in the capacity of"}],"partOfSpeech":"pr"}],"phonetics":[{"audio":"qua-1-us","text":"/kwɑː/"}]},{"word":"SPAWNING","idx":21686,"count":1391705,"meanings":[{"definitions":[{"definition":"To produce or deposit (eggs) in water."},{"definition":"To generate, bring into being, especially non-mammalian beings in very large numbers."},{"definition":"To bring forth in general.","example":"The Web server spawns a new process to handle each client's request."},{"definition":"To induce (aquatic organisms) to spawn."},{"definition":"To plant with fungal spawn."},{"definition":"To deposit (numerous) eggs in water."},{"definition":"To reproduce, especially in large numbers."},{"definition":"(of a character or object) (To cause) to appear spontaneously in a game at a certain point and time."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The process by which something spawns."}],"partOfSpeech":"n"}]},{"word":"FIGURING","idx":21688,"count":1391448,"meanings":[{"definitions":[{"definition":"To calculate, to solve a mathematical problem."},{"definition":"To come to understand.","example":"I can’t figure if he’s telling the truth or lying."},{"definition":"To think, to assume, to suppose, to reckon."},{"definition":"To be reasonable.","example":"It figures that somebody like him would be upset about the situation."},{"definition":"To enter into; to be a part of."},{"definition":"To represent by a figure, as to form or mould; to make an image of, either palpable or ideal; also, to fashion into a determinate form; to shape."},{"definition":"To embellish with design; to adorn with figures."},{"definition":"To indicate by numerals."},{"definition":"To represent by a metaphor; to signify or symbolize."},{"definition":"To prefigure; to foreshow."},{"definition":"To write over or under the bass, as figures or other characters, in order to indicate the accompanying chords."},{"definition":"To embellish."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Calculation."},{"definition":"Structure, design, or arrangement; figure."},{"definition":"Representation."}],"partOfSpeech":"n"}]},{"word":"CITRATE","idx":21689,"count":1391411,"meanings":[{"definitions":[{"definition":"Any salt or ester of citric acid."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cause to form citrate."}],"partOfSpeech":"ve"}]},{"word":"CRUSHING","idx":21691,"count":1391123,"meanings":[{"definitions":[{"definition":"To press between two hard objects; to squeeze so as to alter the natural shape or integrity of it, or to force together into a mass.","example":"to crush grapes"},{"definition":"To reduce to fine particles by pounding or grinding","example":"to crush quartz"},{"definition":"To overwhelm by pressure or weight.","example":"After the corruption scandal, the opposition crushed the ruling party in the elections"},{"definition":"To oppress or grievously burden."},{"definition":"To overcome completely; to subdue totally.","example":"The sultan's black guard crushed every resistance bloodily."},{"definition":"To be or become broken down or in, or pressed into a smaller compass, by external weight or force","example":"an eggshell crushes easily"},{"definition":"To feel infatuation or unrequited love.","example":"She's crushing on him."},{"definition":"To give a compressed or foreshortened appearance to."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The action of the verb to crush."},{"definition":"A former method of execution by placing heavy weights on the victim."},{"definition":"(in the plural) crushed material","example":"oilseed crushings"}],"partOfSpeech":"n"},{"definitions":[{"definition":"That crushes; overwhelming.","example":"a crushing defeat"},{"definition":"Devastatingly disheartening.","example":"Oh, your dog has leukemia? That’s crushing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹʌʃɪŋ/"}]},{"word":"SNOWMAN","idx":21692,"count":1391103,"meanings":[{"definitions":[{"definition":"A humanoid figure made with large snowballs stacked on each other. Human traits like a face and arms may be fashioned with sticks (arms), a carrot (nose), and stones or coal (eyes, mouth)."},{"definition":"A score of eight, especially within one inning (in baseball) or on one hole (in golf, where it is also known as dogballs)."},{"definition":"A playing card with the rank of eight."},{"definition":"An attractive but heartless man (similar to ice queen)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"snowman-us","text":"/ˈsnoʊ.mæn/"}]},{"word":"THORPE","idx":21693,"count":1390854,"meanings":[{"definitions":[{"definition":"(now chiefly in placenames) A group of houses standing together in the country; a hamlet; a village."}],"partOfSpeech":"n"}]},{"word":"ORDAINED","idx":21694,"count":1390770,"meanings":[{"definitions":[{"definition":"To prearrange unalterably."},{"definition":"To decree."},{"definition":"To admit into the ministry of a religion, for example as a priest, bishop, minister or Buddhist monk, or to authorize as a rabbi."},{"definition":"To predestine."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Established by authority."},{"definition":"Admitted to the ministry of the church.","example":"There was much pomp at the ceremony that made him an ordained minister."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɔɹˈdeɪnd/"},{"text":"/ɔːˈdeɪnd/"}]},{"word":"SAUCER","idx":21697,"count":1390639,"meanings":[{"definitions":[{"definition":"A small shallow dish to hold a cup and catch drips."},{"definition":"An object round and gently curved (shaped like a saucer).","example":"The saucer-shaped object could have been a UFO."},{"definition":"A small pan or vessel in which sauce was set on a table."},{"definition":"A flat, shallow caisson for raising sunken ships."},{"definition":"A shallow socket for the pivot of a capstan."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To pour (tea, etc.) from the cup into the saucer in order to cool it before drinking."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsɒ.səɹ/"},{"text":"/ˈsɔː.sə/"}]},{"word":"CHINOOK","idx":21698,"count":1390622,"meanings":[{"definitions":[{"definition":"The descending, warm, dry wind on the eastern side of the Rocky Mountains that generally blows from the southwest and can rapidly increase the temperature due to the much warmer air it brings."},{"definition":"The chinook salmon (Oncorhynchus tshawytscha)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tʃɪˈnuːk/"}]},{"word":"POTTY","idx":21699,"count":1390617,"meanings":[{"definitions":[{"definition":"To go and use the potty: to leave in order to urinate or defecate.","example":"I have to go potty!"},{"definition":"To go crazy: to become insane."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(diminutive) A chamber pot, particularly (children) the pot used when toilet-training children."},{"definition":"(diminutive) Any other device or place for urination or defecation: a toilet; a lavatory; a latrine; an outhouse."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Insane.","example":"The noise that the neighbour's kids were making was driving Fred potty."},{"definition":"Easy to pot the ball on."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpɒti/"}]},{"word":"SHOOTERS","idx":21701,"count":1390360,"meanings":[{"definitions":[{"definition":"Someone who shoots something; a gunner, archer etc."},{"definition":"A firearm."},{"definition":"A video game in which shooting enemies (or targets) is the main objective."},{"definition":"A professional wrestler who uses actual fighting moves as part of his style, or who speaks his mind during a live or televised event (instead of speaking from a script)."},{"definition":"A large marble used for knocking smaller marbles out of a chalk circle."},{"definition":"An alcoholic beverage typically served in a shot glass."},{"definition":"A shooting star."},{"definition":"A device supposed to accumulate orgone."}],"partOfSpeech":"n"}]},{"word":"BACILLUS","idx":21704,"count":1389914,"meanings":[{"definitions":[{"definition":"Any of various rod-shaped, spore-forming aerobic bacteria in the genus Bacillus, some of which cause disease."},{"definition":"Any bacilliform (rod-shaped) bacterium."},{"definition":"(by extension) Something which spreads like bacterial infection."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/bæˈsɪl.əs/"}]},{"word":"BYZANTINE","idx":21706,"count":1389126,"meanings":[{"definitions":[{"definition":"Of or pertaining to Byzantium."},{"definition":"(history) Belonging to the civilization of the Eastern Roman empire between 331, when its capital was moved to Constantinople, and 1453, when that capital was conquered by the Turks and ultimately renamed Istanbul."},{"definition":"Of a style of architecture prevalent in the Eastern Empire down to 1453, marked by the round arch springing from columns or piers, the dome supported upon pendentives, capitals elaborately sculptured, mosaic or other encrustations, etc."},{"definition":"Overly complex or intricate.","example":"a Byzantine system of regulations"},{"definition":"Of a devious, usually stealthy, manner or practice."},{"definition":"Of or relating to the Byzantine Rite or any of the many Eastern Orthodox churches and Greek Catholic churches that use this rite for their liturgical celebrations"}],"partOfSpeech":"j"},{"definitions":[{"definition":"A byzant (coin)."}],"partOfSpeech":"n"}]},{"word":"TRIANGLES","idx":21708,"count":1388860,"meanings":[{"definitions":[{"definition":"A polygon with three sides and three angles."},{"definition":"A set square."},{"definition":"A percussion instrument made by forming a metal rod into a triangular shape which is open at one angle. It is suspended from a string and hit with a metal bar to make a resonant sound."},{"definition":"(cue sports) A triangular piece of equipment used for gathering the balls into the formation required by the game being played."},{"definition":"A love triangle."},{"definition":"(systemics) The structure of systems composed with three interrelated objects."},{"definition":"A draughtsman's square in the form of a right-angled triangle."},{"definition":"A frame formed of three poles stuck in the ground and united at the top, to which people were bound when undergoing corporal punishment."},{"definition":"Any of various large papilionid butterflies of the genus Graphium."},{"definition":"A triangular formation of railway tracks, with a curve on at least one side."}],"partOfSpeech":"n"}]},{"word":"SPOOKY","idx":21710,"count":1388735,"meanings":[{"definitions":[{"definition":"Eerie, or suggestive of ghosts or the supernatural."},{"definition":"Spooked; afraid; frightened."},{"definition":"Unpredictably excitable; skittish (used especially of horses)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/spuːki/"}]},{"word":"CURVATURE","idx":21711,"count":1388596,"meanings":[{"definitions":[{"definition":"The shape of something curved."},{"definition":"The extent to which a subspace is curved within a metric space."},{"definition":"The extent to which a Riemannian manifold is intrinsically curved."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"curvature-us","text":"/ˈkɝ.və.tʃɚ/"}]},{"word":"RITES","idx":21712,"count":1388265,"meanings":[{"definitions":[{"definition":"That which complies with justice, law or reason.","example":"We're on the side of right in this contest."},{"definition":"A legal, just or moral entitlement.","example":"You have no right to go through my personal diary."},{"definition":"The right side or direction.","example":"The pharmacy is just on the right past the bookshop."},{"definition":"The right hand or fist."},{"definition":"The ensemble of right-wing political parties; political conservatives as a group.","example":"The political right holds too much power."},{"definition":"The outward or most finished surface, as of a coin, piece of cloth, a carpet, etc."},{"definition":"A wave breaking from right to left (viewed from the shore)."},{"definition":"A religious custom."},{"definition":"(by extension) A prescribed behavior."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"rites-us","text":"/ɹaɪts/"}]},{"word":"SIDEWAYS","idx":21713,"count":1387766,"meanings":[{"definitions":[{"definition":"A footpath near a road."},{"definition":"A byway."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Moving or directed toward one side.","example":"He gave the ball a sideways kick."},{"definition":"Positioned sideways (with a side to the front).","example":"There was a stack of papers in front of each seat at the table, but each stack was sideways."},{"definition":"Neither moving upward nor moving downward.","example":"Once we get out of this sideways economy, our figures will more accurately reflect what we're truly capable of."},{"definition":"Not as planned; towards a worse outcome.","example":"We realized the project could go sideways very quickly if we didn't get the sales and marketing people on our side."},{"definition":"(usually with \"with\") In conflict (with); not compatible (with).","example":"He was constantly getting sideways with his boss till he got fired."}],"partOfSpeech":"j"},{"definitions":[{"definition":"With a side to the front.","example":"He builds houses sideways, with the front door on the side."},{"definition":"Towards one side.","example":"A bishop moves only diagonally; a rook, only sideways, forward, and back.  He looked sideways at the new arrival, wondering who she was."},{"definition":"Askance; sidelong."},{"definition":"Neither upward nor downward.","example":"The economy has been moving sideways for several months now."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈsaɪdweɪz/"}]},{"word":"DEVIOUS","idx":21714,"count":1387678,"meanings":[{"definitions":[{"definition":"Cunning or deceiving, not straightforward or honest, not frank"},{"definition":"Roundabout, circuitous, deviating from the direct or ordinary route"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈdiːvi.əs/"}]},{"word":"DREAMER","idx":21717,"count":1387422,"meanings":[{"definitions":[{"definition":"One who dreams."},{"definition":"Someone whose beliefs are far from realistic."},{"definition":"Any anglerfish of the family Oneirodidae."},{"definition":"Swallow-wing puffbird (Chelidoptera tenebrosa)"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɹimɚ/"},{"text":"/ˈdɹiːmə/"}]},{"word":"ACKNOWLEDGING","idx":21718,"count":1387381,"meanings":[{"definitions":[{"definition":"To admit the knowledge of; to recognize as a fact or truth; to declare one's belief in","example":"to acknowledge the being of a god"},{"definition":"To own or recognize in a particular quality, character or relationship; to admit the claims or authority of; to give recognition to."},{"definition":"To be grateful of (e.g. a benefit or a favour)","example":"to acknowledge a favor"},{"definition":"To report (the receipt of a message to its sender).","example":"This is to acknowledge your kind invitation to participate in the upcoming debate."},{"definition":"To own as genuine or valid; to assent to (a legal instrument) to give it validity; to avow or admit in legal form."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of acknowledging something."}],"partOfSpeech":"n"},{"definitions":[{"definition":"That acknowledges, in various sense; (especially) that notices or recognises someone or something."},{"definition":"(specifically) Expressing esteem or gratitude."}],"partOfSpeech":"j"}]},{"word":"ESTUARY","idx":21719,"count":1387115,"meanings":[{"definitions":[{"definition":"Coastal water body where ocean tides and river water merge, resulting in a brackish water zone."},{"definition":"An ocean inlet also fed by fresh river water."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɛstjʊəɹi/"}]},{"word":"BURGLARY","idx":21720,"count":1386802,"meanings":[{"definitions":[{"definition":"The crime of unlawfully breaking into a vehicle, house, store, or other enclosure with the intent to steal."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɜː(ɹ)ɡləɹi/"}]},{"word":"POUCHES","idx":21723,"count":1386474,"meanings":[{"definitions":[{"definition":"A small bag usually closed with a drawstring."},{"definition":"A pocket in which a marsupial carries its young."},{"definition":"Any pocket or bag-shaped object, such as a cheek pouch."},{"definition":"A protuberant belly; a paunch."},{"definition":"A cyst or sac containing fluid."},{"definition":"A silicle, or short pod, as of the shepherd's purse."},{"definition":"A bulkhead in the hold of a vessel, to prevent grain etc. from shifting."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To enclose within a pouch.","example":"The beggar pouched the coin."},{"definition":"To transport within a pouch, especially a diplomatic pouch.","example":"We pouched the encryption device to our embassy in Beijing."},{"definition":"(of fowls and fish) To swallow."},{"definition":"To pout."},{"definition":"To pocket; to put up with."}],"partOfSpeech":"ve"}]},{"word":"SUBPOENA","idx":21726,"count":1386235,"meanings":[{"definitions":[{"definition":"A writ requiring a defendant to appear in court to answer a plaintiff's claim."},{"definition":"A writ requiring someone to appear in court to give testimony."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To summon with a subpoena."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"subpoena-us","text":"/səˈpiːnə/"}]},{"word":"THRILLING","idx":21727,"count":1386231,"meanings":[{"definitions":[{"definition":"To suddenly excite someone, or to give someone great pleasure; to (figuratively) electrify; to experience such a sensation."},{"definition":"To (cause something to) tremble or quiver."},{"definition":"To perforate by a pointed instrument; to bore; to transfix; to drill."},{"definition":"To hurl; to throw; to cast."},{"definition":"To drill and thread in one operation, using a tool bit that cuts the hole and the threads in one series of computer-controlled movements."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A thrill."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Causing a feeling of sudden excitement."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"thrilling-uk","text":"/ˈθɹɪlɪŋ/"}]},{"word":"SPECTACLE","idx":21728,"count":1386188,"meanings":[{"definitions":[{"definition":"An exciting or extraordinary scene, exhibition, performance etc.","example":"The horse race was a thrilling spectacle."},{"definition":"An embarrassing or unedifying scene or situation.","example":"He made a spectacle out of himself."},{"definition":"(usually in the plural) An optical instrument consisting of two lenses set in a light frame, and worn to assist sight, to obviate some defect in the organs of vision, or to shield the eyes from bright light."},{"definition":"An aid to the intellectual sight."},{"definition":"A spyglass; a looking-glass."},{"definition":"The brille of a snake."},{"definition":"A frame with different coloured lenses on a semaphore signal through which light from a lamp shines at night, often a part of the signal arm."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"spectacle-uk","text":"/ˈspɛktəkl̩/"}]},{"word":"SENTIMENTS","idx":21730,"count":1386131,"meanings":[{"definitions":[{"definition":"A general thought, feeling, or sense.","example":"The sentiment emerged that we were acting too soon."},{"definition":"Feelings, especially tender feelings, as apart from reason or judgment, or of a weak or foolish kind."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"sentiments-us","text":"/ˈsɛn.tɪ.mənts/"}]},{"word":"INTERPRETIVE","idx":21731,"count":1386070,"meanings":[{"definitions":[{"definition":"Marked by interpretation."}],"partOfSpeech":"j"}]},{"word":"DITTO","idx":21732,"count":1386002,"meanings":[{"definitions":[{"definition":"That which was stated before, the aforesaid, the above, the same, likewise."},{"definition":"A duplicate or copy of a document, particularly one created by a spirit duplicator.","example":"Please run off twenty-four dittos of this assignment, for my students."},{"definition":"A copy; an imitation."},{"definition":"A symbol, represented by two apostrophes, inverted commas, or quotation marks (\" \"), when indicating that the item preceding is to be repeated."},{"definition":"(in the plural) A suit of clothes of the same colour throughout."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To repeat the aforesaid, the earlier action etc."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"As said before, likewise."}],"partOfSpeech":"v"},{"definitions":[{"definition":"Used as an expression of agreement with what another person has said, or to indicate that what they have said equally applies to the person being addressed."}],"partOfSpeech":"i"}],"phonetics":[{"audio":"ditto-us","text":"/ˈdɪtoʊ/"}]},{"word":"BAREBACK","idx":21733,"count":1385982,"meanings":[{"definitions":[{"definition":"A bird, raised for meat, that lacks feathers, seen as an undesirable trait."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To have sex without a condom."},{"definition":"To have, usually male to male, anal sex without a condom."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Without a saddle.","example":"bareback riding"}],"partOfSpeech":"j"},{"definitions":[{"definition":"Without a saddle.","example":"I can ride a horse bareback."},{"definition":"Without a condom.","example":"We had sex bareback."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈbɛəbæk/"},{"audio":"bareback-au"}]},{"word":"NANA","idx":21734,"count":1385908,"meanings":[{"definitions":[{"definition":"A banana"},{"definition":"A fool","example":"You look a right nana dressed up like that."},{"definition":"(term of endearment) one's grandmother"},{"definition":"A nanny"}],"partOfSpeech":"n"}],"phonetics":[{"audio":"nana-1-uk","text":"/ˈnɑːnə/"}]},{"word":"EXTENDER","idx":21735,"count":1385864,"meanings":[{"definitions":[{"definition":"Any of various substances designed to extend any of several properties of a material."},{"definition":"Any of various components designed to extend the length of a device."},{"definition":"Any substance added to food to bulk it out, with a higher protein content than a filler.","example":"Soy protein is used as a meat extender."},{"definition":"A runner, or quick-draw. (from sense #2)"},{"definition":"A phrase that extends an expression to include further members of a set, e.g. \"and stuff\", \"or something\"."}],"partOfSpeech":"n"}]},{"word":"WAITER","idx":21736,"count":1385770,"meanings":[{"definitions":[{"definition":"A male or female attendant who serves customers at their tables in a restaurant, café or similar.","example":"Waiter! There's a fly in my soup."},{"definition":"Someone who waits for somebody or something; a person who is waiting."},{"definition":"A person working as an attendant at the London Stock Exchange."},{"definition":"A vessel or tray on which something is carried, as dishes, etc.; a salver. (See etymology of dumbwaiter.)"},{"definition":"A custom house officer; a tide waiter."},{"definition":"A watchman."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"waiter-us","text":"/ˈweɪtɚ/"}]},{"word":"GLUCOSAMINE","idx":21737,"count":1385726,"meanings":[{"definitions":[{"definition":"An amino derivative of glucose that is a component of polysaccharides such as chitin; it is marketed as a dietary supplement supposedly to reduce the symptoms of arthritis."}],"partOfSpeech":"n"}]},{"word":"ODDLY","idx":21739,"count":1385252,"meanings":[{"definitions":[{"definition":"In a peculiar manner; strangely; unusually.","example":"For December, it was oddly warm."},{"definition":"In a manner measured by an odd number."}],"partOfSpeech":"v"}]},{"word":"TYPHOON","idx":21742,"count":1384872,"meanings":[{"definitions":[{"definition":"A weather phenomenon in the northwestern Pacific that is precisely equivalent to a hurricane, which results in wind speeds of 64 knots (118 km/h) or above. Equivalent to a cyclone in the Indian Ocean and Indonesia/Australia."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To swirl like a hurricane."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"typhoon-us","text":"/taɪˈfun/"}]},{"word":"REFERRER","idx":21744,"count":1384649,"meanings":[{"definitions":[{"definition":"A person who refers another."},{"definition":"The URL from which a user agent was referred to another URL."}],"partOfSpeech":"n"}]},{"word":"RAFT","idx":21747,"count":1384375,"meanings":[{"definitions":[{"definition":"A flat-bottomed craft able to float and drift on water, used for transport or as a waterborne platform.","example":"An inflatable raft. A log raft."},{"definition":"(by extension) Any flattish thing, usually wooden, used in a similar fashion."},{"definition":"A thick crowd of seabirds or sea mammals, particularly a group of penguins when in the water."},{"definition":"A collection of logs, fallen trees, etc. which obstructs navigation in a river."},{"definition":"(when ordering food) A slice of toast."},{"definition":"A square array of sensors forming part of a large telescope."},{"definition":"A large (but unspecified) number, a lot."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To convey on a raft."},{"definition":"To make into a raft."},{"definition":"To travel by raft."},{"definition":"To dock (toolbars, etc.) so that they share horizontal or vertical space."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"raft-us","text":"/ɹæft/"}]},{"word":"NUTSHELL","idx":21749,"count":1384131,"meanings":[{"definitions":[{"definition":"The shell that surrounds the kernel of a nut."},{"definition":"A short book summarizing an area of law."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To summarize (from the term in a nutshell)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈnʌtʃel/"}]},{"word":"ARROGANT","idx":21750,"count":1384122,"meanings":[{"definitions":[{"definition":"Having excessive pride in oneself, often with contempt or disrespect for others."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"arrogant-us","text":"/ˈæɹəɡənt/"}]},{"word":"SUPERHERO","idx":21753,"count":1383752,"meanings":[{"definitions":[{"definition":"Any kind of fantasy/science fiction crime-fighting character, often with supernatural powers or equipment, in popular children's and fantasy literature."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/s(j)upə(ɹ)hɪɹoʊ/"}]},{"word":"INDUCES","idx":21754,"count":1383718,"meanings":[{"definitions":[{"definition":"To lead by persuasion or influence; incite or prevail upon."},{"definition":"To cause, bring about, lead to.","example":"His meditation induced a compromise.   Opium induces sleep."},{"definition":"To cause or produce (electric current or a magnetic state) by a physical process of induction."},{"definition":"To infer by induction."},{"definition":"To lead in, bring in, introduce."},{"definition":"To draw on, place upon."}],"partOfSpeech":"ve"}]},{"word":"TOOLING","idx":21755,"count":1383684,"meanings":[{"definitions":[{"definition":"To work on or shape with tools, e.g., hand-tooled leather."},{"definition":"To equip with tools."},{"definition":"To work very hard."},{"definition":"To put down another person (possibly in a subtle, hidden way), and in that way to use him or her to meet a goal.","example":"Dude, he's not your friend. He's just tooling you."},{"definition":"To intentionally attack the ball so that it deflects off a blocker out of bounds."},{"definition":"To drive (a coach or other vehicle)."},{"definition":"To carry or convey in a coach or other vehicle."},{"definition":"To travel in a vehicle; to ride or drive."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Work or ornamentation done with a tool."},{"definition":"The provision of tools for an industrial process or for software development."}],"partOfSpeech":"n"}]},{"word":"TOMOGRAPHY","idx":21756,"count":1383672,"meanings":[{"definitions":[{"definition":"Imaging by sections or sectioning."}],"partOfSpeech":"n"}]},{"word":"THRIFT","idx":21757,"count":1383578,"meanings":[{"definitions":[{"definition":"The characteristic of using a minimum of something (especially money).","example":"His thrift can be seen in how little the trashman takes from his house."},{"definition":"A savings bank.","example":"Usually, home mortgages are obtained from thrifts."},{"definition":"Any of various plants of the genus Armeria, particularly Armeria maritima."},{"definition":"Success and advance in the acquisition of property; increase of worldly goods; gain; prosperity; profit."},{"definition":"Vigorous growth, as of a plant."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To obtain from a thrift shop."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"thrift-uk","text":"/θɹɪft/"}]},{"word":"VOCALIST","idx":21759,"count":1383147,"meanings":[{"definitions":[{"definition":"A singer; a person who likes to sing."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈvoʊkəlɪst/"}]},{"word":"TIDBITS","idx":21761,"count":1382872,"meanings":[{"definitions":[{"definition":"A tasty morsel (of food)."},{"definition":"A quarter of a byte (Half of a nybble; two bits)."},{"definition":"A short mention of news or gossip."}],"partOfSpeech":"n"}]},{"word":"ADMIRED","idx":21762,"count":1382872,"meanings":[{"definitions":[{"definition":"To be amazed at; to view with surprise; to marvel at."},{"definition":"To regard with wonder and delight."},{"definition":"To look upon with an elevated feeling of pleasure, as something which calls out approbation, esteem, love or reverence."},{"definition":"To estimate or value highly; to hold in high esteem.","example":"He had always admired the work ethos and family values of his friend."},{"definition":"To be enthusiastic about (doing something); to want or like (to do something). (Sometimes followed by to.)"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"admired-us","text":"/ədˈmaɪɹd/"}]},{"word":"STUNTS","idx":21763,"count":1382862,"meanings":[{"definitions":[{"definition":"A daring or dangerous feat, often involving the display of gymnastic skills."},{"definition":"Skill"},{"definition":"A special means of rushing the quarterback done to confuse the opposing team's offensive line."},{"definition":"A check in growth."},{"definition":"That which has been checked in growth; a stunted animal or thing."},{"definition":"A two-year-old whale, which, having been weaned, is lean and yields little blubber."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(cheerleading) To perform a stunt."},{"definition":"To show off; to posture."},{"definition":"To check or hinder the growth or development of.","example":"Some have said smoking stunts your growth."}],"partOfSpeech":"ve"}]},{"word":"CYSTIC","idx":21764,"count":1382824,"meanings":[{"definitions":[{"definition":"Of or pertaining to a cyst."},{"definition":"Of or pertaining to the gall bladder or the urinary bladder."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsɪstɪk/"}]},{"word":"ANNIVERSARIES","idx":21767,"count":1382289,"meanings":[{"definitions":[{"definition":"A day that is an exact number of years (to the day) since a given significant event occurred. Often preceded by an ordinal number indicating the number of years.","example":"Today is the fiftieth anniversary of the end of the war."},{"definition":"(loosely) A day subsequent in time to a given event by some significant period other than a year (especially as prefixed by the amount of time in question)."}],"partOfSpeech":"n"}]},{"word":"INFRASTRUCTURES","idx":21769,"count":1381499,"meanings":[{"definitions":[{"definition":"(systems theory) An underlying base or foundation especially for an organization or system.","example":"The parasitic tyranny's infrastructure depends on secrecy in order to be effective."},{"definition":"The basic facilities, services and installations needed for the functioning of a community or society."}],"partOfSpeech":"n"}]},{"word":"YOUTHFUL","idx":21771,"count":1381263,"meanings":[{"definitions":[{"definition":"Young or seeming young.","example":"a youthful butler"},{"definition":"Characteristic of young people.","example":"youthful vivacity"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈjuːθfəl/"}]},{"word":"COMMENTERS","idx":21772,"count":1381213,"meanings":[{"definitions":[{"definition":"One who comments."}],"partOfSpeech":"n"}]},{"word":"FAIRWAY","idx":21774,"count":1380868,"meanings":[{"definitions":[{"definition":"The area between the tee and the green, where the grass is cut short."},{"definition":"Any tract of land free from obstacles."},{"definition":"(Military) A channel either from offshore, in a river, or in a harbor that has enough depth to accommodate the draft of large vessels. (JP 4-01.6)"},{"definition":"A navigable channel in a harbour, offshore etc; the usual course taken by vessels in such places."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɛɹweɪ/"},{"text":"/ˈfɛəweɪ/"}]},{"word":"POSTDOCTORAL","idx":21775,"count":1380688,"meanings":[{"definitions":[{"definition":"After receiving a doctorate; especially of academic research or study beyond the level of a doctoral degree."}],"partOfSpeech":"j"}]},{"word":"STUMBLED","idx":21776,"count":1380668,"meanings":[{"definitions":[{"definition":"To trip or fall; to walk clumsily.","example":"He stumbled over a rock."},{"definition":"To make a mistake or have trouble.","example":"I always stumble over verbs in Spanish."},{"definition":"To cause to stumble or trip."},{"definition":"To mislead; to confound; to cause to err or to fall."},{"definition":"To strike or happen (upon a person or thing) without design; to fall or light by chance; with on, upon, or against."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stumbled-us","text":"/ˈstʌmbl̩d/"}]},{"word":"EMITTED","idx":21780,"count":1380227,"meanings":[{"definitions":[{"definition":"To send out or give off"}],"partOfSpeech":"ve"}]},{"word":"SPINNER","idx":21781,"count":1380109,"meanings":[{"definitions":[{"definition":"Agent noun of spin; someone or something who spins."},{"definition":"A conical cover at the center of some aircraft propellers."},{"definition":"A device that is spun in games to choose a number or symbol.","example":"I got a four on the spinner and moved my counter forward four spaces on the board."},{"definition":"The coin thrower in a game of two-up."},{"definition":"Primarily in the adult film industry, an actress or prostitute with a tiny frame, usually very thin and small-breasted."},{"definition":"An input control for entering a number, with accompanying arrowed buttons that increase or decrease the value."},{"definition":"A spin bowler."},{"definition":"A type of lure consisting of wire, a rotating blade, a weighted body, and one or more hooks."},{"definition":"An ornamental hubcap that spins independently of the wheel"},{"definition":"The European nightjar, Caprimulgus europaeus."},{"definition":"The dolphin Stenella longirostris."},{"definition":"A spinneret."},{"definition":"A spider."},{"definition":"A kind of dumpling, shaped by \"spinning\" it in the hands."},{"definition":"A spin doctor."},{"definition":"Short for fidget spinner."},{"definition":"A flat target mounted on an axis so that a ball passing through can make it spin around, usually awarding a certain number of points for every revolution it completes."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈspɪnɚ/"},{"audio":"spinner-au"}]},{"word":"HOMEOPATHIC","idx":21783,"count":1379703,"meanings":[{"definitions":[{"definition":"Any of the diluted remedies used in homeopathy."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of or pertaining to homeopathy."},{"definition":"Extremely dilute, insipid."}],"partOfSpeech":"j"}]},{"word":"ORDINARILY","idx":21784,"count":1379609,"meanings":[{"definitions":[{"definition":"In accordance with normal custom or routine; as a matter of established occurrence."},{"definition":"Usually or as a general rule; commonly.","example":"Ordinarily I go to the match on a Saturday."},{"definition":"In the usual manner; unexceptionally.","example":"The man was ordinarily dressed."}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ɔɹdɪˈnɛɹɪli/"},{"text":"/ɔːdɪˈnæɹɪli/"}]},{"word":"SUFFICIENCY","idx":21786,"count":1379490,"meanings":[{"definitions":[{"definition":"The quality or condition of being sufficient."},{"definition":"An adequate amount."}],"partOfSpeech":"n"}]},{"word":"TEMPERED","idx":21787,"count":1379477,"meanings":[{"definitions":[{"definition":"(in combination) Having a specified disposition or temper."},{"definition":"Pertaining to the metallurgical process for finishing metals."},{"definition":"Pertaining to the industrial process for toughening glass, or to such toughened glass."},{"definition":"Moderated or balanced by other considerations."},{"definition":"Pertaining to the well-tempered scale, where the twelve notes per octave of the standard keyboard are tuned in such a way that it is possible to play music in any major or minor key and it will not sound perceptibly out of tune."}],"partOfSpeech":"j"},{"definitions":[{"definition":"To moderate or control.","example":"Temper your language around children."},{"definition":"To strengthen or toughen a material, especially metal, by heat treatment; anneal.","example":"Tempering is a heat treatment technique applied to metals, alloys, and glass to achieve greater toughness by increasing the strength of materials and/or ductility. Tempering is performed by a controlled reheating of the work piece to a temperature below its lower eutectic critical temperature."},{"definition":"To sauté spices in ghee or oil to release essential oils for flavouring a dish in South Asian cuisine."},{"definition":"To mix clay, plaster or mortar with water to obtain the proper consistency."},{"definition":"To adjust, as the mathematical scale to the actual scale, or to that in actual use."},{"definition":"(Latinism) To govern; to manage."},{"definition":"To combine in due proportions; to constitute; to compose."},{"definition":"To mingle in due proportion; to prepare by combining; to modify, as by adding some new element; to qualify, as by an ingredient; hence, to soften; to mollify; to assuage."},{"definition":"To fit together; to adjust; to accommodate."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tempered-us"}]},{"word":"SLIPPING","idx":21788,"count":1379406,"meanings":[{"definitions":[{"definition":"To lose one’s traction on a slippery surface; to slide due to a lack of friction."},{"definition":"To err."},{"definition":"To accidentally reveal a secret or otherwise say something unintentional."},{"definition":"To move or fly (out of place); to shoot; often with out, off, etc.","example":"A bone may slip out of place."},{"definition":"To pass (a note, money, etc.), often covertly.","example":"She thanked the porter and slipped a ten-dollar bill into his hand."},{"definition":"To cause to move smoothly and quickly; to slide; to convey gently or secretly."},{"definition":"To move quickly and often secretively; to depart, withdraw, enter, appear, intrude, or escape as if by sliding.","example":"Some errors slipped into the appendix."},{"definition":"To move down; to slide.","example":"Profits have slipped over the past six months."},{"definition":"To release (a dog, a bird of prey, etc.) to go after a quarry."},{"definition":"To remove the skin of a soft fruit, such as a tomato or peach, by blanching briefly in boiling water, then transferring to cold water so that the skin peels, or slips, off easily."},{"definition":"To omit; to lose by negligence."},{"definition":"To cut slips from; to cut; to take off; to make a slip or slips of.","example":"to slip a piece of cloth or paper"},{"definition":"To cause to slip or slide off, or out of place.","example":"A horse slips his bridle; a dog slips his collar."},{"definition":"To bring forth (young) prematurely; to slink."},{"definition":"To cause (a schedule or release, etc.) to go, or let it go, beyond the allotted deadline."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of something that slips; a slip; a skidding or sudden loosening motion.","example":"slippings and slidings"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈslɪpɪŋ/"}]},{"word":"SOLITUDE","idx":21789,"count":1379342,"meanings":[{"definitions":[{"definition":"Aloneness; state of being alone or solitary, by oneself."},{"definition":"A lonely or deserted place."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"solitude-us","text":"/ˈsɑlɪˌtud/"}]},{"word":"CYLINDRICAL","idx":21790,"count":1379287,"meanings":[{"definitions":[{"definition":"Shaped like a cylinder."},{"definition":"Describing a map projection in which meridians are mapped onto vertical lines and parallels of latitude onto horizontal lines."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/sɪˈlɪndɹɪkəl/"}]},{"word":"DESTROYER","idx":21792,"count":1378814,"meanings":[{"definitions":[{"definition":"That which destroys something."},{"definition":"A small, fast warship with light armament, smaller than a cruiser, but bigger than a frigate."}],"partOfSpeech":"n"}]},{"word":"BRAKING","idx":21793,"count":1378811,"meanings":[{"definitions":[{"definition":"To bruise and crush; to knead","example":"The farmer's son brakes the flax while mother brakes the bread dough"},{"definition":"To pulverise with a harrow"},{"definition":"To operate (a) brake(s)."},{"definition":"To be stopped or slowed (as if) by braking."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act of applying brakes.","example":"the acceleratings and brakings of a vehicle"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbɹeɪkɪŋ/"}]},{"word":"UNDESIRABLE","idx":21796,"count":1378592,"meanings":[{"definitions":[{"definition":"An undesirable person"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Objectionable or not likely to please"}],"partOfSpeech":"j"}]},{"word":"PLATELET","idx":21797,"count":1378519,"meanings":[{"definitions":[{"definition":"A small colorless disk-shaped particle found in the blood of mammals, which plays an important role in the formation of blood clots."}],"partOfSpeech":"n"}]},{"word":"MESSAGEBOARD","idx":21798,"count":1378430,"meanings":[{"definitions":[{"definition":"A board on which messages may be posted, especially one in a public space."},{"definition":"A system by which users may send, read and reply to public messages; an electronic bulletin board or forum."}],"partOfSpeech":"n"}]},{"word":"WEAKLY","idx":21800,"count":1377605,"meanings":[{"definitions":[{"definition":"Frail, sickly or of a delicate constitution; weak.","example":"1885, I lay in weakly case and confined to my bed for four months before I was able to rise and health returned to me. — Sir Richard Burton, The Book of the Thousand Nights and a Night, Night 18"}],"partOfSpeech":"j"},{"definitions":[{"definition":"With little strength or force"}],"partOfSpeech":"v"}],"phonetics":[{"text":"/ˈwiːkli/"}]},{"word":"PARSLEY","idx":21801,"count":1377594,"meanings":[{"definitions":[{"definition":"A bright green, biennial herb, Petroselinum crispum, having many cultivars."},{"definition":"The leaves of this plant used in Middle Eastern, European, and American cooking."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"parsley-us","text":"/ˈpɑː(ɹ)sli/"}]},{"word":"UNDUE","idx":21802,"count":1377567,"meanings":[{"definitions":[{"definition":"Excessive; going beyond that what is natural or sufficient.","example":"To individuals who despise killings in any form, death penalty is undue punishment."},{"definition":"That which ought not to be done; illegal; unjustified."},{"definition":"(of a payment etc) Not owing or payable."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ʌnˈdjuː/"}]},{"word":"SETBACK","idx":21803,"count":1377551,"meanings":[{"definitions":[{"definition":"An obstacle, delay, disadvantage, blow (an adverse event which retards or prevents progress towards a desired outcome)","example":"After some initial setbacks, the expedition went safely on its way."},{"definition":"The required distance between a structure and a road."},{"definition":"A step-like recession in a wall.","example":"Setbacks were initially used for structural reasons, but now are often mandated by land use codes."},{"definition":"An offset to the temperature setting of a thermostat to cover a period when more or less heating is required than usual."},{"definition":"(possibly obsolete) A backset; a countercurrent; an eddy."},{"definition":"A backset; a check; a repulse; a relapse."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"setback-us","text":"/ˈsɛtbæk/"}]},{"word":"STUNNED","idx":21804,"count":1377494,"meanings":[{"definitions":[{"definition":"To incapacitate; especially by inducing disorientation or unconsciousness.","example":"Bill tried to stun the snake by striking it on the head."},{"definition":"To shock or surprise.","example":"He stood there stunned, looking at the beautiful, breath-taking sunrise."},{"definition":"To hit the cue ball so that it slides without topspin or backspin (and with or without sidespin) and continues at a natural angle after contact with the object ball"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Unable to act or respond; dazed; shocked."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"stunned-us","text":"/stʌnd/"}]},{"word":"SMITHS","idx":21805,"count":1377482,"meanings":[{"definitions":[{"definition":"A craftsperson who works metal into desired forms using a hammer and other tools, sometimes heating the metal to make it more workable, especially a blacksmith."},{"definition":"(by extension) One who makes anything; wright."},{"definition":"An artist."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To forge, to form, usually on an anvil; by heating and pounding."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/smɪθs/"}]},{"word":"INSTALLERS","idx":21808,"count":1377247,"meanings":[{"definitions":[{"definition":"One who installs."},{"definition":"A program that installs software and prepares it for use."}],"partOfSpeech":"n"}]},{"word":"HOSTILITY","idx":21809,"count":1377207,"meanings":[{"definitions":[{"definition":"The state of being hostile.","example":"My resentment and anger towards you caused hostility and a division between us."},{"definition":"A hostile action, especially a military action. See hostilities for specific plural definition."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"hostility-us","text":"/hɑˈstɪlɪti/"}]},{"word":"GROVES","idx":21810,"count":1377169,"meanings":[{"definitions":[{"definition":"A small forest."},{"definition":"An orchard of fruit trees."},{"definition":"(Druidism) A place of worship."},{"definition":"A lodge of the Ancient Order of Druids."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To cultivate in groves; to grow naturally so as to form groves."},{"definition":"(of trees) To cultivate with periodic harvesting that also serves to create order (gaps and lines of trees) to facilitate further harvesting."},{"definition":"To plough or gouge with lines."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɡɹoʊvz/"},{"text":"/ɡɹəʊvz/"}]},{"word":"SUBCATEGORY","idx":21811,"count":1377124,"meanings":[{"definitions":[{"definition":"With respect to a given category, a more narrow category."},{"definition":"A subclass of a category which is itself a category, whose arrows are a restriction of the arrows of the parent category, and whose composition rule is a restriction of the parent category's"}],"partOfSpeech":"n"}]},{"word":"PURSUITS","idx":21812,"count":1376989,"meanings":[{"definitions":[{"definition":"The act of pursuing.","example":"Unremitting pursuit of wealth doesn't bring happiness, particularly if successful."},{"definition":"A hobby or recreational activity, done regularly."},{"definition":"A discipline in track cycling where two opposing teams start on opposite sides of the track and try to catch their opponents."},{"definition":"Prosecution"}],"partOfSpeech":"n"}]},{"word":"REFLUX","idx":21814,"count":1376882,"meanings":[{"definitions":[{"definition":"The backwards flow of any fluid."},{"definition":"A technique, using a reflux condenser, allowing one to boil the contents of a vessel over an extended period."},{"definition":"The leaking of stomach acid up into the oesophagus."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To flow back or return.","example":"the refluxing tide"},{"definition":"To boil a liquid in a vessel having a reflux condenser"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɹiː.flʌks/"}]},{"word":"TUPLE","idx":21816,"count":1376804,"meanings":[{"definitions":[{"definition":"A finite sequence of terms."},{"definition":"A single row in a relational database."},{"definition":"A set of comma-separated values passed to a program or operating system as a parameter to a function call."},{"definition":"In some programming languages, a data type that is similar but distinct from the list data type, whose instances are characterized by having a rather fixed arity, and the elements of which instances can differ from each other by data type. (Note: this definition may overlap with the previous one.)","example":"Both Python and Haskell have a tuple data type as well as a list data type."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/tuːp(ə)l/"}]},{"word":"FIBROMYALGIA","idx":21817,"count":1376780,"meanings":[{"definitions":[{"definition":"A condition characterised by chronic pain, stiffness, and tenderness of the muscles, tendons, and joints."}],"partOfSpeech":"n"}]},{"word":"ADAPTATIONS","idx":21818,"count":1376721,"meanings":[{"definitions":[{"definition":"The process of adapting something or becoming adapted to a situation; adjustment, modification."},{"definition":"A change that is made or undergone to suit a condition or environment."},{"definition":"The process of change that an organism undergoes to be better suited to its environment."},{"definition":"An instance of an organism undergoing change, or the structure or behavior that is changed."},{"definition":"The process of adapting an artistic work from a different medium."},{"definition":"(authorship) An artistic work that has been adapted from a different medium."}],"partOfSpeech":"n"}]},{"word":"JURISPRUDENCE","idx":21819,"count":1376456,"meanings":[{"definitions":[{"definition":"The theoretical study of law."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdʒʊəɹɪsˌpɹuːdəns/"}]},{"word":"INVARIABLY","idx":21822,"count":1376202,"meanings":[{"definitions":[{"definition":"Every time; always, without change.","example":"He is invariably late for meetings."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"invariably-us","text":"/ɪnˈvɛɹ.i.ə.bli/"}]},{"word":"LECTURERS","idx":21823,"count":1376176,"meanings":[{"definitions":[{"definition":"A person who gives lectures, especially as a profession."},{"definition":"A member of a university or college below the rank of assistant professor or reader."},{"definition":"A member of the Church of England clergy whose main task was to deliver sermons (lectures) in the afternoons and evenings."}],"partOfSpeech":"n"}]},{"word":"PROGRESSED","idx":21824,"count":1376073,"meanings":[{"definitions":[{"definition":"To move, go, or proceed forward; to advance.","example":"They progress through the museum."},{"definition":"To improve; to become better or more complete.","example":"Societies progress unevenly."},{"definition":"To move (something) forward; to advance, to expedite."}],"partOfSpeech":"ve"}]},{"word":"BROW","idx":21825,"count":1375648,"meanings":[{"definitions":[{"definition":"The ridge over the eyes; the eyebrow."},{"definition":"The first tine of an antler's beam."},{"definition":"The forehead."},{"definition":"The projecting upper edge of a steep place such as a hill.","example":"the brow of a precipice"},{"definition":"A gallery in a coal mine running across the face of the coal."},{"definition":"Aspect; appearance."},{"definition":"The gangway from ship to shore when a ship is lying alongside a quay."},{"definition":"The hinged part of a landing craft or ferry which is lowered to form a landing platform; a ramp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bound or limit; to be at, or form, the edge of."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"brow-us","text":"/bɹaʊ/"}]},{"word":"ELVES","idx":21826,"count":1375481,"meanings":[{"definitions":[{"definition":"A luminous spirit presiding over nature and fertility and dwelling in the world of Álfheim (Elfland). Compare angel, nymph, fairy."},{"definition":"Any from a race of mythical, supernatural beings resembling but seen as distinct from human beings. They are usually delicate-featured and skilled in magic or spellcrafting; sometimes depicted as clashing with dwarves, especially in modern fantasy literature."},{"definition":"Any of the magical, typically forest-guarding races bearing some similarities to the Norse álfar (through Tolkien's Eldar)."},{"definition":"A very diminutive person; a dwarf."},{"definition":"The bluefish (Pomatomus saltatrix)."},{"definition":"An upper atmospheric optical phenomenon associated with thunderstorms, rapidly expanding disk-shaped regions of luminosity, lasting less than a thousandth of a second, which occur high above energetic cloud-to-ground lightning of positive or negative polarity"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɛlvz/"}]},{"word":"CHANT","idx":21833,"count":1374428,"meanings":[{"definitions":[{"definition":"Type of singing done generally without instruments and harmony."},{"definition":"A short and simple melody, divided into two parts by double bars, to which unmetrical psalms, etc., are sung or recited. It is the most ancient form of choral music."},{"definition":"Twang; manner of speaking; a canting tone."},{"definition":"A repetitive song, typically an incantation or part of a ritual."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To sing, especially without instruments, and as applied to monophonic and pre-modern music."},{"definition":"To sing or intone sacred text."},{"definition":"To utter or repeat in a strongly rhythmical manner, especially as a group.","example":"The football fans chanted insults at the referee."},{"definition":"To sell horses fraudulently, exaggerating their merits."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"chant-us","text":"/tʃænt/"}]},{"word":"TURNKEY","idx":21835,"count":1374262,"meanings":[{"definitions":[{"definition":"A warder or jailer/gaoler; keeper of the keys in a prison."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To supply a turnkey product; to supply something fully assembled and ready to use","example":"We can sell you all the parts, or we can turnkey the entire unit."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Ready to use without further assembly or test; supplied in a state that is ready to turn on and operate (typically refers to an assembly that is outsourced for manufacture)","example":"They wanted a turnkey solution for the entire system, but we could only provide the enclosure."}],"partOfSpeech":"j"}]},{"word":"SPRAYS","idx":21836,"count":1374214,"meanings":[{"definitions":[{"definition":"A fine, gentle, dispersed mist of liquid.","example":"The sailor could feel the spray from the waves."},{"definition":"A pressurized container; an atomizer."},{"definition":"Any of numerous commercial products, including paints, cosmetics, and insecticides, that are dispensed from containers in this manner."},{"definition":"A jet of fine medicated vapour, used either as an application to a diseased part or to charge the air of a room with a disinfectant or a deodorizer."},{"definition":"A side channel or branch of the runner of a flask, made to distribute the metal to all parts of the mold."},{"definition":"A group of castings made in the same mold and connected by sprues formed in the runner and its branches."},{"definition":"The allocation and filling of blocks of memory with the same byte sequence, hoping to establish that sequence in a certain predetermined location as part of an exploit."},{"definition":"A small branch of flowers or berries.","example":"The bridesmaid carried a spray of lily-of-the-valley."},{"definition":"A collective body of small branches.","example":"The tree has a beautiful spray."},{"definition":"Branches and twigs collectively; foliage."},{"definition":"An orchard."},{"definition":"An ornament or design that resembles a branch."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To project a liquid in a dispersive manner toward something.","example":"The firemen sprayed the house."},{"definition":"To project in a dispersive manner.","example":"Spray some ointment on that scratch."},{"definition":"To project many small items dispersively."},{"definition":"To urinate in order to mark territory."},{"definition":"To allocate blocks of memory from (a heap, etc.), and fill them with the same byte sequence, hoping to establish that sequence in a certain predetermined location as part of an exploit.","example":"to spray the heap of a target process"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/spɹeɪz/"}]},{"word":"RENTERS","idx":21837,"count":1374199,"meanings":[{"definitions":[{"definition":"A male prostitute, typically young and gay."},{"definition":"One who rents property or other goods from another."},{"definition":"One who owns or controls property and rents that property to another."}],"partOfSpeech":"n"}]},{"word":"ZACK","idx":21839,"count":1374002,"meanings":[{"definitions":[{"definition":"Sixpence."},{"definition":"Five cents."},{"definition":"A six-month or six-year prison sentence."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/zak/"},{"audio":"zack-au"}]},{"word":"GELS","idx":21841,"count":1373875,"meanings":[{"definitions":[{"definition":"A semi-solid to almost solid colloid of a solid and a liquid, such as jelly, cheese or opal."},{"definition":"Any gel intended for a particular cosmetic use, such as for styling the hair."},{"definition":"A girl."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To apply (cosmetic) gel to (the hair, etc)."},{"definition":"To become a gel."},{"definition":"To develop a rapport.","example":"He was a nice guy, and I got on OK with his friends, but the two of us never really gelled."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dʒɛlz/"}]},{"word":"TIGHTEN","idx":21843,"count":1373432,"meanings":[{"definitions":[{"definition":"To make tighter.","example":"Please tighten that screw a quarter-turn."},{"definition":"To become tighter.","example":"That joint is tightening as the wood dries."},{"definition":"To make money harder to borrow or obtain.","example":"If the government doesn't tighten the money supply, inflation is certain to be harsh."},{"definition":"To raise short-term interest rates.","example":"The Fed is expected to tighten by a quarter-point."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"tighten-uk","text":"/ˈtaɪ.tən/"}]},{"word":"REVOLVER","idx":21846,"count":1373255,"meanings":[{"definitions":[{"definition":"A handgun with a revolving chamber enabling several shots to be fired without reloading."},{"definition":"(by extension) Any (personal) firearm with such a mechanism."},{"definition":"Synonym of revolving line of credit"},{"definition":"Agent noun of revolve; something that revolves."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɹɪˈvɒl.vɚ/"}]},{"word":"MOUNTAINEERING","idx":21848,"count":1373229,"meanings":[{"definitions":[{"definition":"The sport of climbing mountains."}],"partOfSpeech":"n"}]},{"word":"SCREWDRIVER","idx":21849,"count":1373116,"meanings":[{"definitions":[{"definition":"A hand or machine tool which engages with the head of a screw and allows torque to be applied to turn the screw, thus driving it in or loosening it."},{"definition":"A drink made of vodka and orange juice."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"screwdriver-us"}]},{"word":"HUTCH","idx":21850,"count":1373107,"meanings":[{"definitions":[{"definition":"A cage for keeping rabbits, guinea pigs, etc."},{"definition":"A piece of furniture in which items may be displayed."},{"definition":"A measure of two Winchester bushels."},{"definition":"The case of a flour bolt."},{"definition":"A car on low wheels, in which coal is drawn in the mine and hoisted out of the pit."},{"definition":"A jig or trough for ore dressing or washing ore."},{"definition":"A baker's kneading-trough."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To hoard or lay up, in a chest."},{"definition":"To wash (ore) in a box or jig."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hutch-uk","text":"/hʌtʃ/"}]},{"word":"CROWNS","idx":21852,"count":1372974,"meanings":[{"definitions":[{"definition":"A royal, imperial or princely headdress; a diadem."},{"definition":"A wreath or band for the head, especially one given as reward of victory or a mark of honor."},{"definition":"(by extension) Any reward of victory or mark of honor.","example":"the martyr's crown"},{"definition":"Imperial or regal power, or those who wield it."},{"definition":"(metonym) The sovereign (in a monarchy), as head of state."},{"definition":"(by extension) The state, the government (headed by a monarch).","example":"Treasure recovered from shipwrecks automatically becomes property of the Crown."},{"definition":"The top part of something:"},{"definition":"A kind of spire or lantern formed by converging flying buttresses."},{"definition":"Splendor; culmination; acme."},{"definition":"Any currency (originally) issued by the crown (regal power) and often bearing a crown (headdress); (translation) various currencies known by similar names in their native languages, such as the koruna, kruna, krone, korona."},{"definition":"A former pre-decimalization British coin worth five shillings."},{"definition":"The part of a plant where the root and stem meet."},{"definition":"The top of a tree."},{"definition":"The part of a tooth above the gums."},{"definition":"A prosthetic covering for a tooth."},{"definition":"A knot formed in the end of a rope by tucking in the strands to prevent them from unravelling"},{"definition":"The part of an anchor where the arms and the shank meet"},{"definition":"The rounding, or rounded part, of the deck from a level line."},{"definition":"(in the plural) The bights formed by the turns of a cable."},{"definition":"In England, a standard size of printing paper measuring 20 × 15 inches."},{"definition":"In American, a standard size of writing paper measuring 19 × 15 inches."},{"definition":"A monocyclic ligand having three or more binding sites, capable of holding a guest in a central location"},{"definition":"During childbirth, the appearance of the baby's head from the mother's vagina"},{"definition":"A rounding or smoothing of the barrel opening"},{"definition":"The area enclosed between two concentric perimeters."},{"definition":"A round spot shaved clean on the top of the head, as a mark of the clerical state; the tonsure."},{"definition":"A whole bird with the legs and wings removed to produce a joint of white meat."},{"definition":"A formal hat worn by women to Sunday church services; a church crown."},{"definition":"The knurled knob or dial, on the outside of a watch case, used to wind it or adjust the hands."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To place a crown on the head of."},{"definition":"To formally declare (someone) a king, queen, emperor, etc."},{"definition":"To bestow something upon as a mark of honour, dignity, or recompense; to adorn; to dignify."},{"definition":"To form the topmost or finishing part of; to complete; to consummate; to perfect."},{"definition":"To declare (someone) a winner."},{"definition":"Of a baby, during the birthing process; for the surface of the baby's head to appear in the vaginal opening.","example":"The mother was in the second stage of labor and the fetus had just crowned, prompting a round of encouragement from the midwives."},{"definition":"To cause to round upward; to make anything higher at the middle than at the edges, such as the face of a machine pulley."},{"definition":"To hit on the head."},{"definition":"To shoot an opponent in the back of the head with a shotgun in a first-person shooter video game."},{"definition":"In checkers, to stack two checkers to indicate that the piece has become a king.","example":"“Crown me!” I said, as I moved my checker to the back row."},{"definition":"To widen the opening of the barrel."},{"definition":"To effect a lodgment upon, as upon the crest of the glacis, or the summit of the breach."},{"definition":"To lay the ends of the strands of (a knot) over and under each other."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"crowns-us","text":"/kɹaʊnz/"}]},{"word":"INTERMEDIARY","idx":21853,"count":1372814,"meanings":[{"definitions":[{"definition":"An agent acting as a mediator between sides that may disagree."},{"definition":"An arranger of a contract or other agreement who is separate from the parties to the agreement"},{"definition":"One or several stages of an event which occurs after the start and before the end."},{"definition":"A person or organisation in an intermediate position in a supply chain of goods or services","example":"The intermediary between the manufacturer and retailer is the wholesaler"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Intermediate."}],"partOfSpeech":"j"}]},{"word":"MATTED","idx":21854,"count":1372746,"meanings":[{"definitions":[{"definition":"To cover, protect or decorate with mats."},{"definition":"To form a thick, tangled mess; to interweave into, or like, a mat; to entangle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Forming a thick tangled mess"},{"definition":"Covered with mats or matting"}],"partOfSpeech":"j"}]},{"word":"APRICOT","idx":21855,"count":1372632,"meanings":[{"definitions":[{"definition":"A round sweet and juicy stone fruit, resembling peach or plum in taste, with a yellow-orange flesh, lightly fuzzy skin and a large seed inside."},{"definition":"The apricot tree, Prunus armeniaca"},{"definition":"A pale yellow-orange colour, like that of an apricot fruit."},{"definition":"A dog with an orange-coloured coat."},{"definition":"The junction of the brain and brain stem on a target, used as an aiming point to ensure a one-shot kill."},{"definition":"(usually in the plural) A testicle."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a pale yellowish-orange colour, like that of an apricot."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"apricot-us","text":"/ˈeɪ.pɹɪ.kɒt/"},{"audio":"apricot-uk","text":"/ˈeɪ.pɹɪ.kɒt/"},{"audio":"apricot-au","text":"/æepɹɪˈkɒt/"}]},{"word":"TUFTS","idx":21856,"count":1372589,"meanings":[{"definitions":[{"definition":"A bunch of feathers, grass or hair, etc., held together at the base."},{"definition":"A cluster of threads drawn tightly through upholstery, a mattress or a quilt, etc., to secure and strengthen the padding."},{"definition":"A small clump of trees or bushes."},{"definition":"A gold tassel on the cap worn by titled undergraduates at English universities."},{"definition":"A person entitled to wear such a tassel."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To provide or decorate with a tuft or tufts."},{"definition":"To form into tufts."},{"definition":"To secure and strengthen (a mattress, quilt, etc.) with tufts."},{"definition":"To be formed into tufts."}],"partOfSpeech":"ve"}]},{"word":"HOMESCHOOLING","idx":21857,"count":1372375,"meanings":[{"definitions":[{"definition":"Teaching children at home instead of sending them to school."}],"partOfSpeech":"n"}]},{"word":"DEALERSHIPS","idx":21858,"count":1372362,"meanings":[{"definitions":[{"definition":"A place that sells items, especially cars.","example":"I visited the car dealership today."}],"partOfSpeech":"n"}]},{"word":"CUCKOLD","idx":21859,"count":1372071,"meanings":[{"definitions":[{"definition":"A man married to an unfaithful wife, especially when he is unaware or unaccepting of the fact."},{"definition":"A West Indian plectognath fish, Rhinesomus triqueter."},{"definition":"The scrawled cowfish, Acanthostracion quadricornis and allied species."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a cuckold or cuckquean of someone by being unfaithful, or by seducing their partner or spouse."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkʌk.oʊld/"},{"text":"/ˈkʌk.əld/"}]},{"word":"SAKURA","idx":21860,"count":1372000,"meanings":[{"definitions":[{"definition":"(Japanese) cherry tree"},{"definition":"Cherry blossom (Japanese cherry tree)"}],"partOfSpeech":"n"}]},{"word":"UNRELIABLE","idx":21862,"count":1371893,"meanings":[{"definitions":[{"definition":"Not reliable."}],"partOfSpeech":"j"}]},{"word":"ROSEWOOD","idx":21864,"count":1371656,"meanings":[{"definitions":[{"definition":"The fragrant wood of Dalbergia nigra, a Brazilian tree in the legume family, which has a sweet smell."},{"definition":"Any of several dozen woods, resembling that of Dalbergia nigra in some respect."},{"definition":"The wood of a South American tree, Aniba rosaeodora, in the laurel family, with fragrant wood from which an essential oil is distilled."},{"definition":"Wood and plant of Pterocarpus spp., for example African rosewood or mukula or Burmese rosewood (Pterocarpus indicus, syn. Pterocarpus santalinus)."}],"partOfSpeech":"n"}]},{"word":"PARRY","idx":21865,"count":1371591,"meanings":[{"definitions":[{"definition":"A defensive or deflective action; an act of parrying."},{"definition":"A simple defensive action designed to deflect an attack, performed with the forte of the blade."},{"definition":"(combat sports and martial arts) A defensive move intended to change the direction of an incoming strike to make it miss its intended target, rather than block and absorb it; and typically performed with an open hand in a downward or sideways slapping motion."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To avoid, deflect, or ward off (an attack, a blow, an argument, etc.)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈpæɹi/"}]},{"word":"EXISTENT","idx":21866,"count":1371448,"meanings":[{"definitions":[{"definition":"A being or entity that exists independently"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Existing; having life or being, current; occurring now"}],"partOfSpeech":"j"}]},{"word":"PHOSPHATASE","idx":21867,"count":1371318,"meanings":[{"definitions":[{"definition":"Any of several enzymes that hydrolyze phosphate esters, and are important in the metabolism of carbohydrates, nucleotides and phospholipids, and in the formation of bone."}],"partOfSpeech":"n"}]},{"word":"MAHAL","idx":21868,"count":1371252,"meanings":[{"definitions":[{"definition":"A summer house."},{"definition":"Private lodgings."},{"definition":"A territorial division of pre-independence India."},{"definition":"A division of a farm."},{"definition":"A division of a hunting preserve."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/məˈhɑːl/"}]},{"word":"KILLINGS","idx":21869,"count":1371222,"meanings":[{"definitions":[{"definition":"An instance of someone being killed."},{"definition":"(usually as make a killing) A large amount of money.","example":"He made a killing on the stock market."}],"partOfSpeech":"n"}]},{"word":"TONGUES","idx":21870,"count":1371081,"meanings":[{"definitions":[{"definition":"The flexible muscular organ in the mouth that is used to move food around, for tasting and that is moved into various positions to modify the flow of air from the lungs in order to produce different sounds in speech."},{"definition":"This organ, as taken from animals used for food (especially cows).−","example":"cold tongue with mustard"},{"definition":"(metonym) A language.","example":"He was speaking in his native tongue."},{"definition":"Speakers of a language, collectively."},{"definition":"Voice (the distinctive sound of a person's speech); accent (distinctive manner of pronouncing a language)."},{"definition":"Manner of speaking, often habitually."},{"definition":"(metonym) A person speaking in a specified manner (most often plural)."},{"definition":"The power of articulate utterance; speech generally."},{"definition":"Discourse; fluency of speech or expression."},{"definition":"Discourse; fluency of speech or expression."},{"definition":"Honourable discourse; eulogy."},{"definition":"(often in the plural) Glossolalia."},{"definition":"In a shoe, the flap of material that goes between the laces and the foot (so called because it resembles a tongue in the mouth)."},{"definition":"Any large or long physical protrusion on an automotive or machine part or any other part that fits into a long groove on another part."},{"definition":"A projection, or slender appendage or fixture."},{"definition":"A long, narrow strip of land, projecting from the mainland into a sea or lake."},{"definition":"The pole of a vehicle; especially, the pole of an ox cart, to the end of which the oxen are yoked."},{"definition":"The clapper of a bell."},{"definition":"An individual point of flame from a fire."},{"definition":"A small sole (type of fish)."},{"definition":"A short piece of rope spliced into the upper part of standing backstays, etc.; also, the upper main piece of a mast composed of several pieces."},{"definition":"A reed."},{"definition":"A division of formation; A layer or member of a formation that pinches out in one direction."}],"partOfSpeech":"n"},{"definitions":[{"definition":"On a wind instrument, to articulate a note by starting the air with a tap of the tongue, as though by speaking a 'd' or 't' sound (alveolar plosive).","example":"Playing wind instruments involves tonguing on the reed or mouthpiece."},{"definition":"To manipulate with the tongue, as in kissing or oral sex."},{"definition":"To protrude in relatively long, narrow sections.","example":"a soil horizon that tongues into clay"},{"definition":"To join by means of a tongue and groove.","example":"to tongue boards together"},{"definition":"To talk; to prate."},{"definition":"To speak; to utter."},{"definition":"To chide; to scold."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tʌŋz/"}]},{"word":"DICTATOR","idx":21871,"count":1370656,"meanings":[{"definitions":[{"definition":"A totalitarian leader of a country, nation, or government.","example":"Dictators are always punished eventually."},{"definition":"A magistrate without colleague in republican Ancient Rome, who held full executive authority for a term granted by the senate (legislature), typically to conduct a war."},{"definition":"A tyrannical boss or authority figure."},{"definition":"A person who dictates text (e.g. letters to a clerk)."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"dictator-us","text":"/ˈdɪkteɪtəɹ/"}]},{"word":"FANATICS","idx":21874,"count":1370272,"meanings":[{"definitions":[{"definition":"A person who is zealously enthusiastic for some cause, especially in religion."}],"partOfSpeech":"n"}]},{"word":"PERPENDICULAR","idx":21878,"count":1369633,"meanings":[{"definitions":[{"definition":"A line or plane that is perpendicular to another."},{"definition":"A device such as a plumb line that is used in making or marking a perpendicular line."},{"definition":"A meal eaten at a tavern bar while standing up."}],"partOfSpeech":"n"},{"definitions":[{"definition":"At or forming a right angle (to something).","example":"In most houses, the walls are perpendicular to the floor."},{"definition":"Exactly upright; extending in a straight line toward the centre of the earth, etc."},{"definition":"Independent of or irrelevant to each other; orthogonal."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"perpendicular-us","text":"/pɝ.pənˈdɪk.jə.lɚ/"}]},{"word":"PULASKI","idx":21880,"count":1369398,"meanings":[{"definitions":[{"definition":"A double-ended fire-fighting tool, usually long-handled, and having an ax-blade on one side and a mattock-blade on the other."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pʊˈlæski/"}]},{"word":"MANTRA","idx":21881,"count":1369355,"meanings":[{"definitions":[{"definition":"The hymn portions of the Vedas; any passage of these used as a prayer."},{"definition":"(originally Hinduism) A phrase repeated to assist concentration during meditation."},{"definition":"(by extension) A slogan or phrase often repeated."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmæn.tɹə/"}]},{"word":"SOURCED","idx":21882,"count":1369225,"meanings":[{"definitions":[{"definition":"To obtain or procure: used especially of a business resource."},{"definition":"To find information about (a quotation)'s source (from which it comes): to find a citation for."}],"partOfSpeech":"ve"}]},{"word":"CAROUSEL","idx":21883,"count":1369112,"meanings":[{"definitions":[{"definition":"A merry-go-round (type of ride on rotating platform)."},{"definition":"A continuously revolving device for item delivery.","example":"After collecting his suitcase at the baggage carousel, he left the airport."},{"definition":"The rotating glass plate in a microwave oven."},{"definition":"A visual component that displays a horizontal series of items one at a time."},{"definition":"An equestrian discipline in which groups of riders make various formations."},{"definition":"A tilting match or tournament accompanied by games, shows, and allegorical performances."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæɹəsɛl/"},{"text":"/ˌkærəˈsɛl/"}]},{"word":"FAY","idx":21884,"count":1368931,"meanings":[{"definitions":[{"definition":"To fit."},{"definition":"To join or unite closely or tightly."},{"definition":"To lie close together."},{"definition":"To fadge."},{"definition":"To cleanse; clean out."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Fitted closely together."},{"definition":"Fairy like."},{"definition":"White; white-skinned."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A fairy."},{"definition":"A white person."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"fay-au","text":"/feɪ/"}]},{"word":"HEDGEHOG","idx":21886,"count":1368651,"meanings":[{"definitions":[{"definition":"A small mammal, of the family Erinaceidae or subfamily Erinaceinae (spiny hedgehog, the latter characterized by their spiny back and often by the habit of rolling up into a ball when attacked.)"},{"definition":"Any of several spiny mammals, such as the porcupine, that are similar to the hedgehog."},{"definition":"A type of moveable military barricade made from crossed logs or steel bars, laced with barbed wire, used to damage or impede tanks and vehicles; Czech hedgehog."},{"definition":"A spigot mortar-type of depth charge weapon from World War II that simultaneously fires a number of explosives into the water to create a pattern of underwater explosions intended to attack submerged submarines."},{"definition":"A type of chocolate cake (or slice), somewhat similar to an American brownie."},{"definition":"A form of dredging machine."},{"definition":"Certain flowering plants with parts resembling a member of family Erinaceidae"},{"definition":"The edible fungus Hydnum repandum."},{"definition":"A kind of electrical transformer with open magnetic circuit, the ends of the iron wire core being turned outward and presenting a bristling appearance."},{"definition":"A way of serving food at a party, consisting of a half melon or potato etc. with individual cocktail sticks of cheese and pineapple stuck into it."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make use of a hedgehog barricade as a defensive maneuver."},{"definition":"To array with spiky projections like the quills of a hedgehog."},{"definition":"To curl up into a defensive ball."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"hedgehog-au","text":"/ˈhɛdʒhɒɡ/"}]},{"word":"RAVES","idx":21887,"count":1368538,"meanings":[{"definitions":[{"definition":"An enthusiastic review (such as of a play)."},{"definition":"An all-night dance party with electronic dance music (techno, trance, drum and bass etc.) and possibly drug use."},{"definition":"The genres of electronic dance music usually associated with rave parties."},{"definition":"One of the upper side pieces of the frame of a wagon body or a sleigh."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To wander in mind or intellect; to be delirious; to talk or act irrationally; to be wild, furious, or raging."},{"definition":"To speak or write wildly or incoherently."},{"definition":"To talk with unreasonable enthusiasm or excessive passion or excitement; followed by about, of, or (formerly) on.","example":"He raved about her beauty."},{"definition":"To rush wildly or furiously."},{"definition":"To attend a rave (dance party)."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ɹeɪvz/"}]},{"word":"MAMMA","idx":21888,"count":1368416,"meanings":[{"definitions":[{"definition":"The milk-secreting organ of female humans and other mammals which includes the mammary gland and the nipple or teat; a breast; an udder. (plural: mammae)"},{"definition":"An accessory cloud like a mammary in appearance, which can form on the underside of most cloud genera"},{"definition":"(hypocoristic, usually childish) Mother, female parent."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmæmə/"}]},{"word":"ENTAILS","idx":21889,"count":1368267,"meanings":[{"definitions":[{"definition":"To imply or require.","example":"This activity will entail careful attention to detail."},{"definition":"To settle or fix inalienably on a person or thing, or on a person and his descendants or a certain line of descendants; -- said especially of an estate; to bestow as a heritage."},{"definition":"To appoint hereditary possessor."},{"definition":"To cut or carve in an ornamental way."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"That which is entailed. Hence:"},{"definition":"Delicately carved ornamental work; intaglio."}],"partOfSpeech":"n"}]},{"word":"FOLLY","idx":21890,"count":1367992,"meanings":[{"definitions":[{"definition":"Foolishness.","example":"It'd be folly."},{"definition":"Thoughtless action resulting in tragic consequence."},{"definition":"A fanciful building built for purely ornamental reasons."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"folly-us","text":"/ˈfɑli/"}]},{"word":"THERMOSTAT","idx":21891,"count":1367967,"meanings":[{"definitions":[{"definition":"A device that automatically responds to changes in temperature by activating a heating or cooling system to maintain the temperature at a desired setting."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈθɝmoʊstæt/"}]},{"word":"WHEELING","idx":21892,"count":1367716,"meanings":[{"definitions":[{"definition":"To roll along on wheels.","example":"Wheel that trolley over here, would you?"},{"definition":"To transport something or someone using any wheeled mechanism, such as a wheelchair."},{"definition":"To ride a bicycle or tricycle."},{"definition":"To change direction quickly, turn, pivot, whirl, wheel around."},{"definition":"To cause to change direction quickly, turn."},{"definition":"To travel around in large circles, particularly in the air.","example":"The vulture wheeled above us."},{"definition":"To put into a rotatory motion; to cause to turn or revolve; to make or perform in a circle."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The motion of something that wheels.","example":"the wheelings of birds in the sky"},{"definition":"The act of moving or conveying on wheels."}],"partOfSpeech":"n"}]},{"word":"INFARCTION","idx":21894,"count":1367559,"meanings":[{"definitions":[{"definition":"The process which causes an infarct."},{"definition":"An infarct."}],"partOfSpeech":"n"}]},{"word":"HAWTHORN","idx":21895,"count":1367531,"meanings":[{"definitions":[{"definition":"Any of various shrubs and small trees of the genus Crataegus having small, apple-like fruits and thorny branches"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈhɔ.θɔɹn/"},{"text":"/ˈhɔː.θɔːn/"}]},{"word":"MURAL","idx":21896,"count":1367338,"meanings":[{"definitions":[{"definition":"A large painting, usually drawn on a wall."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To create a mural."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Of or relating to a wall; on, or in, or against a wall.","example":"a mural quadrant"},{"definition":"Resembling a wall; perpendicular or steep.","example":"a mural precipice"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"mural-us","text":"/ˈmjɝəl/"}]},{"word":"BANKRUPT","idx":21897,"count":1367273,"meanings":[{"definitions":[{"definition":"One who becomes unable to pay his or her debts; an insolvent person."},{"definition":"A trader who secretes himself, or does certain other acts tending to defraud his creditors."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To force into bankruptcy."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"In a condition of bankruptcy; unable to pay one's debts.","example":"a bankrupt merchant"},{"definition":"Having been legally declared insolvent."},{"definition":"Destitute of, or wholly lacking (something once possessed, or something one should possess).","example":"a morally bankrupt politician"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"bankrupt-uk","text":"/ˈbæŋ.kɹəpt/"}]},{"word":"POLYPROPYLENE","idx":21898,"count":1367126,"meanings":[{"definitions":[{"definition":"A thermoplastic resin made by the polymerization of propylene, and used for films, fibres, or moulding materials. Also known as polypropene."}],"partOfSpeech":"n"}]},{"word":"MAILBOXES","idx":21899,"count":1367074,"meanings":[{"definitions":[{"definition":"A box into which mail is put"},{"definition":"A folder or account for the storage of e-mail; an electronic in-box or mailstore."}],"partOfSpeech":"n"}]},{"word":"WAGER","idx":21902,"count":1366964,"meanings":[{"definitions":[{"definition":"Something deposited, laid, or hazarded on the event of a contest or an unsettled question; a bet; a stake; a pledge."},{"definition":"That on which bets are laid; the subject of a bet."},{"definition":"A contract by which two parties or more agree that a certain sum of money, or other thing, shall be paid or delivered to one of them, on the happening or not happening of an uncertain event."},{"definition":"An offer to make oath."},{"definition":"Agent noun of wage; one who wages."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To bet something; to put it up as collateral","example":"I'd wager my boots on it."},{"definition":"To suppose; to dare say.","example":"I'll wager that Johnson knows something about all this."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"wager-us","text":"/ˈweɪdʒɚ/"}]},{"word":"TUNDRA","idx":21903,"count":1366669,"meanings":[{"definitions":[{"definition":"A flat and treeless Arctic biome."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tundra-us","text":"/ˈtʌndɹə/"},{"audio":"tundra-au","text":"/ˈtʌndɹə/"}]},{"word":"VARS","idx":21904,"count":1366514,"meanings":[{"definitions":[{"definition":"A unit of electrical power, in an AC circuit, equal to the power dissipated when 1 volt produces a current of 1 ampere."},{"definition":"Something that is variable."},{"definition":"Something whose value may be dictated or discovered.","example":"There are several variables to consider here."},{"definition":"A quantity that may assume any one of a set of values."},{"definition":"A symbol representing a variable."},{"definition":"A named memory location in which a program can store intermediate results and from which it can read them."},{"definition":"A variable star."},{"definition":"A shifting wind, or one that varies in force."},{"definition":"(in the plural) Those parts of the sea where a steady wind is not expected, especially the parts between the trade-wind belts."},{"definition":"The act of varying or the state of being variable."},{"definition":"A difference between what is expected and what is observed; deviation."},{"definition":"The state of differing or being in conflict."},{"definition":"An official permit to do something that is ordinarily forbidden by regulations."},{"definition":"A discrepancy between two legal documents."},{"definition":"A departure from a cause of action originally in a complaint."},{"definition":"The second central moment in probability."},{"definition":"The number of degrees of freedom in a system."},{"definition":"Covariance and contravariance generally.","example":"Depending on the variance of the type constructor, the subtyping relation of the simple types may be either preserved, reversed, or ignored for the respective complex types."}],"partOfSpeech":"n"}]},{"word":"FARMLAND","idx":21906,"count":1366419,"meanings":[{"definitions":[{"definition":"Land that is suitable for farming and agricultural production."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈfɑːɹmlænd/"},{"text":"/ˈfɑːmlænd/"}]},{"word":"PURGE","idx":21907,"count":1366135,"meanings":[{"definitions":[{"definition":"An act of purging."},{"definition":"An evacuation of the bowels or a vomiting."},{"definition":"A cleansing of pipes."},{"definition":"A forcible removal of people, for example, from political activity.","example":"Stalin liked to ensure that his purges were not reversible."},{"definition":"That which purges; especially, a medicine that evacuates the intestines; a cathartic."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To clean thoroughly; to cleanse; to rid of impurities."},{"definition":"To free from sin, guilt, or the burden or responsibility of misdeeds"},{"definition":"To remove by cleansing; to wash away."},{"definition":"To void or evacuate (the bowels or the stomach); to defecate or vomit."},{"definition":"To cause someone to purge, operate on (somebody) as or with a cathartic or emetic, or in a similar manner."},{"definition":"To clear of a charge, suspicion, or imputation"},{"definition":"To clarify; to clear the dregs from (liquor)."},{"definition":"To become pure, as by clarification."},{"definition":"To have or produce frequent evacuations from the intestines, as by means of a cathartic."},{"definition":"To trim, dress or prune."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"purge-us","text":"/pɝdʒ/"}]},{"word":"SKATER","idx":21908,"count":1366115,"meanings":[{"definitions":[{"definition":"A person who skates."},{"definition":"A member of skateboarding subculture, characterized by dingy and baggy clothes, and often wallet chains."},{"definition":"A player who is not a goaltender."},{"definition":"Any of numerous hemipterous insects in the family Gerridae, which run rapidly over the surface of the water, as if skating."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈskeɪ.tə(ɹ)/"}]},{"word":"INTERPOLATION","idx":21911,"count":1365967,"meanings":[{"definitions":[{"definition":"An abrupt change in elements, with continuation of the first idea."},{"definition":"The process of estimating the value of a function at a point from its values at nearby points."},{"definition":"The process of including and processing externally-fetched data in a document or program; see interpolate."},{"definition":"That which is introduced or inserted, especially something foreign or spurious."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ɪnˌtɜː(ɹ)pəˈleɪʃən/"}]},{"word":"ADJOURNMENT","idx":21912,"count":1365842,"meanings":[{"definitions":[{"definition":"The state of being adjourned, or action of adjourning.","example":"At midnight we made a motion for adjournment and everyone went home tired."},{"definition":"Ampliatio."}],"partOfSpeech":"n"}]},{"word":"PITFALLS","idx":21913,"count":1365762,"meanings":[{"definitions":[{"definition":"A potential problem, hazard, or danger that is easily encountered but not immediately obvious.","example":"It's usually a simple task, but you should know the pitfalls before you attempt it yourself."},{"definition":"A type of trap consisting of a concealed hole in the ground: victims fall into the hole and are unable to escape."},{"definition":"An antipattern."}],"partOfSpeech":"n"}]},{"word":"DISRUPT","idx":21914,"count":1365748,"meanings":[{"definitions":[{"definition":"To throw into confusion or disorder.","example":"Hecklers disrupted the man's speech."},{"definition":"To interrupt or impede.","example":"Work on the tunnel was disrupted by a strike."},{"definition":"To improve a product or service in ways that displace an established one and surprise the market.","example":"The internet makes it easier for leaner businesses to disrupt the larger and more unwieldy ones."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Torn off or torn asunder; severed; disrupted."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disrupt-us"},{"text":"/dɪsˈɹʌpt/"}]},{"word":"STATIONED","idx":21915,"count":1365418,"meanings":[{"definitions":[{"definition":"(usually passive) To put in place to perform a task.","example":"I was stationed on the pier."},{"definition":"To put in place to perform military duty.","example":"I was stationed at Fort Richie."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stationed-us","text":"/ˈstɛɪʃənd/"}]},{"word":"NIGHTMARES","idx":21917,"count":1365166,"meanings":[{"definitions":[{"definition":"A demon or monster, thought to plague people while they slept and cause a feeling of suffocation and terror during sleep."},{"definition":"Sleep paralysis."},{"definition":"A very bad or frightening dream.","example":"I had a nightmare that I tried to run but could neither move nor breathe."},{"definition":"Any bad, miserable, difficult or terrifying situation or experience that arouses anxiety, terror, agony or great displeasure.","example":"Cleaning up after identity theft can be a nightmare of phone calls and letters."}],"partOfSpeech":"n"}]},{"word":"RAMPAGE","idx":21918,"count":1365049,"meanings":[{"definitions":[{"definition":"A course of violent, frenzied action."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To move about wildly or violently."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈɹæmpeɪdʒ/"}]},{"word":"AGGRAVATED","idx":21919,"count":1365039,"meanings":[{"definitions":[{"definition":"To make (an offence) worse or more severe; to increase in offensiveness or heinousness."},{"definition":"(by extension) To make worse; to exacerbate."},{"definition":"To give extra weight or intensity to; to exaggerate, to magnify.","example":"He aggravated the story."},{"definition":"To pile or heap (something heavy or onerous) on or upon someone."},{"definition":"To exasperate; to provoke or irritate."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having been the subject of aggravation; frustrated and angry."}],"partOfSpeech":"j"}]},{"word":"FINK","idx":21920,"count":1364952,"meanings":[{"definitions":[{"definition":"A contemptible person."},{"definition":"An informer."},{"definition":"A strikebreaker."},{"definition":"Any of several birds in the family Ploceidae native to southern Africa."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To betray a trust; to inform on."},{"definition":"To ponder, to go over in one's head.","example":"Idly, the detective thought what his next move should be."},{"definition":"To communicate to oneself in one's mind, to try to find a solution to a problem.","example":"I thought for three hours about the problem and still couldn’t find the solution."},{"definition":"To conceive of something or someone (usually followed by of; infrequently, by on).","example":"I tend to think of her as rather ugly."},{"definition":"To be of opinion (that); to consider, judge, regard, or look upon (something) as.","example":"At the time I thought his adamant refusal to give in right."},{"definition":"To guess; to reckon.","example":"I think she’ll pass the examination."},{"definition":"To plan; to be considering; to be of a mind (to do something)."},{"definition":"To presume; to venture."},{"definition":"To seem, to appear."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"fink-au","text":"/fɪŋk/"}]},{"word":"DEEM","idx":21922,"count":1364711,"meanings":[{"definitions":[{"definition":"An opinion, a judgment, a surmise."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To judge, to pass judgment on; to doom, to sentence."},{"definition":"To adjudge, to decree."},{"definition":"To dispense (justice); to administer (law)."},{"definition":"(ditransitive) To hold in belief or estimation; to adjudge as a conclusion; to regard as being; to evaluate according to one's beliefs; to account.","example":"She deemed his efforts insufficient."},{"definition":"To think, judge, or have or hold as an opinion; to decide or believe on consideration; to suppose."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/dim/"},{"text":"/diːm/"},{"audio":"deem-au"}]},{"word":"CAVERN","idx":21926,"count":1364330,"meanings":[{"definitions":[{"definition":"A large cave."},{"definition":"An underground chamber."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To form a cavern or deep depression in.","example":"catacombs caverning the hillsides"},{"definition":"To put into a cavern."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈkæv.ɚn/"},{"text":"/ˈkæv.ən/"}]},{"word":"DESCENDED","idx":21929,"count":1363212,"meanings":[{"definitions":[{"definition":"To pass from a higher to a lower place; to move downwards; to come or go down in any way, for example by falling, flowing, walking, climbing etc.","example":"The rain descended, and the floods came."},{"definition":"To enter mentally; to retire."},{"definition":"(with on or upon) To make an attack, or incursion, as if from a vantage ground; to come suddenly and with violence.","example":"And on the suitors let thy wrath descend."},{"definition":"To come down to a lower, less fortunate, humbler, less virtuous, or worse, state or rank; to lower or abase oneself","example":"he descended from his high estate"},{"definition":"To pass from the more general or important to the specific or less important matters to be considered."},{"definition":"To come down, as from a source, original, or stock"},{"definition":"To be derived (from)"},{"definition":"To proceed by generation or by transmission; to happen by inheritance.","example":"A crown descends to the heir."},{"definition":"To move toward the south, or to the southward."},{"definition":"To fall in pitch; to pass from a higher to a lower tone."},{"definition":"To go down upon or along; to pass from a higher to a lower part of","example":"they descended the river in boats; to descend a ladder"}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"descended-us","text":"/dɪˈsɛndɪd/"}]},{"word":"DISGUSTING","idx":21930,"count":1363181,"meanings":[{"definitions":[{"definition":"To cause an intense dislike for something.","example":"It disgusts me to see her chew with her mouth open."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Causing disgust; repulsive; distasteful."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"disgusting-us","text":"/dɪsˈkʌstɪŋ/"}]},{"word":"FLAX","idx":21931,"count":1363175,"meanings":[{"definitions":[{"definition":"A plant of the genus Linum, especially Linum usitatissimum, which has a single, slender stalk, about a foot and a half high, with blue flowers. Also known as linseed, especially when referring to the seeds."},{"definition":"The fibers of Linum usitatissimum, grown to make linen and related textiles."},{"definition":"The flax bush, a plant of the genus Phormium, native to New Zealand, with strap-like leaves up to 3 metres long that grow in clumps."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/flæks/"}]},{"word":"WEAKENED","idx":21932,"count":1363046,"meanings":[{"definitions":[{"definition":"To make weaker or less strong."},{"definition":"To become weaker or less strong."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Reduced, made less strong.","example":"His weakened immune system couldn't cope with the infection."}],"partOfSpeech":"j"}]},{"word":"IMPOSES","idx":21933,"count":1362910,"meanings":[{"definitions":[{"definition":"To establish or apply by authority.","example":"Congress imposed new tariffs."},{"definition":"To be an inconvenience (on or upon)","example":"I don't wish to impose upon you."},{"definition":"To enforce: compel to behave in a certain way","example":"Social relations impose courtesy"},{"definition":"To practice a trick or deception (on or upon)."},{"definition":"To lay on, as the hands, in the religious rites of confirmation and ordination."},{"definition":"To arrange in proper order on a table of stone or metal and lock up in a chase for printing; said of columns or pages of type, forms, etc."}],"partOfSpeech":"ve"}]},{"word":"WITHDREW","idx":21934,"count":1362840,"meanings":[{"definitions":[{"definition":"To pull (something) back, aside, or away."},{"definition":"To stop talking to, or interacting with, other people and start thinking thoughts that are not related to what is happening around."},{"definition":"To take back (a comment, etc); retract.","example":"to withdraw false charges"},{"definition":"To remove, to stop providing (one's support, etc); to take out of service."},{"definition":"To extract (money from an account)."},{"definition":"To retreat."},{"definition":"To be in withdrawal from an addictive drug etc."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"withdrew-us","text":"/wɪð.dɹu/"}]},{"word":"ALIASING","idx":21935,"count":1362818,"meanings":[{"definitions":[{"definition":"To assign an additional name to an entity, often a more user-friendly one."},{"definition":"(of two signals) to become indistinguishable"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"(graphics, sound recording) Distortion caused by a low sampling rate, such as a moiré effect or jaggies."}],"partOfSpeech":"n"}]},{"word":"TART","idx":21937,"count":1362374,"meanings":[{"definitions":[{"definition":"Sharp to the taste; acid; sour.","example":"I ate a very tart apple."},{"definition":"(of wine) high or too high in acidity."},{"definition":"Sharp; keen; severe.","example":"He gave me a very tart reply."}],"partOfSpeech":"j"},{"definitions":[{"definition":"A type of small open pie, or piece of pastry, containing jelly or conserve; a sort of fruit pie."},{"definition":"A prostitute."},{"definition":"By extension, any woman with loose sexual morals."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To practice prostitution"},{"definition":"To practice promiscuous sex"},{"definition":"To dress garishly, ostentatiously, whorishly, or sluttily"}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɑɹt/"},{"text":"/tɑːt/"},{"audio":"tart-au"}]},{"word":"GUERRILLA","idx":21938,"count":1362022,"meanings":[{"definitions":[{"definition":"A soldier in a small independent group, fighting against the government or regular forces by surprise raids."},{"definition":"A non-official war carried out by small independent groups; a guerrilla war."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Relating to, using, or typical of guerrilla warfare, or its principles of small independent or non-official perpetrators."},{"definition":"Relating to, using, or typical of guerrilla marketing."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ɡəˈɹɪlə/"}]},{"word":"SOLVES","idx":21939,"count":1361886,"meanings":[{"definitions":[{"definition":"To find an answer or solution to a problem or question; to work out."},{"definition":"To find the values of variables that satisfy a system of equations and/or inequalities."},{"definition":"To algebraically manipulate an equation or inequality into a form that isolates a chosen variable on one side, so that the other side consists of an expression that may be used to generate solutions."},{"definition":"To loosen or separate the parts of."}],"partOfSpeech":"ve"}]},{"word":"SPOONS","idx":21941,"count":1361668,"meanings":[{"definitions":[{"definition":"To sail briskly with the wind astern, with or without sails hoisted."},{"definition":"To serve using a spoon; to transfer (something) with a spoon.","example":"Sarah spooned some apple sauce onto her plate."},{"definition":"To flirt; to make advances; to court, to interact romantically or amorously."},{"definition":"(of persons) To lie nestled front-to-back, following the contours of the bodies, in a manner reminiscent of stacked spoons."},{"definition":"To hit (the ball) weakly, pushing it with a lifting motion, instead of striking with an audible knock."},{"definition":"To fish with a concave spoon bait."},{"definition":"To catch by fishing with a concave spoon bait."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"An implement for eating or serving; a scooped utensil whose long handle is straight, in contrast to a ladle."},{"definition":"An implement for stirring food while being prepared; a wooden spoon."},{"definition":"A measure that will fit into a spoon; a spoonful."},{"definition":"A wooden-headed golf club with moderate loft, similar to the modern three wood."},{"definition":"An oar."},{"definition":"A type of metal lure resembling the concave head of a tablespoon."},{"definition":"A spoon excavator."},{"definition":"A simpleton, a spooney."},{"definition":"A safety handle on a hand grenade, a trigger."},{"definition":"A metaphoric unit of energy available to cope with problems."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Foolishly infatuated with; having a romantic crush on (used with on)."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"spoons-uk","text":"/spuːnz/"}]},{"word":"PERSONA","idx":21943,"count":1361500,"meanings":[{"definitions":[{"definition":"A social role."},{"definition":"A character played by an actor."},{"definition":"The mask or appearance one presents to the world."},{"definition":"(user experience) An imaginary person representing a particular type of client or customer, considered when designing products and services that will appeal to them."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/pɝˈsoʊnə/"},{"text":"/pə(ɹ)ˈsəʊnə/"}]},{"word":"OSCARS","idx":21944,"count":1361177,"meanings":[{"definitions":[{"definition":"Astronotus ocellatus, a cichlid fish, native to South America, sometimes kept in aquariums."}],"partOfSpeech":"n"}]},{"word":"POSER","idx":21945,"count":1361002,"meanings":[{"definitions":[{"definition":"A particularly difficult question or puzzle."},{"definition":"Someone who asks a question or sets a problem.","example":"Even as a child, she was a habitual poser of difficult questions."},{"definition":"Someone who, or something which, poses; a person who sets their body in a fixed position, such as for photography or painting."},{"definition":"A poseur; someone who affects some behaviour, style, attitude or other condition, often to impress or influence others."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈpoʊzɚ/"},{"text":"/ˈpəʊzə(ɹ)/"},{"audio":"poser-au"}]},{"word":"BOOSTING","idx":21946,"count":1360956,"meanings":[{"definitions":[{"definition":"To lift or push from behind (one who is endeavoring to climb); to push up."},{"definition":"(by extension) To help or encourage (something) to increase or improve; to assist in overcoming obstacles.","example":"This campaign will boost your chances of winning the election."},{"definition":"To steal."},{"definition":"To jump-start a vehicle by using cables to connect the battery in a running vehicle to the battery in a vehicle that won't start."},{"definition":"To give a booster shot to."},{"definition":"To amplify; to signal boost."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"The act or process by which something is boosted."}],"partOfSpeech":"n"}]},{"word":"TRAM","idx":21949,"count":1360948,"meanings":[{"definitions":[{"definition":"A passenger vehicle for public use that runs on tracks in the road (called a streetcar or trolley in North America)."},{"definition":"A similar vehicle for carrying materials."},{"definition":"A people mover."},{"definition":"An aerial cable car."},{"definition":"A train with wheels that runs on a road; a trackless train."},{"definition":"A car on a horse railway or tramway (horse trams preceded electric trams)."},{"definition":"The shaft of a cart."},{"definition":"One of the rails of a tramway."},{"definition":"A silk thread formed of two or more threads twisted together, used especially for the weft, or cross threads, of the best quality of velvets and silk goods."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To operate, or conduct the business of, a tramway."},{"definition":"To travel by tram."},{"definition":"To transport (material) by tram."},{"definition":"To align a component in mechanical engineering or metalworking, particularly the head of a drill press."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/tɹæm/"},{"text":"/tɹam/"},{"audio":"tram-au"}]},{"word":"DISTINCTIONS","idx":21950,"count":1360738,"meanings":[{"definitions":[{"definition":"That which distinguishes; a single occurrence of a determining factor or feature, the fact of being divided; separation, discrimination."},{"definition":"The act of distinguishing, discriminating; discrimination.","example":"There is a distinction to be made between resting and slacking."},{"definition":"Specifically, a feature that causes someone or something to stand out as being better; a mark of honour, rank, eminence or excellence; being distinguished.","example":"She had the distinction of meeting the Queen."}],"partOfSpeech":"n"}]},{"word":"POWERHOUSE","idx":21951,"count":1360693,"meanings":[{"definitions":[{"definition":"A power station."},{"definition":"Any source of power, energy or strength.","example":"She's a powerhouse of ideas."},{"definition":"A very good hand of cards, likely to win."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"powerhouse-us"}]},{"word":"DEODORANT","idx":21953,"count":1360554,"meanings":[{"definitions":[{"definition":"Any agent acting to eliminate, reduce, mask, or control odor."},{"definition":"An odor-controlling substance applied to the underarm to counteract odor from perspiration."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Acting or including an agent to eliminate, reduce, mask, or control odor"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"deodorant-us","text":"/diˈoʊdəɹənt/"}]},{"word":"COMPULSIVE","idx":21956,"count":1360158,"meanings":[{"definitions":[{"definition":"One who exhibits compulsive behaviours."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Uncontrolled or reactive and irresistible."},{"definition":"Having power to compel; exercising or applying compulsion."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"compulsive-uk","text":"/kəmˈpʌlsɪv/"}]},{"word":"ICED","idx":21957,"count":1360088,"meanings":[{"definitions":[{"definition":"With ice added.","example":"I'd like an iced tea."},{"definition":"Very cold, but not necessarily containing ice.","example":"an iced drink"},{"definition":"Covered with icing.","example":"an iced cake"}],"partOfSpeech":"j"},{"definitions":[{"definition":"To cool with ice, as a beverage."},{"definition":"To become ice; to freeze."},{"definition":"To make icy; to freeze."},{"definition":"To murder."},{"definition":"To cover with icing (frosting made of sugar and milk or white of egg); to frost; as cakes, tarts, etc."},{"definition":"To put out a team for a match.","example":"Milton Keynes have yet to ice a team this season"},{"definition":"To shoot the puck the length of the playing surface, causing a stoppage in play called icing.","example":"If the Bruins ice the puck, the faceoff will be in their own zone."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"iced-uk","text":"/ˈaɪst/"}]},{"word":"PERKY","idx":21958,"count":1360009,"meanings":[{"definitions":[{"definition":"Lively or enthusiastic.","example":"She answered with a perky smile and bounced off."},{"definition":"Standing upright; firm.","example":"The plant looks much perkier since I watered it."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈpɝki/"}]},{"word":"REINFORCING","idx":21960,"count":1359602,"meanings":[{"definitions":[{"definition":"To strengthen, especially by addition or augmentation.","example":"He reinforced the handle with a metal rod and a bit of tape."},{"definition":"To emphasize or review.","example":"The right homework will reinforce and complement the lesson!"},{"definition":"To encourage (a behavior or idea) through repeated stimulus.","example":"Advertising for fast food can reinforce unhealthy dietary tendencies."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Something that reinforces.","example":"The reinforcing for the roof will be installed before the hurricane season begins."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Used to reinforce.","example":"The reinforcing wire has to wrapped in tension to be effective ins trengthening the main part."}],"partOfSpeech":"j"}]},{"word":"SCARCELY","idx":21961,"count":1359474,"meanings":[{"definitions":[{"definition":"(modal) Probably not.","example":"One could scarcely find any trout in the stream without the stocking program."},{"definition":"(modal) Certainly not.","example":"One could scarcely expect the man to know how to fly a helicopter."},{"definition":"(degree) Almost not at all; by a small margin."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"scarcely-us","text":"/ˈskɛɹsli/"}]},{"word":"EXTENSIBLE","idx":21962,"count":1359254,"meanings":[{"definitions":[{"definition":"Capable of being extended."}],"partOfSpeech":"j"}]},{"word":"EXCUSED","idx":21963,"count":1359136,"meanings":[{"definitions":[{"definition":"To forgive; to pardon.","example":"I excused him his transgressions."},{"definition":"To allow to leave, or release from any obligation.","example":"I excused myself from the proceedings to think over what I'd heard."},{"definition":"To provide an excuse for; to explain, with the aim of alleviating guilt or negative judgement.","example":"You know he shouldn't have done it, so don't try to excuse his behavior!"},{"definition":"To relieve of an imputation by apology or defense; to make apology for as not seriously evil; to ask pardon or indulgence for."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"excused-us","text":"/ɛksˈkjuːzd/"}]},{"word":"FUSED","idx":21965,"count":1359038,"meanings":[{"definitions":[{"definition":"To melt together; to blend; to mix indistinguishably."},{"definition":"To melt together."},{"definition":"To furnish with or install a fuse."},{"definition":"To form a bicyclic compound from two similar or different types of ring such that two or more atoms are shared between the resulting rings"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Joined together by fusing"},{"definition":"Melted"},{"definition":"Furnished with a fuse"},{"definition":"Having at least one bond between two atoms that is part of two or more separate rings"}],"partOfSpeech":"j"}],"phonetics":[{"text":"/fjuːzd/"}]},{"word":"CATHETER","idx":21966,"count":1358691,"meanings":[{"definitions":[{"definition":"A small tube inserted into a body cavity to administer a drug, create an opening, distend a passageway, or remove fluid."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈkæθɪt̬ɚ/"},{"text":"/ˈkæθɪtə(ɹ)/"},{"audio":"catheter-au"}]},{"word":"MADELEINE","idx":21967,"count":1358505,"meanings":[{"definitions":[{"definition":"A French type of small gateau or sponge cake, often shaped like an elongated scallop shell."},{"definition":"Something which brings back a memory; a source of nostalgia or evocative memories."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"madeleine-us","text":"/ˈmædələn/"}]},{"word":"ROARING","idx":21968,"count":1358322,"meanings":[{"definitions":[{"definition":"To make a loud, deep cry, especially from pain, anger, or other strong emotion."},{"definition":"To laugh in a particularly loud manner.","example":"The audience roared at his jokes."},{"definition":"Of animals (especially the lion), to make a loud deep noise.","example":"The lioness roared to scare off the hyenas."},{"definition":"Generally, of inanimate objects etc., to make a loud resounding noise."},{"definition":"To proceed vigorously."},{"definition":"To cry aloud; to proclaim loudly."},{"definition":"To be boisterous; to be disorderly."},{"definition":"To make a loud noise in breathing, as horses do when they have a certain disease."},{"definition":"(North Midlands) to cry"}],"partOfSpeech":"ve"},{"definitions":[{"definition":"A loud, deep, prolonged sound, as of a large beast; a roar."},{"definition":"An affection of the windpipe of a horse, causing a loud, peculiar noise in breathing under exertion."},{"definition":"(North Midlands) to cry"}],"partOfSpeech":"n"},{"definitions":[{"definition":"Intensive; extreme."},{"definition":"Very successful; lively.","example":"The ice-cream sellers did a roaring trade in the midday heat."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈɹɔːɹɪŋ/"}]},{"word":"PRACTICUM","idx":21969,"count":1358209,"meanings":[{"definitions":[{"definition":"A college course designed to give a student supervised practical knowledge of a subject previously studied theoretically."},{"definition":"A science exam in which students are questioned about specimens or other objects placed in front of them."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"practicum-us","text":"/ˈpɹæk.tɪ.kəm/"}]},{"word":"WITCHCRAFT","idx":21970,"count":1358086,"meanings":[{"definitions":[{"definition":"The practice of witches; magic, sorcery or the use of supernatural powers to influence or predict events.","example":"Wiccans believe in a modernised form of witchcraft."},{"definition":"Something, such as an advanced technology, that seems almost magical."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈwɪt͡ʃkɹæft/"},{"text":"/ˈwɪt͡ʃkɹɑːft/"}]},{"word":"STOPPER","idx":21971,"count":1358043,"meanings":[{"definitions":[{"definition":"Agent noun of stop, someone or something that stops something."},{"definition":"A type of knot at the end of a rope, to prevent it from unravelling.","example":"Put a stopper in the knot."},{"definition":"A bung or cork.","example":"We need a stopper or the boat will sink."},{"definition":"Goalkeeper.","example":"He's the number one stopper in the country."},{"definition":"In the commodity futures market, someone who is long (owns) a futures contract and is demanding delivery because they want to take possession of the deliverable commodity.","example":"Cattle futures: spillover momentum plus evidence of a strong stopper (i.e., 96 loads demanded) should kick the opening higher."},{"definition":"A train that calls at all or almost all stations between its origin and destination, including very small ones."},{"definition":"Any of several trees of the genus Eugenia, found in Florida and the West Indies."},{"definition":"A short rope for making something fast."},{"definition":"A playspot where water flows back on itself, creating a retentive feature."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To close a container by using a stopper.","example":"He tightly stoppered the decanter, thinking the expensive liqueur had been evaporating."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stopper-au","text":"/ˈstɔp.ə/"}]},{"word":"FIBRES","idx":21972,"count":1357736,"meanings":[{"definitions":[{"definition":"A single piece of a given material, elongated and roughly round in cross-section, often twisted with other fibres to form thread.","example":"The microscope showed several different fibres stuck to the sole of the shoe."},{"definition":"Material in the form of fibres.","example":"The cloth was made from strange, somewhat rough fibre."},{"definition":"Dietary fibre.","example":"Fresh vegetables are a good source of fibre."},{"definition":"Moral strength and resolve.","example":"The ordeal was a test of everyone’s fibre."},{"definition":"The preimage of a given point in the range of a map.","example":"Under this map, any two values in the fibre of a given point on the circle differ by 2π"},{"definition":"Said to be of a morphism over a global element: The pullback of the said morphism along the said global element."},{"definition":"A kind of lightweight thread of execution."},{"definition":"A long tubular cell found in muscle tissue; myocyte."}],"partOfSpeech":"n"}]},{"word":"PHOTOCOPY","idx":21973,"count":1357693,"meanings":[{"definitions":[{"definition":"A copy made using a photocopier."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a copy using a photocopier."}],"partOfSpeech":"ve"}]},{"word":"ZIPCODE","idx":21975,"count":1357623,"meanings":[{"definitions":[{"definition":"A postal code, especially for addresses served by the US Postal Service, consisting of a five- or nine-figure number."}],"partOfSpeech":"n"}]},{"word":"CRESTED","idx":21978,"count":1357509,"meanings":[{"definitions":[{"definition":"Particularly with reference to waves, to reach a peak."},{"definition":"To reach the crest of (a hill or mountain)"},{"definition":"To furnish with, or surmount as, a crest; to serve as a crest for."},{"definition":"To mark with lines or streaks like waving plumes."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Having a crest, or ornamental tuft (on an animal) or plume (on a helmet)."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈkɹɛstɪd/"}]},{"word":"TIMEFRAME","idx":21982,"count":1357260,"meanings":[{"definitions":[{"definition":"The period of time during which something is expected to occur, or does occur."}],"partOfSpeech":"n"}]},{"word":"STUMP","idx":21983,"count":1357079,"meanings":[{"definitions":[{"definition":"The remains of something that has been cut off; especially the remains of a tree, the remains of a limb."},{"definition":"The place or occasion at which a campaign takes place; the husting."},{"definition":"A place or occasion at which a person harangues or otherwise addresses a group in a manner suggesting political oration."},{"definition":"One of three small wooden posts which together with the bails make the wicket and that the fielding team attempt to hit with the ball."},{"definition":"(drawing) An artists’ drawing tool made of rolled paper used to smudge or blend marks made with charcoal, Conté crayon, pencil or other drawing media."},{"definition":"A wooden or concrete pole used to support a house."},{"definition":"A leg.","example":"to stir one's stumps"},{"definition":"A pin in a tumbler lock which forms an obstruction to throwing the bolt except when the gates of the tumblers are properly arranged, as by the key."},{"definition":"A pin or projection in a lock to form a guide for a movable piece."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To stop, confuse, or puzzle."},{"definition":"To baffle; to make unable to find an answer to a question or problem.","example":"This last question has me stumped."},{"definition":"To campaign.","example":"He’s been stumping for that reform for months."},{"definition":"To travel over (a state, a district, etc.) giving speeches for electioneering purposes."},{"definition":"(of a wicket keeper) To get a batsman out stumped."},{"definition":"To bowl down the stumps of (a wicket)."},{"definition":"To walk heavily or clumsily, plod, trudge."},{"definition":"To reduce to a stump; to truncate or cut off a part of."},{"definition":"To strike unexpectedly; to stub, as the toe against something fixed."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"stump-us","text":"/stʌmp/"},{"audio":"stump-au","text":"/stʌmp/"}]},{"word":"SCALP","idx":21984,"count":1356840,"meanings":[{"definitions":[{"definition":"The top of the head; the skull."},{"definition":"The part of the head where the hair grows from, or used to grow from."},{"definition":"A part of the skin of the head, with the hair attached, formerly cut or torn off from an enemy by warriors in some cultures as a token of victory.","example":"Some tribes used to collect scalps to prove how many of the enemy they had killed in battle."},{"definition":"The skin of the head of a stag with the horns attached."},{"definition":"A victory, especially at the expense of someone else."},{"definition":"A bed or stratum of shellfish."},{"definition":"The top; the summit."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To remove the scalp (part of the head from where the hair grows), by brutal act or accident."},{"definition":"To resell, especially tickets, usually for an inflated price, often illegally.","example":"Tickets were being scalped for $300."},{"definition":"On an open outcry exchange trading floor, to buy and sell rapidly for one's own account, aiming to buy from a seller and a little later sell to a buyer, making a small profit from the difference (roughly the amount of the bid/offer spread, or less)."},{"definition":"To screen or sieve ore before further processing.","example":"scalped ore"},{"definition":"To remove the skin of."},{"definition":"To remove the grass from."},{"definition":"To destroy the political influence of."},{"definition":"(milling) To brush the hairs or fuzz from (wheat grains, etc.) in the process of high milling."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"scalp-us","text":"/skælp/"}]},{"word":"DISARMAMENT","idx":21986,"count":1356677,"meanings":[{"definitions":[{"definition":"The reduction or the abolition of the military forces and armaments of a nation, and of its capability to wage war."},{"definition":"The act of disarming an opponent in a fight."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/dɪsˈɑː(r)məmənt/"}]},{"word":"ACTIN","idx":21988,"count":1356491,"meanings":[{"definitions":[{"definition":"A globular structural protein that polymerizes in a helical fashion to form an actin filament (or microfilament)."},{"definition":"One of the six isoforms of actin."}],"partOfSpeech":"n"}]},{"word":"INTERVIEWER","idx":21990,"count":1356390,"meanings":[{"definitions":[{"definition":"One who interviews."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈɪntɚvjuɚ/"},{"text":"/ˈɪntəvjuːə/"}]},{"word":"CONDUCTORS","idx":21993,"count":1356348,"meanings":[{"definitions":[{"definition":"One who conducts or leads; a guide; a director."},{"definition":"A person who conducts an orchestra, choir or other music ensemble; a professional whose occupation is conducting."},{"definition":"A person who takes tickets on public transportation and also helps passengers","example":"train conductor; tram conductor"},{"definition":"Something that can transmit electricity, heat, light or sound."},{"definition":"An ideal of a ring that measures how far it is from being integrally closed"},{"definition":"A grooved sound or staff used for directing instruments, such as lithontriptic forceps; a director."},{"definition":"A leader."}],"partOfSpeech":"n"}]},{"word":"CRITICISMS","idx":21995,"count":1356135,"meanings":[{"definitions":[{"definition":"The act of criticising; a critical judgment passed or expressed","example":"The politician received a lot of public criticism for his controversial stance on the issue."},{"definition":"A critical observation or detailed examination and review."}],"partOfSpeech":"n"}]},{"word":"GASTROENTEROLOGY","idx":21999,"count":1355859,"meanings":[{"definitions":[{"definition":"The study of the digestive system, from mouth to anus. May also include the study of accessory organs: pancreas, liver, gallbladder and bile ducts."}],"partOfSpeech":"n"}]},{"word":"COMPOSTING","idx":22002,"count":1355576,"meanings":[{"definitions":[{"definition":"To produce compost, let organic matter decay into fertilizer.","example":"If you compost your grass clippings, you can improve your soil."}],"partOfSpeech":"ve"}]},{"word":"DIPLOMAT","idx":22003,"count":1355414,"meanings":[{"definitions":[{"definition":"A person, such as an ambassador, who is accredited to represent a government officially in its relations with other governments or international organisations"},{"definition":"Someone who uses skill and tact in dealing with other people"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈdɪ.plə.mæt/"}]},{"word":"UVA","idx":22007,"count":1355326,"meanings":[{"definitions":[{"definition":"A small pulpy or juicy fruit containing several seeds and having a thin skin, such as a grape."}],"partOfSpeech":"n"}]},{"word":"MELON","idx":22008,"count":1355214,"meanings":[{"definitions":[{"definition":"Any of various plants of the family Cucurbitaceae grown for food, generally not including the cucumber."},{"definition":"The fruit of such plants."},{"definition":"A light pinkish orange colour, like that of some melon flesh."},{"definition":"(usually in the plural) Breasts."},{"definition":"The head."},{"definition":"A member of the Green Party, or similar environmental group."},{"definition":"A mass of adipose tissue found in the forehead of all toothed whales, used to focus and modulate vocalizations."},{"definition":"The result of heptazine being polymerized with the tri-s-triazine units linked through an amine (NH) link."}],"partOfSpeech":"n"},{"definitions":[{"definition":"Of a light pinkish orange colour, like that of melon flesh."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"melon-us","text":"/ˈmɛlən/"},{"audio":"melon-au","text":"/ˈmɛlən/"}]},{"word":"TABLESPOON","idx":22010,"count":1355051,"meanings":[{"definitions":[{"definition":"A large spoon, used for eating food from a bowl."},{"definition":"A spoon too large for eating, usually used for cooking or serving."},{"definition":"A unit of volume, the value of which varies regionally; in the US: three teaspoons or roughly 15 ml; in Britain and Canada: exactly 15 ml; in Australia: four teaspoons or 20 ml."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"tablespoon-us","text":"/ˈteɪbəlˌspun/"}]},{"word":"MANGANESE","idx":22011,"count":1354932,"meanings":[{"definitions":[{"definition":"A metallic chemical element (symbol Mn) with an atomic number of 25, not a free element in nature but often found in minerals in combination with iron, and useful in industrial alloy production."},{"definition":"A single atom of this element."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈmæŋɡəniz/"},{"text":"/ˈmæŋɡəniːz/"}]},{"word":"SIREN","idx":22012,"count":1354779,"meanings":[{"definitions":[{"definition":"One of a group of nymphs who lured mariners to their death on the rocks."},{"definition":"One who sings sweetly and charms."},{"definition":"A dangerously seductive woman."},{"definition":"A member of an order of mammals of Sirenia (first attested in French in Dominique Bouhours, Les entretiens d'Ariste et d'Eugène, 1671)."},{"definition":"A member of a genus of aquatic salamanders of the family Sirenidae (originally introduced by Linnaeus, 1766, for a genus of his reptiles), commonly used for all species subsumed under the family of Sirenidae."},{"definition":"Any of various nymphalid butterflies of the genus Hestina."},{"definition":"A device, either mechanical or electronic, that makes a piercingly loud sound as an alarm or signal, or the sound from such a device (first recorded 1879)."},{"definition":"A musical instrument, one of the few aerophones in the percussion section of the symphony orchestra (patented as Acme Siren in 1895)."},{"definition":"An instrument for demonstrating the laws of beats and combination tones."},{"definition":"An astrophysical event that can be used for calculating cosmic distances."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To make a noise with, or as if with, a siren."}],"partOfSpeech":"ve"},{"definitions":[{"definition":"Relating to or like a siren."}],"partOfSpeech":"j"}],"phonetics":[{"text":"/ˈsaɪɹən/"},{"text":"/ˈsaɪəɹən/"}]},{"word":"OCEANOGRAPHY","idx":22013,"count":1354587,"meanings":[{"definitions":[{"definition":"The exploration and scientific study of the oceans and ocean floor."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˌoʊʃəˈnɑɡɹəfi/"},{"text":"/ˌəʊʃjəˈnɒɡɹəfi/"}]},{"word":"VASTLY","idx":22014,"count":1354491,"meanings":[{"definitions":[{"definition":"Greatly, in a vast manner."}],"partOfSpeech":"v"}],"phonetics":[{"audio":"vastly-us"}]},{"word":"CLASP","idx":22015,"count":1354393,"meanings":[{"definitions":[{"definition":"A fastener or holder, particularly one that clasps.","example":"I always have a hard time working the clasp on this necklace!"},{"definition":"(in the singular) An embrace, a grasp, or handshake.","example":"He took her hand in a firm clasp."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To take hold of; to grasp; to grab tightly.","example":"They clasped hands and parted as friends."},{"definition":"To shut or fasten together with, or as if with, a clasp."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"clasp-us","text":"/klæsp/"}]},{"word":"STARDUST","idx":22016,"count":1354145,"meanings":[{"definitions":[{"definition":"A powder with supposedly magic or charismatic qualities.","example":"My sister's eyes were full of stardust, and she'd spend hours lazily planning her future life when she would make her big break in the movies."},{"definition":"A type of cosmic dust that condensed from cooling ejected gases from individual presolar stars and incorporated into the cloud from which the Solar System condensed.","example":"We are all made of stardust."},{"definition":"A distant cluster of stars, resembling a cloud, the individual stars of which cannot be resolved."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈstɑɹ.dʌst/"}]},{"word":"OLIVES","idx":22017,"count":1354049,"meanings":[{"definitions":[{"definition":"A tree, Olea europaea, cultivated since ancient times in the Mediterranean for its fruit and the oil obtained from it."},{"definition":"The small oval fruit of this tree, eaten ripe (usually black) or unripe (usually green)."},{"definition":"The wood of the olive tree."},{"definition":"A dark yellowish-green color, that of an unripe olive."},{"definition":"An olivary body, part of the medulla oblongata."},{"definition":"A component of a plumbing compression joint; a ring which is placed between the nut and the pipe and compressed during fastening to provide a seal."},{"definition":"A small slice of meat seasoned, rolled up, and cooked.","example":"a beef olive"},{"definition":"Any shell of the genus Oliva and allied genera; so called from the shape."},{"definition":"An oystercatcher, a shore bird."}],"partOfSpeech":"n"}]},{"word":"RADIOLOGICAL","idx":22018,"count":1354035,"meanings":[{"definitions":[{"definition":"Of or pertaining to radiation, radioactivity or nuclear weapons."}],"partOfSpeech":"j"}]},{"word":"COMMANDO","idx":22020,"count":1354026,"meanings":[{"definitions":[{"definition":"A small fighting force specially trained for making quick destructive raids against enemy-held areas."},{"definition":"A commando trooper"},{"definition":"An organized force of Boer troops in South Africa; a raid by such troops"}],"partOfSpeech":"n"}],"phonetics":[{"text":"/kəˈmɑːn.dəʊ/"}]},{"word":"SUMMONS","idx":22021,"count":1353994,"meanings":[{"definitions":[{"definition":"A call to do something, especially to come."},{"definition":"A notice summoning someone to appear in court, as a defendant, juror or witness."},{"definition":"A demand for surrender."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To serve someone with a summons."},{"definition":"To call people together; to convene."},{"definition":"To ask someone to come; to send for."},{"definition":"To order (goods) and have delivered"},{"definition":"To rouse oneself to exert a skill."},{"definition":"To call a resource by magic."},{"definition":"To summons; convene."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/ˈsʌ.mənz/"}]},{"word":"LUCRATIVE","idx":22022,"count":1353990,"meanings":[{"definitions":[{"definition":"Producing a surplus; profitable."},{"definition":"Of a target: worth attacking; whose destruction is militarily useful."}],"partOfSpeech":"j"}]},{"word":"POROUS","idx":22023,"count":1353861,"meanings":[{"definitions":[{"definition":"Full of tiny pores that allow fluids or gasses to pass through.","example":"Concrete is porous, so water will slowly filter through it."},{"definition":"With many gaps."},{"definition":"(by extension) full of loopholes"}],"partOfSpeech":"j"}],"phonetics":[{"audio":"porous-au","text":"/ˈpɔːɹəs/"}]},{"word":"BATHTUB","idx":22024,"count":1353848,"meanings":[{"definitions":[{"definition":"A large container for holding water in which a person may bathe (take a bath)."}],"partOfSpeech":"n"}],"phonetics":[{"text":"/ˈbæθtʌb/"},{"text":"/ˈbæθtʊb/"}]},{"word":"MOTORWAY","idx":22029,"count":1353494,"meanings":[{"definitions":[{"definition":"(parts of Australia) A broad highway designed for high speed traffic, having restrictions on the vehicle types permitted and merging lanes instead of cross traffic; in parts of the United States and other places called freeway."}],"partOfSpeech":"n"}],"phonetics":[{"audio":"motorway-uk","text":"/ˈməʊtəweɪ/"}]},{"word":"BILE","idx":22030,"count":1353296,"meanings":[{"definitions":[{"definition":"A bitter brownish-yellow or greenish-yellow secretion produced by the liver, stored in the gall bladder, and discharged into the duodenum where it aids the process of digestion."},{"definition":"Bitterness of temper; ill humour; irascibility."},{"definition":"Two of the four humours, black bile or yellow bile, in ancient and medieval physiology."},{"definition":"A boil (kind of swelling)."}],"partOfSpeech":"n"},{"definitions":[{"definition":"(of liquids) To heat to the point where it begins to turn into a gas.","example":"Boil some water in a pan."},{"definition":"To cook in boiling water.","example":"Boil the eggs for three minutes."},{"definition":"(of liquids) To begin to turn into a gas, seethe.","example":"Pure water boils at 100 degrees Celsius."},{"definition":"To bring to a boil, to heat so as to cause the contents to boil."},{"definition":"(used only in progressive tenses, of weather) To be uncomfortably hot.","example":"It’s boiling outside!"},{"definition":"(used only in progressive tenses) To feel uncomfortably hot.","example":"I’m boiling in here – could you open the window?"},{"definition":"To form, or separate, by boiling or evaporation.","example":"to boil sugar or salt"},{"definition":"To steep or soak in warm water."},{"definition":"To be agitated like boiling water; to bubble; to effervesce.","example":"the boiling waves of the sea"},{"definition":"To be moved or excited with passion; to be hot or fervid.","example":"His blood boils with anger."}],"partOfSpeech":"ve"}],"phonetics":[{"text":"/baɪl/"}]},{"word":"ESE","idx":22033,"count":1353074,"meanings":[{"definitions":[{"definition":"Ease; pleasure."},{"definition":"Dude, man. (Usually used vocatively.)"}],"partOfSpeech":"n"}]},{"word":"ELEVATIONS","idx":22036,"count":1352758,"meanings":[{"definitions":[{"definition":"The act of raising from a lower place, condition, or quality to a higher; said of material things, persons, the mind, the voice, etc.","example":"the elevation of grain; elevation to a throne; elevation to sainthood; elevation of mind, thoughts, or character"},{"definition":"The condition of being or feeling elevated; heightened; exaltation."},{"definition":"That which is raised up or elevated; an elevated place or station.","example":"A hill is an elevation of the ground."},{"definition":"The distance of a celestial object above the horizon, or the arc of a vertical circle intercepted between it and the horizon; altitude.","example":"the elevation of the pole, or of a star"},{"definition":"The measured vertical distance from the peak of a mountain or hill to its bordering lowlands."},{"definition":"The angle which the gnomon makes with the substylar line."},{"definition":"The movement of the axis of a piece in a vertical plane; also, the angle of elevation, that is, the angle between the axis of the piece and the line of sight; distinguished from direction."},{"definition":"A geometrical projection of a building, or other object, on a plane perpendicular to the horizon; orthographic projection on a vertical plane; called by the ancients the orthography."},{"definition":"The raising of the host—representing Christ’s body—in a mass or Holy Communion service."}],"partOfSpeech":"n"}]},{"word":"REPOSITORIES","idx":22037,"count":1352444,"meanings":[{"definitions":[{"definition":"A location for storage, often for safety or preservation."}],"partOfSpeech":"n"}]},{"word":"FREAKY","idx":22038,"count":1352418,"meanings":[{"definitions":[{"definition":"Resembling a freak."},{"definition":"Odd; bizarre; unusual.","example":"I've heard the props and costumes in this play are quite freaky."},{"definition":"Scary; frightening.","example":"Have you met the freaky new guy who moved in next door?"},{"definition":"Sexually deviant.","example":"The things she asked me to do were too freaky for me."}],"partOfSpeech":"j"}],"phonetics":[{"audio":"freaky-au","text":"/ˈfɹiːki/"}]},{"word":"MERLOT","idx":22040,"count":1352308,"meanings":[{"definitions":[{"definition":"A dark-blue variety of wine grape."},{"definition":"A dry red wine of a certain French type, made from Merlot grapes."}],"partOfSpeech":"n"}]},{"word":"THIRST","idx":22041,"count":1352279,"meanings":[{"definitions":[{"definition":"A sensation of dryness in the throat associated with a craving for liquids, produced by deprivation of drink, or by some other cause (such as fear, excitement, etc.) which spots the secretion of the pharyngeal mucous membrane"},{"definition":"The condition producing the sensation of thirst."},{"definition":"A want and eager desire (for something); a craving or longing.","example":"a thirst for gold"},{"definition":"Sexual lust"}],"partOfSpeech":"n"},{"definitions":[{"definition":"To be thirsty."},{"definition":"(usually followed by \"for\") To desire vehemently.","example":"I thirst for knowledge and education will sate me."}],"partOfSpeech":"ve"}],"phonetics":[{"audio":"thirst-us","text":"/θɝst/"}]},{"word":"ENDEAVORS","idx":22042,"count":1352012,"meanings":[{"definitions":[{"definition":"A sincere attempt; a determined or assiduous effort towards a specific goal; assiduous or persistent activity."}],"partOfSpeech":"n"},{"definitions":[{"definition":"To exert oneself."},{"definition":"To attempt through application of effort (to do something); to try strenuously."},{"definition":"To attempt (something)."},{"definition":"To work with purpose."}],"partOfSpeech":"ve"}]},{"word":"SPORTSMAN","idx":22044,"count":1351806,"meanings":[{"definitions":[{"definition":"A man who engages in sports; a male athlete."},{"definition":"A man who engages in country sports, such as hunting or fishing."}],"partOfSpeech":"n"}]}]